{
  "post content": "Had  a belated Christmas gathering last week with my extended family. The  custom for this event is that we exchange \"stocking stuffers\" - nothing  over $10. Ever since I've since we've had this gathering, I've always  bought scratch off lottery tickets for all the adults.\n\nAs  you would expect, they are almost always trash. But every year we have a  few hit for extra ticket, 2,5, even $10. One year my uncle's ticket hit  for $50 and everyone went crazy. It's always a good time.\n\nSo  this year my 23 year old cousin goes nuts. He holds his ticket up and  claims that it just it hit for the max jackpot - $50,000. Everyone  rushes over, a couple of my uncles verify - yep this kid just won $50k.\n\nI  was fucking elated. I  scooped in him up in a big bear hug and said  Merry Christmas you lucky a-hole. He was screaming and his mom was  actually in tears and whole room was excited. It was literally one of  the top ten experiences of my life.\n\nI  feel my phone vibrate in my pocket and I pull it out to see my wife has sent me a text message that says \"Come out to the car.\" I go outside  and can tell by her body language she is pissed. She told me there is no  way that we are giving my cousin $50k, then starts fussing at me about  buying the lotto tickets to begin with.\n\n2  things to explain: I'm not saying that $50k isn't a lot of money - it's  a ton. But I'm in my mid forties. I have a 2 decade professional  career. My wife is a SAHM by choice. We drive late(r) model cars that  are paid for. Our retirements and the kids' college accounts are fully  funded. Our only debt is the house. I'm saying this to show while $50k  would be nice to have, it's not life changing money for us.\n\nMy  cousin, on the other hand. Just graduated from college. His mom is  single and was one of those fiercely independent women who refused charity. She took on extra jobs to help him pay for school. He worked at least two jobs himself while going to school full time and still managed dean's list. But he still had to take out loans. He landed a  job, but he can't afford a car yet or to live close to the office, so  he's looking at nearly a 2hr commute. He's also saving for an engagement ring for his sweet girlfriend of 3 years. This money would literally change this kid's life and frankly I think it couldn't have gone to a better member of my family.\n\nI explain to her that we're not giving him $50k, we gave him a ticket I  spent $5 on. She's not buying, and she won't let it go. She is now  demanding I go back in there and take the ticket back from him, saying maybe we'll give him some of it. We argue a little bit, I can't get her  to explain why she wants this money so bad other than \"it's ours and you're not giving it away.\"\n\n We fought all the way home and she  hasn't spoken more than a couple of words to me since.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 20185,
      "content": "NTA\n\nYour wife wouldn't want the ticket if it were worth $0 or even the $50 your uncle won would she? She wouldn't demand you'd go back in there and do some taksie-backsies for zero dollars.\n\nYour wife is completely in the wrong. You are right, you have not given away $50k, you gave him a gift that could have been worth $0 at the end of the day for a bit of a laugh and the lucky sod got lucky.\n\nI would just not talk to her either and tell her I'm very disappointed in this poor show of character and hope she sleeps it off.\n\nBesides, legally there were witnesses who saw you give the ticket to him as a gift and saw him scratch it and subsequently win. Morally and legally it's his money, not yours or hers.\n\nEdit: the irony of coming back to all these updoots! To think you can leave a comment on the internet and have it blow up in the Reddit lotto. No taksies backsies ppl!!! <lols in Reddit coin>",
      "id": 2,
      "comments": [
        {
          "score": 5892,
          "content": "That is a VERY good point. There’s a room full of witnesses, possibly someone even recording (because holiday gatherings pictures and recording happens), that can attest that the ticket was given as a gift. No question it was given to him.",
          "id": 3,
          "comments": [
            {
              "score": 2560,
              "content": "Especially since it’s a yearly tradition and everyone knows OP gives that as a gift every year",
              "id": 4,
              "comments": [
                {
                  "score": 2520,
                  "content": "Imagine giving that gift every year and then taking it back when someone wins.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1760,
                      "content": "OP’s wife is Veruca Salt.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 676,
                      "content": "That's exactly it. That's not a gift at all, that's just buying yourself more lottery tickets and having other people scratch them off for you. That's not what this tradition is about at all. The wife is an absolute nightmare in this scenario. And she doesn't even know why she wants it. Just so ridiculous and disgusting.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 144,
                      "content": "It would probably end OP’s relationship with much of his family. NTA, your wife is greedy and does not have a leg to stand on.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Super tacky and, frankly, obnoxious of the wife to demand a gift be taken back because the kid won",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "She must be the sister of the guy who gave his step-son $50 to play at the casino then demanded all the winnings",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "And then casually continuing the tradition the next year like nothing happened",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Does she give extra money for the people who don’t win on the tickets?",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "This is why I pre-scrarch the tickets before giving them away",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Yeah this would last about 10 seconds in front of a judge.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "My ex in laws did this for the 16ish years I was with their daughter. We never won big but I couldn't imagine them asking for a winning ticket back.\n\nThat said, if I won 50k in my early 20s I'd have definitely bought them something nice.\n\nNTA, your wife needs to do some serious soul searching about what it means to give a gift and be happy for someone else.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Dunno if it’s a standard lottery thing everywhere, but where I live you can (and have to) sign your lottery ticket to claim the money. I’d advise your cousin to sign it asap if it’s not already done.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "what if his wife suggested that they kill all the witnesses for the money.  How dark would Christmas be at that house?",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3277,
          "content": "Agreed! You have a history of giving lottery tickets. You have witnesses that you gave these lottery tickets and witnesses that your cousin scratched off the winner. She will not win any lawsuit because it was a gift of a ticket that could be worth $0 or $50k.\n\nTrying to take back the money/ticket will blow up the family for nothing.\n\nI agree that you should speak with your cousin and assure him that it belongs to him and say that if your wife contacts him to tell you and to ignore her.\n\nI also suggest that you tell your cousin that the money is 100% percent his. Many people get badgered into giving up part of it to try to make peace.\n\nI hope your wife calms down but it is crazy that she thinks you guys would still have any rights to that ticket and worse that it isn't coming from a place of desperate need (facing homelessness, etc)\n\nA BIG congratulations to you cousin!!!!  It sounds like fate was very kind.\n\nEDIT: NTA",
          "id": 18,
          "comments": [
            {
              "score": 660,
              "content": "I wonder where the wife is coming from. Like, what makes her this greedy? Does she have a terrible past experience with money? I feel like it's something that probably has to be worked through. But also NTA because it's the cousin's money now, in every way possible.",
              "id": 19,
              "comments": [
                {
                  "score": 325,
                  "content": "Wondering if she has a bunch of secret credit card debt that she can't pay off as a SAHM",
                  "id": 20,
                  "comments": [
                    {
                      "score": 285,
                      "content": "IDK, sometimes money just makes people nuts.  \nI mean, look at the entire US economy.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Let’s speculate wildly! I, for one, think she owes money to the mob.\n\nNo wait, she’s part of the mob and is going to put a horse head in cousin’s bed",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": ">secret credit card debt that she can't pay off as a SAHM\n\nThis is a good guess. I was a SAHM for several years and racked up HUGE cc debt during that time. Been back to work for 3 years now and still working on paying it off. HOWEVER, if I were the wife in this situation, while I might be internally screaming that we just \"gave away\" $50k while I'm in this hole, I'd never ever actually say anything. Because I'd know that in reality it is cousin's money and just pure luck. It was never \"ours\" because OP never bought the ticket for us.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That's my suspicion (not *assumption*, suspicion - different things here), that she has some secret habit that's caused her to lose a lot of money. But if that *is* the case, she's really showing her ass by trying to demand that money.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "That’s what I was thinking. Based on her attitude she definitely sees that amount of money as a solution to a very particular problem.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 257,
                  "content": "Dude some of the richest people who have never experienced being poor are the cheapest, money greedy people. Stop trying to find something to feel sorry about for OP wife….she is greedy, and money turns people into assholes.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You shouldn't talk about our former president that way.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": ">  Like, what makes her this greedy?\n\nI don't think she is some abnormal and rare person, there are many people who would do this sort of thing for $50k.  It was the main prize, so it was purposefully this much to motivate people to buy it.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "She sounds like she has a super easy life.  People like that are often the most entitled.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Money is just something that puts otherwise normal and rational people onto their worst behavior.  She must know that she has no legal or moral claim to that money but somehow she has to have it.  Like Golem and the Ring.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "She saw someone else being lucky and wanted the prize for herself. She’s jealous.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I think humans in general are greedy asshole. It's our nature and has helped us survive during times when we were less enrolled, but it's irrational most of the time.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I \\*hope\\* that the wife is just shocked.  If I thrifted an ugly figurine as a gag stocking gift, and then the recipient turned around and sold it for $25 000, I would also be shocked, and a little sad that I didn't get the windfall.\n\nI kind of feel that OP and wife should have had a talk before handing out the lottery tickets about what they would do if someone won.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 3,
                      "content": "While I suppose a good idea in hindsight. That shouldn't be necessary. If she wasn't so greedy there would be no problems.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I feel like it is the perception that luck exists in some limited quantity. Even if the wife doesn’t literally believe in luck as a force that can choose you as a winner, it is common to act as if one instance of luck affects other potential opportunities for luck.\n\nIn other words, she thinks they blew their one chance to win a large sum of money.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 385,
              "content": "This is a great post.  But just tell the cousin how excited he is for him.   Don’t assure him that it belongs to him.  Don’t throw the wife under the bus.  Share how disappointed you are in her inability to be happy for your cousin.  She may come to her senses, and it would be a shame if he had destroyed her standing permanently for a temporary lapse in judgement.   Do make it clear you will not support her if she takes any action on this.   Do probe to find out why this has triggered this reaction in her.   And do remind her they’ve been doing this for years - it’s a little late to change the rules now.  The time to make conditions was waaaay back in the day",
              "id": 36,
              "comments": [
                {
                  "score": 435,
                  "content": "I agree with you that OP shouldn't specifically mention his wife, but it might be a good idea to reach out and give the cousin more general reassurance that the ticket is his. Something like \"When someone comes into a bit of money like that, sometimes otherwise decent people can take it a bit weird. Don't let anyone pressure you into anything with the money, and if you start to feel pressured at all, remember that you can come to me and I'll help run interference.\"",
                  "id": 37,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Definitely the best idea out of saying nothing, shaming her, or saying these things. As another commenter said very tactful",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 115,
                  "content": "It *does* belong to him. As others have pointed out, legally it's his, not just morally. A gift with witnesses and probably recordings legally belongs to the giftee. Why the heck would OP not assure him that it belongs to him? To protect Mrs? You can't avoid throwing someone under the bus, when they tied themselves to the wheels.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You totally misunderstood his point. He's saying that there's no need to reassure him it belongs to him, he already knows that and it might make him think that there's somebody who thinks it doesn't belong to him. Instead, telling him the thing's u/minuteye suggested makes sure that if she does happen to say something to him, he'll know that OP doesn't agree with her. It's called tact.\n\nIt isn't just to protect his wife, its to protect his cousin and the whole family. It would sour the experience for everyone, not just her, for him to shame his wife by telling them what she said. If she never comes to her senses and apologizes, then maybe its worth burning that bridge with her (I certainly would question my own relationship in that case), but like the others commenters said: its better to avoid causing a huge family drama for a momentary lapse in judgement.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Like the person said, its just for reassurance. *People get weird once folks win money.  My old boss’ dad hit scratchers a couple times(50k,1m, etc). As you can guess, a lot people asked them for $$ a lot.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "Maybe op can give some financial advice too. Just having graduated it's good to start thinking ahead",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 383,
          "content": "Yup and if you sue, the lawyers will split the 50k and you’ll prolly also end up owing them money",
          "id": 43,
          "comments": [
            {
              "score": 144,
              "content": "That wouldn't happen because no lawyer would even take this loser of a case. The law is really clear that once you gift something, it belongs to the person you gifted it to and you have no legal right to ask for it back. \n\nIf they did somehow find a lawyer willing to sue, the relative shouldn't have to use any of the 50k for a lawyer, one really isn't needed since any judge is just going to say the law is the law and you can't legally steal back a gift you gave someone.",
              "id": 44,
              "comments": [
                {
                  "score": 37,
                  "content": "In reality no lawyer would take it on contingency but some hack would take it hourly against a small retainer. Then the winning recipient of the gift would probably hire a lawyer and end up spending something lik $2k in legal fees having the case dismissed. They could go to to court and get it dismissed alone but it is possible to be so unqualified to represent yourself that you lose a slam dunk by failing to file, say, appear, or do some other procedural requirement.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": ">That wouldn't happen because no lawyer would even take this loser of a case. \n\nWell... not on a contingency but if they are willing to pay full freight, they could find one who will take their money to pursue a predetermined losing case.",
                  "id": 46,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Wasn't that an episode of Always Sunny in Philadelphia?",
              "id": 47,
              "comments": [
                {
                  "score": 48,
                  "content": "Poor Mac, came out over a 14 dollar scratcher.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 11,
                      "content": "But the real question is - Hero or Hate Crime?",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "\"Oooh is that all that's left?\"",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "One of the best",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 335,
          "content": "NTA. If your wife got a present of a $5 lottery ticket and won 50k, she wouldn't wanna give it back to the person she got the ticket from.......would she? \n\nIf the answer is no, and we all know it will be. It's purely about the money. Not the gift. Now if you just up and gave away 50k hard earned dollars saved up for years without discussing the household or your intentions, sure! That would merit some major discussion and stuff. \n\nWhat does she want 50k for? Why is this so important to her? \n\nYes, everyone would be delighted with 50k, but you have the kid a 5 dollar scratch card with a chance, you didn't give him actual 50 thousand dollars to his account or in cash as a gift. It's not something you had to give, nor something you would have. It's not even really from you, you gave him a chance, but the lottery system is the one that's paying out not your household.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "The wife is a greedy and uncharitable piece of work. This can’t be the first OP is witnessing of this",
          "id": 53,
          "comments": [
            {
              "score": 13,
              "content": "I've been thinking the same thing.  I think it's likely the family already dislikes her and has kept silent for years in order to keep the peace.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "That's what I was wondering. I didn't think the wife could have a legal leg to stand on.",
          "id": 55,
          "comments": [
            {
              "score": 155,
              "content": "Not a legal, moral or ethical leg to stand on.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "100% OP didn’t give away $50k. He gave a scratch ticket. If you (or OP’s wife) can’t stomach someone winning on a ticket you bought, then don’t buy scratch tickets.",
          "id": 57,
          "comments": [
            {
              "score": 3,
              "content": "My husband is one of those people- he would be beside himself if he gifted someone a ticket & they hit big so he wont buy a ticket for anyone. Silly to me but better than giving one away then demanding it back! Though, admittedly I’d prob also be quite butt hurt if I gave someone a huge winner lol",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Not really a gambler myself, but when I do I set an amount and say \"this is the money I am spending to enjoy myself, spend time with friends, whatever\". I fully expect to get none of it back and am simply paying for an experience, like paying to go to a museum. If I leave with more, great, but not the goal. \n\nOP paid $5 to give his family the experience of scratching them off together and enjoying the little wins and the camraderie of mutual loss. Part of that is the joy of someone winning big. If I were the cousin I'd definitely take OP out for a nice dinner, but that's it. He should ask his wife how shed feel if he bought enough tickets weekly to win big himself? Not good, because it never happens.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yes came here to make sure someone else said that you CAN’T take the $50,000 even if you wanted to.  You gifted the ticket and it was scratched by someone else - that person is the one entitled to redeem the ticket.  NTA of course, but your wife’s tantrum is a big red flag.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5089,
      "content": "[removed]",
      "id": 61,
      "comments": [
        {
          "score": 12581,
          "content": "OP should send a text to his cousin telling him that watching him win $50K was one of the best experiences of his life and that he hopes he spends it wisely, just in case his wife directly contacts the cousin about wanting the money back. This way everyone will know she's the greedy one.  NTA.",
          "id": 62,
          "comments": [
            {
              "score": 2208,
              "content": "[deleted]",
              "id": 63,
              "comments": [
                {
                  "score": 1026,
                  "content": "And tells the wife that if she tries to get the ticket back behind his back, either by guilt trip or force, it divorce worthy. \n\nI would also warn the cousin gently if OP and him are really close about OPs wife being salty about the situaiton and to inform cousin that if she gets salty about it with him to inform OP and OP will take care of it and that OP is extremely happy for him and to enjoy the winnings.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 164,
                      "content": "INFO:  OP, has there been any indication prior to this of your wife’s bent toward…what is this?  Jealousy, envy, churlishness?\n\nNTA.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "No, disagree. If the cousin is particularly guilt-prone or a people pleaser, knowing that the OP's wife is upset may accidentally push him to volunteer to give it to her.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 119,
                  "content": "Plus it was a strike of luck and not something conscious. But money makes some people act silly.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 9,
                      "content": "You mean greedy.",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "Absolutely agree",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 441,
              "content": "100% OP’s wife will contact the cousin directly.",
              "id": 70,
              "comments": [
                {
                  "score": 271,
                  "content": "This could literally either be the straw that broke OP's family or the straw that broke OP's marriage.\n\nIt is at moments like this when people show their true colors. Often the signs are so small that they can be ignored and then there comes a scenario where it becomes the hill to die on. This is one of those instances.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 301,
              "content": "If wifey \"wants the money back\" kid can give her the $5 OP spent on the ticket.",
              "id": 72,
              "comments": [
                {
                  "score": 34,
                  "content": "I spit out my coffee on this -- love this!",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "No.  Don't give her one red cent.  She didn't buy the ticket; she even thought they shouldn't be buying them for gifts at all.  She gets nothing; she loses; good day madam.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 300,
              "content": "NTA - and great idea here.\n\nLegally she’s not entitled to it whatsoever. She will have an entire family, including the guy that bought the ticket, supporting the fact that this ticket was purchased as part of routine gift giving.\n\nYour wife sounds like she sucks. Sorry mate.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 189,
              "content": "This.  Absolutely this!  You are a phenomenal soul.\n\nIn our family we have an agreement that anything over 5k on a scratchie that was gifted is split 50/50.  That said you honestly sound like you are the position to be able to just enjoy the gift of seeing your young cousin get a leg up and it is really beautiful.",
              "id": 76,
              "comments": [
                {
                  "score": 48,
                  "content": ">In our family we have an agreement that anything over 5k on a scratchie that was gifted is split 50/50. \n\nThat is just weird. \n\nI was raised to consider a gift a gift. I sometimes buy people lottery tickets too (we have a \"New Year's Lottery\" that's kind of a tradition here, and I buy people tickets for that). Never EVER would I expect, demand or even think about them giving me the price if they won something. I mean, the whole idea behind giving them the ticket is that THEY will have a chance to win money, right?!",
                  "id": 77,
                  "comments": [
                    {
                      "score": 6,
                      "content": "This is why I would never buy lottery tickets as gifts.  You have people like u/tellbelle79 which at least it sounds like they all have an agreement at least, but I know a guy who plays lottery and often gives tickets as gifts and he literally tells people it is the best gift because if the person wins they will give you part of their winnings, because you bought the ticket.  Which made me not want to give  him shit even if I hit a huge payout.  It just irks me to buy a gift for someone in the hopes that you also get something out of it other than the joy of making someone else happy.  \n\nBut this story by OP is not uncommon either, the gift recipient is under no legal or moral obligation to share their winnings, to me its really no different than buying a PlayStation for someone, and then asking to borrow it all the time sine you paid for it.  A gift is a gift and  you give it because you want the person to have it.  I have heard of it causing problems with numerous people over lesser amounts than OP's nephew won.   I am not a lottery guy, but to me lottery gifts just cause problems.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Just curious - has this agreement ever been tested in your family? Has anyone hit bug and split the prize?",
                  "id": 79,
                  "comments": [
                    {
                      "score": 7,
                      "content": "No.  But it is only with Mum, Dad and Twin.  Personally I am at point in life where I would be happy to let them keep it if they did.  But I know I am in a much better state financially than them.  Not remotely rich but just been sensible with size of mortgage and fortunate to be in a rapidly gentrifying suburb where we got our home right before gentrification began.\n\nThat said my sister in law's Mother....sends her pre-scratched scratchies.  Seriously I have seen my SIL opening a card from her Mum to find that.  She is pure evil that woman.",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Oh yes definitely! I was wondering myself how far the wife may go to recoup that ticket.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Also this cousin sounds like literally the most deserving winner!\n\n&#x200B;\n\nTell your wife that if it was some 80 year old millionaire, a trust fund baby, a skanky drug addict or in general an asshole it'd be different.\n\n...Although that's exactly why I only gift such things to people I would hope to win.",
              "id": 82,
              "comments": [
                {
                  "score": 8,
                  "content": "It wouldn't be different, though. All those people would deserve the payout if it was their ticket.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "in his explanation his wife called the ticked a marital asset!!! would she if the ticket was 5 dollars? what a greedy asshole omg",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "This plus having it in writing (via text) will (or can) protect his cousin in case his wife tries to take him to court.  She sounds petty enough to do so.\n\nIMO, he should send him a more legally binding text such as, \"I am so happy that you were able to win $50,000 from a $5 ticket that I purchased.  It's all yours for the taking so enjoy!!\"",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Imagine having to send messages to your relatives to make sure they know you are not the jealous greedy asshole but your wife is, in case she contacts them directly. What a marriage.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 725,
          "content": "\\> the kids' college accounts are fully funded\n\nBad news, they quite likely do",
          "id": 87,
          "comments": [
            {
              "score": 156,
              "content": "poor kids",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 671,
          "content": "Even if the 50k is worth having his family hate them, why on earth would they give it back?\n\nIf OP and/or his wife were like \"give it back\" or tired to take it, his family would likely (and rightfully) just be like \"no\". It was given to this young man. It legally belongs to him. There are a ton of witnesses.\n\nThey'd hate her and she'd get squat. NTA.",
          "id": 89,
          "comments": [
            {
              "score": 234,
              "content": "Even if they managed to grab it, I’d fully hope family calls the cops and/or sues.  Wife lost her mind, and this isn’t even the kind of multimillion dollar win that usually draws out the AHs.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 149,
              "content": "\"They'd hate her\". They probably already do. Judging by her actions afterwards, I would imagine this is not the first time she has pulled some shady crap.",
              "id": 91,
              "comments": [
                {
                  "score": 30,
                  "content": "Oh I'm sure it was obvious she wasn't happy at that point anymore. It wouldn't take a genius to put 2 and 2 together.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Not to mention... He didn't gift $50k, like him and his wife are not out $50k in their savings. OP gifted a lotto ticket and has been for years. He probably n wouldn't have even bought the ticket if it weren't for the gift. Makes no sense.",
              "id": 93,
              "comments": [
                {
                  "score": 4,
                  "content": "I understand he didn't spend 50k. However, I can also understand if I had a winning loto ticket for 50K I'd be reluctant to *knowingly* give it away. That's giving away 50k, even if you got it through luck.\n\nBut that's not what happened here. What happened is is husband spent $5 on a gift and then the cousin won 50k. OP had no way to know it was 50k when he gave it. And once it was given, it was too late. Legally, it belonged to someone else now. OP also wouldn't have bought it if it weren't for the gift exchange. So OP and his wife only gave $5. They paid for cousin to have a very small chance of winning, and he won.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "Further, the law might actually have something to say about who's rightful property that winning ticket is, and it's probably the recipient, not the buyer, if given as a gift.",
          "id": 95,
          "comments": [
            {
              "score": 175,
              "content": "if its any state in america this, there was a law suit between a someone who tipped a winning lotto ticket and the waitress.The court ruled in the waitresses  favour by a large margin. \n\n  \nIIRC its because the law states when you give a gift you are offering something without a promise for something in return.   \n\n\nA nice video on the case is covered by legal eagle  \n[https://www.youtube.com/watch?v=WRPxYGqOEL4](https://www.youtube.com/watch?v=WRPxYGqOEL4)  \n\n\nEdit: Clarification and some more info.",
              "id": 96,
              "comments": [
                {
                  "score": 36,
                  "content": "Yeah. The cop tipped a couple dollar lottery ticket. Waitress was ticked about it until it paid off, then the cop wanted it back. Really nice guy, right? \n\nOP, NTA. Your wife definitely is. You spent $5 on a lottery ticket, and it sounds like the most incredibly deserving person in your family lucked out. I'm so happy for him. It's too bad your wife can't share that feeling, and has gotten greedy over the money. I hope she doesn't walk away from your relationship over this, but I can see her at least threatening it. And yes, warn them about the possibility of Mrs. OP asking them for all or part of the 50k and not to give it to her, that she doesn't represent how you feel, and YOU bought the ticket.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Whose favor? The buyer or the service industry worker who got it as a tip?",
                  "id": 98,
                  "comments": [
                    {
                      "score": 8,
                      "content": "sorry i probably need to be in bed not on reddit fixed it for clarity, ty.",
                      "id": 99,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "A lottery scratcher as a gift is hardly going to be viewed as a \"conditional gift\" like an engagement ring. People give them all the time. Hell my real estate lawyer sends me one every year for the holidays. It's meant to be a fun little game that she does for her clients and if they win they win.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "Reminds me of the end of Indiana Jones and the Last Crusade, where the chalice falls in the crevice, the lady goes after it, and she dies so she doesn’t get it or her life, where she could have kept her life.\n\nYour wife, OP, is in the same position- does she want the money, or does she want to keep her family? \n\nBecause if she chooses money, *she will lose both*!\n\nNTA",
          "id": 101,
          "comments": [
            {
              "score": 3,
              "content": "Hahah, true! Good pop culture reference.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 133,
          "content": "Nta, wife isn't thinking about the other side of this either. In reality after taxes the kid is looking at a lump sum of closer to $20k maybe $25k, which given college these days isn't a lot, and is even less significant for her and OP. ( obviously taxes vary, so it's a rough guesstimate)",
          "id": 103,
          "comments": [
            {
              "score": 90,
              "content": "More like $30-35k. The kid probably isn't in a high tax bracket to begin with, and (assuming they're in the US) even if he was there's zero chance taxes are going to take more than about half of the winnings.",
              "id": 104,
              "comments": [
                {
                  "score": 3,
                  "content": "Gambling tax rates don't fall into the normal income tax brackets.  Federal has a flat rate of 24% and each state was a varying amount ranging from 1% to 51%, but most tend to fall between 5%-10%.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "[deleted]",
              "id": 106,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "And taxes will be a lot less in the kid’s bracket",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": ">i would if you did that\n\nYep, this would be a dealbreaker for me. Especially with all the context.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4918,
      "content": "NTA. \n\nYour wife is wrong. Like you said, you gave him a $5 ticket as a gift. You don't take gifts back when you realize they are worth more than you thought. It doesn't matter that you are older and more financially secure, and your cousin is just starting out (although it is nice that it worked out that way). Sounds like you have a good relationship with your family do not let your wife shatter it.",
      "id": 109,
      "comments": [
        {
          "score": 4359,
          "content": "My point in explaining my financial situation was illustrate that my wife doesn't have any need for this money. If we were struggling I would totally understand her frustration (but it wouldn't change the fact that legally it's not our ticket).",
          "id": 110,
          "comments": [
            {
              "score": 3040,
              "content": "Do us all a favor. Have that boy SIGN that ticket asap  by signing it the place he turns it into will hopefully require an ID to verify it etc.\n\nI don't trust her not to try to get that ticket somehow. By signing it and cashing it in asap means less time she can try to take it back.\n\nYou gave him a $5 ticket that just happened to be a damn winner. She can get over it.\n\nNTA.",
              "id": 111,
              "comments": [
                {
                  "score": 911,
                  "content": "Excellent advice and tell him to put it in a baggie also so it doesn’t get destroyed “somehow” \n\nWow money really does change people smh 🤦🏻‍♀️",
                  "id": 112,
                  "comments": [
                    {
                      "score": 806,
                      "content": "Grandpa Simpson said it best. “Money don’t change people. It helps them be who they really are.”",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I'd also recommend to cash it as soon as possible.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 138,
                  "content": "This. Not to mention that there is an entire room full of witnesses (and probably a few phone videos of the celebration) who saw OP *give* the ticket to his cousin. Even before it’s signed he may not have any legal grounds or take it back.\n\nSure, if the wife gets a hold of it and signs it herself she could turn it in, but there would still be grounds for a civil case over the winnings.\n\nOP better hope that his wife apologizes ASAP for going a little nuts during a bizarre moment, otherwise he needs to consider the side of herself she showed him that night.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 11,
                      "content": "People keep mentioning a roomful of witnesses, but only one is actually necessary, and that is OP, the actual gift-giver. Either partner in a marriage is completely free to spend or give any and all joint assets at anytime, except any funds that require joint signatures to access, or unless a court proceeding is already underway requiring them both to preserve assets through adjudication, like in a separation, divorce. Marital assets aren’t 50/50. They’re 100/100, just like joint bank accounts.",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "Please do. Its not gonna be that much after taxes.\n\nYou need to tell your wife she's very disappointing. \nReally crappy.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 130,
                      "content": "It'll still be a sizable chunk not life changing but it'll do a LOT of good for that kid and give em at least a bit of a head start.\n\nThe wife though...she irks me. What kind of person would wanna take that ticket away from someone who they know could use that money for good.\n\nShe isn't struggling to make ends meet either! And even if she was it wouldn't be an excuse to take it back.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Even if he lives in the state with the highest lottery taxes (plus the fed's 25%) he's still ending up with $33k. That's a **lot** of money to the vast majority of people.\n\nNot that it changes how crappy the wife's behavior is.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "With how she's acting, yeah, I wouldn't put it past her to sneak over to the cousin's house behind OP's back to demand the cousin hand over that ticket.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 20,
                      "content": "And I see her claim that OP agreed with her etc and the poor kid prolly would! Being that confused and spooked by her behavior.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "[deleted]",
                  "id": 122,
                  "comments": [
                    {
                      "score": 39,
                      "content": "I wouldn't put it past her to try to steal it. Claim she's their to apologize and then go search for it etc.\n\nI don't put much trust into people when it comes to money of any size. \n\nWith how she's acting about this yeaa.\n\nAnd the fact she said SOME like no you leave that kid alone. He's gonna lost a ton anyways due to damn taxes.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "Please check your bank accounts. Run a family credit check. \nThis smacks of she has secret debt",
              "id": 124,
              "comments": [
                {
                  "score": 27,
                  "content": "This actually sounds like very good advice. While it makes sense that she'd have loved to win that ticket, and let's be real, who wouldn't, she sounds almost desperate for the money which given your seemingly solid financial situation is strange. Make sure that your financials are actually as solid as you think they are because there may very well be more than meets the eye here.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 84,
              "content": "Seriously even if you both lived in a cardboard box, it would be an asshole move to take back a winning lottery ticket given as a gift.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "as someone that works in selling lotto tickets, we tell customers all the time to sign the back if they win but because you need to have ID to cash it in if it’s signed. please have him sign the back",
              "id": 127,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "A lot of people have already suggested that maybe your wife is hiding a financial issue from you, and that's possible.  There's another (and I'm my opinion, more likely) explanation though: does she have a reason to dislike the *cousin*?  Because if she's normally charitable and kind and this is the exception, the only real difference isn't the money, it's who it's going to.",
              "id": 128,
              "comments": [
                {
                  "score": 7,
                  "content": "I mean, it could be as simple as she just wants the $50k. Large amounts of money have the potential to make people assholes, and in her eyes they gifted the money, not the ticket (which is bullshit). It doesn’t have to be some conspiracy or she doesn’t like the cousin, it could just be plain envy.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I get it but even if the two of you needed it, taking it back is not the right thing to do. No matter what your wife is being greedy.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Yah. You’re NTA, but your wife, big one. Especially when she doesn’t financially need the money, and would burn all the bridges to claim something that isn’t hers. You gave away the lottery, you spent $5, your cousin legally has possession of the lottery and whatever it may come with. Please don’t back down. I hope your wife comes to her senses.",
              "id": 131,
              "comments": [
                {
                  "score": 4,
                  "content": "Agreed. If OP’s wife wants to get stingy w their joint assets, he should just reimburse her half, $2.50. Done and done. \n\nOf course, she should ALSO be prepared to start showing him receipts for anything she buys in the future and reimburse him for anything that’s not strictly for their mutual benefit. 🤝",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3166,
      "content": "NTA\n\n> She told me there is no way that we are giving my cousin $50k\n\n#You ALREADY GAVE HIM the ticket.\n\nA ticket that —at the time of giving, by the way— was only worth a couple bucks.\n\nI don't know what I like *less* about your wife: the greed or the illogical thinking.\n\n> She is now demanding I go back in there and take the ticket back from him, saying maybe we'll give him some of it.\n\n**WHO IS THIS WOMAN?!?!?**",
      "id": 133,
      "comments": [
        {
          "score": 812,
          "content": "It’s the greed clouding her thinking. She suddenly felt entitled because the $5 turned into $50k and she felt entitled to a portion. Kind of like those pot lottery where everyone contributes to a pot to buy the lottery tickets.",
          "id": 134,
          "comments": [
            {
              "score": 226,
              "content": "Yeah this is why most people shouldn't give lotto tickets as gifts, obviously not OP as they understand that once given they can't just take it back. If OP gives them to everyone I'm wondering if there's anyone else pissed that they themselves didn't get that ticket. In my family this would definitely drive a wedge not just between the giver and receiver but everyone else as well, can already see them demanding they split it.",
              "id": 135,
              "comments": [
                {
                  "score": 39,
                  "content": "I wondered that too. Like I get it they're basically luck and you don't think somebody will actually win big, but I can't imagine being the other family members who also always recieve a $5 scratch off for a present and actually end up getting nothing at all.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 23,
                      "content": "[deleted]",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I completely understand that if I were to give a lottery ticket away as a gift I wouldn’t be entitled to any winnings, and I still don’t give them away. Despite understanding that on an intellectual level, I know I’d be upset with myself and feel like I had the money in my hands and just gave it away.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Both my dad and stepdad buy all of us those scratch tickets every Christmas and we have a deal: if one of us wins the jackpot (100K€, if I remember correctly), then the winner shares a bit with their siblings. Anything less than the jackpot (other wins go from 5€ to 2000€ I think, so significantly less), you can keep it to yourself. We're all cool with it and it keeps the peace on the off chance one of us wins.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I actually have a positive story. We decided to randomly get lottery tickets during Thanksgiving. My sister purchased them, but we had designated ones to scratch off. Mine won and everyone was excited as it would help with my rent. Afterwards, my sister and I were discussing it and she let me know that had her or my brother-in-law had that ticket, it would have still gone to me as they are more financially stable.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Wifey said she \"might give cousin some of it\" which tells me wifey (definitely the AH here) thinks she should have the entire amount.",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 187,
          "content": "THAT TICKET IS NOT HERS! In what world does she think she has any claim to it at all?",
          "id": 142,
          "comments": [
            {
              "score": 119,
              "content": "She's considering it a marital asset that her husband gave without her consent. Remember the movie Nicholas Cage did years ago about the true story of the cop giving a lottery ticket to his waitress at the diner as his tip? It hit for multi- millions. In the movie, his wife demanded he go get it back, he refused, the wife sued the waitress and did get some of it back through the courts. They ended up divorced. (That didn't happen real life)This is only 50k...after taxes and legal fees it would go poof! The divorce might still happen though. I think she needs to reassess what's really important to her",
              "id": 143,
              "comments": [
                {
                  "score": 83,
                  "content": "That’s a good point. In this case though, it seems to have been established that OP gives out lottery tickets every year as a tradition. OP’s wife has never had a problem with it before. She didn’t have a problem (nor did she say anything) as he was handing out the tickets. She only had a problem after the cousin had won. If it was about giving away a marital asset without consent she would have said something when she saw her husband giving out the tickets, and would have demanded t\nall of them back. By the time OP’s cousin scratched the ticket off it had been established as gifted to him.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I agree completely. Not sure if some greedy lawyer wouldn't take the case though just to drain it dry",
                      "id": 145,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "How ridiculous!  If I were the judge, I would award her $2.50 since that’s half of the money he spent “without her consent.”  (I guess she wasn’t planning on giving anyone Christmas gifts?). Then, after ruling in her favor for the measly $2.50, I’d turn to her, deadpan, and say “would you like that in cash or by check”?  NTA, OP, your wife is greedy and awful.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yeah, in that movie he never gave that waitress a lottery ticket, he just promised her that he would tip her with half of his lottery winnings.\n\nHe also had even less of a chance in front of a divorce court, because he spent the night in a hotel with that waitress before he went to court. So they assumed he was cheating for a long time. \n\nIt didn't happen in real life. The only part that did happen was a police officer promising a waitress half the lottery earnings as a tip and keeping his promise. The rest was fictional.",
                  "id": 147,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Mrs. Fanny Dashwood, by the sound of things",
          "id": 148,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1195,
      "content": "NTA. Your wife is a piece of work. Is she otherwise a nice person? Is this an outlier way for her to behave?",
      "id": 149,
      "comments": [
        {
          "score": 1547,
          "content": "Yes and yes. This came completely out of left field. She's one of the sweetest people I know and she's actually very charitable. In fact it's really tough sitting here reading people call her all kind of names but I get it all they know about her is this post. But yeah I'm really scratching my head. That's why I included the financial info stuff cause I just can't figure out why she cares so much.",
          "id": 150,
          "comments": [
            {
              "score": 958,
              "content": "So maybe there is something finance related that is really bothering her right now even though your big picture finances are in order. Maybe because she’s a SAHM she envies the idea of an unexpected windfall of spending money? Or is she generally more frugal than you are so that she wouldn’t agree that your nest egg is big enough? \n\nIf this is out of character, it might be worth digging a little more. Not to make her think you guys might take the ticket back (because that would be both illegal and immoral like you’ve referenced), but just to understand since it’s sort of an ugly reaction.",
              "id": 151,
              "comments": [
                {
                  "score": 669,
                  "content": "My totally unfounded guess is that the wife has a spending habit of some kind, and their finances aren't nearly as secure as OP thinks they are.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 299,
                      "content": "Came here to say this. I'd be suspicious we weren't as financially stable as I thought if I were OP.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 170,
                      "content": "Or she is in the habit of only buying absolutely necessary items for herself.  She would love to feel free to buy that $500 dress or designer purse but doesn't, because she would feel selfish or guilty for doing so   The bonus 50k would give her permission to splurge while still remaining in the budget she has for the normal income.  Having been a SAHM when we had 3 under 8 years old I do remember feeling like I had to pinch every penny despite having 6 figures in savings at the time.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 69,
                      "content": "Oh! That’s a very good point. Oof! I hope that’s not it. OP sounds like such a kind person.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I was thinking that too. OP is definitely NTA and should really check on all the financials.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "gambling maybe",
                      "id": 157,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "Yeah, like maybe she has a large debt OP doesn't know about.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 237,
              "content": "This maybe a scary thought but is it possible she has credit card debt (or any debt) you don't know about? \n\nYou may want to consider trying to get a reason from her. If she can't give you one that could be bad.\n\nEither that or she has trauma from her past related to money issues. Was her parents fiscally responsible? Or do they seem very bad at money?",
              "id": 159,
              "comments": [
                {
                  "score": 121,
                  "content": "I argue some people just can’t be happy for other people, regardless of how well off and successful they are themselves. Like this whole zero sum game thinking. “Like why does cousin gets all the luck and we don’t.” She thinking that she/they have claim to a part of the winnings so maybe the cousin gets $25k and they take the rest. She might not be able to accept cousin claiming all the glory.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Ha, you just described most of my mom's side of the family with that first sentence! They're all well off but can not stand it when people who they see as having less than them are actually much happier than they are.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "Then you have unfortunately seen a side of your wife that has heretofore been hidden from you. You now know how she acts when significant money is involved: Jekyll and Hyde.\n\nAs you age, as your older family members age and die and wills are read, I fear you might be seeing much more of this type of behavior from her. Good luck, I wouldn’t want to be in your shoes.",
              "id": 162,
              "comments": [
                {
                  "score": 29,
                  "content": "This is the point where you get serious about writing your own wills and making sure your parents have their stuff together. You don’t want to repeat this mess w potential future windfalls and plans for your own bequests.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 57,
              "content": "Then you need to stop arguing over stealing the ticket from your cousin (it would be criminal theft to take it, or your cousin could sue and win it from you anyway) and ask her what is actually going on. There is something wrong here and it has nothing to do with that winning ticket. I have no idea what it is, and maybe you don’t have any clue either, but your wife knows and you need to find out. I hope it’s something that you two can work through.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "If this is out of character then it’s not about the money.",
              "id": 165,
              "comments": [
                {
                  "score": 40,
                  "content": "I don't know about that. Money brings out the absolute worst in people. When my mom passed, and her life insurance wasn't even *that* much, suddenly everyone came out of the woodwork suddenly desperately needing money anywhere from hundreds to thousands. If my dad said no because he was trying to save the money for emergencies, they would loose their minds and say how my mom would have helped them and how he is disrespecting my mom's memory by refusing. Money was gone within a few months.  It was horrible.\n\nMy sister's father in law one a lotto and similarly everyone suddenly had a sob story to beg for money and treated him horribly if he said no. The money was gone in a few months, but even when it was gone, people would ask and say how he wasted it and should have given it to *them* so it wouldn't be wasted.\n\nSignificant amounts of money are like the ring from Lord of the rings. It corrupts and brings out the absolute worst in people.\n\nThe truly unfortunate thing is that OPs nephew won in front of family. 50k isn't going to last and everyone will suddenly be there looking for a peice. OPs wife was just the first.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 23,
                      "content": "there's just something about someone else getting \"unearned money\" that sends people into a really strange mental state. Like that because they didn't \"earn\" it by working for it, they're somehow entitled to some of it.\n\nMakes me wonder if there's something deep in our psyche where that was necessary behaviour in our evolution, like if someone found a big meal they'd be compelled to share with the tribe.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Or she has some debts or some sort of spending habit she's keeping from OP, which I especially suspect because she won't give any actual reason other than \"it's ours\".",
                  "id": 168,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Eh, people are complex.  I've seen otherwise kind generous people behave like AHs when an inheritance is involved.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "OP, are you sure your financial house is in the order you think it is? Is it possible she’s taken on some debt that you don’t know about and saw a convenient way out of her situation? \n\nOn a more mundane note, maybe she just doesn’t feel comfortable spending money in ways she might want to and saw this windfall as a solution. Is she possibly unhappy with her side of the finances as a SAHM?\n\nI hope it’s something like the latter, but I fear it’s something like the former. \n\nhttps://www.annualcreditreport.com/\n\nThat is the website provided for by federal law, it’s completely free. You don’t have to take my link, google it but make sure it’s annualcreditreport.com. Check yourself, your wife, and possibly your kids.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Here’s my guess, based largely around the financial info you shared: If your wife is anything like me, money is a massive source of anxiety. There’s never enough money to feel safe, “because what if [xyz scenario].”\n\nIf I were in your wife’s shoes I’d feel embarrassed and frustrated that I couldn’t be happy for someone because all I’d be able to think about was how much “safer” I was convinced I’d feel if my family had had the windfall. \n\n“50k against the mortgage could go a long way, what if that would have helped us retire earlier/be able to spend more time together/with the kids.”\n\nAgain, if your wife is anything like me, she is generally genuinely happy with her life as it is, and the feelings she has surrounding money can be confusing, frustrating, and sometimes irrational. I’m frugal, not a coupon queen or a penny pincher, but I will wear shoes until the soles wear out. The newest clothes I own are hand me downs or gifts. \n\nIt bugs the shit out of me that I make a good wage and save so much of my income, but I can never look at a bank account of mine and go “Yeah, that should do it.” Because…what if? \n\nCheck in with your wife about anxiety generally before broaching the financial issue and her feelings surrounding your cousin’s good luck. Try to be sensitive to the fact that she’s probably already feeling shame about her reaction and will likely retrench and double down if simply confronted or ignored. \n\nIt sounds like you have an overall very happy home and marriage. Assume the best of your wife and go in with good faith.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Sudden changes in personality or behavior can indicate a medical issue. If she does anything else out of character, might be worth bringing up to a doctor.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "[deleted]",
              "id": 173,
              "comments": [
                {
                  "score": 37,
                  "content": "Considering the circumstances, I wouldn't ask the cousin to do this.",
                  "id": 174,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "label snails makeshift degree juggle puzzled placid workable tidy air\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 175,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah, gifts are not conditional. A gift is a gift, that is so odd",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Regardless, the cousin still has a lot less money than she and her husband has, and it's guaranteed that he would enjoy it a lot more.",
                  "id": 177,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Dude, you're a fucking class act. You stand up for your wife at her worst, and you saying that your little cousin's joy was one of the top ten experiences of your life, absolutely made my day.\n\nIt's so easy to forget there are good people out there, especially on the internet. May you be happy and loved and I hope your wife comes to her senses - she's one lucky woman!",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 734,
      "content": "NTA. You were absolutely correct, you gave him a five dollar scratch off. He won the 50k. Good for you for being so thoughtful about how much more this money means for him.",
      "id": 179,
      "comments": [
        {
          "score": 6,
          "content": "Exactly. OP sounds like a nice person, and his wife is coming across as the greedy Wicked Witch of the West. It was a gift. It is now the nephew's and that is his money, and his alone. OP's wife wants him to steal from his nephew (plus ruin a happy moment & possible fracture that family) over $50k that they don't need. \n\nIt wasnt her ticket. She didn't pick out the gift. OP paid for the $5 with his own money. She needs to chill. Greed & envy are a hideous look, and this just shows her true colors.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 560,
      "content": "NTA. She’s insane. You gifted it to him.  Period. You have no claim to it.",
      "id": 181,
      "comments": [
        {
          "score": 149,
          "content": "But I'm sure if she'd been gifted the winning ticket by the cousin that she'd have given the ticket back. Right? Right??\n\n(Yeah, right.)",
          "id": 182,
          "comments": [
            {
              "score": 3,
              "content": "Great point! We all know how she'd act",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 422,
      "content": "NTA, your wife on the other hand is a greedy asshole. She wouldn't have done this if your cousin won $100.\n\n>I can't get her to explain why she wants this money so bad other than \"it's ours and you're not giving it away.\"\n\nBecause she's hell bent on playing the \"we bought it so it's ours\" card",
      "id": 184,
      "comments": [
        {
          "score": 85,
          "content": "I kinda think that she may have wanted that $100",
          "id": 185,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 67,
          "content": "He should take back all the gifts he gave her. After all, he bought them, so they actually belong to him.",
          "id": 186,
          "comments": [
            {
              "score": 33,
              "content": "Especially the ring the medical term for this is to debride",
              "id": 187,
              "comments": [
                {
                  "score": 6,
                  "content": "Oh the irony! I love it.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I know the pronunciation is different but it is one of my favorite happy accidents in the English language",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Her sudden change in tune at the sound of $50k makes me now question her reasoning for being a sahm. \n\nWas it really to take care of the household and any children they have while OP covers all the bills, or was it really so she could have a sugar daddy who pays the bills and gives her spending money?\n\nMakes ya wonder...",
          "id": 190,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 375,
      "content": "NTA You never gave the cousin money, you gave the cousin a ticket, the cousin won the money fairly. \n\nYou technically gave only $5. A gift given is a gift gone. Your wife is completely wrong here, both legally and morally.",
      "id": 191,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 364,
      "content": "NTA, but what’s going on with your wife? Does she somehow feel unappreciated or low key does she have a debt you don’t know about? I’m assuming she’s keyed in on all your financials? I would ask her what she thinks this extra $50k is going to do for your family.  It sounds like this behavior is out of left field for her, so I would definitely talk to her more and figure out where this sudden greediness is coming from.",
      "id": 192,
      "comments": [
        {
          "score": 442,
          "content": "No clue, she won't talk to me!\n\nYes she is keyed in on financials she handles all the bill payments. We both keep a pretty close watch on everything and nothing looks out of sorts.",
          "id": 193,
          "comments": [
            {
              "score": 413,
              "content": "Might be worth doing a credit check, though.....her attitude gives me a sinking feeling there may be a secret credit card or two out there",
              "id": 194,
              "comments": [
                {
                  "score": 223,
                  "content": "Nah, i think its just simple greed..",
                  "id": 195,
                  "comments": [
                    {
                      "score": 72,
                      "content": "That’s the best possible explanation. Sadly",
                      "id": 196,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "Agreed. Even if $50K isn’t life-changing for them, it’s still *$50K*. Unless OP is Elon Musk or Mark Zuckerberg, that’s a lot of money.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 87,
              "content": "Wait wait wait.  She does the bill payments?  Have you two compared credit reports recently?  \n\nShe likely has a credit card you don't know about.",
              "id": 198,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 67,
              "content": "She got her mother involved.  This is weird. \n\nDoes she feel deprived of spending money in some way? That's the only thing I could think of.\n\nI agree with others, make sure the cousin secures the ticket and winnings and advise them to be discreet about spending...",
              "id": 199,
              "comments": [
                {
                  "score": 16,
                  "content": "> Does she feel deprived of spending money in some way?\n\n\nThis was my thought too. They may be doing well financially just to not have it translated in fun-money for her to spend on hobbies or luxuries or such.",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Well she’s going to have to talk to you eventually. You cannot take the ticket back  Keep us posted if you can.",
              "id": 201,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Please have your cousin sign the ticket!",
              "id": 202,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Sir, the only thing bothering your wife is her greed.\n\nShe just wants that $50k\n\nShe's trying to fake an issue in order to guilt you into taking it back\n\nShe can't condemn you for buying the tickets, then demand the prize\n\nHer mom is co-signing because she's greedy & entitled too.",
              "id": 203,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Oh this is such a scary coincidence, happened to my parents when I was 8/9. My dad gave a smaller sum than yours to his nephew and my mom was so so so angry. They fought for days and days. Their relationship was so messy for a while and all my siblings and I agree my mom was out of pocket. \n\nYou’re NTA op, but I think for her, this sum of money is “technically mine” in her eyes since you paid for the lottery ticket. She probably won’t talk to u for a while (my mom did that LOL), but don’t change your mind. Don’t give in, and don’t feel so shitty because of this. It’s not fair to you. She didn’t ask for the $50 back or anything so I hope you feel better soon :’)",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "An adult woman refusing to talk to her husband is a red flag on its own.",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "If I were you, I'd make an appointment with a marriage counselor. There's not much more you can do if she won't talk to you.\n\nIf she refuses to attend, you might want to consider seeing a therapist on your own to get some advice for dealing with this.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}