{
  "post content": "So one of my good friends who I have been friends with for 20 years is coming over to help me repair a hole in the ceiling tomorrow.  He asked if he could bring his new partner of about 5 weeks because shes got nothing to do and wants to come along and meet us.\n\nI instantly said \"yeah no problem\" (because why wouldn't you?)  I trust my friends judgement.\n\nHowever, when I have mentioned this to my wife, she has gone crazy saying I shouldn't invite people round that we don't know and that its weird that this woman will just be sat around watching him work etc.\n\nAITA for thinking shes totally unreasonable?  Like I genuinely don't get why shes so mad about it.  I have offered to say \"Sorry my wife doesn't want her to come round\"  but thats not acceptable either.\n\nNeither my or the wife understand each others position, so I have come here to ask you Reddit... AITA? ",
  "id": 1,
  "comments": [
    {
      "score": 56,
      "content": "Well, you and your friend are going to be repairing the ceiling, and your friend has told the partner she’ll be coming to meet the two of you…so that leaves your wife to entertain a total stranger on her own when she might have wanted to have a chill day to herself or to do other things during that time.\n\nIf your wife leaves the house while they’re over, would that bug you? What if she goes upstairs and doesn’t interact with them at all? If the answer is yes, then I’m gonna say Y T A. If not, NAH.\n\nAlso, don’t say your wife has ‘gone crazy’ because she’s upset with you. Unless she burnt the house down in rage that’s an automatic asshole move.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 30,
      "content": "INFO Is your wife going to be expected to entertain her while you and your friend fix the hole in the roof? How long do you expect the job to take?\n\nHis new partner sounds weird though to want to come and sit around for hours while he fixes a roof. Who doesn’t have a million things to do better with their time than that? I’m getting strong clingy vibes. They’ve only been together for five weeks. \n\nI understand you probably didn’t think this through and thought it would be harmless for her to come over and meet you but I’m with your wife on this. Whether you realise it or not there will be an expectation for your wife to entertain her.",
      "id": 3,
      "comments": [
        {
          "score": 5,
          "content": "OP is certainly TA based off the comments , nobody better bring someone a friend barely knows for me to entertain especially if I didn’t agree to it. Like what !? It’s super odd, if you guys had met before maybe , but first meeting naw.",
          "id": 4,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "Yeah fair I guess, I mean it is a bit strange for her to have nothing else to be doing but theres nothing as strange as people I guess.  It'll probably take us about 2-3 hours to fix the ceiling and in my mind she'd just be sat there as we do the repair, probably chatting?\n\nI don't know tbh.  But you make a good point to be fair",
          "id": 5,
          "comments": [
            {
              "score": 13,
              "content": "But what would you do if you’re busy with your friend working on the ceiling and his gf wants the bathroom and starts wandering to see the house, the kitchen cupboards, the bedroom, your wife’s closet etc - you don’t know her at all and weirder things have happened.",
              "id": 6,
              "comments": [
                {
                  "score": 4,
                  "content": "This ain’t fucking rocket science, surely it’s possible to converse while competing this relatively simple task. \n\nWhat is happening in this thread.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Of course it’s possible and if OP’s wife knew the gf, maybe she wouldn’t mind. That’s the point - neither of them have even met her.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Who the hell just wanders around someone they don't know house?",
                  "id": 9,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -17,
                  "content": "Well yeah maybe but not like we've got anything to hide?  I don't care if she wants to look around or have a snoop!  Think I get where you're coming from though, maybe my wife's just a bit suspicious!",
                  "id": 10,
                  "comments": [
                    {
                      "score": 15,
                      "content": "So flip the scenario.\n\nYour wife is having a friend over to help her get ready for an event, she is helping her with her hair and makeup for a few hours. \n\nYour wife's friends new BF doesn't have anything better to do on a friday night, asks to come along and just sit in the lounge room or hang on the deck until your wife and friend are finished in the bathroom getting ready upstairs.\n\nSo here is this random dude you have never met sitting in your downstairs lounge room just hanging out because he was bored, starts roaming around your home snooping in drawers and cupboards, but you \"don't care\". lol...come on mate!",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Seriously? You expect your wife to be happy with someone snooping through the house? That’s completely unreasonable. Unless your friend knew this person for a long time before they started dating he doesn’t know her well enough to vouch for her after only five weeks. \n\nIt’s all weird and you are not being considerate of your wife’s feelings here.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "It’s not about hiding. It’s about personal privacy and boundaries. Maybe your wife has a more robust sense of privacy than you do, but that doesn’t make her suspicious. \n\nIt would really bother me to find out someone had snooped around my house! It’s one thing to have people over and they pick things up that are displayed in the living room and move about the kitchen and bathroom, but it’s entirely different for someone to wander on their own by themselves when we are not specifically having company. \n\nThat said, my stepmother used to periodically rearrange my bedroom and go through all my stuff while I was at school and then expect me to thank her. I grew up, married and had a family, and a friend babysat for us once and completely rearranged our living room furniture because she thought she’d be more comfortable watching TV like that. Then there was when my in laws came to visit and while my husband and I were at work, they threw out our futon and bought a really soft mattress because they thought married people should have a proper mattress. I have lots of examples of boundary stompers. So maybe those things influence my sensitive boundaries.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Whatever you end up doing DO NOT blame it on your wife if you suggest the girlfriend doesn’t come over. That would be an arsehole move. The friend and his weirdly clingy girlfriend who has no life of her own shouldn’t have asked you in the first place and you should have checked with your wife first. If your wife doesn’t want to be involved on this occasion just make that clear to your friend “My wife already has plans that day with XYZ, she’ll be in the house and will swing by to say hello but gf will need to amuse herself, tell her to bring a book. Wife and I are keen to meet up socially for a proper get to know you chat in future”.\n\nAs other commenters have suggested it would be better to plan a get together with all four of you to meet the new gf.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "Your wife's right about it being strange that she just wants to come and sit at your house while he works when she doesn't know you, but not unusual for your friend to want you to meet just seems like may not have been the appropriate situation ESH",
      "id": 15,
      "comments": [
        {
          "score": -8,
          "content": "Yeah it's a bit weird but end of the day if your friend asks if he can bring his partner or she'll be sat on her own all day then how can you say anything but yes?  \n\nJust don't get my wife's angle at all but her reaction has made me think I'm missing something here and maybe IATA",
          "id": 16,
          "comments": [
            {
              "score": 10,
              "content": "Not guna lie I'd feel super uncomfortable if my husband said some random woman I don't know was coming to my house it's awkward AF. I would of said why don't we all meet for drinks so we can get to know her as we've not met her yet and don't want her to be uncomfortable in our home. But it's done now so to late for that but yeah id feel super uncomfortable with that to.",
              "id": 17,
              "comments": [
                {
                  "score": -4,
                  "content": "Ahh ok.  Can I ask why you'd feel awkward? Like I get it's a bit strange but if she's asked to come then I don't see a good reason to say no?",
                  "id": 18,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Because you don't know her lol it's your home doesn't matter whose partner it is you don't know anything about this woman your wife n her could get on like a house on fire but also the complete opposite could happen. It's not the correct environment and tbh weird that she wants to come sit in someone's house she doesn't know while her new bf works like can they not be apart for a few hours? Has she no friends of her own? Honestly mate that in itself is strange. You and your wife are now expected to play host to someone you may not even get along with and you've made this decision for your wife because if she doesn't she now seems rude. Also just a heads up when making plans like that always consult your wife first will save u a lot of trouble lol",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "So here's what you do. ring, ring. \"Hello, good friend, I've just found out that my wife had made other plans for tomorrow, so bringing your new partner won't work out. But let's plan a night out for the four of us for sometime soon in the future.\"\n\nBecause respecting your wife and her home is more important than somebody's date of the last five weeks.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "Info- does inviting the partner affect your wife? Will she be expected to entertain her? Is your wife the type who will feel the need to clean up or go to some trouble for a stranger to come over?",
      "id": 21,
      "comments": [
        {
          "score": 1,
          "content": "No she's not expected to entertain her and she might feel the need to tidy a bit but we live clean and it's not untidy.  Certainly nothing to be ashamed about.\n\nShe's normally pretty zen about stuff but this has really annoyed her and she's convinced that it's not normal to do this.  I don't get her angle at all",
          "id": 22,
          "comments": [
            {
              "score": 6,
              "content": "But your friend said ‘she wants to come along and meet us’. That suggests the friend is expecting your wife to be there, and he and his partner may very well be expecting your wife to entertain her.",
              "id": 23,
              "comments": [
                {
                  "score": 1,
                  "content": "Yeah maybe I guess - I understood \"meet\" to be \"say hello and introduce ourselves\". But you are right, it may be more than that.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 11,
                      "content": "It’s also really weird that a woman he’s been dating five weeks would be ‘sitting home alone’ if she can’t come with him. Like, does she not have a life of her own? I definitely understand why your wife thinks this is weird.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It's so weird his GF wants to just come and sit in your house while you and your friend repair the roof, like it's strange, lol.\n\n100% everyone in your friend group would think it's weird.",
              "id": 26,
              "comments": [
                {
                  "score": 0,
                  "content": "Oh yeah weird for sure, but weird doesn't mean bad. Just odd!",
                  "id": 27,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I also get how you probably can't say no to you friend without making it awkward between you guys. Like, your friend probably think it's a little weird she wants to do this also, but it's a new GF so he might not be able to say \"No\" without hurting her feelings?",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "It's not weird, imo. They just started dating. They're obviously loving spending time together. He might think it's a good way to casually introduce her to his friend group.  \n\nIf I were your wife I wouldn't expect to entertain her. I might even make tentative plans just in case I'm expected to.",
              "id": 29,
              "comments": [
                {
                  "score": 3,
                  "content": "She might also be interested in what her new boyfriend is doing and to see how he interacts with friends while helping them out.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Lol, if you want to meet the friend group, you organise a dinner and drinks or a BBQ, you don't go hang in your new BF's friends lounge room like a doofus watching them fix the roof. \n\nYou can't interact with anyone properly? \n\nIt's odd, it really is.",
                  "id": 31,
                  "comments": [
                    {
                      "score": -1,
                      "content": "It'd be odd if op was paying his buddy to do the work. \n\nYou do you. I'm good.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "Your wife probably thinks she gonna have to entertain her the whole time she is there and doesn't want to do that.",
      "id": 33,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "NTA - Your trusted friend asked if someone he knows can be at your house while you work together to repair the ceiling. Why do you need your wife's permission before saying yes; it is your home too? Maybe the friend and his SO want to do errands or grab a meal when the work is done. It sounds like he is doing you a favor teaming up to get the job done.\n\nIt is much nicer to fix repairs with people whose company you enjoy. Why does your wife not understand this? Maybe she'd even enjoy chatting with this woman. Best to you!",
      "id": 34,
      "comments": [
        {
          "score": 0,
          "content": "Thanks! I've said exactly this! Strangers are just friends you haven't made yet in my opinion but she's not happy at all 😂. Thanks for the good wishes!",
          "id": 35,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Personally, I am pretty hesitant of having people over that I do not know (met a couple of times in person) already. Makes me very anxious so I would feel the same if my husband sprang this on me.. \n\nAnd I get she is your pals GF, but not a GF of that long.. a matter of weeks. How well does he know her even?\n\n'Home' is a safe spot for most people.. YTA if you are making her feel uncomfortable in her own home to accommodate a stranger.",
      "id": 36,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1 - I instantly said it was ok for my friend to bring his new partner round to our house while we complete a repair job\n\n2 - My partner has gone crazy about this decision and says I dont consider her feelings at all and I don't know if its me or her who is being weird or an asshole about it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 37,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Ask your wife to help you figure out how to express this - like, my wife would want to be there too so let’s plan a different time for the four of us to get together. And be ready for him to bail, and don’t blame it on your wife.",
      "id": 38,
      "comments": [
        {
          "score": 2,
          "content": "Yeah I guess so, I mean I don't want her to be upset or feel awkward in her own home but she just keeps saying it's weird and not normal so I'm checking there isn't some sort of well known social code or trope I'm missing here?",
          "id": 39,
          "comments": [
            {
              "score": 3,
              "content": "Just to be clear, I do think it’s overstepping for a woman your wife doesn’t know to invite herself over with her bf who is coming to help you with a project.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}