{
  "post content": "My daughter recently got her license, and I bought her a car that I remember she said looked nice. I told my ex, and my daughters mother, about it and she said I shouldn’t have done it cause I didn’t get her, “consent”. \n\n\nFrom my perspective I don’t need her, “consent”. Since we’re not together anymore. She claims that it’s our daughter so all purchases like a car must be discussed and I was wrong for just buying her a car. She thinks I’m trying to show my daughter’s step-guy up or something. Since apparently she asked them and he couldn’t afford it.\n\n\nI will admit that hearing about my daughter asking the other guy and them not being able to afford even a used one before I stepped in and bought her a new one is very satisfying. I hate that guy, so getting 1 over on him is always good. But I genuinely didn’t know anything about that. And I really don’t think how it will make his kids feel should matter to me. I hate him, his kids, and anything to do with him. So I’m glad he’s upset about it. But I don’t think I’m the A hole for not checking with my ex and her new husband.\n\n\nA persistent person asked me to include the fact that I pay for my daughters insurance in my main post. But that I do not plan on paying for the gas she used, or….”oil changes”. Daughter has a job so she can pay for the gas she will be using. Also that I conceded custody.",
  "id": 1,
  "comments": [
    {
      "score": 2983,
      "content": "NTA. You don't need your ex's permission to buy things for your daughter.",
      "id": 2,
      "comments": [
        {
          "score": 1326,
          "content": "Maybe a heads up would have been nice/appreciated?",
          "id": 3,
          "comments": [
            {
              "score": 914,
              "content": "Not being \"nice\" =/= being an ah",
              "id": 4,
              "comments": [
                {
                  "score": 500,
                  "content": "OP doesn't have custody.  Adding expenses to their household is an AH move.  It's an elephant gift.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 553,
                      "content": "She's 17, custody is more or less a moot point!\n\nIf OP bought her a car, either she or OP would be likely paying the bills, Why would it add expenses to the household?",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "You mean the expense the daughter is paying for in full? It’s not step daddy who’s paying for it,it’s not the petty mom who’s paying for it,it’s the daughter with money she makes at her job,so it’s not a “household expense” it’s an expense for the daughter.The fact that he said he’s pay for actual damages to the car solidifies this point because guess what? That means neither the mom nor stepdad are paying for it.Quit trying to blame OP like you get an award for it",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "OP paid for the car AND insurance… not to mention the daughter is 17 and has a job to pay for other expenses, so OP is NTA.  A car opens up so many new opportunities and conveniences for her as a lot of aspects of life are now a lot more accessible! Why is the mother so concerned about her husbands feelings and not the door opened up for the daughter by OP… there’s no shame in the ‘step-guy’ not being able to afford it, that’s life… but to say that OP can’t give his daughter nice things to make her life easier because it will upset him is simply absurd.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "He said he pays for the insurance and the daughter has a job to pay for gas and oil changes. Since he mentioned it specifically like that I’d assume he’d help with repairs if they aren’t covered under the new car warranty. All in all I think he did fine and it’s a well thought out gift and will be safe for the daughter to use.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yeah.....no. OP is covering insurance, and the kid has a job so she can pay for her own gas.\n\nI'm not seeing an added expense here, so I'm not seeing an asshole move here.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "How is that an expense?",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "How exactly is that impacting household expenses? He pays car insurance. She has a job and can pay fuel and servicing herself.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Insurance is still probably in his name",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "He pays the insurance and his daughter has a job there’s no added expense",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -7,
                      "content": "Ohhhh that changes things. Yta op.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 48,
                  "content": "[deleted]",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I mean, it kind of does though a lot of the time. This sub isn’t “am I legally allowed to do what I did.” It’s “am I the asshole.”",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 132,
              "content": "My biggest concern would be insurance, bc I know nothing about how it works in divorce. But I wonder if the custody division affects who carries the insurance?  Like if she lives 60% of the time with her mom, does her mom have to carry it, or does it not matter. That's the only part that would really be problematic",
              "id": 18,
              "comments": [
                {
                  "score": 159,
                  "content": "Yeah my dad did this. Bought me a car, gave it to me in front of all of my friends, but then did NOTHING to put it on the road. My mom had to register it, insure it, and deal with any issues that arose. \n\nI didn’t have a regular job and she was having trouble paying bills. I absolutely should not have had a car. But my dad surprised me, her, and everyone else by giving me a car at my party. So she didn’t want to be TA and take it away. But he was def TA for that move.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 82,
                      "content": "I’m not your dad, I didn’t do that. Her car is in **my name**, on **my insurance**, and the 2 of us have already decided I’d pay if it gets damaged.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 56,
                      "content": "This happened to a friend of mine. Mom and step dad didn’t have a lot of money, what money they did save was spent purchasing a used Honda for step dad kid. Here’s the thing, my friends step sister was 2 years older, had a part time job and got really good grades. Used her own money to purchase driving school lessons, had her drivers license two years before they bought her the car. She paid for the registration and insurance, which wasn’t too much considering it was an older cheap Honda. So when my friend turned 16, the very next day asked her mom and step dad to buy her a car. The obviously said no, because they just spent their saved money on a car for step sister, my friend didn’t even have a license or a permit, didn’t go to driving lessons because she refused to get a job and had really crappy grades because she refused to do homework and skipped school a lot. Her dad would just buy her whatever she wanted because dad had a lot of money, hated his ex wife and definitely hated the step dad|. So she called her dad up and told him about how step sister got a car but mom refused to buy her one because they spent all the money on step sisters car. Dad got pissed off, argued with the mom, and the next day took her out to buy a car. It was used, but they bought a Mercedes that was only a few years old. Dad enrolled her into driving lessons but she still drive the car with out a license. Months down the road her dad ended up moving across country with the mistress and cut contact with my friend. Mom wasn’t able to afford to get the Mercedes registered since it’s super expensive to get a car like that registered, nor could they afford insurance for a car like that. Mom tried making a deal with friend, they would try to get the car set up IF friend got a part time job to help with costs. She never did, and eventually got pulled over and caught with out a license so the car got towed. And there it stayed. \n\nAll this because dad didn’t think he had to discuss buying a car with ex wife since she was the EX and was more than happy to “one up” step dad, then blamed ex wife and step dad was playing favorites with the step sister. \n\nAs for as I know, step sister went on to a really great university with a scholarship , married some guy, had a cute little family and both became doctors. and my “friend” dropped out of high school, married her high school boyfriend the moment she became 18, had a few kids. Last I checked she was on her 5th kid with her 3rd husband and was excited because she finally got section 8.  I always thought it was so strange how it was like stereotypes wrote themselves with these two girls.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 158,
                  "content": "It doesn’t matter who’s insurance she is on as long as she/the car is covered.\n\nI’m going to assume the car is in dads name and under his insurance.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 61,
                      "content": "I think they meant if he bought her an overpriced car for her mom’s insurance he would then be an asshole",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I haven’t heard of it mattering. It’ll be at least partly in his name since she’s underage so the insurance will likely be under his name regardless of who has primary custody",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Good point. She is only 17? Who’s name is the car in? I’m guessing OP?",
                  "id": 25,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Obviously OP since he is paying for it.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Stop acting like a 17 year old is a baby.  I'm 48 but at 17 I was in my second semester of college, paying my own rent, and yes even bought a very used car and insured it myself.  I was not emancipated.  I was still a legal minor in the US.  I don't know what country this look place.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "In most US states,  you are required to carry insurance for all persons in your household over 16 whether licensed or not.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 129,
              "content": "I agree on the heads up, \"consent\" is a bit strong, but despite being divorced they're supposed to be raising a child together, when it comes to major items/decisions it's important to have a discussion with the partner in raising, even if the end result is \"I'm buying it for her anyway\". 😉 \n\nHe needs to try and remember it's not about him or his ex it's about sending the right message to their kid.",
              "id": 29,
              "comments": [
                {
                  "score": 27,
                  "content": "Except they’re not raising a child together, he admitted to giving up his custodial rights.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 25,
                      "content": "He's in her life and he knows personal details, and as long as mom is involved and he hasn't broken contact with his daughter, he's helping. My dad didn't have custodial rights but I still benefited from his knowledge, and his wisdom. He's still my dad, my step-father was a veritable A-Hole. Bottom line is he's obviously still in her life, and he's her father.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "As someone with separate parents - this just seems like a classic divorced dad thing to do. Big gestures like buying over-the-top gifts mom can't afford... Feeling satisfaction in sabotaging her and new partner... it's petty. And in all petty disputes between parents it's the child that loses in the end. Even a fancy new car at 17 doesn't make up for the issues that pop up later in life as a result of these kinds of little wars.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "How bout a heads up the daughter asked and they couldn’t afford it?",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I don't know if OP would have known this reaction would happen, but I gotta say sometimes you don't do a heads. Its not always gonna be the best method,  but in cases where the other parent isn't on the kid's side (Seen here because there's reasons like upsetting the stepdad and stepkids) its better not to give them a chance to ruin things.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "NTA It sounds like they have the kind of relationship where drama will ensue if it can. The daughters 17, so almost 18 and an adult. This couple have probably been fighting about everything, forever. I’m NTA on this one.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If communication about the purchase of a car for a shared child is important, mom should have informed dad that daughter had asked and they had said no for whatever reason. Mom didn’t tell dad that it was already turned down, so he was working without that knowledge. He did tell mom (abet after the fact). Mom is criticizing dad for doing what she did - withholding info until after the fact. \n\nNTA.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I can see how there may have been a necessary conversation regarding safety with an inexperienced teenage driver about rules with the new car, like \"no driving after dark\" and \"no texting while driving\" and \"no carting around friends to parties\" and \" leave the car and call for a Lyft if you get intoxicated\" or whatever.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 299,
          "content": "It’s not permission. It’s “coparenting”. And it’s the right way to keep the kids best interests in mind without your ego or resentments getting in the way—exactly what OP is doing. They should make important decisions together regarding the child, even though they’re not together. OP YTA.",
          "id": 38,
          "comments": [
            {
              "score": 106,
              "content": "Yes, this. I'm actually laughing at the idea that this is just fine. In no world is it okay for one parent to just unilaterally make a huge decision like this for a kid they both have custody of. This is an easy YTA.",
              "id": 39,
              "comments": [
                {
                  "score": 31,
                  "content": "Even worse, they both don’t have custody. OP said mom has sole custody.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Great point. I missed that originally. My parents divorced when I was driving age and I was lucky to have parents who were amicable. I guess the broader point people are trying to get through to him is one of values. Doesn't each parent have a say in how the kid is parented? Do they work and save for the car, pay for their own insurance, work after school to pay for gas, etc. These are all questions that got completely set aside because this guy wanted to throw his money around. It's not about if he has enough money or if the parents don't get along. This kind of spite-buying completely bypasses any conversation about what is good for the KID.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Agreed. Think of it this way, if the parents were still married and one parent bought the kid a car with no discussion, would that be ok? Of course not. This guy, who sees his daughter infrequently, has no custodial rights, who bought this on his daughter’s whim, and did this in part to spite the stepfather, would have less say in this decision than a married partner—not more say. \n\nI can’t believe this got a N T A designation. Sometimes Reddit can be vastly disappointing.\n\nEdit: to whomever reported me to Reddit Suicide Watch or whatever, thanks? You proved my point. Sometimes Reddit can be *vastly disappointing*.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Yes, this is absolutely a joint parental decision, especially at her age.  A lot of kids are NOT ready to drive at this point, and maybe that is part of the parents concern as well.  It does sound like the OP did it to spite them, given his resentment and pettiness- Yes, OP- YTA.",
              "id": 43,
              "comments": [
                {
                  "score": 4,
                  "content": "She’s 17. One more year and she’s legally an adult. \n\nI’m a bit amused at all of this lack of understanding about how much freedom 17 year olds actually have.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I can't believe I had to scroll this far down to see tge real answer. OP comes off as a massive AH.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -12,
              "content": "It's fairly obvious that his Ex WOULD treat it as a permission and would, considering she thinks OP \" made the stepdad have bad feels \" about his inability to afford one for his own kids, turn it down flat out. \n\nOP is under no obligation to bend over backwards to soothe new husbands economic problems. \nBeing civil to the Ex and not trash talking the step da is as much as can be expected. \nHis daughter has an involved father who gifted her a vehicle. It gives his daughter a lot of independence and the ability to make her own way around town for summer or part time jobs. \nThe real problem is going to be the pressure and punishments going forward when Ex demands she share the car with step dad kids. I hope OP has a plan for that. Making sure the insurance only covers his daughter and no other drivers will solve that without burdening his daughter with turning down attempts to glom her car. It's a hood idea for teen age drivers anyway as letting friends drive it can be problematic.\n\nEx'es problems are not OPs. Step dad issues? Not OPs or his daughter's problem.",
              "id": 46,
              "comments": [
                {
                  "score": 34,
                  "content": "Dude, he admits he sees his own daughter only occasionally, he hates hates the stepdad, and revels in how this makes him feel. There’s a lot to unpack here besides “oh she needed a car so I got her one”.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 1,
                      "content": "And not just any car, not a reasonably priced safe model purchased bearing in mind that new drivers may be far more likely to put dents and scratches in it as they’re learning and gaining confidence, to say the least—a car his teen said she LIKED. He bought her a FUN car, a STYLISH car, not a safe reliable economical car.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Op is not an involved father. He barely sees her and his wife has full custody. He's clearly openly hostile to her stepdad to the point that he can't even call him that.\n\nHer legal guardians should have been included in the conversation, but op would rather just drop a big shiney passive-aggressive present in her lap and run away.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 248,
          "content": "No usually you don’t but a vehicle requires a huge heads up. A vehicle even if some else is covering the payment on also requires insurance, maintenance when/if something goes wrong, routine oil changes, gas, etc. There’s not a single parent on earth that I would not deem an AH for not discussing this with the other parent first. Even if being willing to cover all costs, that is a huge step- and responsibility for the child, and even if they are ready that is fine but it absolutely requires a conversation among both parents about the responsibility, etc.",
          "id": 50,
          "comments": [
            {
              "score": 29,
              "content": "I mean that’s her mother so she should have some sort of say in her daughters life, for their attitude alone I’m gunna go with ESH, they really should still be working together to give their daughter the best the both of them can, not fighting and being petty.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">A vehicle even if some else is covering the payment on also requires insurance, maintenance when/if something goes wrong, routine oil changes, gas, etc.\n\nThings the dad is paying for. He doesn't need permission from his ex to buy his daughter things that don't require financial support from her.",
              "id": 52,
              "comments": [
                {
                  "score": 66,
                  "content": "The most important part of it was the responsibility. They should agree on daughter’s responsibilities regarding maintenance, when she can drive friends, how far she’s allowed to drive, etc.\n\nPersonally, I think buying a brand new car for a teen is not a great decision. Accident rates are I believe 19 times that of over 25 y o. It will almost assuredly get dinged at least. \n\nMoreover, they cannot possibly understand the value without having earned it. I just gave my 16 y o a 2002 Civic even though I could have afforded a new one. He has a Job, buys his own gas and car washes. And he is putting away money to save for his next car himself. I am so glad my dad allowed me to learn the value of work and saving and buying my own as well. Most of the kids I went to school with that had expensive cars gifted has no concept of their value. How could they? It’s a lost opportunity in character development to give a teen a free brand new car, and distorts their sense of entitlement (eg many look down on kids with less). I’m not saying it ruins a kid irrevocably, kid can still be a good person… it’s just a majorly huge lost opportunity in a parenting choice.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I knew a girl who’s mom was lawsuit happy. She had multiple lawsuits going and when she would win one, she gave huge chunks to her 17 year old daughter. This girl would blow $10k in a month from drugs and shopping. But she should always purchase a brand new car that was popular at the time. First car was an Escalade that she crashed months later. Second cat was a mustang, crashed again. Third and fourth car was also crashes. I remember when she got her crystler 300, that last almost a year until she got a DUI and it was towed. She was friends with my best friends younger sister and I absolutely refuse to hang out with her. And I sure as hell NEVER got into the car with her, especially since she drive drunk and high all the time. She used to literally joke about crashing her car and said she didn’t give a fuck because mommy would just buy her a new one!",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "He flat out said he wasn't paying for gas.  He also went back and forth in comments about paying for routine maintenance (he gave different answers about oil changes).  He said he would cover accidents.  \n\nSo the only thing we know is that he will cover accidents and won't cover gas.  That is ***not*** covering all expenses of a car.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 10,
                      "content": "This doesn't really matter though. Anything he doesn't pay for, his daughter will have to pay for. His ex won't have to pay for anything because the car isn't in her name and isn't hers.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "If he doesn't need to ask permission, then he can keep the car at his house.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The dad is covering all of the above.",
              "id": 58,
              "comments": [
                {
                  "score": 33,
                  "content": "No he isn't.  He straight up said he isn't paying the biggest expense - gas.   He also was very wishywashy on whether he'd pay for routine maintenance like oil changes.  He only confirmed he'd pay for accidents.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 20,
                      "content": "/u/guacamore deleted this comment while I was responding (super rude man):\n\n>  As long as the mom isn’t obligated to pay and the daughter is, I think it’s still okay. By accepting the car, the daughter agrees to pay gas, oil changes, minor maintenance in my opinion. If the ex wife, however, was the one that had to pay for those things and wasn’t consulted about the car, that’s different. But if the daughter is old enough to drive and accept the responsibilities of car ownership, she’s old enough to get a job and pay some. In high school I didn’t know very many if any 16 year old kids with cars they didn’t pay for their own gas…\n\nBelow was the response I made before he deleted it.  \n\n-----\n\n\n\n\n> As long as the mom isn’t obligated to pay and the daughter is, I think it’s still okay.\n\nYou *know* OP is going to pull \"oh I covered so much so get your mom to cover gas\" and make her the bad guy.  Don't even pretend he won't pull that crap.  \n\n> By accepting the car, the daughter agrees to pay gas, oil changes, minor maintenance in my opinion.\n\nShe's a minor.  You should never ***ever*** give strings attached gifts to a minor.  That's terrible parenting.  \n\n> If the ex wife, however, was the one that had to pay for those things and wasn’t consulted about the car, that’s different\n\n***Which is the entire problem.*** OP dropped it on them and went \"figure it out, goodluck!\"  And he disappeared.  He didn't talk to them so everyone could figure out a plan. \n\n***THAT'S THE ENTIRE PROBLEM***.  He never gave anyone a heads up to prepare a plan.  He got the car without asking anyone.  Read the title of the post again!\n\nIf the issue in your opinion is around who pays what then he's an AH for not giving them a heads up to determine who pays what.  Clear cut.  Your own logic makes him the AH.",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "I paid for the car, the insurance, and accidents. What more do you want? She’s gonna be using the gas, so she can pay for that. And why exactly would, stuff like oil changes be anything I should cover. Is the one driving the car I bought not perfectly capable?",
                      "id": 61,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "If he wasn’t an AH why does he dedicate so much of this post to how much he hates his ex’s new husband?\n\nA car is a big decision, he bought it flippantly because his daughter said it “looked nice.” We don’t even know for sure if thats the car she really wanted! He’s an asshole and if he wants to be a good co-parent he needs to communicate with his ex about huge decisions like that.",
          "id": 62,
          "comments": [
            {
              "score": 26,
              "content": "But his ex and her husband decided without ever speaking to him that daughter couldn’t have a car because step dad can’t afford it. So why can ex make decisions like that without speaking to him, but he can’t? Seems like ex is only upset because he is showing up her husband, and her step kids will be upset her daughter has a car and they don’t have one.",
              "id": 63,
              "comments": [
                {
                  "score": 75,
                  "content": "> But his ex and her husband decided without ever speaking to him that daughter couldn’t have a car because step dad can’t afford it\n\nBecause they have custody.  \n\nThey decide what's best for her. They are the ones responsible for her.\n\nHe doesn't have ***any*** custody of her.  You don't think that's a bit weird?  He wasn't trusted with any custody over his daughter but he's supposed to be able to make this call himself?",
                  "id": 64,
                  "comments": [
                    {
                      "score": 7,
                      "content": "There's honestly a lot of reasons custody is handed over. And I just need to point out, maybe he's just being biased, or maybe his assessment is accurate that the issue of the car is because the mom doesn't like that it bothers her husband and makes her step kids jealous. In which case they aren't actually deciding what is best for her. They are deciding what is most convenient to them. Even if it means the daughter loses out on things.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I conceded custody",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 42,
                  "content": "“So why can ex make decisions like that without speaking to him, but he can’t?”\n\nBecause OP’s ex has custody and he doesn’t.",
                  "id": 67,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Not the same at all. Saying no to a big decision is not permanent, is always open to further discussion, might incentivize the teen to go to work or negotiate in some other way, etc etc. No is not at all the same level or intensity of decision making as buying her a car. I can’t believe people are equating those two.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Oh good catch,  you're right.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "and maybe daughter is playing Dad to get what she wants.    Mom may have other reasons for not wanting daughter to have her own car.   Since she wanted one, she went to Dad for one.   He doesn't have custody and obviously has anger towards his ex's new significant other.    At a minimum, Mom needs to be able to establish ground rules for car care etc - i.e.  if daughter is late for curfew more than twice, is MOm allowed to take the keys or is daughter going to say 'It's my car.   You can't take it from me'.    Since Mom is the legal guardian, if the daughter gets into trouble, she bears more responsibility than Dad.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Then ESH but that does not make OP a saint for unilaterally making a decision without even discussing it with his ex. And the same goes for her. \n\nTheir combined awful co-parenting is only going to push their daughter away.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I’m sorry but the logic here is a little flawed. Just because the step dad and ex said they couldn’t afford to buy her a car does not mean they specifically said she could not have one. The daughter has a job so mom and step dad very well could have told her to save up money and they could look into helping her find a suitable car to purchase with what she’s saved. Which is completely reasonable and would definitely teach the daughter an important life lesson. Obviously we only have OPs side, but buying a car is a huge purchase and definitely warrants a conversation with the parent who has custody. OP is definitely TA in this scenario.",
                  "id": 72,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Yes. If ex’s husband could afford the car, do we really think ex + husband would have asked OP for permission before buying one? OP, NTA.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "OP did not buy the car out of malice directed at the step dad. It's a bonus sure but despising the step Dad doesnt make him an asshole.\n\nThere are a bunch of reasons that could lead to that dislike. Stepdad could be an overstepping IM the PARENT guy, he could be aggressive, belittling, have alcohol abuse issues, infidelity could be involved , all kinds of things. The stepdad is butthurt right now that OPs daughter has something his kids do not and that is straight up bullshit in a blended family.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 63,
          "content": "That’s fine in theory, but co-parenting is much more than one decision. It’s inappropriate to not discuss such a big decision/purchase with your co-parent and make it so unilaterally. It sends a shitty message to the kid and causes more strain between co-parents than necessary. \n\nThis shouldn’t be a game between them, they should both be mature enough to respect each other and their roles as parents.",
          "id": 75,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 50,
          "content": "Disagree. Driving and car ownership is a HUGE responsibility that should be discussed between parents",
          "id": 76,
          "comments": [
            {
              "score": 1,
              "content": "Yes. Doesn’t it come with additional costs as well? Insurance, parking fee, gas…",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "This isn’t just a “thing”. A car is a big, dangerous object that comes with a lot of responsibility. The mother is the custodial parent meaning if the kid does anything, like get into an accident, hurt anyone, damage another car, the mother will be held responsible. Not to mention it’s super common for new drivers to get into accidents in general, she could easily get hurt, and it’s so easy to be irresponsible with a car.\n\nThis is absolutely something both parents need to discuss to decide if it’s right for their kid. It’s not a new sweater, it’s literally heavy machinery lmao.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Being a shitty co-parent makes you an AH\n\nYTA",
          "id": 79,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Well, you kind of do when you don’t have custody of the daughter.",
          "id": 80,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "what if mom didn't want daughter to have a car because she was already violating household rules and she was worried that her daughter would be out joyriding after curfew?   At a minimum, he should've given her a heads up so that they can establish any guidelines with regards to the car before hand - i.e. Mom is allowed to take keys if she is late more than twice, etc.   Vs daughter saying 'It's my car, not yours.   Dad gave it to me'.   The poster obviously does not get along with his ex and her significant other - the daughter can be using that to play her Dad.",
          "id": 81,
          "comments": [
            {
              "score": 1,
              "content": "All of that!",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2747,
      "content": ">I conceded custody\n\nThis right here is a big part of why doing something like buying her a car without discussing it with her mother first was wrong.\n\nYour ex is the parent with primary custody. She gets to make the big calls, and that includes if she is allowed to have her own car, what types of cars are acceptable, and any rules that go along with having her own car. \n\nAnd, although you say you didn’t know that she had already asked her mom and stepdad but they couldn’t afford it, it is clear that your main motivation was to try to show up your daughter’s stepdad with a shiny brand new car. Getting a brand new car for a new teenage driver is done to show off. No 17 year old needs an expensive new car with even higher insurance costs than already apply to teens. \n\nSo, yeah, YTA \n\nTry coparenting instead of being so busy hating your daughter’s stepdad.",
      "id": 83,
      "comments": [
        {
          "score": 270,
          "content": "This. Plus, Mom has to insure the car now, which is an added expense.",
          "id": 84,
          "comments": [
            {
              "score": 643,
              "content": "He did say he is paying insurance, but he also isn’t paying for regular maintenance because *he doesn’t believe that that counts as an expense.*\n\nAnd, he probably used his address on the insurance which could possibly get her into trouble if anything happens since she doesn’t live with him. \n\nHe has also conveniently left out what kind of car it is other than that it was new, so we don’t know the extent of how inappropriate the car may be for her or what the rest of the cost of ownership is that they’ll have to pay aside from insurance.",
              "id": 85,
              "comments": [
                {
                  "score": 167,
                  "content": "Exactly. He legally can’t insure the car, the mother MUST add it to her insurance (for it to be valid). \n\nOP,\n\nYTA",
                  "id": 86,
                  "comments": [
                    {
                      "score": 108,
                      "content": "The car is in his name. Her insurance is not part of it.",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 48,
                      "content": "If this is the US that's not true. As long as he discloses the alternate garaging address,  the policy is written for the state the car is registered in, the named insured matches the registered owner, and all drivers of the vehicle are listed on the policy then it's legal. The custodial parent doesn't have to have the policy for it to be valid.  OP is still the AH because he's a non-custodial parent making a major decision that could potentially impact custodial parents finances. (Impact to mom's insurance that kid may already be listed on plus He's said he's not covering maintenance costs)",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "That's not even almost true. Anybody can insure the driver/ car as long as the carrier agrees.",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Underwriter and former adjuster, here.\n\nMost states allow minor children (even without primary custody) on either parent's policy. \n\nAs long as he gives the correct primary garaging zip code, he can pay for the insurance.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "No reason why the daughter can’t pay for gas and oil changes.   I did when I was 16, along with buying my own car.  And when I neglected to get oil changes I got to pay for a new engine.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "In a more recent update he explained that his daughter does have a part time job and will be paying for gas and maintenance costs with her own money not her Mom or step dad's money",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I mean as long as shes listed as a driver on his insurance that shouldnt be an issue. Some states dont even require that.",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Uh it shouldn’t count as an expense on anyone but the daughter,she pays for gas she’ll pay for routine maintenance,OP will pay for the insurance and any damages to the car like if the transmission gets wrecked.Really? The car is something the daughter liked,it’s not like it’s going to kill her,plus pretty sure anyone would do research into the car they buy before they buy it so they know what to expect,unless you Americans just like dying from something other than a heart attack.",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "my parents make me pay for regular maintenance on the car they own but let me use. it’s plenty fair.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 145,
          "content": "YTA. Custododial parent makes the decisions. \n\nA car is s HUGE decision. Not your call without discussing it.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "Just popping in to say he stated in one comment that  he conceded custody because he was deployed at the time, so he likely wouldn't have won what could've been a lengthy custody battle anyways, so he conceded instead. Not that I don't agree with all your points, but I don't think we should crucify the guy on that concession either.",
          "id": 97,
          "comments": [
            {
              "score": 24,
              "content": "Plus the cost of legal fees. My grandfather had to give up custody of his 1st born because the mother and new husband barried him in court fees. He was over seas fighting a war and it cost more in legal fees to be overseas to fight a court case. He had to think of the debt he was letting my grandmother drown in with two children under 5yrs old.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": ">Just popping in to say he stated in one comment that he conceded custody because he was deployed at the time\n\nIf he said that, I can’t find it. The one related comment I did find that was posted after my comment is:\n\n>I never fought for her, I just conceded custody. I didn’t seek it.\n\nThis guy just didn’t even ever try at all to have any custody of his daughter.",
              "id": 99,
              "comments": [
                {
                  "score": 14,
                  "content": "https://www.reddit.com/r/AmItheAsshole/comments/qt9duq/aita_i_bought_my_17_year_old_daughter_a_car_now/hki915b?utm_medium=android_app&utm_source=share&context=3",
                  "id": 100,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Thank you for linking that. \n\nOh yeah. This is oh so much better. \n\n>But in my case I was deployed and then working so much of the time that **my wife was pretty much a single parent.**\n\n>I was the kind of dad who’s wife’s friends would sincerely and enthusiastically praise me for, “babysitting”. Even though they were **technically my own kids**. I had to pay tons of additional child support. But it’s okay. **It’s better this way.**\n\nCool with been seen as a babysitter for his own kids. \n\n“Technically his kids” - who says that? Not anyone who actually sees themselves as a parental figure or who has any desire to be an active and full participant in parenting his children, as confirmed by “it’s better this way.”\n\nBeing deployed was the least of the reasoning here.",
                      "id": 101,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 46,
          "content": "Also, money aside, deciding whether or not a teen has their own car is absolutely a coparenting decision. It’s a big responsibility. If I had a child who had any sort of bad driving record or who had a propensity towards irresponsible behavior (e.g., skipping class to go places with friends regularly), I would absolutely not want them to have their own car to get themselves into more trouble. \n\nI’m not saying OP’s daughter is irresponsible, but these are conversations you have with the other parent.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Commenting cause this needs to be the too comment. YTA",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I disagree that a teenage driver shouldn’t have a new car. New cars are safer than old cars. They are improving safety features on cars all the time. Ideally, in a perfect world where cars were affordable for everyone, all new drivers should have new cars because they are the drivers who are most likely to get into an accident: A safer car means the rider is safer.\n\nObviously that is not an affordable choice for the vast majority of people, but if OP can swing it, more power to him. That reason may not even have been on his radar when he bought the car, but it probably DOES end up keeping his daughter safer than if he bought a used jalopy.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This is the teenage version of buying your kid a pet when they don't live with you",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah I was leaning towards N-T-A right up until this. He bought a kid a car and without informing the people actually parenting her. YTA",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "The mom and step dad would have gotten her the car but couldn't afford it. He's paying for insurance and the daughter will pay for maintenance. She's also almost adult age. NTA",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Agree. I feel like this is the equivalent of buying a puppy without asking the parent/guardian who lives with the kid. Not cool.",
          "id": 108,
          "comments": [
            {
              "score": 1,
              "content": "Lol not the same thing at all",
              "id": 109,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 979,
      "content": "YTA, buying a kid a car is a big deal and definitely something you should at least TRY to co-parent on. You may not technically need your ex’s permission (“consent” really strikes me as the wrong word here), but at least discussing it with her since it directly affects her and the daughter you share would have been a good and reasonable thing to do. \n\nAlso, you hate her new husband’s kids? Really? They’re just kids who have nothing to do with your beef with this guy. Taking their feelings into account, at least a LITTLE, is the proper adult move here. I don’t care how awful their dad might be or how justified you are in disliking him.",
      "id": 110,
      "comments": [
        {
          "score": 222,
          "content": "> Also, you hate her new husband’s kids? Really?\n\nThis pushed it into AH territory for me. Buying a car without due coparenting diligence is dicey but not necessarily shitty. But hating literal children just because you hate their dad? What the fuck.",
          "id": 111,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "I’d also be interested to know if the daughter calls him “step guy” or if that’s just OP undermining her relationship with her mother’s husband. Especially considering in other comments he says that when they were married his ex-wife was effectively a single mother.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 638,
      "content": "Info/clarification:  it doesn't sound like they asked you either.  Her step father said they couldn't afford it without checking with you about some sort of split payment plan or discussion.  Is that correct?",
      "id": 113,
      "comments": [
        {
          "score": 463,
          "content": "They’ve never had a conversation regarding anything about my daughter and a car with me",
          "id": 114,
          "comments": [
            {
              "score": 174,
              "content": "So you both did the same thing, but you are the bad guy?  NTA!",
              "id": 115,
              "comments": [
                {
                  "score": 403,
                  "content": "No, they didn't do the same thing. One of them bought a car for a kid who doesn't live with them. The other . . . didn't.",
                  "id": 116,
                  "comments": [
                    {
                      "score": -34,
                      "content": "They both decided not to talk to the other parent at all.. but hes only the bad guy because he had the money to buy her a car.",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -44,
                      "content": "Exactly why can't people see a convo didn't need to be had bc it w as s a no go?\n\nWere they supposed to say hey OP we are not buying a car for daughter /step daughter bc we can't afford it?\n\nC'mon now. It went no where and therefore there we no need to have a convo about it.\n\nIn the other hand bio dad ended up taking it further than a question and therefore a conversation needed to be had.\nEven just a check in.\n\nHowever not knowing how gas is going to get paid as in his comment means he clearly hasn't thought or talked this through at all.\n\nOP YTA",
                      "id": 118,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Yea what they didnt even come close to doing the same thing lol",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "Do you ever discuss your child with her mother",
              "id": 120,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Because you aren't her legal parent, they don't need to discuss that with you. You gave that up and with that comes giving up the right to decide if she can get a car or not. YTA",
              "id": 121,
              "comments": [
                {
                  "score": 3,
                  "content": "He didn’t give detail but vaguely “conceding custody” can mean a wide variety of things. I’m guessing he meant he conceded primary physical custody, but clearly he’s still involved in his daughter’s life. He very well could still have joint legal custody and I doubt his parental rights were terminated, so yes he’s still a legal parent. \n\nAs a divorced coparent, I know the rule is you get zero votes in what gifts the other parent gives the kid but you set the rules in your house. If mom doesn’t like the car, she can set a curfew and/or distance limits on its use while the kid is with her. If cost is the concern, she can refuse to contribute towards its costs. She could even go so far as to ban it from her property. Plenty is within mom’s control. What gifts dad gives his daughter is not.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Well to be clear, you conceded custody of this child to them so that might be why they didn't think they needed to discuss this lol",
              "id": 123,
              "comments": [
                {
                  "score": 11,
                  "content": "I was deployed when I got the news, what would you have done? Literally got mailed the papers.",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 31,
          "content": "If they have multiple kids (which they do, because step kids) then the split payments with OP isn’t a viable option for what they can or can’t afford when it comes to big purchases unless the step kids other parent can also take on that kind of situation when it’s their time to get cars. You don’t need to keep everything equal between the kids in blended families, but you absolutely can not get one kid something as big as *a car* if you can’t afford to do the same with the other kids. OP may not have a reason to care about the other kids, but everyone would be screaming Evil Stepmother if the step kids came to this sub saying their dad and step mom got their step sister a car but won’t do the same for any of the other kids.",
          "id": 125,
          "comments": [
            {
              "score": 33,
              "content": "[deleted]",
              "id": 126,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Because they have 100% custody.  Why would they need to ask someone that has no custody of her?",
          "id": 127,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "They have full custody of the daughter, why do they need to ask him? Buying her a car or not does not affect him, it does affect them.",
          "id": 128,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Good point",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 426,
      "content": "I see where the  ex wife is coming from, you sound childish and petty as hell no wonder y’all aren’t together YTA",
      "id": 130,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 323,
      "content": "YTA. Parenting is a joint project, and the purchase of a car deserves discussion first with the other parent (she gets input, not complete veto power though). And don't do it to show up the step parent.",
      "id": 131,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 303,
      "content": "YTA\nFirst off, you sound like an asshole. An asshole in general, but an asshole to co-parent with. Secondly, owning a car is a huge responsibility and expense -an expense that doesn’t end with the purchase price when there’s insurance and gas and maintenance etc. Definitely something that you should’ve discussed with your child’s mother and coparents. Grow up.",
      "id": 132,
      "comments": [
        {
          "score": -20,
          "content": "They didn't ask him about buying her a car either. So...",
          "id": 133,
          "comments": [
            {
              "score": 53,
              "content": "They said that they couldn’t afford to buy her a car. That’s not the same as deciding she couldn’t have one. Plus, the implications of having vs not having a car are completely different. If OP’s daughter has full time access to a car, that changes things for her mother and stepfather. OP’s daughter continuing to not have a car doesn’t change anything.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "They have custody of her. He conceded his rights. Why would they discuss it with him? HE definitely should've talked to them.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Op said he conceded custody and she doesn't live with him, why would they ask him?",
              "id": 136,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -21,
          "content": "He just said he would pay for maintenance etc.",
          "id": 137,
          "comments": [
            {
              "score": 45,
              "content": "He’s an asshole to coparent with! The cost doesn’t matter - it’s about instilling values in your children. Earning something working for something not having things handed to you. Handling responsibility. It should’ve been discussed. The kid asked her mom and stepdad and it was easy for them to say no if they can’t afford any of it - what is there to discuss on their side?",
              "id": 138,
              "comments": [
                {
                  "score": 7,
                  "content": "🏅🏅🏅 Seriously, I could afford to buy my teen kids new cars, but as a matter parenting principle I would never rob them of the character building that comes with working and saving for your own. I give mine an old one they can use while they save up for their own, so they can properly appreciate it. Buying a brand new free car for a teenager is not a great parenting choice IMHO.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "That's not what this is about and not what the mother's problem with the car was.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 1,
                      "content": "According to him!",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "> Earning something working for something not having things handed to you.\n\nYou realize that 99% of teenagers have no way to purchase their own first car - because they CAN'T get a JOB without transportation???!!!",
                  "id": 142,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "You mad she can afford a new car for his kid? Maybe she did earn it? The ex would have bought her a car if she could afford it. So what the heck are you going on about?",
                  "id": 143,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "2 years ago my ex told my our daughter she’s getting his car. ( she’s 14 now and will be driving in 3 years) . I was pissed. We grew up differently. He got handed a sports car, no payments. I had to work for my first car . Paid for by myself. We have different values. I wish my ex would have spoken to me first before promising her things like that. I hope to have another conversation on costs and responsibilities on the car. Because I am the primary parent who pays for nearly everything . \n\nMy ex should have talked to me before our daughter for sure",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "So why didn’t ex talk to the OP about the car issue? She’s only mad that she and her new husband couldn’t afford a car and ex could. Mom would have gotten the car without discussing it with the OP if she could afford it as well. So her frustration is hypocritical. Don’t get me wrong, a car *should* be discussed beforehand. But mom can’t hold herself to one standard and dad to a stricter standard either.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Because she has primary custody and decision making - the mother doesn’t have to discuss with him. But he has to discuss with her. Also what’s there to talk about",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Not sure how you came to that conclusion. Why would the ex talk to OP about it if they knew they weren’t getting her the car? He said they can’t even afford the insurance on it so it sounds like they couldn’t afford even a partial payment to split with OP. Daughter asked for a car. Mom said no. How do you jump to but she would’ve done it without talking to OP if she could afford it?",
                      "id": 147,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 223,
      "content": "INFO - What's the custody agreement for your daughter? Who is paying for maintenance on the car? Who is paying for gas? Who is paying for car insurance?",
      "id": 148,
      "comments": [
        {
          "score": 51,
          "content": "what happened to make all the replies deleted lmfao",
          "id": 149,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "What happened here 👁👄👁",
          "id": 150,
          "comments": [
            {
              "score": 47,
              "content": "[deleted]",
              "id": 151,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 177,
      "content": "YTA. You should love your daughter more than you hate your ex’s family. Petty parenting will ALWAYS come back to bite you in the ass. Always. How you parent is how she will view the potential partners in her life. Think long and hard if you want her to end up with someone who is petty and bitter. Because she will. Getting input with your ex about life changing gifts is not only good co-parenting, but has a significant effect on both households. Be better.",
      "id": 152,
      "comments": [
        {
          "score": -42,
          "content": "I knew nothing about it upsetting her husband prior to her telling me. But I’d be lying if I said the thought of getting one over on him doesn’t bring a smile to my face. The guys Is a piece of work.",
          "id": 153,
          "comments": [
            {
              "score": 56,
              "content": "YTA for this answer alone. This is where and with who your child lives. You need to put it away.",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "If he's so awful why did you concede custody of your daughter to him?",
              "id": 155,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -8,
              "content": "I get that. Jesus you don’t know how much I get that. But take a breath and let that shit go. I’m not kidding that it will bite you in the ass. I have first hand experience and it’s heartbreaking to watch the birth parent lose a relationship with their son.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 110,
      "content": "YTA. You’re not a single dad. You’re a COPARENT. That means you make important life decisions together",
      "id": 157,
      "comments": [],
      "relation": "Attack"
    }
  ]
}