{
  "post content": "A friend decided she wanted to have her bachelorette party in Las Vegas, so most of the bridal party decided to road trip it out together, including the bride-to-be. We all chipped in so the bride wouldn’t have to pay for her hotel room, bottle service at a club for one of the nights, and a nice dinner. We also chipped in to get her some gifts. The rest of the time, we all covered our own meals, gambling, etc. Everyone had a great time, bride included. \n\n\nA little backstory: Several of us met through work, which is a freelance industry. We are still semi-new to it, so it’s always a grind to find our next job, and so none of us are exactly well-off. I even turned down a long gig, which really sucked for me financially, because it would have taken me out of the country for the date of the wedding. So on top of paying for my share of the bachelorette party, I also am paying for my wedding gift, a bridesmaid dress, two pairs of shoes she requested (wedding and rehearsal dinner), and a hotel room for the actual wedding which is also in another city a few hour away. So this wedding has already been fairly expensive for me. \n\n\nAnyway, as we are driving back home, we decide to just grab some fast food for lunch on the way. As I get to the front of the line, the bride runs up to me and tells me what she wants. I may have been a little cranky from the amount of money I just spent in Vegas, but I couldn’t do it anymore. I just looked at her, told her that sounded good, and paid only for my own order. Immediately, the bride’s face turned angry, and things have been weird between us ever since. \n\n\nFor the record, I acknowledge that I absolutely could have afforded her $8 order, but it was her sense of entitlement that turned me off in the moment. But I still don’t think I was in the wrong. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 775,
      "content": "Wait wait wait.  You paid for all of this other stuff, AND you bailed on taking a long term job for the sake of not missing the wedding and an $8 meal is the hill you decide to die on?\n\nESH: you for listening to her order, telling her it \"sounded good\" and only ordering for yourself.   Her for having, at least the way you tell it, a sense of entitlement for everyone to comp everything for her the entire weekend and beyond.",
      "id": 2,
      "comments": [
        {
          "score": 249,
          "content": "This. I don't know what makes people so crazy about weddings/bachelorette parties, but so many people are mad from the start about cost, say nothing, let it simmer, and then explode over the wrong thing. \n\nOP is an adult. If they were uncomfortable spending this much money/not taking the job, there was ample opportunity to say something. Social pressure is real, but it's not law. If you don't/can't do something without it hurting your bank account beyond repair, don't do it. \n\nThe bride sounds entitled in this narrative, to be sure, but at every event like this I've attended, people paid the bride's way, even on the small stuff. Suddenly throwing that in her face over a fast food order was designed to make her feel shitty during a celebratory event. We only have one side, and that bit about rehearsal dinner shoes is egregious, so I'm in the ESH camp, but only barely.",
          "id": 3,
          "comments": [
            {
              "score": 11,
              "content": "This exactly. I was asked by a close friend to be a bridesmaid in her wedding. I knew financially I wouldn't be able to do it because money was really tight for me at that point in time. I felt awful about turning it down but thankfully she is an awesome person and was totally understanding. I don't get why people think they need to walk on eggshells around brides to be. Act like adults and voice your concerns. If they still throw a tantrum then don't participate.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -105,
              "content": "Umm, the bride is supposed to be paying for everyone else. I don’t know what weird bachelorette parties you’re going to, but everyone else bankrolling the *bride* is ridiculous.",
              "id": 5,
              "comments": [
                {
                  "score": 98,
                  "content": "It's pretty common for the other members of the party to pay for the bride's drinks and dinner for her bachelorette party.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Yes, assuming it's an actual party and not a several day event. I understand getting drinks/dinner for one occasion but I can't see how it should be on the bridesmaids to pay for the bride's every meal if they're actually all going on a vacation for her. She's a bride, not the queen.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Yeah, drinks and dinner.  Not every possible expense that crops up.  If she trips and breaks her arm, are they supposed to pay for that, too?  Entitle bride probably thinks so.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "I'm in the US Northeast, and generally, the bride doesn't plan or pay for the bachlorette in my circles. I covered dinner for one friend who struggles financially and had travel costs, and my friend was a bit offended by this.\n\nOn the other hand, I did pay for hair and makeup and all the bouquets for the wedding party (and I definitely didn't require specific shoes - it's actually pretty common to just request a nude or black shoe in any style but I didn't even bother with that). It can go either way, depending on the situation, but the bride might pay for those items and occasionally even the dresses.\n\nThe part that surprises me is the wedding present. Of my 3 bridesmaids only 1 actually gave me a present, and that was my sister who didn't actually participate in any bridesmaid activities (she lives across the country) and had no associated costs and was basically just an honorary bridesmaid.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 17,
                      "content": ">Of my 3 bridesmaids only 1 actually gave me a present, and that was my sister who didn't actually participate in any bridesmaid activities (she lives across the country) and had no associated costs and was basically just an honorary bridesmaid.\n\nUm...that is \\*why\\* she gave you a present. She had money left over that the others didn't. I've been a bridesmaid (and a best (wo)man!) and once I'm shelling out over $1000 all in for a wedding + other events (travel, lodging, food, outfits, the bride/groom party), I've never had any left over for a present. My being in the wedding party (and planning a ton of stuff) was my present. [Miss Manners](https://emilypost.com/advice/wedding-attendants/) says I should have, but she also says that the bride/groom (or their families) should provide lodging for the wedding party, which has never happened for me. So, yeah, I'm gonna take that with a grain of salt.\n\nWedding invitations are not a binding contract to provide gifts. Gifts are \\*always\\* optional. I'm currently planning my own wedding and we're opting out of gifts all together, but yikes, even if we had a registry I can't imagine asking my bridesmaids to give something above and beyond what they already are doing.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I've never heard of the bride paying for her own bachelorette party. Every bachelorette party I've attended we as attendees covered the costs for the bride.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Yeah where I'm from (the midwest)  the party is part of the wedding expenses and is more or less paid for by the bride / out of the wedding budget. \n\nSource: been a bridesmaid 3 times",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 208,
      "content": "NTA. She wants specific shoes for the rehearsal dinner?? That is next level. Being a bride doesn't give anyone an excuse to act like an entitled brat.",
      "id": 13,
      "comments": [
        {
          "score": 64,
          "content": "Seriously...who the hell makes you buy special shoes for the rehearsal? Bridezilla if I ever heard of one.",
          "id": 14,
          "comments": [
            {
              "score": 13,
              "content": "Yeah, like I can't even imagine a scenario where this would be a thing? Are they all wearing matching rehearsal dresses too?",
              "id": 15,
              "comments": [
                {
                  "score": 10,
                  "content": "Yeah, every bridal party I’ve ever been in, and I’ve been in about 11, has been very low-key. We were just told to wear a formal looking shoe in black, no boots, and to have a dress in a certain colour… Most of the people in my social group are into mismatch dresses so we all just picked address in black and if we happen to own address in that colour she said go for it.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 134,
      "content": "could've handled it better but she sounds like a fucking nightmare. YTA though because you made her think her behavior was fine until then. you metaphorically punched her in the face without giving her a chance to rectify her behavior. Yea, any normal human would feel bad acting like a bridezilla but she probably thought everyone was just indulging her on her big day. \n\nSide note: I fucking hate the tradition that the bride & groom don't pay for their own damned wedding. if you can't afford it, *fuck off.* why should it be on anyone else?",
      "id": 17,
      "comments": [
        {
          "score": 36,
          "content": ">Side note: I fucking hate the tradition that the bride & groom don't pay for their own damned wedding. if you can't afford it, fuck off. why should it be on anyone else?\n\nI think it's moreso \"customary\" for the bridal parties to pay for the bachelor/bachelorette stuff, but it also seems like there's bad communication between everyone when it comes to that.  Half of them want to do XYZ, half of them want to do ABC, half of them can't afford to pitch in, etc etc.\n\nI don't disagree though, no one else should feel obligated to pay for anyone else's shit.",
          "id": 18,
          "comments": [
            {
              "score": 34,
              "content": "I think it's customary because it's actually supposed to be a one day event. One meal is not a big deal. Several meals over the course of several days during a vacation is totally different.",
              "id": 19,
              "comments": [
                {
                  "score": 7,
                  "content": "Sure, but we're assuming a lot about everyone's finances here so I don't want to even go down the rabbit hole on this part of the situation.  Apparently the OP was at least sort of stressed about the money (rightly so) but again, it should have been brought up long before an $8 meal was the tipping point.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": ">\t\"moreso customary\" \n\nexactly. tradition.",
              "id": 21,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 128,
      "content": "ESH - If you're there on her bachelorette party weekend, it would've been best to just pay for the $8 food to make her happy. The weekend really *is* about her and celebrating her. But, it's still rude to be entitled.",
      "id": 22,
      "comments": [
        {
          "score": 61,
          "content": "think of the brides point of view though. no one has told her that they're turning down jobs to go to her wedding. the weekend has been treating her. it'd be really odd if all of a sudden a $8 dollar fast food was the straw that broke the camel's back. \n\ni'd never expect people to treat even on a weekend like that. but if they are, its not asshole to figure that its going to continue. it'd be annoying if you kept asking at every single event if you can pay your share.",
          "id": 23,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 75,
      "content": "ESH, just ask her for money. \"You have any cash? If not, you can just PayPal me later.\" Its not that hard.",
      "id": 24,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 46,
      "content": "NTA\n\nJesus more and more i find meself saying thank god im not american. The materialistic traditions over there are mad! In my country ya literally have the hen night and wedding. Ya cover the room and dinner, thats it. If you need a plane to get to the hen night you cover yourself only! If you're asked to be bridesmaid it's the bride's job to buy the dress and it's expected that everyone in the wedding party is given a gift by way of thanks for helping, from the bride and groom. \nThe sense of entitlement from the bride is mind boggling!\nNTA here.",
      "id": 25,
      "comments": [
        {
          "score": 26,
          "content": "It varies a lot even here. \n\nThe US is huge, and people often move for college and move again to a city to find work. I went to high school in NJ and I currently have more high school friends in CA than NJ. (That's a 6 hour flight or several days of driving.) \n\nCultural norms differ by region and social class, but the distance also makes it hard to do things as simply.\n\nMy 3 bridesmaids were from CA, MA and NJ. No matter where I had it, 2/3 of them would have had to travel 6 hours for what might be just an evening. At that point, it makes a bit more sense to just do a weekend of things.\n\nA weekend bachlorette doesn't mean it's necessarily a crazy weekend. In my circles, it's usually one big night and then a few smaller optional things (we had brunch at home and went to a science museum, partner had a gaming afternoon). \n\nIt is definitely standard to get everyone a gift. The biggest difference is really just the norms around who purchases the dress.",
          "id": 26,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It will vary a lot and you only hear complaints from the more extravagant if we are being honest. People are definitely paying a bit more as of late, but it's not as insane as it sounds. A small weekend to celebrate with friends and a suit or a dress is pretty standard. For girls they might also need the hair and makeup. \n\nThe standard is a gift from the bride and groom as well as a heartfelt thank you. It starts to get out of hand when people are asking for bottle service, great hotels, lavish meals, multiple shoes, $500 dresses and the like. All of the above were things I or friends have heard of being asked of them. It's silly. My goal is to be able to help my friends for my wedding because I know how ridiculous it can be and how quickly it adds up. I'm going to try and swing some rooms and keep my suits and dresses reasonable and ones that can hopefully be worn again. \n\nMy girlfriend had to buy a $350 dress and $150 shoes among other things for one wedding and I was absolutely flabbergasted. Her costs to be in the wedding added up to over $1500 and she wouldn't put her foot down.",
          "id": 27,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 33,
      "content": "YTA.  Your reaction was assholey.  Context notwithstanding, and I'm at the point now where I feel like people who enable bridezillas are nearly half as bad as the bridezillas themselves.  You don't get to acquiesce to all her demands without objection, and then use them as an excuse to be an asshole to her at will at a random point later.",
      "id": 28,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 27,
      "content": "I gotta say, I don't understand weddings.  I don't get why people spend so much money on them, and I certainly don't get why people spend so much money on OTHER people's weddings.\n\nI'll give someone a reasonable wedding gift, but that's about where my celebration of your special day ends.",
      "id": 29,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 23,
      "content": "NTA- but you're an idiot for turning down a decent gig for a wedding.",
      "id": 30,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 21,
      "content": "NTA you never said you were buying her fast food meal. She assumed, and assumed wrong.",
      "id": 31,
      "comments": [
        {
          "score": 2,
          "content": "I get why she assumed, as they're coming off of a weekend where everyone probably paid for everything for her, even if it wasn't discussed beforehand, but still agree NTA.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}