{
  "post content": "Gonna keep this one brief.\n\nMe, I am a College Student, so I had a way of signing up for Peacock Premium for a reduced rate. I originally got it for the FNAF movie, but I have branched out. They also have La Brea, which is a mom and I show. Plus I have engaged in some of my guilty pleasures. \\[Trolls movie series\\]. That said, since FNAF holds a special place in my heart, the PFP I set for myself is Freddy Fazbear himself.\n\nEither way, this is not about that. You might be wondering why my Aunt has my Peacock Account. The answer is my Uncle.\n\nMy Dad, my Dad's Fiance \\[Maria\\], and I went to go visit my Grandparents, and turns out my Uncle Jerry was visiting from out of state. We visited on football night, so my grandfather, my dad, and Uncle Jerry were trying to watch the game. Bad news: whatever my Grandpa uses to get his channels on his TV failed.\n\nUncle Jerry said we could use Peacock to watch it, but since they don't have an account they'd need to pay for it. This is where I came in. I signed in on his ipad and they watched it a bit on there, but then they wanted to scale up so I signed in on my Grandparents' Firestick. Simple as that. They enjoyed the game and then soon we left for home.\n\nA few days pass and I don't hear anything, but then I get a text from my Aunt Melinda \\[Jerry's Wife\\] saying \"You need to change the picture on your peacock account. It's too scary for me and the kids.\"\n\nUncle Jerry has two sons, and they're 10 and 7 respectively. They're also very much of the Christian Faith, so I bring that up because their household is not conducive to horror. However, Freddy holds a dear place in my heart for many reasons that I won't outline here. \n\nI told Aunt Melinda that I didn't want to and she said that I still need to. I then told her \"If you don't want to see Freddy every time you open Peacock, get your own account.\" and stopped responding. Aunt Melinda isn't a particularly vindictive person, so I think that's why she didn't respond directly to me after that.\n\nLater on, I got a call from Dad asking what happened, and I had to explain. He wasn't *mad* per se, but wasn't exactly proud.\n\nHere's everyone's position:\n\nAunt Melinda: Wants me to apologize and change my profile pic.\n\nUncle Jerry: Says I should consider doing it for Aunt Melinda and the boys.\n\nDad: Says that I have a point and that it's my prerogative, but says there will be an impact.\n\nMaria: Says that since I'm the one paying for the account, I have the final say. \n\nMom: Told me I wasn't in the wrong at all and I should change my password and sign out of all devices that aren't mine.\n\nI am mentally at a stalemate personally. Should I give this up? Should I just change it? Think it'll blow over?\n\nReddit: Am I the A-hole?",
  "id": 1,
  "comments": [
    {
      "score": 11531,
      "content": ">Mom: Told me I wasn't in the wrong at all and I should change my password and sign out of all devices that aren't mine.\n\nThis is the way. NTA",
      "id": 2,
      "comments": [
        {
          "score": 3121,
          "content": "Agreed. OP signed in for people to watch football. Game’s over now. I don’t recall OP giving their Aunt permission to mooch off of their account. Don’t like the profile picture? Don’t bite the hand that feeds you. It’s not their account!",
          "id": 3,
          "comments": [
            {
              "score": 1085,
              "content": "OP signed in so they could watch the Chiefs Dolphins game that was EXCLUSIVELY on Peacock. Which so pissed the NFL is pulling this shit. But anyway, the game is over, log out of all devices. \n\nNTA.",
              "id": 4,
              "comments": [
                {
                  "score": 179,
                  "content": "Chiefs literally do their spring training at our college every year and they wouldn't even broadcast it here!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 154,
                      "content": "SMH! I agree with OP's mum! She has the most sensible solution.  OP only intended for her uncle to watch the game, not for his freeloading Aunt to watch it and complain about his profile photo. OP just change your password and sign out all the other devices that isn't yours. NTA",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 56,
                  "content": "I was wondering why my mom was asking me if we had peacock. I told her we did and set it up for her on her phone so she could use it. Thats not cool.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Yup. We had to drive over and log my 85yo grandmother into our account. Ridiculous. She barely understand how her TV works and now they are forcing her to use different apps for everything. Sooooo many older people didnt believe they would make it app only and then scrambled when the game started or missed it entirely. \n\nI personally dont watch football and dont care about the games, but the people in my life treat it like air. They cant live without it. Feels bad watching them get more and more confused by technology. There should be a better way for elderly people to have the shows and such they want in an easy to use format.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I really hope people didn't pay to get peacock just to watch the game. I don't watch football but I believe if enough people paid for peacock just so they could watch a football game, then the NFL will choose to air all games on a paid streaming app and not publicly televise them. Which will be bullshit.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 10,
                      "content": "It was a playoff game with the reigning super bowl champs, everyone wanted to see it, so yeah a lot of people signed up. Which sucks because it was definitely a bullshit move.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 439,
              "content": "The audacity of the church people stealing Peacock and then trying to make you feel bad about your choices. 🙄",
              "id": 11,
              "comments": [
                {
                  "score": 194,
                  "content": "Audacious? Yes. Surprising? No. Because it is church people.  Hypocrisy breeds and thrives.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Gentle nudge: most people are hypocrites all the time, all are hypocrites some of the time. Nothing to do with church except religious hypocrisy has become easy to spot because we keep seeing the same patterns in that context",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "This is why im a jaded ex Christian 😭!!!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "I remember walking around L.A. approx 20 years ago and some random christian mother found it appropriate to chastise me (a 30+ y.o. man at the time) for wearing a Pikachu shirt for spreading misinformation about evolution. 🤣🥴.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I'm going to do this to the next person I see in Pokémon gear for shits and giggles. Thank you",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Looove this!  Beautifully, simply, and perfectly sarcastically stated!",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": " Amen.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "And OP is a a student! They are all mooching off a broke as student. That’s the real a’hole manoeuvre here.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yeah! Log her out! Log her out! Log her out!",
              "id": 20,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 335,
          "content": "Yeah, probably should follow mom’s advice.\n\nI’m more of an AH though, I would tell aunt Melinda that she should stop stealing your account to watch peacock, it’s not very religious or Christian of her, and that Freddy is there to scare her and her monster kids away from thieving from your account.",
          "id": 21,
          "comments": [
            {
              "score": 52,
              "content": "Exactly. It’s very unreligious (is that even a word?) to steal.",
              "id": 22,
              "comments": [
                {
                  "score": 70,
                  "content": "I only use magnets on my car, never things that stick on.  I had never lost a magnet.  Then my Darwin fish vanished very soon after I put it on.  I wondered whether the person who stole it thought that they had saved me, or realized that they had just confirmed my opinion that religion doesn't make people better.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I had that happen several times. Eventually I thought someone should make a Darwin fish that has ***#7 Thou shalt not steal*** as a caption on the bottom.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "[Jesus Fish Puddy](https://fb.watch/pFHreIlYY1/?mibextid=2JQ9oc)",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Irreligious",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": " My mom would say my entire lifestyle is evidence that unreligious is a word.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I agree with your mom, but fully support your lifestyle.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Irreligious",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Irreligious",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Irreligious ☺️",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "irreligious",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "NTA.  If it was me I’d just go ahead and change the picture to something worse!!  Maybe a devil or something.  \n\nBut I would suggest he goes with his mom’s advice.",
              "id": 33,
              "comments": [
                {
                  "score": 5,
                  "content": "The Satanic Temple emblem",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You!!! I **like** you!",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It would be fun to set up an account for Melinda and fill it with the filthiest things that you can even find on Peacock.",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "> Freddy is there to scare her and her monster kids away from thieving from your account.\n\nLOL, I hope OP does this. \"Stealing is a sin. Freddy is warning you and your kids away from sinning. If I change the picture you all might go to hell. I'm TRYING to save all of you.\"",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "🏆💯",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 227,
          "content": "I agree with mom!!!",
          "id": 39,
          "comments": [
            {
              "score": 102,
              "content": "The only reasonable response when people try to dictate things like this.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "100%!",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 207,
          "content": "\"Stealing is a sin and I just realized that Peacock considers it stealing if I share my login information with someone outside of my household. So I signed you out.\"",
          "id": 42,
          "comments": [
            {
              "score": 8,
              "content": "This!!\n\n\n\n\nLMAO",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "mom knows best",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "Mom for the win",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "This is the way.  NTA",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Mom is correct.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "And tell the aunt that you changed the picture after all!",
          "id": 48,
          "comments": [
            {
              "score": 53,
              "content": "Change the picture, wait a day, and then sign out of all accounts. Claim it was a reset error or something. Ooops.",
              "id": 49,
              "comments": [
                {
                  "score": 18,
                  "content": "Or that you decided to cancel the subscription",
                  "id": 50,
                  "comments": [
                    {
                      "score": 5,
                      "content": "No. Too easy to verify that OP still had the account.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I had a login error and then had to reset the password. Sorry.",
                  "id": 52,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Is there a picture that Auntie M will find more objectionable than Freddie?  hehehe",
              "id": 53,
              "comments": [
                {
                  "score": 15,
                  "content": "Satan",
                  "id": 54,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Picture ideas: huge dick, middle finger, boobs, “screw you”",
                  "id": 55,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I’m pretty sure Peacock doesn’t have that as an option.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "While the Aunt definitely deserves all that, keep in mind two small children apparently see it too",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Mother knows best",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2739,
      "content": "NTA. I’m with your mom here, sign out of all devices and the problem is solved. If they’re so christian about it, let them login into jesus’s peacock account. amen.",
      "id": 59,
      "comments": [
        {
          "score": 539,
          "content": "Well they weren’t *that* kind of Christian. I brought it up because Christian beliefs and horror tend to not mix.",
          "id": 60,
          "comments": [
            {
              "score": 583,
              "content": "that part was just a joke, brother. they could be good old atheists with nightmares and I’d still log them out",
              "id": 61,
              "comments": [
                {
                  "score": 227,
                  "content": "Ah. Sorry, I’m not the most receptive. It was interesting tho.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 102,
                      "content": "...perceptive...?",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Tell Auntie Mel there's a great kid's movie called \"Benny Loves You.\" Then take Mom's advice. ",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "🤣🤣🤣I’m sending this to my atheist brother. He’ll get a good laugh out of it.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "I am SUPER Catholic.. like two masses a week, the one up front giving the wafer, archdiocese council sitting Catholic.  I love horror movies.  Believing in a higher power and letting it guide to serve your community does not mean depriving you of things you have a connection to.  \n\nYour mom is smart.  Your aunt and uncle still see you as a child they can still scold.  Gaining autonomy isn’t easy even under the best of circumstances with some family members. Don’t feel bad if this is how you gain it.  NTA.",
              "id": 66,
              "comments": [
                {
                  "score": 18,
                  "content": "Yup that’s why I clearly told my family I am my mother’s child, but I am not a child I will do what I want.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "To be fair, there's a lot of horror in Catholicism though lol",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Thou shalt not steal is pretty hard to debate your way out of for *any* type of Christian. Your aunt and uncle did not ask to use your service, they just took it.  Smite them!",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Don’t kid yourself. The Bible has plenty of horror.  FFS the main plot point is nailing a man to a cross and watching him bleed out.  \nAs a mom and grandma, I personally really do not like horror but FR, your account, your avatar. Aunt Melinda needs to unclench those butt cheeks or get her own account.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "thats hilarious considering its freddy fazbear, created by a hardcore christian lmao",
              "id": 71,
              "comments": [
                {
                  "score": 3,
                  "content": "Oh I thought it was Freddy Kruger",
                  "id": 72,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Well considering OP named the movie in the post, I would be very shocked if I missed a scene in the FNaF movie where Freddy Fazbear and Freddy Kruger become besties",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "People who complain for getting shit for free are the worst. Sign them out.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Try telling them that their continued use is actually theft since they aren’t the subscribers.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Have you seen the new Ted TV show?? Omg it is so funny had me cracking up at some parts",
              "id": 76,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "100%",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Lolol! Jesus account.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I would go so far as to tell them I have changed the profile picture- you just have to hit log out for it to update. Let them realize their mistake.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "i hear his profile pic is pretty gory though, and his watch list has a lot of \"blood of, body of\" stuff.\n\nand i can't get past the roman empire obsession.",
          "id": 80,
          "comments": [
            {
              "score": 2,
              "content": "if they’re uncomfortable with that, logging out solves the issue. they can just close their eyes and step away from the ipad",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1041,
      "content": ">Gonna keep this one brief.\n\nMission failed.\n\n&#x200B;\n\nNTA. I prefer your mom's approach, but if you want to let them keep access, that's fine too. Definitely don't change your picture at this point, it's now a matter of principle. They don't get to mooch off you without asking *and* then demand you make accommodations for them.",
      "id": 82,
      "comments": [
        {
          "score": 289,
          "content": "Ah. In the future I’ll need to make friends with brevity.\n\nStill, I see your point.",
          "id": 83,
          "comments": [
            {
              "score": 134,
              "content": "I don't think OP starter posts on AITA should be brief. A lot of the time whenever there's a very brief starter post, redditors will end up asking a lot of questions and an OP may have to answer the same question like 5 times. You had a good sized starter post that shed light on everything. \n\nYou are NTA. They can either ignore your avatar and still get access to the streaming service for free (a real steal!), or they can pay for their own subscription - it's only 6 USD per month. It's up to aunt, uncle and kids to decide if saving on 6 USD is more important than not seeing scary pictures.\n\nI'd give them 3 days to decide on their choice. If they still want you to change the picture, you should follow your mom's advice.",
              "id": 84,
              "comments": [
                {
                  "score": 0,
                  "content": "My only disagreement with your first point is that the first paragraph with them justifying why they paid for peacock felt rather useless and was frustrating because of the acronyms I don’t know. If you’re going to include niche acronyms, at least define them. Or better yet, realize you don’t need to justify paying for a streaming platform lol.\n\nThat said, this is a very minor compliant and I prefer more detail as to less. The subreddit already has a post size limit — if you are not over that (which you literally can’t be) you are fine length wise.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Beggars can’t be choosers, if you will.",
              "id": 86,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I don't believe he had an issue with the detail in your post. Merely pointing out the first thing you said was let me keep this short and then played a 7 minute guitar solo 😂",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "THIS!\nNTA - obviously, but to keep the peace I would friendly remind them that after all this is your account and it was initially only to watch one game, but you have courteously ignored that they have continued to use it.\nBut if they want to pose demands, you will end this courtesy of yours.\nTheir choice.\nThey quietly use it, no problem.\nThey put up demands: Get your own account!",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Haha I thought the same thing 😂 brief? Where?",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "not necessary to bring up the brevity of the post.",
          "id": 90,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 439,
      "content": "NTA...They need to do the Christian thing and pay for their own account. ",
      "id": 91,
      "comments": [
        {
          "score": 118,
          "content": "Isn’t it a sin to steal?",
          "id": 92,
          "comments": [
            {
              "score": 38,
              "content": "Yeah but sins only apply to non-christians, jesus forgives them no matter what they do",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "Heck, if they wanted to do the *really* Christian thing, they'd also pay for an extra account for a less-fortunate family.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 327,
      "content": "NTA - you are paying for the account.  Sign out, change the password and Auntie and niblings won't have to be traumatized by a pic of \"Freddy Fazbear\".  Problem solved.",
      "id": 95,
      "comments": [
        {
          "score": 66,
          "content": "I just Googled the bear in question. Am I missing something, because it doesn't look horrifying. I was expecting fangs or something after all this fuss.",
          "id": 96,
          "comments": [
            {
              "score": 45,
              "content": "It's basically horror for kids consisting mainly of jump scares. There are episodes of Courage the Cowardly Dog scarier than some of the FNAF games. ",
              "id": 97,
              "comments": [
                {
                  "score": 9,
                  "content": "Courage got dark sometimes fr. A few episodes left me permanently disturbed.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 8,
                      "content": "SERIOUSLY! That was not a kids show. Everything about that show was earie AF.\n\n&#x200B;\n\nRAMSEEEEEESSS!.........",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "It’s not scary at all unless you’re actually playing it",
              "id": 100,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Check out spring trap freddy",
              "id": 101,
              "comments": [
                {
                  "score": 16,
                  "content": "Okay, yeah, definitely creepier. Still, OP's definitely NTA. Even if their profile picture was a bag of dicks they'd be NTA; nobody's forcing auntie to use his account.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Agreed lol, auntie is a piece of work for sure. I couldn’t imagine being allowed to use someone’s PAID streaming service and continuing to use it, let alone have the gall to complains about it",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "The only scary Freddy is Nightmare Freddy, but Nightmare Freddy wasn’t even in the FNAF movie… So it would only be the original Freddy - that isn’t even remotely scary looking 💀",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 247,
      "content": "NTA\n\n> I then told her \"If you don't want to see Freddy every time you open Peacock, get your own account.\" and stopped responding. \n\nFucking a.",
      "id": 105,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": "NTA but wow, family drama! You are giving Aunt Melinda and Uncle Jerry free access to Peacock. If they don't want FNAF avatar grinning gruesomely at them, they need to buy their own account. Technically, because they are using your account, they are stealing. Peacock would prefer they pay for their own account and not ride on yours. It's why Netflix stopped allowing sharing. Good luck!",
      "id": 106,
      "comments": [
        {
          "score": 30,
          "content": "Good point, OP would be doing them a favor by putting a stop to this living in sin",
          "id": 107,
          "comments": [
            {
              "score": 3,
              "content": "They’re watching entertainment in sin.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 97,
      "content": "NTA\n\nMom's right. Log out all devices and change your password. Not only are they wrong for criticizing you for something you let them use, you risk losing your discounted service. Read your terms and services. You may be ok sharing, you may not be.",
      "id": 109,
      "comments": [
        {
          "score": 17,
          "content": "Yes, the violation of the Terms of Agreement is one thing I wanted to mention.\n\nIf you wanted snark you could say you prayed abt it and realized you were essentially lying by violating your TOA. you felt so guilty you HAD to change it.\n\nBut honestly, I'd just change and be done.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 70,
      "content": "Who pays for Peacock monthly? You are genuinely the first person I ever hear does that.\n\nNTA. This is an argument that babies would have.",
      "id": 111,
      "comments": [
        {
          "score": 152,
          "content": "I don’t. I got the student rate and I paid 2 bucks for the whole year.",
          "id": 112,
          "comments": [
            {
              "score": 92,
              "content": "I was going to comment exactly what your mom said tbh. I like your mom.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "While you’re on Peacock:  watch “Mrs Davis”. One of the best and one of the weirdest shows I watched last year!",
              "id": 114,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Whoo!  Good deal!",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -67,
              "content": "You get what you pay for I guess.",
              "id": 116,
              "comments": [
                {
                  "score": 29,
                  "content": "I was fine with it. Cost less than a movie ticket and I get a lot more stuff to go with it.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "This is such a nonsensical thing to say in this situation",
                  "id": 118,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "I pay for it monthly because being poor is expensive. I can scrape up $7 a month. I can't come off of whatever a yearly membership costs all at once a still pay my bills. \n\nHonestly this is the last month I'm paying for peacock because I have to prioritize. In 6 months or so I'll turn off Hulu or disney+ and go back to peacock for a while.",
          "id": 119,
          "comments": [
            {
              "score": 2,
              "content": "I also rotate my streaming services.  Netflix is the one i rotate in the least because I think its overpriced.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -7,
              "content": "Peacock is $50/year which comes to a titch over $4/month (with ads). At $7/month, you're paying $84/year.",
              "id": 121,
              "comments": [
                {
                  "score": 13,
                  "content": "Thank you, but peacock is $60 a year as of me just checking an hour ago. And with all respect, I'm perfectly capable of doing the math. I just don't have $60 to dedicate to a streaming service all at once. \n\nAnd at $60 a year the savings is only $14. Again, if I could do it I would but I have much better uses for $60.\n\nAlso I lose interest in streaming services over time and like to alternate.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I love when people insist on not believing what you tell them about your financial situation.",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "FYI, as a fellow penny-pincher, subscribe to Hulu during its Black Friday sale. 2023-2024 year is 99 cents/mo. Year before was $1.99/mo. Previous year was 99 cents. Switch between 2 emails because Hulu requires 1 year between re-subscribing on previous accounts. This is my 3d year at this affordable rate. ",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes, it's expensive to be poor.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "I'm happy to pay the $10 a month for Peacock! I begrudgingly pay the $80 or w/e it is for the \"no adds\" Hulu that is chalked full of adds. Unfortunately Hulu is just too hard to replace. Hoping Peacock can fill the roll someday but I'm sure they will raise their rates just as much.\n\n\nAlso pay for Netflix and additional subscriptions on Prime... and we still never have anything we want to watch.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I feel like this is an ad",
          "id": 127,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Is there another way? ",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Hahaha I do too! 🙈 haha I though I was alone in the world.. thanks OP for being the second subscriber 😅",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Black Friday Deal was good",
          "id": 130,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I'll be honest I only have peacock myself because it came free with my instacart subscription",
          "id": 131,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I got the reduced Xfinity rate but I keep it, they have a bunch of good original stuff and lots of archive",
          "id": 132,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 54,
      "content": "NTA-   the exact correct response. You pay for this service and kindly allow them to use it. \n\nInfo- Did you ever intend on them using it ongoing? It doesn’t seem that way from your post. \n\nI agree with your mom. And if your aunt wants to have a fit about it, that’s her problem. It’s also not very Christian of her to hold a grudge over something as trivial as a streaming service. Maybe you should mention that the good, Christian thing to do is totally remove the platform from the reaches of your impressionable little cousins. Heaven forbid they see something that is violent or breeds temptation in them. You could never live with yourself for leading the little lambs astray. Change the password and sign out.",
      "id": 133,
      "comments": [
        {
          "score": 36,
          "content": "I personally hope that this blows over. Though indeed, a lot of people are team Mom.",
          "id": 134,
          "comments": [
            {
              "score": 85,
              "content": "Because she’s correct. This is your aunt exerting control where she has none. They are being gifted access to a free streaming service out of the kindness of your heart. You need to stand your ground now or she’s going to walk all over you the rest of your adult life.",
              "id": 135,
              "comments": [
                {
                  "score": 11,
                  "content": "My plan is that for this to blow over and things to go back to normal. My Grandad on my Dad’s side is the only remotely spiteful person and even then he has mellowed out over the years. I personally think it will since Aunt Melinda is normally very sweet and kind so I think things will blow over.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Whatever you do, do not change your image. Make sure to set your account as the master account so they can’t go in and change it on you. I think you can password protect the master account on Peacock. I think I looked at that when a friend used my account.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Ah yes the tried and true Ostrich method of sticking your head in the sand and hoping it just goes away.",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Your mom's not wrong... Here's a compromise. Don't respond and don't  change anything but, let them keep using the account. If you see any changes to your profile picture, log out of all devices and change your password. Don't give anyone a heads up.\n\n\nIf anyone asks why they don't have access, \"Peacock kicked everyone off because under my college plan I am only allowed one access point\". Or plead ignorance, \"I don't know anything\".",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This may blow over.  But if your approach is to just let things blow over,  you're going to be waiting on the wind a lot of your life, and often when you are doing favors.    Dealing with things forthrightly is a great practice to get into.  You don't have to be rude,  but you are allowed to be decisive and firm in protecting your boundaries.   She complained to your dad.  That says she's willing to stir up the family and indeed,  seemingly everyone has an opinion,  though they are generally supporting you.  \n\nI would think that letting it blow over is fine,  but as it stands,  you are likely violating the terms of service by sharing with them.  You are putting your account at risk for people who are using the account beyond your intentions and trying to control it.   I think your mom is right.   Your dad is worried about the social cost of whatever you do,  but the fact is,  you're going to bear a social cost no matter what you do here.   Your aunt will keep nagging you to change it and will try to save your soul from your evil avatar, or she'll be upset with you for taking away access to shows.  No matter what you do,  you're wrong to her.  \n\nI'd log them out, not punitively, but because the risk is not worth the hassle you're getting.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "If you want a way out that saves face and isn’t as direct… you could log out and when they question just say your free trial ended. Or your discount ended. Or you decided to cancel it because you didn’t like the shows.\n\nI know it’s not as direct as everyone else is suggesting but it seems like you do want to keep the peace with the wider fam. \n\nThis way you get the same result, they’ll know it’s because they said something, but they can’t argue that you haven’t cancelled it and demand it. They’ll just accept it and learn their lesson to not look a gift horse in the mouth.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Did you even agree to let them keep using your account?",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Maria has the best plan for everyone. But Mom gets that may not work.\n\nI mean, if they don't like it, they can simply not use your account as they did before.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If I didn't want to make waves I would point out the account sharing can get your account terminated and use that as the reason to drop their access to your login. Heck I would just do it anyway just to play it safe. They now know they like it so they can decide if it's worth spending the money on or not now.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I say screw her and you need to change your password. If she brings up the bullshit christian thing tell her it's not christian to cheat either but that's what she's doing by not paying for her own. That should shut her up for a while.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}