{
  "post content": "Hello reddit, first time poster here. I need some advice on something. \n             ( Background) I moved to southern Georgia (USA) when I was about 8. Upon moving here I went to church every Sunday and quickly adopted a set of grand parents. Now Grandma had a rough country upbringing in south Georgia and Florida. She was a farm girl, rarely went to town and eventually got her education and became a teacher. Grandpa however was a northern boy who drove (first race cars, then trucks). Now they have been together for 33 years. Grandma is 86 and grandpa is just a bit younger. When grandpa was young (13-15) he hit a clothesline while riding his bike, this destroyed his thyroid, possibly causing development issues. Well now he has undiagnosed dementia and can't remember things, as well as being deaf (has hearing aids but still can't hear properly). So he has a sore on his foot that hasn't healed for over a year, he is trying to lose weight and keeps his diabetes in check but he still isn't the healthiest. He recently got the sore cleaned out but they put a wound vac on, and he spent that night and the next morning taking it apart to figure it out. Grandma has had a heart valve repair surgery, and is scheduled for a cornea transplant surgery, her body stopped producing insulin and she gained a little weight, so she has been self conscious and insecure for the last couple year's. Now Grandpa has gotten a lot worse and doesn't realize what he says is a bit offensive ( or very), and has started saying things like \"I'm determined to weigh less than her.\" Or \"It was fine before she got her internet setup.\" ( His computer quit working, it just wasn't plugged in).Well it came to a head today and grandma told grandpa to figure out what he needs to move on, so he \"doesn't have to bother\" with her. With all of the surgeries,  stress, and fear, I just want them to be okay. Now I have started working for them as a caregiver, but I'm not under any contract or non-disclosure agreement (verbal, moral, or written) I love them both but grandpa can't understand why she is so upset. I really don't think I should get involved but they are both scared. So here is where I might be an a**hole. I tried to explain to grandpa that grandma is scared and insecure and that maybe some of the things he has said in the past year may have triggered her. I'm worried I should have kept my mouth shut.\n       So what do I do, Am I the a**hole",
  "id": 1,
  "comments": [
    {
      "score": 8,
      "content": ">he has undiagnosed dementia and can't remember things  \n>  \n>Grandpa has gotten a lot worse and doesn't realize what he says is a bit offensive ( or very)  \n>  \n>grandma told grandpa to figure out what he needs to move on, so he \"doesn't have to bother\" with her  \n>  \n>I love them both but grandpa can't understand why she is so upset\n\nThis feels like a situation for a professional social worker. Dementia destroys relationships; it destroys lives. Your grandma is dealing with both her own health problems and trying to deal with the drastic changes affecting the love of her life. Your grandpa is trying to hold onto whatever he can, and that manifests in a lot of different ways. It's clear that you love your family very much - the compassion you have for both grandparents is evident in every word of your post - but this is a very complicated situation, and I don't think there are any clear answers. NAH, and please look into getting some help: you don't have to go through this alone.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "I agree completely",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH.  The trouble is, you can't explain to someone with dementia why what they're saying is hurtful.  They're not capable of understanding, at least not for any significant length of time.  So if you're not going to be able to deflect Grandpa's comments with that in mind and focus on supporting Grandma through the slow and painful process of losing her husband as she knows him, it may be time to start looking into trained caretaker options or otherwise revisiting this arrangement.",
      "id": 4,
      "comments": [
        {
          "score": 1,
          "content": "I'm thinking about talking with them about it because I don't have the know-how to give the care they need at this point.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "[deleted]",
      "id": 6,
      "comments": [
        {
          "score": 1,
          "content": "Thank you",
          "id": 7,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NAH. You’re not an asshole for expressing your concerns to your grandfather. If he has dementia, it’s likely that he really isn’t meaning to say offensive things and no longer has the capacity to understand why what he is saying is offensive. Have you considered looking into resources such as support groups for spouses who are dealing with dementia?",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "This is what I'm fretting over, and yeah I just don't know how to bring it up to her/them.",
          "id": 9,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This! My mil has alzheimer's. Lost any kind of filter and said the most horrible things to my fil.it was rough,even understanding she couldn't help herself didnt lessen the hurt.we are lucky to be a big family that could take turns to 'mind' .her so he could take a break . You have to start fighting now for carers or some kind of relief or it will be soo much harder as he gets worse.(the body shuts down slowly too,not just the mind). Do what you can to bolster granny's confidence. A haircut,nails done etc day out or something. And most importantly take care of yourself. You'll be no good burned out. Good luck op.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHello reddit, first time poster here. I need some advice on something. \n             ( Background) I moved to southern Georgia (USA) when I was about 8. Upon moving here I went to church every Sunday and quickly adopted a set of grand parents. Now Grandma had a rough country upbringing in south Georgia and Florida. She was a farm girl, rarely went to town and eventually got her education and became a teacher. Grandpa however was a northern boy who drove (first race cars, then trucks). Now they have been together for 33 years. Grandma is 86 and grandpa is just a bit younger. When grandpa was young (13-15) he hit a clothesline while riding his bike, this destroyed his thyroid, possibly causing development issues. Well now he has undiagnosed dementia and can't remember things, as well as being deaf (has hearing aids but still can't hear properly). So he has a sore on his foot that hasn't healed for over a year, he is trying to lose weight and keeps his diabetes in check but he still isn't the healthiest. He recently got the sore cleaned out but they put a wound vac on, and he spent that night and the next morning taking it apart to figure it out. Grandma has had a heart valve repair surgery, and is scheduled for a cornea transplant surgery, her body stopped producing insulin and she gained a little weight, so she has been self conscious and insecure for the last couple year's. Now Grandpa has gotten a lot worse and doesn't realize what he says is a bit offensive ( or very), and has started saying things like \"I'm determined to weigh less than her.\" Or \"It was fine before she got her internet setup.\" ( His computer quit working, it just wasn't plugged in).Well it came to a head today and grandma told grandpa to figure out what he needs to move on, so he \"doesn't have to bother\" with her. With all of the surgeries,  stress, and fear, I just want them to be okay. Now I have started working for them as a caregiver, but I'm not under any contract or non-disclosure agreement (verbal, moral, or written) I love them both but grandpa can't understand why she is so upset. I really don't think I should get involved but they are both scared. So here is where I might be an a**hole. I tried to explain to grandpa that grandma is scared and insecure and that maybe some of the things he has said in the past year may have triggered her. I'm worried I should have kept my mouth shut.\n       So what do I do, Am I the a**hole\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    }
  ]
}