{
  "post content": "UPDATE:\nThe wedding was on Oct 9th and it was beyond amazing and everything my wife and I hoped for. After the honeymoon, I started reaching out to close friend again to see if we could talk. I found out quickly I was still blocked on social media, and my number was blocked as well. I spoke to a few mutual friends for help and after contacting him, they were told he wants nothing to do with me. Just last week, I sent him 2 shirts he ordered from my website along with a handwritten note explaining if he ever wanted to get in contact with me, my number is still always open and I have and won’t block him just in case. This was delivered last Tuesday, 11/30, with no reply or reach out. My mutual friends who helped me previously are now shadowbanned and blocked as well. Not really the update I was hoping to post but that’s life. Thanks to everyone for their input and ideas and suggestions.\n\nMy fiancé and I get married this upcoming October. When I proposed last September, we had picked a really close friend of ours, who I thought of as my brother, to ordain us. He has a history of public/motivational speaking, plus he’s seen our relationship grow from the early stages till now (~6 years). It was a no brainer for us. Cut to this past Saturday, we’re talking about the wedding in our group chat and he mentions he will be taking a micro dose of Acid to “get his head in the right mind space” before the ceremony. I subtly said that my fiancé and I didn’t think that would be the best decision. He rebuttals with the statement that he has crippling social anxiety and won’t be able to do the ceremony and talk to our guests unless under the influence of something. Again I state that we would respectfully ask him to refrain from doing anything before the ceremony. I told him after the ceremony, he’s free to do whatever he wants. He continues to make excuses on why he needs it. I essentially tell him to suck it up or if it’s too much we can find another officiant no sweat no fuss. He then blocks me on everything and sends a text stating he can’t associate with people who twists his intentions and good luck in life. He blocked my number so I couldn’t even respond or call. AITA for wanting our ordainer and best friend to be sober during our big moment?",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I may be the asshole for disregarding his wishes and wanting a simple request to be followed for our wedding day.\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Holy cow, the number of NTA votes who clearly don’t understand the difference between a micro dose and a full on trip is a little concerning.",
      "id": 3,
      "comments": [
        {
          "score": 1,
          "content": "read her comments, his micro doses arent really micro doses",
          "id": 4,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YTA. If it's micro-dosing then it's similar to telling someone they can't take their antidepressants or anti anxiety meds at your wedding.",
      "id": 5,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "ESH. If he has a history of being a public speaker, perhaps you should trust whatever his process is. Microdosing isn’t the same as taking a bunch of something. If he’s a really close friend I’m surprised you wouldn’t know about either his microdosing OR social anxiety before asking him to do this. I simply can’t personally imagine ANY of my friends asking me to officiate a wedding without expecting I would smoke weed beforehand. \n\nAt the end of the day this is your wedding and you’re allowed to require whatever you want from folks attending, but I can also taste the judgmental vibes from here. I get why he went nuclear block option, but he’s also definitely an AH for that. Dude is suppose to be one of your best friends so maybe take a breath and try to have a conversation with him about why he finds it so helpful and what the results tend to be and how that could affect the wedding.",
      "id": 6,
      "comments": [
        {
          "score": 1,
          "content": "Thanks for your outlook on this situation. We would smoke heavy together so weed I have no issue with. How he’s engaged and acted while on acid and other psychoactive’s is what lead to my fiancé and I asking him to refrain from acid at least. He’s had more than a few bad trips when we’ve taken shrooms or acid together. He’s only recently been taking acid daily for the past 3 weeks. I’ve been trying to get in contact with him to speak on the issue but as you stated, he went nuclear bomb option.",
          "id": 7,
          "comments": [
            {
              "score": 1,
              "content": "Tripping and microdosing are not the same. Microdosing has medical benefits without the hallucinations or weirdness that comes with an actual acid trip. Microdosing is taking a very small amount, not enough to actually affect you the way taking a whole dose would, but enough to help with creative thinking, mental disorders, etc. \n\nIt's your wedding, so you do what feels best, but I don't think anyone is the asshole here.",
              "id": 8,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Is he microdosing or taking it to trip?",
              "id": 9,
              "comments": [
                {
                  "score": 1,
                  "content": "His micro doses end up turning into full blown trips, one of our many points of contention when he’s supposed to be DD or a trip sitter",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Then NTA, i hope you guys can find a solution!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "> His micro doses end up turning into full blown trips\n\nThat's the most relevant information here OP.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I'm going to go out on a limb and say anyone who describes taking their \"anti-depressant\" as getting their \"head in the right mind space” is tripping.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 1,
                      "content": "That’s a pretty weak limb you’re on, be careful!",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Have you done any research on microdosing, it's benefits, and affect on mental health? Because it doesnt sound like it.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "YTA for telling someone they can't take their anti anxiety meds before speaking in a public situation. He's not going on a damn vision quest during your wedding.",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "Then again your wedding your rules. \nI understand where you're coming from after reading your comments. Especially considering how you guys used to party. \nI think I'm going to change to NAH.\nIf you think he isn't actually mature enough to do this medicinally the proper way it's not worth risking it.\nIt does sound like you know this person and what you expect out of them.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "YTA.",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHere’s the context:\nMy fiancé and I get married this upcoming October. When I proposed last September, we had picked a really close friend of ours, who I thought of as my brother, to ordain us. He has a history of public/motivational speaking, plus he’s seen our relationship grow from the early stages till now (~6 years). It was a no brainer for us. Cut to this past Saturday, we’re talking about the wedding in our group chat and he mentions he will be taking a micro dose of Acid to “get his head in the right mind space” before the ceremony. I subtly said that my fiancé and I didn’t think that would be the best decision. He rebuttals with the statement that he has crippling social anxiety and won’t be able to do the ceremony and talk to our guests unless under the influence of something. Again I state that we would respectfully ask him to refrain from doing anything before the ceremony. I told him after the ceremony, he’s free to do whatever he wants. He continues to make excuses on why he needs it. I essentially tell him to suck it up or if it’s too much we can find another officiant no sweat no fuss. He then blocks me on everything and sends a text stating he can’t associate with people who twists his intentions and good luck in life. He blocked my number so I couldn’t even respond or call. AITA for wanting our ordainer and best friend to be sober during our big moment?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "If he can do it then what’s the problem?",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. He should have cleared it with you up front, but it sounds like microdosing is a big part of this guy's \"history of public/motivational speaking\" if he needs it so bad. You are not the assholes for wanting him to be sober but it sounds like you lost a friend by being inflexible.",
      "id": 22,
      "comments": [],
      "relation": "No"
    }
  ]
}