{
  "post content": "So here’s a little backstory. My mom has always been an amazing mother. She has always taken care of me and my siblings and done pretty much everything for us. Ever since she divorced my father, she started using her days off work (this is usually her only free time) to take us out and do literally anything. This could be going to the store, playing mini golf of bowling, or anything that isn’t just staying indoors. At first, me and my siblings had no other option as we were fairly young, around 13 years old, but now that I’m 19 and in college I don’t feel like going out with her anymore. I have nothing against her, I would just rather stay at home and keep doing my own thing. Today, after she asked me to go out and “do something” I rejected her offer and later saw her crying. I asked her why to which she responded, “I spend 9-10 hours working almost everyday just so that I can finally maybe go out with you guys, but you guys don’t seem to care.” I can’t help but feel like an a-hole for not wanting to go out with her, but I really would just rather stay at home since we’ve been going out and doing random things for as long as I remember. So AITA?\n\nSorry if I messed anything up, this is my first time using reddit so I’m not sure how everything works.",
  "id": 1,
  "comments": [
    {
      "score": 8,
      "content": "NAH. Your mom loves you and enjoys her children. You love your mom. Maybe just say, \"mom, let's stay ina and watch a movie.\" or \"mom, let's stay in and bake cookies.\" or \"let's just chill and play games.\" you dont HAVE to go out every day off that she has... and as you get older, you do sometimes want to do other things with friends. maybe say, \"lets do something every other week as I have x, y or z planned.\"  just let her know you love her and communicate how you feel.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. This is natural for you to increasingly seek independence. You don’t have to feel guilty. Go out occasionally with them still but it’s okay and normal for you to seek out your own life. \n\nThis transition might be tough for your mom, but she’s going to have to start seeking out some social interactions of her own soon as her kids fly the coop.\n\nYou sound like a good kid.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA--Spending less time with her is to be expected as you get older but it sounds like she is taking it personally. Let her know you still love her, invite her to watch a movie or just hang out at home. Tell her that now that you're getting older, she shouldn't feel obligated to entertain you on her days off and to take some time for herself.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo here’s a little backstory. My mom has always been an amazing mother. She has always taken care of me and my siblings and done pretty much everything for us. Ever since she divorced my father, she started using her days off work (this is usually her only free time) to take us out and do literally anything. This could be going to the store, playing mini golf of bowling, or anything that isn’t just staying indoors. At first, me and my siblings had no other option as we were fairly young, around 13 years old, but now that I’m 19 and in college I don’t feel like going out with her anymore. I have nothing against her, I would just rather stay at home and keep doing my own thing. Today, after she asked me to go out and “do something” I rejected her offer and later saw her crying. I asked her why to which she responded, “I spend 9-10 hours working almost everyday just so that I can finally maybe go out with you guys, but you guys don’t seem to care.” I can’t help but feel like an a-hole for not wanting to go out with her, but I really would just rather stay at home since we’ve been going out and doing random things for as long as I remember. So AITA?\n\nSorry if I messed anything up, this is my first time using reddit so I’m not sure how everything works.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA, you're an adult now. If you want to see your mother than do it. If you really want to not see her than that's your choice. In my opinion a poor choice.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "INFO: how often does this happen? If it’s only a few times per month, I think you should spend time with your mom.",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "It’s every week on the days she has off.",
          "id": 9,
          "comments": [
            {
              "score": 2,
              "content": "Then I don’t think you need to say yes every time.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Maybe set a twice a month \"date?\" I regret I didn't spend more time with my mom because I thought I would have more time, but didn't.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "And she needs her own friends. On Craigslist, there are friend groups, some with special interests, that do things together.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH there's nothing wrong with staying home and having alone time, but it's clear that your mom loves you and really wants to continue having time with you. Maybe ask if you can cut down the outings to one or two a month instead?",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH you have no obligation to go out with your mother. It's also understandable how from her perspective that could really hurt.\n\nAs someone who is just a little bit older than you who started off in their career. As you get older the amount of time you will be able to spend with your mom is going to drastically decrease. I can definitely relate to your mindset of it not exactly being the most fun you can have that night. Spend time with your mother. From what you described she's a great mom and when you get older you will be really happy you spent that time with her.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA\n\nYour mom has some underlying issues she needs to deal with that go beyond this situation.\n\nYou’re an adult. You are entitled to spend your time how you want. You’re not a kid anymore. Your mom feeling hurt is pretty normal I think once kids start growing up and apart from their parents. \n\nShe loves you, make time for her so she knows you still love her too",
      "id": 15,
      "comments": [],
      "relation": "Support"
    }
  ]
}