{
  "post content": "For the past few months, I (18M) and my girlfriend (19F) have had more than a few rough moments relating to my inability to stay focused when talking to her. I'd like to preface that her and I are both neurodivergent; I have ADHD and she is autistic. We are also mainly an online relationship, but we've been going steady for almost a year and we've known each other for longer.\n\nI do not know when this really started, but it's something I struggle with, really, every day. I'll be messaging my girlfriend, us both focused on a topic or something we're both doing (that I potentially have to hold up my end of) and then I'll look over at something else. Maybe it's something I'm watching on TV, maybe it's a hole of browsing through Wikipedia, maybe it's checking Twitter. Whatever it is I get distracted with, I only intend to check it for a minute before getting to what I'm meant to do. But then I get lost in this thing, sometimes to the point of spacing out. One minute turns to ten turns to fifteen, and by then I panic and scramble back to message her.\n\nThere's also times when we have something going on, but for one reason or another I don't focus on it. I spend time focusing on chatting with her and seemingly ignoring the thing we're working on, I message a group chat we're both in... Either way, I unintentionally blow off things we're working on for stretches of time that I only meant to be for a few minutes or so. \n\nThere's more examples that I'll probably remember, but this is mainly what happens. Me stepping away from our conversation or things that we're working on because of a distraction that I... don't really want to be distracted by.\n\nThis has caused a lot of stress for my girlfriend. She has many commitments in her own life, be they taking care of her pets, going to college and dealing with that immense workload, and many many other things. And yet, she still makes time to talk to me, even when she hasn't got time for anything else she enjoys. You can imagine how upset it makes her to seem me always go silent or have my messages to her be punctuated by 10-15 minute gaps, gaps that I don't intend to create. \n\nI'm trying to work on this, but there always seem to be moments where it gets really bad and she reaches a breaking point. It's made me feel like such an a-hole for not nipping it in the bud immediately. Am I the asshole here?",
  "id": 1,
  "comments": [
    {
      "score": 3,
      "content": "NAH, you guys need to find ways to work around this.\n\nCould you call instead of messaging so that it's easier for her to get your attention back if you get distracted? Or maybe set a loud/noticeable message notification sound and tell your girlfriend she has your full consent to start blowing your phone up if you stop replying?",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA  - is she getting mad at you for a *fifteen minute* response time?\n\nYou both need to reevaluate reasonble response times to texts/chats. It's just fundamentally not the same as being in a face-to-face conversation. Fifteen minutes is not that long to wait for a text response in any circumstance, whether someone has ADHD or no. \n\nI'd say you need to agree on what is 'we are doing this together, online/on text, now' and commit to not looking at other stuff in that time. Maybe those sessions need to be on facetime or discord or zoom or something live so you don't get distracted from talking to her.\n\nIf you're just texting back and forth, it doesn't have to be immediate response, and you both need to agree that if it's that setting, 15 minutes isn't disrepecting or ignoring her.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH. If you're really trying to improve the situation and not just telling yourself you're trying and then settling back into the same habits you're on the right track.\n\nThat being said, it sounds like you and your girlfriend need to sit down and have some communication about your communication. I'm a bit older than you, but if I need an immediate response to something I'm not sending it over text. Ten to fifteen minutes to respond to a text message doesn't seem to be out of the realm of reasonability.\n\nIt might be a good idea to start setting aside times where you talk on the phone or video chat where you're setting aside time specifically to spend time talking to each other in a situation where you're less likely to be distracted.  \n\n\nEDIT: NAH is contingent on the idea that her being upset is attributable to her autism and that she is also willing to work on things from her end.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH but as someone with ADHD, let me say that eventually, that while your ADHD may be the REASON that you get distracted and don’t respond to something, but it’s not an EXCUSE. \n\nPersonally I either do things immediately, or set reminders. We live in a world of technology where seeing a reminder takes zero time. All it takes is to say “hey Siri, remind me in 3 minutes to text Jordan back.”",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor the past few months, I (18M) and my girlfriend (19F) have had more than a few rough moments relating to my inability to stay focused when talking to her. I'd like to preface that her and I are both neurodivergent; I have ADHD and she is autistic. We are also mainly an online relationship, but we've been going steady for almost a year and we've known each other for longer.\n\nI do not know when this really started, but it's something I struggle with, really, every day. I'll be messaging my girlfriend, us both focused on a topic or something we're both doing (that I potentially have to hold up my end of) and then I'll look over at something else. Maybe it's something I'm watching on TV, maybe it's a hole of browsing through Wikipedia, maybe it's checking Twitter. Whatever it is I get distracted with, I only intend to check it for a minute before getting to what I'm meant to do. But then I get lost in this thing, sometimes to the point of spacing out. One minute turns to ten turns to fifteen, and by then I panic and scramble back to message her.\n\nThere's also times when we have something going on, but for one reason or another I don't focus on it. I spend time focusing on chatting with her and seemingly ignoring the thing we're working on, I message a group chat we're both in... Either way, I unintentionally blow off things we're working on for stretches of time that I only meant to be for a few minutes or so. \n\nThere's more examples that I'll probably remember, but this is mainly what happens. Me stepping away from our conversation or things that we're working on because of a distraction that I... don't really want to be distracted by.\n\nThis has caused a lot of stress for my girlfriend. She has many commitments in her own life, be they taking care of her pets, going to college and dealing with that immense workload, and many many other things. And yet, she still makes time to talk to me, even when she hasn't got time for anything else she enjoys. You can imagine how upset it makes her to seem me always go silent or have my messages to her be punctuated by 10-15 minute gaps, gaps that I don't intend to create. \n\nI'm trying to work on this, but there always seem to be moments where it gets really bad and she reaches a breaking point. It's made me feel like such an a-hole for not nipping it in the bud immediately. Am I the asshole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) The action that I've taken that should be judged is my tendency to get distracted when speaking to my girlfriend.\n2) This may make me the asshole because it makes me look as though I'm not present. My girlfriend goes through so much on a day to day basis, so me vanishing makes her upset and I feel like an asshole for it.\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "I think we are busy/get distracted, 15 minutes wait time between text messages is not massive, I sometimes respond hours later and I understand when others do the same. If she wants to talk with you a video call might be better, then ye can talk away until nothing left to say.",
      "id": 8,
      "comments": [],
      "relation": "No"
    }
  ]
}