{
  "post content": "I am disabled, but I still try to work a minimum of 15 hours a week. Lately I have been working a ton more as a substitute to make up some of our savings back after both our cars decided to freak out. I won't explain the details of my disabilities as to not identify myself, but they are physical and mental in nature. \n\nMy disability matters in this context because my husband has an FMLA claim with his work to stay home with me when my disabilities are too much for just me to deal with, and to drive me to my doctor's appointments. He had to use all of his sick days from his job before it dipped into his vacation and now we aren't being paid when he takes time off. \n\nSo now we get into what happened this morning.\nHe wakes up 3 hours before I have to get up for work and he has 3 alarms every morning, because he sucks at waking up. After the last alarm he lays down for 5 or so more minutes, and I get a little pissed and ask him if he is getting up or not. He tells me he isn't feeling good, and he is nauseous...\n\n\nSo I get a little more mad since once a week he has done this for 4 weeks. We are broke. I have had to work way more than I am capable of without fucking up everything and he is nauseous 4 weeks in a row? I told him we can't afford for him to be sick right now.\n\n\nI am normally only capable of 15 hours per week, and some weeks that is stretching it. He refuses to let me sign up for disability because, \"We don't need it\" and it could affect our ability to adopt/foster in the future. So to make up for the weird shit that popped up in our lives I have scheduled myself to work my ass off for 4 weeks, and he can't even go to work regularly? He makes about double what I do as well. \n\nHe got very mad at me, and just turned our bedroom light on and stared at me in the doorway for like 5 minutes while I was attempting to go back to bed. I kept asking him what he wanted the whole time, because I had to get up in 3 hours. No he just stared at me, then after 5 mins said I was being a real bitch, told me I shouldn't stay out past 8 anymore since he wakes up so early and can't sleep when I am not here, and that we need to buy better food. \n\n\nLike what the fuck. Of course I am pissy. I am tired. This is not what FMLA is for. I hang out with my mom once a damned week until 10ish. And OH MY GOD WITH WHAT MONEY? \n\n\nI am exhausted. I can no longer go back to sleep, he claims he didn't know I worked today so it's okay to do all of that. I'm so tired. I don't get it. I go to work sick all the time, because I am literally never not sick. 4 weeks in a row.\n\n\nNow he's sleeping in the bed next to me after I cried from exhaustion and frustration. I am just so done. I can't even tell if it is my crazy ass that is making me take this out of proportion, or if I am allowed to be mad. He has said sorry, but like I can't stop being mad and sad. I just keep crying and he is passed out.",
  "id": 1,
  "comments": [
    {
      "score": 124,
      "content": "So wait, he uses all his paid leave and sick leave to take you to appointments and take care of you when you're sick, but now he's sick you're giving him a hard time because you need the money? I...don't understand this...\n\n>I told him we can't afford for him to be sick right now.\n\nHe could use his sick days if he hadn't already used them for you...?\n\nLike, I get it, you're 'more sick' and have disabilities, I have some idea of that myself, but I don't see any sympathy from you for the fact that your husband is also apparently sick here. Sure, he may not be suffering quite like you are, but it's not a competition. His sickness can still be bad for him.\n\nESH, I guess. You don't seem very caring towards him and the sacrifices he makes for you, and he should agree to you signing on for disability if you're disabled enough to qualify and get the assistance you clearly need.",
      "id": 2,
      "comments": [
        {
          "score": -38,
          "content": "Oh sorry I thought I responded to this already. We have him schedule his vacation time out, so they don't take it for FMLA pay. I find it fucking ridiculous that they do that anyway, but it's not something I can change. I deleted it to fit in the word count, but he has used his vacation time, and he has none left. We make sure to have him schedule it every January so he gets breaks, but this last year he did a month long vacation in February. That was awesome, and great, but it is the end of the year and I think he is having burnout and having issues dealing with our financial burden. I for sure need to apologize, and we probably won't do a huge vacation for him next year to help prevent this. \n\nI am still talking with him about the disability thing, as my doctors keep telling me I really need to be on it. There are days it is so bad I can't move very well, and those are when I need him to stay home and help. I usually with meds and things can deal with it myself. I try my best to remain as independent as possible, but working and being able to dress yourself and things like that are two different levels of abilty. I have good days and bad days, but I try to put as little pressure on him as possible since I love him and want him to be happy despite him taking care of me as often as he has to.",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 84,
      "content": "YTA. You dont seem to consider what stress your disability is putting on your partner. He's a god damn person, not your fucking paycheck.",
      "id": 4,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 64,
      "content": "YTA. Your husband is shouldering a lot of responsibilities, including yours. Unfortunately you are unable to contribute significantly due to your disability, but it sounds like he is being run ragged and you are not seeing it. \nSounds like he's trying his best, give him a break.",
      "id": 5,
      "comments": [
        {
          "score": -57,
          "content": "Normally it is fine, but the past week and the next 4 I am working 45 hours a week to try and recouped some of the stuff that has happened. He is honesty awesome so I have let him use FMLA to take breaks when he needs to, but this month we can't afford for either of us to take breaks. Also my husband did get his vacation time at work btw. He schedules it at the beginning of the year so they can't use it for our pay, I just wanted to clarify any time he takes off is unpaid. I'm probably going crazy from all the stupid stuff that has happened and dealing with kids all week.",
          "id": 6,
          "comments": [
            {
              "score": 66,
              "content": "> I have let him use FMLA to take breaks \n\nHow generous of you.",
              "id": 7,
              "comments": [
                {
                  "score": -53,
                  "content": "Are you serious? That is legitimately not what it is for. We have a set amount of hours he can use per week, and yes I do need help. If I let him use it for a midnight release of Black Ops or so he can go out on a work day and I have something go wrong I can't get help from him without it affecting his job. He married me knowing all of this would be how it would work, and he took on the role of caretaker because he won't let me apply for disability. We have been together for a very long time, and yes he is wonderful and helps me a lot but it is not as if I haven't attempted to take the burden off of his shoulders by means of disability or anything like that.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Of course it's not for him to recharge. It's supposed to be for you and your needs  /s",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "You know it’s not all about you, right? He’s a person with needs and wants and desires.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Do you not see that you are trying to justify the fact that you aren’t supporting your husband when he’s physically unwell about by complaining about having to work a normal amount of hours for a month instead of working part time?",
              "id": 11,
              "comments": [
                {
                  "score": -18,
                  "content": "Dude. I can't actually work full time. I know that is a normal amount for normal people. I can't normally do that though. I should be on disability but my SO really doesn't want me to do that in case it effects our future. According to my doctors I shouldn't be working at all, but I would feel guilty as hell not working at all without supplementing it with disability. Also I'm not sure if it came across in the post, but I think he isn't actually nauseous. He has been doing this every Thursday for 4 weeks and he stays up late Wednesday nights. I think he just wants a break which is fair. We've been having a hard time, but I  have been doing a lot to try to recoup that. When I get home we'll talk about all of this, but I feel like it is really bs to bring up how much I can and can't work normally.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 33,
                      "content": "It's not bs though. Because you have to make yourself uncomfortable temporarily, then he damned sure has to suffer too is the vibe I'm getting. If you have to work extra now then he has to, no matter what. Kind of messed up.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "Then he might also be feeling crazy and need a break. Its logical to assume that if you need a break sometimes then so does he.",
              "id": 14,
              "comments": [
                {
                  "score": -7,
                  "content": "I understand that, but we have $23 in our account rn. I'm using my tips from work to pay the power bill today, because a bunch of stupid stuff happened. Normally this isn't an issue for us. He works 4 days a week already, so us losing a quarter of his weekly check hurts a lot when we are in such a tight spot.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 23,
                      "content": "He works 4 days a week? Can you not schedule appts and such on the 3 days he doesn't work so he can save his PTO and sick days?",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "You've got kids on top of all that? man no wonder you're both so stressed. Remember that you're in it together and you both need time for yourselves. That's probably what these \"sick days\" are about.",
              "id": 17,
              "comments": [
                {
                  "score": 5,
                  "content": "We do not have kids, we want to have some in the future if I am able to get to a better place so he doesn't want me to be on disability in case that will effect it in the future since I believe having bio children is not a good idea, and I also probably can't have kids. I just wish he had used his vacation time better since I deleted that he scheduled it and used it so they wouldn't take it in February. He didn't work the entire month of February, and that was dope honestly. But if he schedules his time off at the beginning of the year they don't take it for FMLA pay. There were a couple days he didn't schedule, so we got paid for them, but he did get to use it. I should edit that tbh. Im not sure if I can though, since I was so close to the character limit.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Please don't have kids. If you're resentful and angry with your husband because he's SICK and that's causing financial hardship you will be an awful parent. \n\nYou're hypocritical, unreasonable, demanding, and unempathetic. \n\nYTA.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Oh sorry! I get where the kids part came from now. I am a substitute teacher since I can sign up for days as I am able to. I have another job as well, but this is the one that I have been working at like crazy since we need the money",
                  "id": 20,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Ah I see, no worries. In regards to the vacation time used in February, well there's no point crying over spilt milk. Can't change what has already happened so just don't make the same mistake next year. One month off was probably awesome for the two of you, but now you're paying for it. Give each other a break.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 41,
      "content": "YTA. It's not all about you. Your SO is running himself down into the ground to be your caregiver when needed. Every minute of sick time and vacation time goes towards time off for you and you have the audacity to call him out for not feeling well and staying home to rest?",
      "id": 22,
      "comments": [
        {
          "score": -9,
          "content": "I had to delete that he scheduled his vacation at the beginning of the year, so he got to use it. I just wanted to say that none of the time he takes off is paid. And honestly it wouldn't be a problem if I actually believed him and he wasn't just likely tired. 4 weeks in a row at the end of his weekend he always stays up playing games until after I get home on Wednesday night from having dinner with my mom. I normally am okay with him taking me time, but we have like $23 dollars in our bank account rn, and he has been too sick for work, but not too sick for fun for the end of his weekend for the past 4 weeks. I wish he would have scheduled his vacation time a little more spaced out, because he took all of it in a row in February o he could not work for a month basically. He is honestly awesome and I know that, but i really can't work more rn to make up for the time off he is taking to make up for the loss of income. I am already scheduled for 45 hours this week and pretty close to that for the next 4 between the two jobs I work at",
          "id": 23,
          "comments": [
            {
              "score": 44,
              "content": "> it wouldn't be a problem if I actually believed him\n\nWow. Yeah, YTA.",
              "id": 24,
              "comments": [
                {
                  "score": -5,
                  "content": "4 weeks in a row after his weekend and only getting 4 hours of sleep? Yeah I don't believe him this week. I didn't really give a fuck until this week. He was out and about every time having fun. We play DND on Thursdays, and he has never been too sick to skip that. I let it go without saying anything for 3 weeks. I got mad this week, and said that.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 9,
                      "content": "That blatantly sounds like anxiety manifestation",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 37,
      "content": "YTA. He's been looking after you and using his sick days to support you. Every one gets unwell every now and then. I understand the frustration and the worry about money, but you know, if he normally works more than you because you have a disability and can't work many hours (which is totally understandable), maybe you should not be mad at him for not being to work as much every now and then when he is unwell.",
      "id": 27,
      "comments": [
        {
          "score": 20,
          "content": "Exactly. The second I read about the nausea coming with a pattern my first thought was anxiety. He has exactly no time for himself, it sounds like, and that will wear him down. He needs to be able to rest too and not be treated like a work mule.",
          "id": 28,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 33,
      "content": "Yta. You can’t afford for him to be sick? Sounds to me like you can’t afford to keep treating someone who does so much for you like nothing more then a cash cow.",
      "id": 29,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 28,
      "content": "yo wtf yes YTA\n\nyour husband uses ALL of his sick and vacation time to care for you and you're angry he's not feeling well?\n\ngive the man a break he's ONE person",
      "id": 30,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 22,
      "content": "YTA\n\n\nSo, who takes care of the caretaker? Yeah, you are in a Shitty situation, but it sounds like he is burning the candle at both ends.",
      "id": 31,
      "comments": [
        {
          "score": -5,
          "content": "I know he helps me a lot, but I have a feeling I should explain more about what he does. I have a mobility and pych service dog. She does most of the work, and my dog was trained by a family member who does that for a living. She helps me get around for the most part, and I take care of myself a lot. The only time he needs to stay home are when I can't get around with just my dog, or I think the weight I would have to put on her would be too much. She is a big girl, but some days are worse than others. I use mobility aida, but it helps having someone to make sure I don't fall or hurt myself. My dog takes care of my needs almost to the point where I could live alone. I would definitely have to be on disability if I lived alone, and have access to something to call for help if I fall, but I for the most part have good to moderate days most of the time. I know living with a family member who has a disability is hard, and can be very hard, but I do not need a caregiver. He stays home to help on those days, because I can get really depressed by my fluctuating ability. For the most part he plays call of duty or any other game he likes when he stays home. I know that is hard, but I feel like people are blowing the caretaker aspect out of proportion.",
          "id": 32,
          "comments": [
            {
              "score": 21,
              "content": "If you are so ill he has to use all his time from work and take FMLA every year then I think you are underestimating his caretaker role.",
              "id": 33,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17,
      "content": "YTA, odds are he’s exhausted and sick from taking care of himself and you. Your constant complaining and telling him he needs to work anyways I’m sure isn’t helping.",
      "id": 34,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 14,
      "content": "ESH.  You’re seriously thinking of adopting?  Get your affairs in order first",
      "id": 35,
      "comments": [
        {
          "score": -1,
          "content": "I'm very young, this would be in the future. I personally am not sure if we can at all, but my doctors think with the right meds and surgeries we will get to a better point for all of it. I do not plan to adopt until I am 100% sure I would be able to. My husband just wants to avoid it in the mean time to keep our options more open in the future.",
          "id": 36,
          "comments": [
            {
              "score": 9,
              "content": "Making your life difficult in the present (not applying for disability) for something that may not happen I seems unwise",
              "id": 37,
              "comments": [
                {
                  "score": -2,
                  "content": "It is not my choice. My SO decided that was the best avenue. I don't agree, and we are still working on that. I will say it was fine before shit hit the fan a couple months ago, so I had let it go for the most part. I have been bringing it up more recently. I also have a little suspicion in that he thinks that he would be less of a caregiver to me if I were to be on disability. I have no idea if that is true, but I think that might be the case from our more recent discussions.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}