{
  "post content": "We’ve been dating for about 4 months and mostly it’s been good. He’s cute, smart, and very successful. The only downside is that he’s almost addicted to buying things that are on sale or have coupons despite being a VP at his company. I’m not talking about sometimes or even most of the time, I would be alright with that. He never buys anything at full price. NEVER!\n\nHe plans his cooking around what’s on sale that week at the grocery stores. All of his clothes were bought on sale or clearance, even his socks and boxers. Last week we were at my friend’s house for dinner and she commented on his shirt. He proudly said he got it on clearance last year for $20. I was mortified. Lastly, we don’t go to any restaurant unless he finds a coupon or they’re running some kind of special.\n\nThings came to ahead last night when we went out to dinner. He had a digital coupon for buy one get one free. For some reason, the restaurant’s computer didn’t recognize the deal and the poor cashier couldn’t make it work. We were holding up the crowded line because he refused to pay for both dinners. Finally the cashier called the manager but he was busy somewhere else in the restaurant. While we waited, the people behind us were getting annoyed. I was so embarrassed I left him standing in line by himself and went to the car.\n\nWe argued the entire drive home. We were supposed to go to the movies, because he got free tickets, but I wasn’t in the mood so he dropped me off. We haven’t texted today at all.\n\nWhen I talked to my friends at brunch, they didn’t see a problem with it and I found it frustrating that they didn’t understand how embarrassing it is. Am I TA or is this normal?",
  "id": 1,
  "comments": [
    {
      "score": 18640,
      "content": "YTA\n\nStuff is expensive right now, especially with inflation\n\nHe's being money smart and frugal",
      "id": 2,
      "comments": [
        {
          "score": 5933,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 8447,
              "content": "Also found it very interesting that OPs reaction to the “embarrassment” of waiting on the coupon was to wait in the car rather than offering up any of their own money to cover the second meal.",
              "id": 4,
              "comments": [
                {
                  "score": 3464,
                  "content": "Nice observation. I think most normal people would just be exasperated and offer to pay.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1225,
                      "content": "agreed. Any partner would pay and clear the matter Instead of getting embarrassed and going to the car",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 178,
                      "content": "Unless she's broke lol",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I must be abnormal, if all conditions of the coupon are met, then the business should be obligated to make it work.  Because the staff couldn’t make it work in the computer system, they could have manually calculated.\n\nIt’s the staff that were making the situation awkward.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Which is why business make it difficult to get the discount.  They think you'll  just give up.  I feel  for the cashier, but why should I pay more because the companies  computer is messed up.  Or the employee is poorly  trained.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "He would decline most likely. As that’s not the point. I agree with bf. Why should he have to pay double because of the restaurants problem yo have working machine. I absolutely would be annoyed if I was behind him. But that’s not really his fault either",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 507,
                  "content": "Exactly. If I was as embarrassed as OP claims to be I would have just paid for both of us and asked boyfriend to pay me for his meal later.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 559,
                      "content": "Pretty sure there wasn't a hope in hell for that happening.  OPs bf has made a second career out of being cheap.  He's obviously proud of it and enjoys *saving money.*  OP says he's always been like this. So he didn't hide it, didn't pretend to be any other way. OP somewhat accepted this....until she didn't.  Afraid she's a bit of an AH bc she had to know what she was getting into. She'll be a big AH if she doesn't break it off immediately. If that's not her style, fine but don't try to change someone who's perfectly happy as they are.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Or you know as partners you could have just paid for him that time…",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Pay and be done. This isn’t the 60s.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Also, why would you even expect to be paid back for the meal? You two are dating. If she's really sooo mortified and in her mind it's fine to pay the full price for the dinner, then pay it. Or let him do his thing and wait for a bit, if you want to eat for free. It's easy to expect someone else to dish out the cash and act all indignignant when it's not your money.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Why does the BF  have to pay for his if he was gonna pay for you? Regardless of the coupon. He clearly pays all the time for everything",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 152,
                  "content": "I doubt he would have accepted it though. People that coupon want it to go through because it’s the principal of the matter.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 48,
                      "content": "It’s not the point of the bf accepting the offer to pay. It’s the fact that OP would make the offer so that bf could then decline it in his desire to get the deal. It would make OP look less like an AH which she is of course. YTA",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 149,
                  "content": "I had this exact thought! Why not just pay for the second meal and end the embarrassment she’s feeling? I feel like the boyfriend pays for everything in that relationship.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 10,
                      "content": "OP might think \"oh but am I not worth paying the full price for?\" but I think from the boyfriend's perspective maybe he's like \"if I save money now, I'll be able to buy us LOADS of bigger things for the full price later\". In my opinion, OP has a very short term, shallow vision",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "He’d get a half off if he made her pay for herself, someone tell him. Then he could still use the coupon to have an extra meal for tomorrow.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "100%. If his spending bothers OP she should stop mooching from him and spend her own damn money. The entitlement is rife here.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 8,
                      "content": "“I want him to spend more money than he should!” …..😈",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "She probably doesn’t have any money.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Doesn't sound like OP brings anything to the table tbh",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 96,
                  "content": "Sounds like OP is the actual cheapskate \n\nYTA",
                  "id": 26,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Such a good point... the idea of paying for both of them didn't even cross her mind.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 58,
                  "content": "Yea this is what stuck with me. I can be cheap and buy my clothes at costco on sale etc, but if my wife or family was holding up the line like this id just offer to pay. Heck I have done that before to strangers with checks, coupons or ebt, because while I like a deal I also hate shopping and I especially hate wasting time....",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This, on top of her being embarrassed of him mentioning his shirt being on sale/clearance for $20?\n\nWhy in the hell would that embarrass someone? \nI’d be like *hell yeah this shirt was $20.* \n\n\n*macklemores thrift shop starts playing in the background*",
                  "id": 29,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I feel like that’s a typical brag point when I compliment my coworker’s clothes - “thanks! I got it on sale and the dress has pockets!”",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "I can understand being \"embarrassed\" for holding up the line, but being mortified that he got a shirt for $20 on clearance? Sounds like OP wants her BF to be buying expensive name brand overpriced crap.\n\nYTA OP",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Yup, that jumped out at me too.\n\nMy instinctive response when the coupon failed would have been to offer to pay for my meal or cover both, depending on my available funds. Hiding in the car wouldn’t be in my top 10 responses.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "For real. It's the FIRST thing they said about him.\n\nI myself would start to get slightly irritated at not being allowed/able to go out unless there was an offer but then I would pay instead (shock horror) and I certainly wouldn't be embarrassed \n\nYTA OP. And seeming like a gold digger. BIG TIME",
              "id": 33,
              "comments": [
                {
                  "score": 9,
                  "content": ">but then I would pay instead\n\nRight, like what's stopping her from \"hey, I know we don't have any coupons to this place but it's really like to try it out, my treat?\" Like how is it fair that the boyfriend is paying for everything?",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Yeah, it would be an issue if he refused to do *anything* at full price, even if OP was paying. That would edge it over from extremely frugal to controlling imo. But that doesn't seem to be the case since, from what OP has told us, it doesn't seem like she's paid for anything in this relationship.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "A lot of people who are financially stable right now are the people who try to skimp and save wherever possible.",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "There is absolutely nothing wrong with a partner who doesn’t buy things at full price. Times are tough right now and excessive spending isn’t a luxury most of us can afford. \n\nHer reasonings for why the relationship is going well is because he’s “cute, smart and very successful”. \n\nThose are nice traits to have in a partner but how about mentioning that they’re kind hearted, a loving partner, attentive, thoughtful, etc etc. You know, the things that actually matter most in a partner.\n\nShe also didn’t ever mentioning offering to pay for dates or meals and seems to always leave it to him. They only go out to eat when he gets coupons and when he doesn’t, they doesn’t go out cos she doesn’t want to pay. \n\nShe most definitely seems like she’s with him because he’s attractive and rich. Defo seems like a gold digger.",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Took the words outta my mouth. She's not embarrassed that he buys cheap things, she's pissy that he isn't using the leftovers to buy her all kinds of expensive shit she can show off to other people. YTA",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">Now i ain't saying she a gold digger but she ain't messing with no broke folk\n\nTHIS",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">But seriously i believe the bf's Job was 90 percent the reason she dated him\n\n[without a doubt](https://tenor.com/view/you-got-em-good-glenn-the-pigeon-quattro-the-pigeon-fairfax-you-tricked-em-so-good-gif-25600726)",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 779,
          "content": "the richest person in my close friend group (totally self made, props to them) never makes a retail purchase without checking their couponing apps.",
          "id": 41,
          "comments": [
            {
              "score": 285,
              "content": "I like to say that putting a little extra labour into saving money is my side hustle, and it pays well.\n\nEdit: yes Ive been called cheap enough times to craft a prepared comeback lol",
              "id": 42,
              "comments": [
                {
                  "score": 14,
                  "content": ">putting a little extra labour into saving money is my side hustle\n\nYou're not kidding. I think it was Ben Franklin who said 'a penny saved is a penny earned', and it's totally tax-free money to boot. Until the government finds a way to tax you on money you SAVED... and with current circumstances, they'll probably find a way to do that.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "\"Cheap\" was my FIL paying a crew to put a roof on his house- but having them install the cheapest shingles that could be bought.",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Just don't end up like all those rich old people who saved all the time and never lived. I worked at a retirement with tons of millionaires with boring life stories. A lot ended up leaving their money to the state anyway.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "Wait, there’s legit couponing apps? Please tell me more",
              "id": 46,
              "comments": [
                {
                  "score": 108,
                  "content": "Practically every store has their own app where there will always be discounts, sales, points for members, and digital coupons so definitely download the app to whatever store or restaurant you go to. Another app to help save money is fetch app. Every time you buy something, take the few seconds to take a picture of the receipt and upload it and you get points. Once you get enough points you can use it to redeem a gift card of whatever you pick from, there’s hundreds to choose from. Or can pick items and souvenirs. It also scans receipts from any online orders like Amazon and stuff that you do. Check it out if you’re wanting to earn something back from all the spending you do lol. [fetch app](https://fetch.com)",
                  "id": 47,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Add the Amazon Shopper Panel.  $10 gift back a month for giving them pics of 10 reciepts, plus an occasional 25c/>5 question survey.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "retailmenot, [restaurant.com](https://restaurant.com), groupon, all do different things but still give a discount or coupon for different things.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "The honey app.\n\nDownload it on your devices and anytime you buy something it’ll scour the internet for deals and coupons and then apply them if it finds any. It also shows a product’s price history and tells you if someplace else has the exact same item for cheaper.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "If you shop online, use Rakuten. So many stores offer cash back just for going through Rakuten. It’s usually 2-5%, but sometimes it’s double or even triple cash back, and that’s on top of any offers or sales the store has. You get a nice little bonus check every three months.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Ibotta has been legit for cash back rebates on purchases. I used to use Swagbucks for a few cents here n there on basic grocery buys and cash back on gift cards or travel. Receipt hog is slow but always pays ($45 in a year sometimes but hey it’s cash) also Fetch while it CAN take a while sometimes like this weekend I”lol get like $8 worth of points if I make a strict list like OP’s dude. Target with circle and Red Card I sometimes walk out saving $50 on a transaction right in store and use the rest for rebates",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Ahem.  I may or may not have some on my phone....\n\nFirst  - virtually every store has their own shopping app that has electronic coupons.  \n\nSecond - Fetch - scans your receipts for offer\n\nThird - iBotta - also scans for offers but you have to activate them first\n\nFourth - Shopium - took over when [coupons.com](https://coupons.com) shut down their app.  Similar money goes to PayPal, no minimum pay out\n\nFifth - Checkout 51, limited offers these day.\n\nLastly  - Amazon Shopper Panel - $10 for 10 receipts per month plus surveys - they have a waiting list.  Google Opinion Rewards - $ for surveys, randomly asked often when they are tweaking Google Maps location.   I haven't paid for a  movie rental in a long long time.\n\nThere are other apps that I don't use but others do - ReceiptHog, etc.  and that isn't even counting the cash back apps and sites like Rakuten, TopCashBack, Honey, etc.\n\nI've kept track of my couponing rewards on these sites for years, and it adds up, even without trying very hard.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "This is the way.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This is the thing. My family were poor immigrants who are now incredibly wealthy. \n\nGuess what? They don’t show boat their money. Their way of bragging is that they got the best deal. They’re literally millionaires but they never buy anything full price if they can help it. My father is constantly on redflagdeals. My ex was dumbfounded when I would go to two or three different stores to get groceries on sale. Guess who got converted when he realized I’d save 50-100$ per trip because I’m not paying 6$ for olives.\n\nThere is a difference between rich and wealthy. People stay wealthy by being smart about their money",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "A lot of the time if I’m shopping retail online, I’ll throw stuff in my cart then leave the tab completely. Retailers usually email a ‘you forgot this in your cart! Here’s a code for 10% off’ or whatever that usually pushes me over the edge. If they don’t send that, I’ll mostly forget about it.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 647,
          "content": "If I complimented someone's shirt and they told me they got it on clearance, I'd be like hell yeah! What a steal! And if I had a boyfriend that had the drive and energy to plan out meals based on sales I would hand all that planning over to him and always do the dishes in exchange.\n\nTho I do get OP's discomfort holding up the line for the coupon, but also if I was behind them I wouldn't be thinking badly of them cuz they have a coupon and the right to use it, not their fault the system is messed up.",
          "id": 57,
          "comments": [
            {
              "score": 322,
              "content": "Yeah, I think there’s a line between getting a good deal and then over extending other peoples courtesy in order to save a few bucks.  If they were in line long enough that people were getting irritated and the hostess was flustered and uncomfortable…. Then I’d just pay the bill and call ahead next time to make sure the coupon was good.\n\nBut the extra info OP included about him getting his socks and boxers on sale, how embarrassed she was about his $20 shirt…. That makes her TA, in my opinion, she clearly has some standards that he doesn’t meet.  And he has been completely honest about how he is front he beginning.  So now, suddenly it’s ok to shame him for being frugal???  Naaaahhhh, that’s manipulative and gross.",
              "id": 58,
              "comments": [
                {
                  "score": 189,
                  "content": "Yeah, “even” socks and underwear? Prime thing to buy on sale.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I only buy these on sale. I might have a few to many now, but time will pass and I don’t need to buy for a while. Getting half price is like 15 years in a savings account",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "No gets mad about the cost of someone’s underroes?!",
                      "id": 61,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 101,
                  "content": "Nah, maybe he should have stepped to the side to let others pay first but if you've purchased something with an advertised coupon in mind then it's up to the business to fulfil their end of the promise. Have sympathy for the server and other customers don't let the business rob you",
                  "id": 62,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Yep. Businesses rely on your sense of embarrassment and decorum not to make a scene, which allows them to not honour vouchers. If I have a voucher, and it says in black and white that there's a deal and I have ordered within that deal, I will wait as long as it takes for the manager to come out.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Exactly. Step aside to let others pay, but if the coupon is good, you should stick with it until the restaurant finds a way to honor it.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": ">If they were in line long enough that people were getting irritated and the hostess was flustered and uncomfortable…. Then I’d just pay the bill\n\nNo, I might be thinking too deep, but this is how stores/brands peer pressure you into paying. Just like the \"impulse shelves\" in some supermarkets: you're standing in line, which is moving steadily, and you have limited time to grab one of the low priced (but expensive for the amount you get) packs of bubblegum or chocolate. Because there's a time pressure and a peer pressure of the people behind you, you're more likely to buy.\n\n>and call ahead next time to make sure the coupon was good.\n\nYes to this. To be very sure, ask who you're speaking to on the phone. If there's an error later, you can tell them who had assured you the coupon would work",
                  "id": 65,
                  "comments": [
                    {
                      "score": 8,
                      "content": "My local Albertsons does that with the deals, by the time I get everything rung up… half the deals didn’t come off the price.  And I will absolutely take my time to have the cashier go back and fix them “if I have time”.   \n\nBut it’s VERY frustrating for me and the cashier, they are just as annoyed with stores pricing scams as I am and are always apologetic and quick to fix the price.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Nah dawg, ya in the wrong there.  If the business cannot properly hand the coupon they sent out, then that is entirely on the business.  If the manager can't be bothered to come over immediately, than that is on the manager.  He will have to deal with all the other irate customers, and possibly loose business.\n\nI am not spending my money when I don't have to for a business to save face.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "It's not on the customer to handle their payment system. If they give out coupons and there's a problem in the system, just sort it out manually and handle the coupon later.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "The manager was \"too busy\" to honor the coupon. Glad boyfriend held up the line and walked away.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I don't even think the holding up the line is that bad. I used to work in a supermarket and sometimes stuff like that just happens. Some people are irritable but that doesn't mean you have to just get out of their way, you have the right to the service as much as anyone and coupons should never cause embarrassment.\n\nWe would deal with a lot of coupons and you could tell when people were embarrassed to be using them, but I'd never judge anyone, it's just smart money saving.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 445,
          "content": "I'm pretty well off and dated a handful of men making $200k+ salaries. This all seems normal to me. It's wonderful to have someone responsible with their money. Trust me, I've dated rich and frugal and poor and spendy. I far prefer the boyfriend who will live within or below his means.",
          "id": 71,
          "comments": [
            {
              "score": 333,
              "content": ">Trust me, I've dated rich and frugal and poor and spendy. \n\nThe idea that these are the only two options is laughable lol. I wouldn't want to date someone who literally never purchased things at full price. Think of all the things you'll never experience because there isn't a deal going on. But to each their own.",
              "id": 72,
              "comments": [
                {
                  "score": 242,
                  "content": "Years ago, this one guy asked me on a date. He made a big deal saying I was going to have *the best* time-- *the best* food...*the best* service. Whatever, I don't demand anything like that ever. But when he drove 45 minutes *out* of the city, telling me how much much I was going to enjoy this dinner and then pulled into a Red Lobster, I was more than a little surprised. He then pulled out a black binder, chuck full of coupons, and I had to wonder wtaf. I paid for my own dinner (he took the free 2for1 coupon and was super stoked he got to eat for free), and it was our first and last date. I was surprised he didn't ask me for gas money.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 131,
                      "content": "Jeez, if that was your first date and it was going to be the “best of the best”…. You’re looking at your anniversaries, birthday dinners…. celebratory events….  \n\nIf he would’ve said, “I love Red Lobster and have a great coupon!”  Then awesome, I’m down, but if that’s how he views fine dining… AND he happily allowed you to pay… yikes!  It almost seems like this is a test or something, which on its own is a red flag.\n\nDefinitely good that you didn’t go out again.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "Was his name Donald Trump?  _”You’re going to have the best time, the greatest time.  You can ask anyone — nobody has a better time than when they’re with me.”_",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Yep...can't bear cheapskates like that.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Haha I once read some dating tips for guys. It seems obvious to me that “shower” and “wait for the second date to pull out your coupons” made the top 10.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Lmaoooo, \"don't worry babe, I got you covered. Nothing is too good for my sweetheart. I'm gonna treat you like a Queen\"\n\n*pulls out a 2for1 coupon*",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "> I was surprised he didn't ask me for gas money.\n\nBecause it's not actually about saving money; it's an addition and a compulsion. It's not that different from early stages of hoarding.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 125,
                  "content": "I mean, they also haven't even been dating half a year yet. There could well be plenty of things he's willing to pay full price for, but not for a girlfriend of only four months.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Sure, or she could be right and this is just who he is",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "I read that to mean she’s dated both frugal and spendy types, also rich and poor, meaning all kinds not just rich/frugal?",
                  "id": 82,
                  "comments": [
                    {
                      "score": 8,
                      "content": "So did I.  It was 4 types, not just the two types of earners/spenders.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I read it as \"rich and frugal\" and \"poor and spendy\" but not implying that she *hasn't* dated any of the other two combinations... just pointing out more specifically that rich and frugal is not a bad thing to be, and someone who spends for the sake of spending (which it sorta sounds like OP might be) can get in a lot of hot water quickly if they can't afford it, or could become un-rich by way of their spending habits.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Have you considered she in this case should start spending money and paying instead? Because it seems to me that it is him paying for the OP all the time.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yeah. I get being responsible, but I would hate to have literally all of my dinner dates limited to places with deals or whatever.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "She seems to have a very different relationship with money than he does and that’s a- likely irreconcilable- issue right there. Even though neither is “wrong” it’s not a good match and will always cause tension between them, especially after only 4 months in!! What about buying a house, costs for children, etc there will be many more confrontations over more important things than dinner!",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "We are retired with, let's just say, well over $1M in savings, paid for home and cars, etc. We pretty much NEVER buy anything, not even groceries for full price. Shop the clearance rack at the grocery store pretty much every day and stock up on what's on sale. Buy clearance meat and freeze it. We have always had a pretty modest income and guess how we became millionaires?",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah... im just lazy. So, I hate using coupons... so, I'll never judge anybody that uses them. I think I'm the idiot, not them... and I am OK with that.",
              "id": 89,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Yeah I'm relatively successful but why would I buy a shirt jow when it'll be on sale in a few weeks? I save tons of money because of sales...",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 206,
          "content": "Did anyone else get Julius vibes with the coupon, for “Everybody Hates Chris”??  Lol\n\nYTA why are you embarrassed at him be proud of a good deal?  Women are notorious for doing the same when someone compliments us on our clothes.  There pride to be had in finding good deals!!  It’s like when someone says something to a female about their dress and they get all excited and say: “look it has pockets!!!!” As they stick their hands in them to show it off. \n\nHe had a coupon for a buy one get one and I would want my coupon to work as well.   Saving money is important and everything is so pricey and even if it wasn’t, it’s good sense.  Seems to me you are too far up your own nose to see clearly.  \n\nHe may even have a background if growing up poor and this might have influenced him in the way he shops. Still good smart sense. \n\nYou have a lot of growing up and maturing to do, if you feel so adamant in he way you feel you have choices: \n\n1) break up with him and let him find a good woman. \n\n2) pay for the dates or your half, so you are not “embarrassed”\n\n3) grow up and stop acting like a highschooler whose mum pick them up from school in a bathrobe and curlers.",
          "id": 91,
          "comments": [
            {
              "score": 64,
              "content": "I always bragged when people would compliment this cool jean dress I wore (ok it was the 90’s 😆) that “I got it for $6 at blah blah blah!” Like that was part of the reason it was so sweet. I wore that damn jean dress for 10 years (with breaks to wash it lol)",
              "id": 92,
              "comments": [
                {
                  "score": 7,
                  "content": "Jean dresses where the best!!!  90s had some cool shit. I miss my Jean dress, now I’m reminiscing.  Sighs.  \n\nRight! It’s so awesome to find a great bargain. Its like it’s own treasure hunt!  \n\nMakes me wonder if OP found some designer whatever at a bargain price, if she would buy it and claim full price or just turn her nose up at it altogether.\n\nEdit missing a word due to my keyboard lagging.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah, like who gets “mortified” by a sale? \nI bet she brags about how rich her bf is and his comment hurt the image she tried to portray. \n\nThat said, maybe he is one of those extreme bargain hunters and makes it his personality- that could get annoying real fast. They clearly have different views on finances, I can’t see how they can reconcile such a major difference in perspective. Especially as it’s only 4 months in! He wasn’t the sugar daddy she thought she “scored” and is dealing with the reality of dating a very frugal person, rich or not",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "The three main responses to a clothes compliment: \n\nLook! It has pockets!  \nThank you, I made it myself.  \n£x at M&S in the sale.\n\nYou now know everything you need to know if you want one of your own. Except I'm not making one for you.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 160,
          "content": "If it bothers OP so much, OP should just pay.",
          "id": 96,
          "comments": [
            {
              "score": 39,
              "content": "Or find someone else.",
              "id": 97,
              "comments": [
                {
                  "score": 9,
                  "content": "Set him free so someone else can snatch him up like it's a fire sale!!!",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "For OP, paying would be the ultimate insult. Her BF exists to provide her with a luxury lifestyle.",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "There was a tweet I saw. While back. “In the Midwest it is customary to accept a compliment by explaining how you got the item at a significant discount.”",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Im very weirded out by OP’s embrassement that about him having stuff from the clearance. I love having the conversation of « I love this where did you get it? » « thank it was on sale/I thrifted it »\n\nBut at the same time, it does sound like the boyfriend is taking the frugality to an extreme: not going out unless he finds a discount/coupon? There must be a reason behind it, maybe he grew up in poverty, still has student loans, is saving up for a house, his retirement, or to help family members. Honestly OP needs to talk to him to understand why he’s so frugal, instead of reacting with shame, Cus rn she sounds like a gold digger",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I do find it funny that as people age from teens to adults we go from \"This is Coach/Versace\" to \"I got this for $5 on clearance\". Someone actually did comment on my shirt last weekend, and I said the exact same thing as OPs BF, \"Thanks it was on clearance!\". Why pay double when you can get it half off?",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Hell yes to this! \n\nShe wants to pay full price then she can pull out her wallet. Seriously. She gets treated to dinner and complains that he doesn't pay more than he should? WTF.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7937,
      "content": "*He never buys anything at full price. NEVER!*\n\nWhat's so terrible about that? As long as he's never rude or demanding to retail staff, he's smart to chase the best deal on everything.\n\n*He proudly said he got it on clearance last year for $20. I was mortified.*\n\nWhy? I doubt your friend thought any less of him for it.\n\n*He had a digital coupon for buy one get one free. For some reason, the restaurant’s computer didn’t recognize the deal... While we waited, the people behind us were getting annoyed. I was so embarrassed*\n\nThe fact that the computer didn't recognize the deal wasn't his fault. He had the coupon. He ate there with the expectation that the coupon would be honored. Again, as long as he was patient and not rude to the cashier, he did nothing wrong. If the people standing behind were annoyed, they should get annoyed at restaurant management, not him.\n\nOverall, this sounds very much like a you problem, not a him problem. And calling him a \"cheapskate\"? You've been dating four months. I can't see this relationship lasting if you continue with that attitude.\n\nYTA.",
      "id": 104,
      "comments": [
        {
          "score": 2873,
          "content": "The “mortified” comment is really all you have to read here. The fact that OP is “mortified” by her BF telling people he got an awesome deal on a shirt is crazy. OP should be embarrassed by her vanity. Being a smart shopper is something to be proud of.\n\nIf her BF had a right to a buy-one-get-one dinner, it doesn’t matter if he was holding up the line. The restaurant made a mistake, it’s not his fault!",
          "id": 105,
          "comments": [
            {
              "score": 763,
              "content": "I live for coupons, sales, and second-hand steals. I'm an awkward weirdo that answers any compliment with \"thanks, I got it for *insert clearance price*\". Literally, a mom tried to make conversation with me over us having matching purse/wallet at school drop off, and I didn't know what to do, so I blurted out that I got it 50% off! If my husband was mortified by that behavior, we would have divorced 10 years ago.",
              "id": 106,
              "comments": [
                {
                  "score": 632,
                  "content": "The only thing I like more than getting a good bargain is hearing about someone else’s good bargains.",
                  "id": 107,
                  "comments": [
                    {
                      "score": 535,
                      "content": "That has POCKETS",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 114,
                      "content": "Wanna hear my great bargain? This past February/ March I was in a store and found this fantastic long winter coat. The original price was $120. It was on clearance for $30! A couple of weeks later I was in another store of the same chain and saw the same coat on clearance for $15! I bought it and then returned the first one because I hadn't worn it yet. That had to be one of my best bargains. But I've also gotten t-shirts for $1 and jeans and shorts for $3. I am proud as hell of my deals. Geez, I find it wasteful to pay full price all the time.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Dude I even tell people how we got my wedding rings (gorgeous synthetic sapphires with little diamonds antique style engagement ring + wedding band bridal set) for 40% off, we’re honestly both just really proud of the deal we found 😂",
                  "id": 110,
                  "comments": [
                    {
                      "score": 7,
                      "content": "\\*waves\\* Pawn shop bargain engagement ring. I have no qualms about telling people; I will even tell them which pawn shop!",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I would have *zero qualms* with this, a kickass discount doesn’t change the quality of a ring! I’ve known of people that take such a thing as an insult and I honest to god can’t wrap my mind around that train of thought.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "We were just saying yesterday that this is pretty much the response to all clothing related compliments, unless its 'thanks, its got pockets!', or 'thanks, it came from an op shop/thrift store!",
                  "id": 113,
                  "comments": [
                    {
                      "score": 3,
                      "content": "And now I've just carried on reading this thread. It's true! :D",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 132,
              "content": "Yes. \"Oh thanks I got it on sale\" is a totally normal way to respond to a compliment. There's a phrase I'm thinking of - it might be \"conspicuous consumerism\" or I may be messing up the first word. Consuming not out of need but out of a desire to show off your social status and wealth. I think op has a problem with it",
              "id": 115,
              "comments": [
                {
                  "score": 39,
                  "content": "It's conspicuous consumption :)",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "Wait ten years. When all that savings starts making interest/she's still paying off student loans - he'll start lookin real good again.",
              "id": 117,
              "comments": [
                {
                  "score": 68,
                  "content": "By then he will have married someone who appreciates him.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Seriously. I have the same response OPs BF has. Why isn't it awesome to share you got a deal?!\n\n\nLike my mother before me, and her mother before her - rule 1 of clothes shopping is when you enter a store (particularly clothing) you make a beeline for the clearance rack and don't be afraid to loom/ shove stuff around.",
              "id": 119,
              "comments": [
                {
                  "score": 6,
                  "content": "I buy a large percentage of my clothes at a shop in our local town and I don't think I've ever paid full price for anything. I've even been on the way past going home from work and if something catches my eye I'll park and check it out.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "\"Thanks, I found it cheap!\" seems like a variation on \"Thanks, it has pockets!\" for dresses.  Like, \"I appreciate the compliment and it's even cooler than you knew.\" It's honestly still a brag, but more wholesome than what OP wants her bf to be",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "A shirt that I picked up at goodwill is one of a couple that I always get compliments on, even from strangers just walking by. I even had one take a picture of it. \n\nI think I paid 7 dollars 5 years ago",
              "id": 122,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "The other subtext here is if she was so mortified that the coupons weren’t working, why didn’t she just offer to pay for her own meal so thd BF would then only need to pay for his meal.\n\nThis girl not only wants his partner to pay for everything, she is also calling him a cheapskate while doing so.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Right??? There's this super good store that sells clothing for really cheap in my city, and I got this pair of pants from there for like.. $2.00, and whenever someone new compliments it, my favourite thing to tell them is that it was two bucks, and usually they'll react super positively as well and want to know where I got them. I could never imagine being MORTIFIED about good shit for not much money, it's no way to live life :/",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "yeah this is the key to her being a AH! I would find it annoying af if we could only cook or eat out based on coupons available (given there are no money challenges) but mortified to say a shirt is on sale? bring is way over into AH territory",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": ">The “mortified” comment is really all you have to read here.\n\nAlso highlighted with OP being frustrated that her friends being unable to see how embarrassing it is. Maybe if your friends can't see it as being embarrassing then it isn't, it's just OP projecting her weird issues. I wonder if she grew up poor and feels judged for using coupons?  \n\n\nAlso, if she has a problem with his insistence on eating out at places where he has a deal, why can't she take him out for a meal some time?",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 231,
          "content": "\"He's a cheapskate\"\n\nSaid the girl who was getting her dinner paid for by someone else...",
          "id": 127,
          "comments": [
            {
              "score": 11,
              "content": "ding ding ding! post closed lol",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "God if she was so mortified about the line she couldve offered to just pay for the dinner",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 201,
          "content": "She’s worried about how small of a diamond engagement ring she would get. She thought she found someone who she could mooch off of but is now realizing that it won’t be that way….",
          "id": 130,
          "comments": [
            {
              "score": 92,
              "content": "Yea...when he was trying to resolve the coupon issue, she just walked away. Didn't offer to pay, but was mortified he didn't?",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "Hopefully he’ll leave after this, but if not he’s probably smart enough to have an iron clad prenup if it ever gets that far.",
              "id": 132,
              "comments": [
                {
                  "score": 8,
                  "content": "Not only that, but people with bank always have somebody trying to get with them. If OP keeps up her attitude I doubt her boyfriend will have to worry about being alone for long after dumping her. Then she’ll kick herself in the future when she sees the photos of him and his new wife taking amazing vacations (that he found a deal on).",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 115,
          "content": "Honesty, I was mortified by the $20 clearance shirt, too. That is what I'd pay for a full price shirt!",
          "id": 134,
          "comments": [
            {
              "score": 16,
              "content": "I have a side custom apparel business and I make my own shirts for around $5. It's nice getting extremely good shirts directly from the manufacturer",
              "id": 135,
              "comments": [
                {
                  "score": 8,
                  "content": "Do tell me more about how you get clothes directly from the manufacturer….",
                  "id": 136,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Right? I’m from Europe so I don’t really know about prices in the US but $20 doesn’t sound that cheap of a price",
              "id": 137,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Ngl that kinda endeared me to him more, if it's a high quality shirt. If it was that he only bought cheap Gildan t-shirts at Walmart and wore them til they're rags, there could be logic that he's being way too cheap and she has a right to be embarrassed. But if he buys quality on clearance, that's just being smart",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Her friend didn't think less of him, She did. Op is definitely the AH",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Note she calls him ‘cheapskate’ but all the stories are about him buying things for her.\n\nShe a freeloader throwing stones in a glass house.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "OP doesn't seem to understand the the products are the same quality - whether they're at full price or not. So, why not save money? A nice shirt at $90 will still be a nice shirt at $20. OP is weird.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "There was this meme that I saw one time that was like\n\n“Girlies when you compliment their dress”.\n- Thanks! I has pockets and I bought it second hand for $1 \n\nAnd honestly I get OP’s boyfriend for being proud to find something good AND cheap.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">Overall, this sounds very much like a you problem, not a him problem. And calling him a \"cheapskate\"? You've been dating four months. I can't see this relationship lasting if you continue with that attitude.\n\nI found it pretty telling that OP never mentioned what *her* job is. It seems like it's very important to her that her BF spend his own money freely and consistently demonstrates how he has so much of it he just doesn't care about it.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "lmfao that mortified comment fucking killed me. really bro you were mortified bc he said he got a shirt on sale? OP is clearly the issue here.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5547,
      "content": "Omg, not a shirt on clearance!! 😱\n\nWhy didn't you just pay for the dinner if you were so worried about the line of annoyed folks?  YTA",
      "id": 145,
      "comments": [
        {
          "score": 1419,
          "content": "THIS!! It would have taken much less time for OP to say \"here, I'll pay for dinner this time\" if they were so embarrassed. \n\nYTA based on the fact OP is more into the VP title (and salary) than the guy, apparently.",
          "id": 146,
          "comments": [
            {
              "score": 620,
              "content": "Op probably doesn't want to admit she's the real cheapskate getting everything paid for and not chipping in.",
              "id": 147,
              "comments": [
                {
                  "score": 139,
                  "content": "I didn’t even think about this when reading it but you are right on.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 26,
                      "content": "[deleted]",
                      "id": 149,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "This is exactly the subtext in this story. That guy is husband material, and she’s gonna lose him over being the real cheapskate herself.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "He's a cheapskate because he won't buy her all the stupid shit she wants because it's overpriced and never goes on sale, now she's looking for validation for being a greedy asshole. OP, YTA now and forever. Leave this poor man alone to do his couponing, go find a rich 80 year old or something.",
                  "id": 151,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "She's not the cheapskate. She deserves that! Do you know how much work OP has done to put up with her embarrassing boyfriend paying less than full price? It's crazy. She needs to save money to buy concealer for her blushes of shame!",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 172,
              "content": "Not embarrassed enough to spend their own money apparently",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": ">YTA based on the fact OP is more into the VP title (and salary) than the guy, apparently.\n\nDefinitely. And the fact that she isnt able to brag about luxury(WITH HIS SALARY) is making her embarassed.\n\nThe level of Entitlement!!!",
              "id": 154,
              "comments": [
                {
                  "score": 8,
                  "content": "VP at a bank is a middle manager elsewhere, wouldn’t just assume VP automatically = high salary",
                  "id": 155,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Doubt he would have accepted it. It’s the principal of the matter. Even if my partner wanted to pay I wouldn’t let him until the coupon went through. I also don’t think he could have accepted it until the coupon went through no matter who paid.. it’s a waste of unnecessary money.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "People are often more in love with the idea of love, than the person they're with. In this case it sounds like she's more in love with *his title,* than him as a person.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 110,
          "content": "Exactly! If I had a coupon for a buy one get one, I’d wait for the restaurant to process it! He wasn’t being rude. And the shirt on clearance is a good deal. Doesn’t make him a cheapskate",
          "id": 158,
          "comments": [
            {
              "score": 10,
              "content": "Im confused why the restaurant couldn’t just manually do it and save everybody time. OP is still the ass tho.",
              "id": 159,
              "comments": [
                {
                  "score": 6,
                  "content": "It mightve just been the cashier didn't know how, it's hard to say",
                  "id": 160,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "Exactly! YTA. It sounds like he plans and pays for dates and wants to let others know about a good deal. And OP was embarrassed but not so embarrassed that they wanted to just pay for the meal.",
          "id": 161,
          "comments": [
            {
              "score": 7,
              "content": "Imagine wanting to save money, real men don't spend less than £150 per sock. If I had to walk around on inexpensive fabric, I would be mortified, MORTIFIED I SAY!",
              "id": 162,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I was thinking they never did ANYTHING because he was a cheapskate. I'm imagining this guy rolling in money, just staying home in old clothes and watching VHS he saved from his childhood. It sounds like he SPENDS money, he's just aware of where and when. They were getting dinner and a movie! He's making the most of his money and that's an admirable trait.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "If someone told me they got something really cool on clearance, I would have congratulated them.  I don’t get the embarrassment.",
          "id": 164,
          "comments": [
            {
              "score": 5,
              "content": "My favorite jacket was a clearance buy. I've gotten a lot of compliments on how it's a great color on me, and, when I proudly tell people I only got it for $15, everyone's been like, \"Wow, that's great!\"\n\nSomeone rolling their eyes at my excitement about my great deal jacket would be a bit of a red flag to me. Can't OP just let her BF be happy about being frugal?",
              "id": 165,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I’d ask if they had more in stock in my size.",
              "id": 166,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "It’s the best! I needed a smart coat for the winter and with a gift card and very well timed sale, I got a designer coat for 80% off. It’s one of my best buys and I will proudly share the steal that it was 😂",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "Here I am having been raised poor and feeling guilty if I buy something full priced even though I can actually afford it now 😂",
          "id": 168,
          "comments": [
            {
              "score": 5,
              "content": "My folks never ate out unless they had a coupon, even at Taco Bell.",
              "id": 169,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "God forbid, OP’s boyfriend decides how he spends **his** money…",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I love bragging about getting a deal.",
          "id": 171,
          "comments": [
            {
              "score": 7,
              "content": "My favorite thing is when someone compliments my clothes and I proudly answer “ I got it at Goodwill for 3 bucks” I think it’s also the pride of the hunt.",
              "id": 172,
              "comments": [
                {
                  "score": 4,
                  "content": "Yep! Either a gleeful reply of “goodwill!” Or telling them where I got it on clearance and then I start offering unsolicited tips on clearance shopping lmao",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "That’s such a good point! 🥉",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "OP strangely correlates wasting money with status.  Which is stupid, but irrelevant.\n\nOP, you can’t be an asshole for feeling something.  Emotions are amoral.  You can only be an asshole for what you *do*.\n\nSo to the original question, no, you aren’t an asshole for feeling embarrassed.\n\n…you’re an asshole for starting a fight over it, tho.  Seconding the comment above, if it’s that important, you pay for dinner.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "$20 is also a bit high for me honestly.",
          "id": 176,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2579,
      "content": "YTA \n\n\nI spent most of the post thinking N A H. But you're just really judgy of him. There's nothing embarrassing about mentioning a good deal on a shirt that someone complimented. \n\n\nIf the coupon was valid (ie: he wasn't trying to get them to honor an expired coupon or get something different), he is entitled to the deal they advertise. Maybe the cashier could have asked him to step aside and rung up other people while waiting for the manager, but this wasn't his fault, it was the restaurant. \n\n\nAlso, I missed the part where you were \"so embarrassed\" that you just paid the bill, instead of walking away.",
      "id": 177,
      "comments": [
        {
          "score": 324,
          "content": "Exactly this! When I have people compliment me on something I’m wearing, I’m always super honest about where I got it and for what great price! I once had a lady tell me my earrings were stunning and they must have cost thousands right? I said no, I got them on clearance at this place for less than 10 dollars. She then said “you shouldn’t tell people stuff like that.” It rubbed me so wrong! You don’t have to buy brand or expensive things to make anything look good! It’s about walking with confidence and poise;)",
          "id": 178,
          "comments": [
            {
              "score": 157,
              "content": "Like a decade ago, I told a guy that I liked his skirt. His response was \"thanks, it was $10 at Burlington.\" This exchange stuck with me because it was like \"this is my people. \"",
              "id": 179,
              "comments": [
                {
                  "score": 16,
                  "content": "When my husband and I went on our first date, I went fully expecting to pay my share.  When the check came he offered to pay.  I said thank you, paused a minute and then said \"I have a coupon if you want it.\"\n\nIt was really hard for me, because the devil on my shoulder was telling me that using a coupon on a first date was super tacky.  While the angel was telling me that it would be wrong to keep the coupon and make him pay more money for the food.\n\nI finally decided that if he found my frugality tacky then it was best to find it out on the first date, because it was the way that I lived.  \n\nIt turned out that he had grown up really poor, and he was also very frugal, and so we've spent the last 13 years living frugally (and happily) ever after.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "The best part about buying something on sale is getting to tell unsuspecting complimenters that you got it on sale\n\nIts a fundamental part of the experience",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Man, people are so obsessed with prices. If it looks nice, it looks nice. Why does it have to also have a high price tag for it to be admired?! Does it make you cheap because you saw nice earrings for not much? Does the earring look worse now the price is known to be lower than expected? No, obviously not!",
              "id": 182,
              "comments": [
                {
                  "score": 10,
                  "content": "Ba some people value spending money, brand names, etc. I dated a guy that was broke in my early 20’s bc he spent every penny on his clothing and car. He scrambled for rent every month and that blew my mind. I shop clearance or thrift and he once joked calling me white trash. Keep in mind I came from upper middle class and he was considered a much lower class. He truly thought he was happier with expensive things, and that was ok. He just wasn’t for me bc I value saving money, financial responsibility/literacy. We all just care about different stuff 😜",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "One time I was with my somewhat well-off ex BF's family and his sister complimented my top. I told her the thrift shop I got it from and the room turned uncomfortably quiet for a minute. Bf was super embarrassed and apparently his sister asked him afterwards if I used to be homeless or something. People who haven't struggled just don't understand.",
              "id": 184,
              "comments": [
                {
                  "score": 9,
                  "content": "That’s sad and funny. Sounds like his family was snooty af. If they are judging you based off of that, I’m glad you ran!! No thank uou",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Always thought it was a small part of the female experience (where I am) to let someone know if the thing they complimented you on was affordable or on sale. That and the dress also has pockets. Like, hey this thing you like is totally attainable! I’ve felt so bad when people have complimented something I wore and asked where I got it, but it was a gift or thrifted so they can’t go get one for themselves. \n\nYTA, op. If I compliment someone with VP money on a shirt and they tell me the shirt was affordable, I’d be happy because I could go look like a VP on my much lower salary.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "As soon as she said she was mortified about the shirt thing she lost me.",
          "id": 187,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "We all missed that part.",
          "id": 188,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Lol. The irony of saying ‘I was so embarrassed by this cheapskate I just left and waited for him to finish paying for my dinner’.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": ">Also, I missed the part where you were \"so embarrassed\" that you just paid the bill, instead of walking away.\n\nThis, yeah. Also, OP never mentions where they go on dates when she pays. I wonder why that is...",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Exactly. I absolutely don’t get her embarassment over a shirt on sale. I have a shirt that cost 2 dollars and whenever someone compliments me on it, the first thing I say “it is crazy, I managed to find this for 2 dollars”. If anyone gave me crap for that, I’d know who to cut out of my friend circle.\n\nHopefully OP will break up with her bf since he deserves better.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I’m wondering what life was like growing up. People who know what its like to struggle typically value money more regardless of what they presently make cause they know the future ain’t guaranteed.",
          "id": 192,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I think Kanye and Jamie Foxx had a song about OP. Gold something....",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Being judgy is arguably being an asshole tho?",
          "id": 194,
          "comments": [
            {
              "score": 4,
              "content": "I meant that I originally thought that maybe she just had a different way of thinking and was frustrated and didn't quite climb to AH level. But when I realized how judgy she was, I knew she was an AH. The behavior at the restaurant just blew the top off.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1259,
      "content": "NAH. You are just not compatible.",
      "id": 196,
      "comments": [
        {
          "score": 779,
          "content": "I dunno. I think OP more or less ragging on her boyfriend for being a bit frugal is a bit of an asshole thing to do. Like, being \"mortified\" that he was slightly bragging about a good deal? That's ridiculous",
          "id": 197,
          "comments": [
            {
              "score": 786,
              "content": "He’s not a “bit frugal” though, he’s extremely frugal. Which is valid to be a good deal of the time and she shouldn’t degrade him like she did but for him to obsess over it in almost everything they do and publicize it every chance he gets also seems excessive to me on his end. I think it’s more NAH that they’re just not compatible in terms of goals or lifestyle.",
              "id": 198,
              "comments": [
                {
                  "score": 221,
                  "content": "It must be so exhausting to have to shoe horn your life into a deal. \n\nYou can never pick a restaurant because it sounds good, it has to have a coupon. You can never buy a shirt just because it looks nice. Can you buy a book you want to read, or does it have to be on sale? Can she buy the things she wants, or does it come with a lecture about “being fiscally irresponsible” and how she should have waited for a discount. What about if something in their house breaks? Do they just live that way until he can find a coupon for a repair service?\n\nI feel like people are falling for some red herrings here. There’s nothing wrong with being excited about a compliment and alerting the complimenter that *it’s even better than they thought* because it was on sale! - or at least not in a vacuum.\n\nThis guy won’t replace his socks without a coupon, so I’m guessing that her nerves are just absolutely frayed hearing about deals all the time and it’s turned into a bitch eating crackers scenario for her.",
                  "id": 199,
                  "comments": [
                    {
                      "score": 25,
                      "content": "reddit is full of people with a great appreciation for frugality and no appreciation of social embarrassment. NAH OP, it's fine to break up with somebody because they're creating an embarrassing scene for the sake of saving $50-100 out of their VP salary and then fighting with you about it",
                      "id": 200,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "You can never buy such person a present just because you thought they would like it, because they will immediately Google how much it costs and evaluate if it was a good deal.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Also, and I say this as an EXTREMELY frugal person who’s also had to live through some hard shit…\n\n…You will make people feel like they aren’t worth the price of anything. Like they don’t deserve for you to give them anything.\n\nLike they aren’t worth the food or the clothing or the shelter…just basic necessities, even!\n\nYour wife/husband. Your own **kids**.",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 212,
                  "content": "I mean, the things she was \"mortified\" over are ridiculous. I can't tell you how many times I've seen someone mention they got a great deal on their shirt or whatever after being complimented on it. The whole thing with the coupon was ridiculous, too. Of course, they should honor it if it wasn't expired and stuff. Op is just extremely judgy and cares way too much about appearances, which is why bf has money, and she clearly doesn't.",
                  "id": 203,
                  "comments": [
                    {
                      "score": 679,
                      "content": "Coupons here and there are fine. I was raised by a man like op bf. It’s really exhausting. It isn’t about the restaurant coupon. It’s about the fact that all day long every interaction is driven by coupons and freebies. It sounds savvy or fine but it will drive you batty",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "No they're not. I would be embarrassed in those situations as well.",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "There is a difference between getting a deal on a shirt, and only buying things if they’re on sale",
                      "id": 206,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "She was probably mortified because he won't shut up about it in general. If he randomly mentioned he got it on sale, it probably would go unnoticed, but since she probably hears him comparing prices and bragging about deals all the time, she's hyperaware of it.",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 154,
                  "content": "This. I think OP is kind of an asshole for being mortified by him bragging about the shirt being on sale, but I also would be embarrassed by him holding up a line for a coupon (unless there were severe financial reasons). \n\nI can't imagine having a kid with someone that frugal. There's a difference between cutting some coupons, and \"that.\"",
                  "id": 208,
                  "comments": [
                    {
                      "score": 58,
                      "content": "And it obviously wasn't a nice restaurant, it was a fast casual where you still pay at a counter like a Bob Evans.",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "It seemed like the bigger deal was inconveniencing a bunch of people in a busy line.",
              "id": 210,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I think it’s more than a bit frugal considering he only eats what he can find on sale and any activities he does is based on whether or not he has a coupon for it. \n\nI would call myself a bit frugal… I buy things I regularly use like toiletries, toilet paper, tissues, cleaning products etc ONLY when they’re on sale because the brands I use regularly have good deals so I stock up and have never needed to pay full price. I often compare weights on products like oatmeal and I price match for expensive foods like meat to other shops. But I absolutely don’t limit my whole life to whether or not I can get what I want on discount. That’s totally extreme.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "A bit? Lmao … I think her judgmental tone is uncalled for but don’t tell me you’d be fine with someone refusing to go to dinner or on a date without a coupon… forget trying anything new or family owned at that point, where I’m from… good restaurants don’t run 2 for 1 specials… he takes it too far holding up a line and refusing to do things with his partner unless they’re at a discount… I am not by any means outside of the lower class but if my boyfriend and I plan a date night it certainly won’t be based around coupon clippings…",
              "id": 212,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "A bit frugal.  \n\nHe plans his meals based on what's on sale at the grocery store. He's extremely frugal and that's not gonna be for everyone. But she sold probably communicate her issues with him better.",
              "id": 213,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I think OP needs to be less uptight. But I also have met extremely frugal rich people and they can be insufferable lol. \n\nPeople are viewing situations like this through the lenses of regular people, but at a certain level of wealth this extent of extreme frugality has little to no impact on their finances, so it’s either performative or indicative of a mental disorder.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He’s not a bit frugal. He’s inflexible and extreme",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This isn’t a bit frugal.  I was on his side till the restaurant tantrum.",
              "id": 216,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "\"a bit frugal\" is a far way off from \"my lifestyle revolves around coupons\"",
              "id": 217,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 97,
          "content": "Yeah I'd agree with this. Two people together who are frugal like the bf end up having so much more in life because they are smart with money, and 2 people who are happy to pay more to have an easy life generally get by fine aswell, but 1 of each type can be a huge point of contention in a relationship.",
          "id": 218,
          "comments": [
            {
              "score": 120,
              "content": "My best friend and her husband are like the BF in this story. They have two cars and own their 3 bedroom house (owned outright) but haven’t taken a vacation in 10 years or ever left the country.\n\nMeanwhile I’ve seen every continent and eaten at many Michelin star restaurants but don’t own any property (not even a car). I have enough in the bank to be considered responsible but not enough for their house. \n\nWe’re all pretty happy with our choices and we’re great friends but we couldn’t live each other’s lives. She values the security of owning property and would have a panic attack if she owned what I own. I value having spent my 20s exploring the world and would be clinically depressed by the day to day monotony and scrimping and saving all the time in order to… keep doing that for the next 40 years. Everyone is different.",
              "id": 219,
              "comments": [
                {
                  "score": 45,
                  "content": "I love how you put it. Some very frugal people might even judge your lifestyle, but that’s a no regrets outlook I can respect. If I leave this earth place tomorrow, it would be nice to know I tried a lot of things that made me happy.",
                  "id": 220,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "My husband and I are both frugal.😆 We be cheap.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "They really don't sound compatible. I wouldn't want to be with someone who makes a good living and yet is literally unwilling to go to a restaurant or buy ingredients for a meal at full price. Saving money is great but I want to live my life. OP, he's not going to change, and that doesn't make him a bad person but if it bothers you then there's no future here.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Exactly. OP is not a values match with her boyfriend. He needs someone who will be excited and proud when he gets a deal. Someone who will be frugal with him. She needs someone less fixated on saving a few dollars and more excited about her. It sounds like she'd also appreciate someone who doesn't talk as openly about money. People are raised differently in that. NAH.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "Same NAH. His behavior seems like a compulsion and not just being frugal. The issue is the rigidity of it that he couldn’t just pay for the second meal to make the evening go smoothly (though I also think she could have paid as a solution too).\n\nIt’s not that he just likes to save money, it’s that he will only go places and do things with her that he can get a deal on. She probably feels like that is more important to him than the actual time spent with her. Wanting to save money is a responsible trait, but not being able to do things or buy things unless it’s discounted is exhausting when you don’t *have* to live that way. If I had to guess this is a learned behavior from his upbringing. \n\nOP and him just don’t mesh.",
          "id": 224,
          "comments": [
            {
              "score": 8,
              "content": "Yeah, it's the focus on discount specifically that would drive me crazy. Like, many of my favorite restaurants are dirt cheap (I work near Chinatown and MAN can you get a good meal for under $15 if you know what you're doing, under $10 or even $5 if you're not that hungry), but they don't offer specific deals.",
              "id": 225,
              "comments": [
                {
                  "score": 6,
                  "content": "100%. there are a lot of things in life that is worth it from a simple cost-benefit analysis that doesn’t require a deal at all. also there are deals and sales all the time that specifically trick people into thinking they’re saving money when they actually aren’t. anything over moderation isn’t healthy and this is no exception, only spending money on deals sound like an obsession",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "They are just not compatible NAH",
          "id": 227,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "You can be non-compatible while also not shaming your partner. She's an AH for how she treated him. If her values and image are so important why didn't she just pay so it wasn't a scene?",
          "id": 228,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1102,
      "content": "1. Are you ever digging into your own pockets to show him that you don’t mind spending money on him?\n\n2. If his clothes are a big deal to you, have you ever bought him a nice shirt to show him that the quality or look is better?\n\n3. You’re very proud that he is a VP, are you more proud of his job title than him?\n\n4. You ever think that sometimes people might have other things going on in their life that they need money for and might not want to share it with someone he’s known for like 4 months?\n\n5. You ever think that maybe sometimes people are just incompatible?\n\nYou sound like YTA!",
      "id": 229,
      "comments": [
        {
          "score": 237,
          "content": "She was probably fine with his frugality at first because she assumed “he will have more money to spend on me.”",
          "id": 230,
          "comments": [
            {
              "score": 13,
              "content": "I bet if they ever got to the point where an engagement ring comes into the picture, he's gonna shop around and get a hell of a deal on it and she'll have a problem with it.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 168,
          "content": "The fact he spends money like that is *why* he’s the VP lol",
          "id": 232,
          "comments": [
            {
              "score": 32,
              "content": "That's not how VPs are chosen, lol",
              "id": 233,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "How do you think people become VPs?",
              "id": 234,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "At risk of sounding like an asshole myself, if I were privy to a lot of money, I probably would “test” potential partners by going to cheaper restaurants and taking advantage of sales, simply so I can see if this person is in it for me, or in it for my money.",
          "id": 235,
          "comments": [
            {
              "score": 9,
              "content": "I think there would be some value in that if you are holding Elon Musk money. Being a VP is ok money, not let’s have kids and I can live off your bank account for three generations type of money.",
              "id": 236,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 812,
      "content": "INFO: Do you ever pick up the tab?",
      "id": 237,
      "comments": [
        {
          "score": 266,
          "content": "Oooohhhhh this is a good one. If she offered to pick up the tab and he still insisted on using a coupon, it would be weird. But my guess is she doesn’t pick up the tab ever.",
          "id": 238,
          "comments": [
            {
              "score": 92,
              "content": "‘Cause he’s a VP….lol",
              "id": 239,
              "comments": [
                {
                  "score": 121,
                  "content": "Which means absolutely nothing by the way. It’s just a title. My company uses VP as the title for the first level of manager lol",
                  "id": 240,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Ha! Shes done her homework into how much he makes by asking her friends. Sounds like she thought she was gonna lead a glamorous life. This is what happens when you try to get with someone for money. It always backfires somehow. Lol",
                      "id": 241,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah. I’ve known a handful of VPs that make less than 100k, definitely doesn’t mean he’s rich.",
                      "id": 242,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Since she said they only go out to eat when he was a coupon, I'm guessing she expects him to pay each time. If she wanted to go out more and didn't want to wait for him to find a good deal, then she should be planning and paying for their dates!",
              "id": 243,
              "comments": [
                {
                  "score": 8,
                  "content": "I've treated bf to a decent meal (we're talking Longhorn Steakhouse-- and not the filet mignon) when I realized I had the cash accumulated. Neither of us has a lot of disposable income. He does want to be the provider, but I refuse to let him be the *only* one who pays for fun stuff. And he doesn't mind, as long as he knows i value him just the same as I always do.",
                  "id": 244,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Would it be weird though? If I picked up the tab and my partner insisted I use a coupon, I'd kind of think it's thoughtful. Why not save a few bucks? 🤷🏼‍♀️",
              "id": 245,
              "comments": [
                {
                  "score": 5,
                  "content": "It be weird if he insisted after she said no. There are people out there that don’t want to use coupons for stuff. They may be self conscious about what it looks like. That’s on them. But if he’s getting a free meal and he makes a fuss about her not using his coupon, that’s just weird.  She can use her money how she wants just like he can save his money how he wants.",
                  "id": 246,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "Or pay her own meal.",
          "id": 247,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 542,
      "content": "NAH. You guys are just incompatible. He's not wrong for wanting to save, you're not wrong for not wanting to hold up a gigantic line of people for a coupon. Just different life approaches. And you will drive each other nuts with this if you don't discuss and come up with a compromise. Maybe his clothes and groceries are free for all couponing, but occasionally dinners out can be full price.",
      "id": 248,
      "comments": [
        {
          "score": 125,
          "content": "If she didn't want to hold up the line, she could've offered to pay for the food. It doesn't sound like she ever pays when they go out to eat, since she said it only happens if he has a coupon. If she's so embarrassed by this, then why isn't she picking up the bill?",
          "id": 249,
          "comments": [
            {
              "score": 174,
              "content": "Everyone is calling op a gold-digger but they were at a restaurant with a cashier. It’s not like this lady is expecting 5 star dining. Shes embarrassed the guy made a scene.",
              "id": 250,
              "comments": [
                {
                  "score": 62,
                  "content": "I've been thinking this the whole time I've been reading the gold digger comments, but that also makes the questions about why OP doesn't just pony up for the second meal even more salient.",
                  "id": 251,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Could be the principle, this guy insisted on this place because he had a BOGO coupon. Maybe she did offer but he was adamant about using his coupon.",
                      "id": 252,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 75,
          "content": "Many suggested already why didn’t she say honey I got the meal and next time we work on your coupon authorization in advance. Nah",
          "id": 253,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 55,
          "content": "He's not holding up the line, the restaurant is. If they are that concerned about the line they can just honor the coupon and move it along, if they insist on verifying it, then let them wait.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 454,
      "content": "NTA.  People are leaving comments like \"I didn't grow up rich, so I get this guy.\". I didn't grow up rich either (not even close), but I did grow up with a sense of pride.  My Dad was very clear that we were worth as much as anyone else and we do not accept hand-outs.  I understand that being aggressively cheap can be really damn embarrassing.\n\nI had a boyfriend like this for a while - would try to haggle with everyone and get a deal for everything and such, and it did annoy and embarrass me.  Getting a good deal is great and there's nothing wrong with it, but making every decision based on what is cheap *especially * when you don't need the money just makes it seem like you don't value the person you're spending it on or like you're impoverished and desperate.  When you're super vocal about it and doing things like bragging about it, arguing about coupons, and haggling, it seems like you're loudly advertising the fact that you're money-insecure, which is not a great look, IMO.  I once had that boyfriend leave me alone in a restaurant for an extended amount of time to go back to our hotel room and search for a coupon for that restaurant which he couldn't find and thought he had left behind.  He couldn't find it and then tried to talk the waitress into accepting it anyway while describing it.  The coupon was for like $2 off!  I was mortified.  I just wanted to pay and leave and it ended up leading  to a fight, so I totally get where you're coming from.  \n\nAnd before anyone makes any asinine assumptions; no, I am not a gold digger.  I make plenty of my own money, pay for every-other meal of everyone I've ever dated, and otherwise split expenses 50/50 down the middle.\n\nEDIT: Just FYI For all you binary thinkers out there, there is such a thing as moderate thinking left in this world.  Just because I think there's a line someone can cross which goes beyond being frugal and into being miserly doesn't mean I think someone should never use a coupon or wait for a holiday sale day or tell themselves \"no\"; geez!  One can take literally ANYTHING too far.  You can take eating healthy too far, you can take gift-giving too far, you can take any relatively positive thing too far.  Just because someone doesn't want to eat only unsalted homemade vegan raw diet meals, for example, doesn't mean they only eat fast food and hostess snack cakes.  There is such a thing as a middle ground.   Is this really such a foreign concept?  Likewise, just because I would find it cringe-worthy to haggle and fight stores on their coupon policies on a regular basis does not mean I'm living paycheck-to-paycheck, engaging in conspicuous consumption to impress people, and not saving for retirement.  And same for OP.",
      "id": 255,
      "comments": [
        {
          "score": 334,
          "content": "I’m glad I finally found a comment like this! My Dad is exactly like OPs boyfriend and I don’t think people actually understand this behaviour. It’s not as simple as ‘oh he’s saving money and being frugal’. It’s almost obsessive. I think people have also missed the part that this guy is wealthy, it’s not about necessity.\n\nFor example someone commented about how it’s good to plan meals around what’s on offer - this isn’t what’s happening lol. Meals will make no sense, you can’t plan if your just going to eat whatever was reduced at the supermarket today.\n\nI also don’t think people appreciate how frustrating this is when EVERY decision is based on this. Want to meet up for lunch for something nice to eat? No, find the cheap sandwich shop or use a voucher for a free drink. Nothing is done based on enjoyment, and it’s miserable! I’m not talking about being able to afford it either, people absolutely have to live within their means, but that’s not what is going on here.\n\nI can absolutely understand why his behaviour is frustrating you. I don’t think you need to be embarrassed by most of his behaviour, (apart from things like the restaurant queue/coupon) that is a bit AHly, but overall I get how you are feeling. I don’t have any advice though sorry lol",
          "id": 256,
          "comments": [
            {
              "score": 119,
              "content": "I felt insane reading all the comments until I got to this one and the related dialog.  Reddit really does have trouble parsing situations in greyscale.",
              "id": 257,
              "comments": [
                {
                  "score": 59,
                  "content": "Same. The top comments don’t understand how draining it is to have to deal with someone who can’t spend money unless they feel like they are getting a deal of some kind. Like the objective isn’t to just enjoy dinner with your spouse, it’s to fill up with calories for absolute minimum cost. The enjoyment for this type of person is how much below the normal cost the bill is, not quality of the food, not service, or even time spent with loved ones.",
                  "id": 258,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I couldn’t agree MORE with this comment! I grew up this way. Everything, and I mean everything is about the discount/deal, not the experience. Being frugal is good…obsessive is not. The fights within the family about spending on anything & everything was horrible. If you are not compatible regarding finances, it’s a LONG difficult road. And the people saying she should have offered to pay, that would have SO angered my dad. Its about the coupon & saving money, and NOT paying full price no matter who pays. He would have literally been so mad had my ANYONE offered to pay. I once got caught throwing 2 extra bucks on a waiter’s tip, and oh boy he was pissed! I was so embarrassed bc he did take the money off the table! Holding up lines, making people wait, haggling was my entire life growing up…still is LOL it is embarrassing!",
                      "id": 259,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I think it's just a lack of experience with certain things. Like, not everybody has known someone like this or read/watched a video about the miserable side of this, so they don't understand it.",
                  "id": 260,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "noxious political engine workable smell nail hateful innate murky salt\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 261,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I’ve been with that boyfriend too and broke-up with him - it was too much and embarrassing. And this is coming from a person that grew up poor - electricity getting cut off, evictions, landlords chasing my parents for their rent money. \n\nAs an adult, I’m frugal and this boyfriend mortified me.  One time we were at a grocery store and he pulled out a bag of coins to pay $100 in groceries. I went and hid in the back of the grocery store. And look, till this day I collect my loose change but at least I will take it to the bank to get bills for it.  \n\nNo one understands until everything you do and eat is impacted by this extreme frugality. And the desire to make a scene or disrupt others to make your point. It is  frustrating to be with this type of partner. So OP NTA in the slightest",
              "id": 262,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yes frugality is a great sign but what she’s describing is borderline compulsive *if she’s being accurate*. He won’t do anything unless he’s getting it on a discount. \n\nImagine never going to a concert for a band you actually like or a stand up show for a popular comedian because tickets aren’t cheap enough and there’s no deals to be had, even though you’re flush with cash.\n\nAs with all things, there’s a balanced to be achieved. It’s good to be as frugal as possible, but it is important to recognize that some wonderful experiences can’t be bought at bargain prices. And if you decide you never do things if there’s no bargain, you’ll miss out on a lot.",
              "id": 263,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Omg you hit the nail on the head! I have the same dad and what was worse was he had a really booming voice and loud temper and fought my mom over every penny he thought she wasted. Grew up walking on eggshells because he could blow up at any time. He’s the type of person who would boast about getting free lunch and dinners from abusing Costco’s free samples. I hated it then and still hate it now. Living and growing up with someone like this is terrible.",
              "id": 264,
              "comments": [
                {
                  "score": 3,
                  "content": "I SO can relate!!! Every single word! Let me guess, you dad is a bad tipper too LOL  My dad should be enjoying his golden years, instead he stays at home & hardly turns the air conditioner on bc it costs money!",
                  "id": 265,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 182,
          "content": "This is the only sensible comment. OP literally said she’d be fine if it was sometimes or even most time, But the dude is Extreme.",
          "id": 266,
          "comments": [
            {
              "score": 131,
              "content": "distinct pie pot rotten scandalous rhythm bedroom soup long muddle\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "id": 267,
              "comments": [
                {
                  "score": 46,
                  "content": "Yep I have a friend like this and you will experience uncomfortable moments with them. My friend has gotten into full blown spats, calling up management, etc just to get their deal which may only be a couple bucks! That does get embarassing! Idk if OPs boyfriend is that bad or not but he very well may be since he uses a coupon or deal everywhere he goes.",
                  "id": 268,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "They were going to the cinema because he got free tickets! I wonder if he would ever pay full price for a movie.",
                  "id": 269,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Ever seen Extreme Cheapskates? I can't even watch that show without getting angry at them (though admittedly some of it is staged). Imagine living with that.",
              "id": 270,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "Thanks for being the only sane commenter. My dad is like OP’s boyfriend and it ruined my parent’s marriage. It’s just not worth making your partner feel like shit.",
          "id": 271,
          "comments": [
            {
              "score": 15,
              "content": "NTA. My grandparents divorced because my grandfather was like this. It drove everyone nuts.",
              "id": 272,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "Gotta love all the comments that went straight to assuming OP was a golddigger. Because? Like so many AITA posts, everyone is coming here and commenting based on their own experiences. OP is going to sound like a reasonable person or a villain simply based on how we experienced someone like them.\n\nTo some people, the deal is about winning some sort of invisible game. Who doesn’t love a good sale at the grocery store? But if you refuse to cook the dish that you were both really excited to make because you can’t find a curry on sale, that’s going to grate on a lot of people’s nerves.\n\nSame with mentioning a shirt. We all love a sale, but most of us don’t care about the shirt you got for half price. Like I really don’t care if you spent $5 or $150 on your t-shirt. Sometimes, people do some impressive couponing or find something amazing at a sample sale, but usually a shirt on sale is unremarkable. If OP’s bf is mentioning this all the time, the embarrassment might not be just from saying it’s on sale. It could be more of a “read the room” type thing or just being sick of hearing it.\n\nI dated a guy (who was also insanely cheap with my money and controlling about it) who had to tell everyone he grew up on a farm. Sometimes it was very relevant and even added a great detail to the conversation. Other times, not only was it irrelevant, it came across as virtue signaling. So I could also see embarrassment stemming from something like that if her bf mentioned it at a very weird time.",
          "id": 273,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "I'm with you on this one. I grew up poor but earn well enough now that I don't need to worry about only getting food on offer. I go out for nice meals and don't worry about the price. I couldn't be with someone penny pinching to the extreme that what we cooked at home was based only on things on offer (or yellow sticker super cheap bit where it's all about to go off). It sounds mentally draining to live like you only have £5 in your pocket when you don't need to.",
          "id": 274,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "Agree with this. Everyone calling OP a gold digger and ungrateful is missing the point. You're not annoyed he's not spending on you, you're annoyed he's making a big stink to save a few bucks. It does sound like you might be incompatible, though.",
          "id": 275,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Finally found a sensible comment lol these ppl don't understand how frustrating it is to be around someone who only wants those deals and will basically ruin everything until they get it which he seems to be doing",
          "id": 276,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "marvelous imminent chop expansion vase hunt wipe society vegetable public\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "id": 277,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Finally found a more sensible response here. Everyone quick to call OP a gold digger. Maybe she is, idk. But from the info we got the boyfriend is obsessively frugal. Being frugal is fine. Wanting to save money wherever you can is fine. To have it dictate practically every purchasing decision seems kinda asinine. It’s an extreme.",
          "id": 278,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 290,
      "content": "YTA\n\nI’m always amazed that people don’t base their cooking on what is on sale at the grocery store or buy meat in bulk and freeze it.  It’s at least 30% and perhaps 50% cheaper that way.  So certainly nothing wrong with that.\n\nThe restaurant one I find weird.  If you are going out to eat rather than cooking at home you are already blowing the food budget out of the water so just go where you get the most enjoyment.  But again if he wants to save money that’s fine.  It shouldn’t be embarrassing for someone to use the items the restaurant provides.\n\nI’m with him on clothing as well.  Why would anyone ever pay retail for any clothing?  Especially men’s where style changes much more slowly than women.\n\nSo I think you are over reacting by being embarrassed and therefore are the asshole in this situation.  Have you considered why you find being frugal embarrassing?",
      "id": 279,
      "comments": [
        {
          "score": 74,
          "content": "I mean like with anything there's a limit. Being frugal and using smart tricks to keep costs down certainly is smart. But it can be obsessive. For example I remember a time in my life where I tried to pay as little as possible for every single thing even though financially it didn't have to. However it was to such an extent that I wouldn't buy/eat/do things I wanted to do just because they weren't the cheapest option available. Like I'd see a cheap snack in the grocery store and crave it so bad. But would instead buy something a few cents cheaper just to save money.\n\nFor example let's say there was a plain and a flavoured hummus. The flavoured hummus looked amazing but was slightly more expensive. So I'd never buy it. And if I did I'd feel guilty about the 'wasted' few cents that the flavoured hummus cost extra.\n\nOr there'd be an aged or an unaged cheese. I LOVE aged cheese. But wouldn't buy/consume any for years because unaged was cheaper.\n\nBeing frugal and thrifty is great! But spending money on yourself isn't always money wasted. Even if it is just something like getting some name-brand snacks or soda once in a while or just going to your favourite restaurant even if you have a coupon for the place next door. You can try and be reasonable with your money and still live life to fullest by splurging on small 'unimportant' things that bring you joy.\n\nLike in all things there needs to be a balance. And being too obsessive can become extremely restrictive and mentally draining.\n\nPersonally what worked for me in this regard was set up a budget. Yes I could live off of 1 pound a day of food if I needed to. But I sat my budget at 4 originally so I could enjoy a greater variety of food, splurge on my favourites, etc. And my budget was still an amount I found reasonable. Which meant that even my 'splurges' didn't leave me guilt-ridden or in fear of 'wasting' money. Because every cent I spent wasn't money out of my savingsaccount, it was money that needed to be spent this month on food! It was NOT going into my savings either way. If I had any leftover at the end of the month it would just get added to my grocery budget for next month.\n\nThat being said OOP's concerns really don't seem to focus on the right thing. She isn't concerned about his well-being or whether his need to 'save' money by getting deals is constrictive in an emotional way and keeping him from enjoying himself. If she genuinely felt worried about his behaviour/habits and feels they are too restrictive she should have brought those things up to him. Not as her primary concern being social embarrassment but concern for his well-being. In this way he might have either been able to assuage her fears or they could have revised his spending habits together and come up with a compromise/gameplan that alleviates some of the pressure he may feel to get a 'deal' on everything he purchases.",
          "id": 280,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": ">  If you are going out to eat rather than cooking at home you are already blowing the food budget out of the water so just go where you get the most enjoyment.\n\nIt's not blowing your budget if you planned for it. Or it wasn't before they doubled the price.",
          "id": 281,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}