{
  "post content": "I currently work in an office of 14 people.  Since I mainly work with clients in a different time zone, I come into the office a bit later than every one else.  Their office hours are 7:30 am to 4:30 PM, I am 12pm to 9pm.  Because of that I started to pickup lunch for some of my coworkers on my way to work.  What started off as a nice thing for 1-2 people turned into most of the office giving me their orders.  I had 3 rules.\n\n1) Only one restaurant a day, all orders had to come from that location.\n\n2) I would not go to 2 restaurant, out of moral principles, these are forbidden restaurants, and no order to them will be accepted.\n\n3) Your order will be rounded up to the nearest dollar + $1.  If your order was $7.28, it would be $9 for me to pick it up.  Still way cheaper than any other service out there. Cash on lunch delivery or prepaid for the week will be accepted.\n\nFor the most part I had no trouble with these rules. Except for 1 coworker and the vice president.  They both would want me to go to one of the restaurant that I would not go too.  Every week I would explain I do not buy from that company.  Every week they would try to get me to go there. \n\nNow this drama started on Friday.  After I came in and gave everyone their orders I was called into the office with vice president and told that I am bulling and excluding coworker form my little \"lunch club\", and must included him in it by going to the forbidden restaurant. I told them I would solve the problem, but explained that Saturdays orders were already in, and Monday is when the change would happen.\n\nWell on Saturday, after I dropped off the orders, I canceled the \"lunch club\" in a company wide email.  Stating the facts, that I am being forced to add forbidden restaurant by vice president to my pickups, and I can not under my moral and religious fiber I can not support forbidden restaurant, so effective immediately, the \"lunch club\" is disbanded, and Monday everyone is on their own with their lunch orders.  I will refund any money that is left if the orders were prepaid, and to see me Monday to get your money.  I do not pickup lunch on most Sundays.\n\nWell half the office supported my decision, and the other half is PO'd at me for stopping the service.  It was a huge time saver, and pretty cheap since I picked up the orders on my way to work for them. \n\nI never really made a lot of money off of this, maybe enough to cover my daily lunch at best, maybe $15-$16 a day on a really good day. \n\nEdits :  This is an alt account, for privacy reasons, so I will reply if I have time to, thanks.\n\nI think I maybe the Ass hole due to \n\nMostly due to the sudden stop of the service may leave some with out a clear lunch plans.  Some coworkers seem really ticked because of it, and also want food from forbidden restaurant.\n\n-----------------------------------\nEnd\n\nSome details first. I was hired mainly due that I am bi-lingual with the clients main language and know the business. So to fire me you would need 2 people to replace me.\n\nAs many of you guessed one of the forbidden restaurants is Chick Fil A. As for the second one. It is partly due me working there and having an issue with the franchise owner and not the whole franchise itself.\n\nI have no issues ordering Vegan, Muslim, or Jewish food for those who wanted it. Some of the locations I visited and picked up lunch even have those options.\n\nI emailed and spoke with the owner of the company. I am basically in the clear. For those worried about any potential raise or promotions being stopped by the Vice President (who really is just a glorified office manager who makes us call him a Vice President) That will not be an issue. I will not really be getting a promotion (there really is not currently a promotion available), but I did get a raise out of this.\n\nOnward.\n\nMonday. I was called into a meeting with VP and myself only. He told me that this was not what he meant and I need to sort something out by the end of the day or there will be \"consequences\". I called and emailed the owner about this. Refunds were given out. At this point I am holding no ones money. My lunch was a famous fresh beef burger which I ate at my desk.\n\nTuesday. I had a meeting with VP and owner. Owner made it very clear to VP that I am to be left alone, and I am allowed to continue my \"lunch club\" as I want if I want to. I made it clear that I will no longer be willing to do so. I had Taco Bell, not my best choice.\n\nWednesday. Businesses as normal. I ate a fresh grilled chicken sandwich and fries from Zaxby\n\nThursday. Most of my coworkers that were originally PO'd at me for stopping the service, asked me if I could start it up again. I said no, too much of a risk with VP and coworker. I brought in a bacon cheese burger + Nuggets and fries $5 special and a small frosty from Wendy's.\n\nFriday. Coworker greeted me at the entrance, called me several very racial names, and knocked my Araby's out of my hand, kicked it, and left the building. He was meet with the police and the owner and terminated when he came back from lunch. I am now allowed to work from home again, with bi-weekly office meetings.\n\nSaturday. Spent most of the day getting my home office setup again, I had a can of instant potato cheddar and bacon soup for lunch.\n\nSunday. My day off. Here given an update.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Mostly due to the sudden stop of the service may leave some with out a clear lunch plans.\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA.  You were doing this on your own time, off the clock, as a favor to them. You made, what, $1 per order?   For all the work involved in placing the orders. and making sure all the orders are right, and carrying food and drink for 14 people - that's a lot of work, for very little pay, and on your own time.  I'm surprised you did it for as long as you did.  They can either honor your very reasonable requests or they can pay DoorDash.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA.. I think every adult in your office should be able to figure out a lunch plan with 20 minutes notice let alone 2 days notice. \n\nThere is always one or two people who ruin a good thing for everyone.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. Let them pay meal delivery service fees if they want to be that picky.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA (except that it doesn’t sound like anyone was tipping the restaurant employees who put the orders together for you - not tipping is any AH move)",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "r/MaliciousCompliance",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. Your coworkers should be mad at manager and coworker for forcing you to go to this restaurant, that’s what ended this thing. Plus they felt entitled, it sounds like it became an expectation rather than a favor the more you did it tbh.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. This is why we can't have nice things.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA, don’t bite the hand that brings you food for a dollar",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. You were volunteering to do this. It was not part of your job. You had every right to discontinue it when the choosing beggars started clowning around.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}