{
  "post content": "So recently my dad (54) and mum (52) have divorced, and I wasn't surprised, however remained friends. After a week after the final divorce, my farther got  new girlfriend, (Sofía, 26). \n\nI wasn't mad but I felt like it was a little to soon, but its none of my business, how ever I told my dad I couldn't accept her as my new step mother as it was too soon and she was only 2 years older than me. He said this was okay, however he hopes in the future I can come around to it.\n\nRecently, my twins(we will call c&k, both 3) met my dads gf, however they clearly do not like her. They were asking me stuff like whos she, wheres abuela, and more.\nAfter she noticed my kids faveouriteising their biological grandmother, she yelled at me and told me I was raising my kids wrong because they don't treat her like that.  I told her they will eventually come around, however she wouldn't listen and kicked me out of my dads house. \n\nA few weeks later, me and my husband found out I was pregnant, and wanted to wait a while to tell my family, anyways, at the next family dinner, I told everyone the news. Everyone was happy for me and my husband, but especially my dad's gf. Keep in mind she still hadn't apologised for her outburst, and I still felt as I couldn't accept her, so when she started saying things such as, I cant wait for My grand baby, I felt a little uncomfortable but assumed she just liked babys. That was until she decided that if it was a girl then we should call her Elia after her grandmother or if boy then Samuel after her grandad, I told her no as I never even met them, and she was mad. She said I never took into consideration her ideas and that she wishes my stupid baby wasn't born\n\nI stormed out and messaged my dad saying I decided i will not let her see me, my kids or my baby till she apologises. \nI have gotten many angry texts from her and her friends, and one told me what she said, and she flipped the entire story.\n\nSo Am I The A-hole?\n\n\nUPDATE:\nSo I went out for coffee with my dad and sofia. \n\nShe apologised with very obvious fake tears. And my farther said he was sorry. Then I told them I will accept it however they are no to see my kids until they are oldenigh to  decide for themselves. Sofia ew up and called me a selfish whore then my dad yelled at her and broke up with her so she stormed out. \n\nMy dad told me he to was sorry and can understand why I didn't want my kids to see him for a while, truth be told I needed him next week for a Babysitter , so I said its okay \n\nHe told me how no one can talk to his \nlittle princess like she just did no matter how old i am. He also said how he was with her more for the fact of it made him feel good he could still get woth someone.\nThat was 6 days ago now and I have since seen my farther 3 times and my kids have seen him twice.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I could be the ass hole bc I didn't take the time to get to know her or her family\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Congratulations on the incoming baby, OP!  \n\n\nI'm here to tell you that you are NTA in this instance. I get wanting hard to be a mom or grandmom but those things are earned and not magically granted because you date someone with children and or grandchildren. It would've been better if she were cool about the entire thing instead of forcing the issue and throwing a massive tantrum when things didn't go her way.   \n\n\nYour decision to block out such a big stressor until she mellows down is a prudent move!",
      "id": 3,
      "comments": [
        {
          "score": 1,
          "content": "Thankyou! I tried to explain this to her that my kids will eventually respect her is she's Kinder and  respects them but she's stubborn and won't listen",
          "id": 4,
          "comments": [
            {
              "score": 1,
              "content": "She really is very, very young. She's only 26 years old, your father picked a child to be with. She is going to compete with you for your father's attention. Maybe she'll eventually grow up but chances are she isn't. Your father for some reason likes being with a child, I call her that because she's acting like a child. You can be 26 and be very emotionally developed, she sounds like a very young 26. A lot of old men like finding young girls like that!",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "She knows nothing about children. Toddlers asking where is Abuela was while visiting Abuelo has nothing to do with meeting a stranger for the first time.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I don't think she's going to listen, she sounds off the deep end. \n\nIs it possible just to avoid her? Frankly it seems unlikely that your dad will keep this relationship up long term; a the excitement of a crazy young girlfriend usually wears off and then the guy is just left with crazy.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "No she's not stubborn, she's extremely immature and childish. There's a big difference there. She is one of your peers, think about how many of your friends act like her. Probably not many. Cuz she's nuts. She has no right to demand that the kids treat her like a grandma to start with because again she's the same age as their mother. She is not a grandmother she is barely an adult.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA\n\nShe has some serious boundary issues.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Congrats on the new baby !! \nto answer the question , how does this in any way shape or form make you an asshole . Naming your kid after a random woman’s family ( sorry but a new gf to your father is literally nothing to you) would be fucking weird and she must have no boundaries to not understand that NTA",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Sounds like she's trying to cement herself in an older man's life.\n\nThat relationship is questionable at best.\n\nNTA and your dad and gf (might) be TA",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "This has to be fake. \n\nNo one considers a gf of less than a month some form of step parent. Especially when you’re close in age. \n\nAnd why does every story contain twins??? \n\nAlso she assumed after barely dating your father she would \n\n1) be considered a grandparent?\n\n2) have any say? \n\nEither you’re bored picking pieces from other AITA or she went and bought a huge order of audacity. Either way, your dad is gross and his gf is probably a psycho.",
      "id": 12,
      "comments": [
        {
          "score": 1,
          "content": "its not fake, I'm hoping its just a rebound gf, i have twins, i didn't choose and she's definitely a crazy psycho who's only with my dad for his money",
          "id": 13,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I always have to scroll way too far to find this take!",
          "id": 14,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Not to be rude but your dad is kind of sus",
      "id": 15,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "NTA.  Also, don't be surprised if you find out the 'new' girlfriend is the cause of your parent's divorce.  Why to these older men marry girls young enough to be their children and then wonder why their kids don't embraces them???  Just never ceases to amaze me.  You're NTA and it sounds like your dad's wife is very insecure and childish.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA she’s a nutcase",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA\n\nAnybody else find it weird that the GF wants to be the Grandmother?  I will ignore the age thing for now, but she isn't even married into the family, and she could be gone in a couple of weeks, why give her that type of respect, I think an Aunt \\_\\_\\_\\_\\_ thing is more appropiate, but I might be a little old fashioned here.\n\nBy the way I love how she interjected that they would be named this, kind of above her pay grade if you ask me.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    }
  ]
}