{
  "post content": "So this is a rabbit hole, and I’d like to start with I don’t care if he sleeps with men or women. Or even if he likes to sleep with both. Absolutely his business. This is more of a “bro why didn’t you tell me thing?” And surprise because I always thought we were fairly close. \n\nSo I was going through twitter and a tweet he liked popped up. I thought the video was funny so I went to his likes to see if there was more videos. As I was scrolling through his account I noticed a bit of a pattern emerging, so out of curiosity I went to see who he followed. \n\nHe followed a lot of gay porn accounts (which again is fine) but he’s always claimed to be 100% straight. I want to know if asking him if he’s not is appropriate and how do I let him know I’m cool with whatever he wants to do? Or do I just let this discovery go and see if he ever tells me by himself? \n\nI’m also scared because what if that was meant to be liked on a separate account? I don’t want him to be blindsided if someone else finds out about it because he liked it on his account where people can find him. \n\nI’m feeling conflicted. If he’s in the closet I don’t want to force him out. I’m probably horrendously overthinking this. \n\nWIBTAH if I asked him?\n\nEDIT: I’m getting mixed responses. Here’s my worry. \n\n- Homie isn’t aware that he liked the stuff on his main account. If he isn’t I don’t want everyone in the world knowing if he isn’t ready.",
  "id": 1,
  "comments": [
    {
      "score": 13,
      "content": "NAH - but I personally would keep it to myself and once he comes out I’d tell him that I knew.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "When it comes to coming out, sometimes the best thing is to let them do it on their own. He may not be ready, or maybe just likes gay porn? Either way, just be supportive and a good friend and things will sort themselves out. Asking can sometimes put people in uncomfortable situations (i.e. not wanting to lie to a friend but not ready to come out. Happened to me before I came out as bi). So my opinion is just to let it be for now, the answer won’t change anything between you two so there’s no need to rush and ask.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NAH. Coming from my own experience, i FREAKED OUT when i realized i was gay and pretty much went into denial and depression for the next six or so years. Not fun times. If someone had asked me during that time if i was gay, i probably would have ghosted them. Not saying im proud of that fact, but i can almost guarantee thats how i would react.\n\nIf you're concerned about other people seeing what he's liked, just casually mention hey homie, i think you've been hacked as this is what i noticed. You could then add something like 'you know you're my bud no matter what' but... i dont know, just tread carefully. Everyone's different of course but... anyway, this is my advice 😁",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "If you ask him directly if he’s gay YTA. Let him decide whether and/or when to tell you directly. It’s not your right to know just because you’re close. \n\nHowever, if you tell him the fact that you noticed what sites he follows and you’re worried that others might find out (in case he wants it a secret), without asking directly, then you’re NTA. Then you’re a caring friend. He will most likely tell you just as much as he’s ready to tell you.",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "How would I word that?",
          "id": 6,
          "comments": [
            {
              "score": 4,
              "content": "I accidently commented again, such a noob lol. Here’s the reply:\n\nYou’re worried about your friend and that’s very kind of you. \n\nJust tell him what you saw. And tell him that you don’t care what he’s into, but you’re worried that someone who he doesn’t want to know, might find out. And that he doesn’t have to reply now if he’s not ready but now he knows about the visible “follows” on his account.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "\"Hey man, I saw a pattern in your <whatever> account.  Not sure if you used the wrong account or what, but you're following a lot of gay porn actors.  Doesn't matter to me, you're my homie no matter who you want to go out with, but you haven't said anything so I thought you might not want it to be that visible.\"",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NAH. No harm in asking a friend something personal. He can decide if he wants to confirm or deny or ignore you.",
      "id": 9,
      "comments": [
        {
          "score": 5,
          "content": "But do I tell him what I saw or do I just ask? I don’t want to lose this friend at all.",
          "id": 10,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "Ehhhh gently YTA.\n\n> I’d like to start with I don’t care if he sleeps with men or women. Or even if he likes to sleep with both. Absolutely his business\n\nYou should end your post there. You are correct, it doesnt matter to you and it's his business. Maybe he only just realized. He gets to come out the way he wants.\n\nPeople asking, hinting or insisting I wasnt straight pushed me further into the closet and denial. It took till my twenties to admit it as a result, even though the clues were clear from preteen years.",
      "id": 11,
      "comments": [
        {
          "score": 1,
          "content": "Okay. I guess I’m just nervous if someone not as understanding sees what I saw if it was an accident. That is why I’m conflicted. I don’t want him shoved out of the closet if he isn’t ready.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "Yeah, you'd be an asshole if you asked him. His sexuality is his business. If he wants to share it with you, he will. If not, then I don't think it's your place to ask.",
      "id": 13,
      "comments": [
        {
          "score": 2,
          "content": "That’s why I’m conflicted. If homie isn’t out but In the first 10 tweets liked he has two dudes going at it but he isn’t out, does that make me the bad friend for not warning him?",
          "id": 14,
          "comments": [
            {
              "score": 1,
              "content": "So, like, I mean if the guy's looking at gay porn, he probably knows that he's gay already. I doubt he's conflicted here. He has just, for whatever reason, not decided to share it with you. He may not have shared it with anyone yet and may not want to. I've known gay guys before that no one would ever have thought they were gay. Only knew that they were because I knew their bfs and both guys were keeping it on the real down low.",
              "id": 15,
              "comments": [
                {
                  "score": 0,
                  "content": "*bye reddit. -- mass edited with https://redact.dev/",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I replied sufficiently to his question, that being that it ought to be obvious that he knows he is gay, and that it still isn't appropriate to ask. The argument isn't that it's not okay to make it public. The argument is that someone's sexuality is there business and no one else's. If they want people to know, they can tell them. If not, you nor anyone else has a right to ask.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH \nthe best thing you can do is very very subtly show your support for LGBT and be an ally\nhe will tell you when he is comfortable, if there even is anything to tell \ndon’t force him to come out, he will come out when he is ready to\njust show that you’re an ally and would support him no matter",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH \nNo harm in asking, especially if he has a public twitter account. Of course be kind about it and come from a non-judgmental way.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "You’re worried about your friend and that’s very kind of you. \n\nJust tell him what you saw. And tell him that you don’t care what he’s into, but you’re worried that someone who he doesn’t want to know, might find out. And that he doesn’t have to reply now if he’s not ready but now he knows about the visible “follows” on his account.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    }
  ]
}