{
  "post content": "\nI've been married to my 2nd Husband \"Mike\" for 4 years now. He's a jokester and loves to crack jokes all the time. He especially like to joke with my brother \"Ethan\" and his wife. Ethan used to be okay with it til he started complaining about Mike taking it too far with his jokes.\n\n\nSome context about Ethan. He and his wife couldn't have kids so they adopted a boy \"Joey\" 2 years ago. Mike has been making silly, lighthearted jokes that involving Joey's bio parents as a way to mess with Ethan and his wife. I already talked to Mike and I tell you that he's 100%means no harm and he was just trying to get them to react.\n\n\nSo fast forward to NYE, my parents hosted a big celebratory dinner and Ethan and his wife came. While we were eating dinner, Mike decided to tell a knock-knock joke to Ethan. He said \"Knock knock..\" Ethan laughed and said \"Who's there?\". Mike replied \"Joey's bio parents\" then he bursted out laughing. Silence took over and Ethan's facial experssions changed. His wife called Mike an \"idiot\" to which Mike replied with \"Hey...Relax it was just a joke\". An argument ensued and dinner was paused. My parents suddenly told Mik to leave which I thought was too harsh. I tried to speak to them and get them to calm down but mom insisted that Mike leave. We left and Mike was complaining the whole time about how they overreacted. I called mom later and she told me Mike was out of line with his hurtful jokes about this touchy topic and told me I was wrong for defending him and saying he was just joking. She said he ruined NY for the family but I told her it was her and dad who ruined NY celebration for escalating the situation and kicking him out. I told her he could talk to them but again they were the ones who ruined NY celebration. She called me delusional for this statement and hung up.\n\n\nWe haven't talked to them for days. I tried contacting Ethan but no response.",
  "id": 1,
  "comments": [
    {
      "score": 114921,
      "content": "YTA. Your husband likes to hurt people. It's nothing to do with jokes.",
      "id": 2,
      "comments": [
        {
          "score": 43067,
          "content": ">Your husband likes to hurt people.\n\nWish I had an award to give you for this.",
          "id": 3,
          "comments": [
            {
              "score": 39579,
              "content": "'Hey it's just a joke' is not a get-out from everything. No-one is obliged to find something funny just because you do and to insist that they should is bullying, no more, no less. Mike's 'jokes' are unpleasant and not remotely funny, and I speak as someone with a very sick sense of humour indeed. He's an AH and OP is another one for enabling him.",
              "id": 4,
              "comments": [
                {
                  "score": 17442,
                  "content": "They teach this at school and work regarding harassment, bullying, sexual harassment and the like. Husband knows this and doesn’t care. He is mean, he is a bully, and he is not funny. Without all of those things he has been asked to stop and still bulldozes and does what he wants.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 18055,
                      "content": "I’m so glad OP’s parents kicked him out",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8041,
                      "content": "He's been asked, over and over to stop, that they make BIL uncomfortable. But does he stop, no. Keeps with the shitty jokes. It's just not funny.\n\nOP is AH and her husband. She shouldn't be defending that bullshit.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1804,
                      "content": "Bingo! Even if it's not your intention to be hurtful or mean or creepy, if that's how it made your victim feel, it's harassment. Basics of any workplace harassment course.\n\nOP\"s family has repeatedly said his \"jokes\" and not welcome but he continues to make them, even after knowing they are hurtful. So it would be fair to say that he cracks them fully intending to hurt. This is not a case of \"oops, sorry I didn't realise this joke would hurt you\".\n\nOP's mom is right, she is delusional if she thinks anyone other than her husband ruined NY. And she is definitely an AH for enabling and supporting a bully.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1151,
                      "content": ">He is mean, he is a bully\n\nLiterally my first thought. \n\nOP's husband sounds like a classic school bully. \n\nKudos to his parents for kicking him out",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 647,
                      "content": "The good ol’ shitty person “what do you mean I can’t target vulnerable people about jokes?  Comedy is dead everyone, cause I can’t be an unprompted dick to everyone!”",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 334,
                      "content": "Yup. Your husband is a BULLY not a jokester. If only he finds his jokes funny they are not. Just makes him a giant doosh.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5947,
                  "content": "“It’s just a joke” is a cloaking mechanism so an asshole can do asshole things. I have a pretty dry sense of humor that isn’t everyone’s cup of tea. I learned years ago to read the damn room. If everyone doesn’t laugh, the “joke” didn’t land, and you move the hell on. Unless you’re an AH who’s just trying to be an AH.\n\n“I tried contacting Ethan but no response”- because this was the last straw. If someone was using one of my children as a source for “humor”, especially an adult who should know better, that would be the last time they interacted with my family. End of.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 2753,
                      "content": "Also I’m assuming the child may have been there and this is pretty disturbing if he was. YTA from a parent of 2 adopted boys with serious trauma who even at 2 or 3 could pick up on this kind of “joke” being negative about them.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 870,
                      "content": "Ugh I endured years of abuse couched in “its just a joke, lighten up.” Jokes aren’t jokes if the target doesn’t find them funny. YTA for enabling this outrageous behavior and abuse of your family.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 141,
                      "content": "Definitely warrants cutting contact. Husband 100% sounds like the type of person who would \"joke\" with the kid about being adopted and op would still defend him.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 87,
                      "content": "My mum used to say horrific things to me under the guise of \"joking\". It's horrific. Op YTA and moreso your husband.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 55,
                      "content": "Or the “that’s just how i am”. Asshole at my work would always say that’s the generation he grew up in and blab blab and he can’t change. He sure changed really quick when he gets wrote up. It is always when there is no consequences they keep their shit going. Since OP is pretty much enabling him since she still thinks her parents were out of line, how would he ever change.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 970,
                  "content": "[deleted]",
                  "id": 18,
                  "comments": [
                    {
                      "score": 646,
                      "content": "Jokes should make people laugh. OP’s husband doesn’t care about laughter, he just wants to “get a reaction.” You know what gets reactions? Insults and disrespect. OP’s parents are right to put their foot down.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Well, he got a reaction all right!",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 149,
                  "content": "I tell my kids, and those I work with, \"if the person you are saying it to/doing it to isn't laughing, it isn't a joke/prank, its bullying. Period. It doesn't matter if everyone else laughs, its never a joke unless the person its aimed at thinks so.\"",
                  "id": 21,
                  "comments": [
                    {
                      "score": 31,
                      "content": "THIS! Jokes are meant to make the **other** person laugh. If the one telling the joke is the only one laughing, it's not funny. But especially if the joke is directed *at* someone, if they aren't laughing, it's not funny.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "Right? It’s not even a properly structured joke. No real set up, no punchline. It was just genuinely not funny, and Mike has even admitted he wants ‘a reaction’. Not laughter or mirth, he delights in seeing others experience distress. Yikers man, I couldn’t be with someone like that. Emotionally stunted, teenaged boy of a man. Yikes.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": ">and I speak as someone with a very sick sense of humour indeed.\n\nAmen to this. I can find humor in some very inappropriate situations, but this takes the cake. I have friends who adopted, and I can't imagine saying anything that crass to them. Definitely TA.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": ">He's an AH and OP is another one for enabling him.\n\nThat's the crux of the issue with people like OPs husband. Every person like OPs husband who is all like \"it's just a joke/prank, don't be so sensitive\" etc always have an enabling AH behind them enabling their bullying behaviour, and as long as the bullying AH has an enabling AH behind them, *they're not going to stop being a bullying AH*.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Knock knock,\n\nWho's there?\n\nOp's first husband\n\n\nIt WaS jUsT a JoKe...",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 35,
                  "content": "\"It's just a joke\" is often used to excuse bullying, as if the other person's hurt doesn't matter. That kind of callous disregard is deeply unpleasant.\n\nMike is a bully, deserves to be treated as such, and in fact *was* treated as such.\n\nIt sounds as if Ethan and his wife either have gone NC or are considering it, and I don't blame them because I would as well.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Especially how he didn't regret it afterwards despite clearly hurting them.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "omg the whole “he just likes\nto get a reaction” isn’t that a synonym for “he likes to hurt people but just for shits and giggles”. what a rude heartless man",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Right? The moment I saw \"jokes around\" a lot, I knew OP would be TA. No one would be mad about a joke unless it hurt their feelings. And OP's husband doesn't joke around. He uses \"joking\" as an excuse to poke at people's wounds. How does he think the little boy feels to be constantly reminded that he's not their bio child?",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15304,
          "content": "“He 100% means no harm and he was just trying to get them to react.”\n\nThe reaction is hurt. That’s the reaction he’s trying to get- hurt. If it’s not hurt, it’s frustration or annoyance. It’s shitty to purposefully make people feel hurt, frustration, or annoyance for your own amusement. Toying with people’s emotions is harmful. THINK OP. YTA",
          "id": 31,
          "comments": [
            {
              "score": 4010,
              "content": "OP is blind. Whether he *means* harm or not (and I think he does, personally), if he cared at all about his BIL, he would've stopped as soon as he saw that his \"jokes\" were *causing* harm.\n\nOP, please stop excusing his terrible behavior before you alienate everyone else in your life because he isn't a jokester. He's an AH. And so are you as long as you back him up.",
              "id": 32,
              "comments": [
                {
                  "score": 2487,
                  "content": "> Whether he means harm or not (and I think he does, personally)\n\nI honestly can't see an argument that it _wasn't_ intended to be mean. I mean, boiled down to the essence, this is the \"joke\":\n\n> Knock knock  \n> Who's there?  \n> Joey's bio parents  \n\nWhat, exactly, is the punchline supposed to mean, and why is it funny? Seems to me it's \"your kid is not biologically yours.\" Why is that supposed to be funny?",
                  "id": 33,
                  "comments": [
                    {
                      "score": 1637,
                      "content": "To me it says “your child’s bio parents are going to come back and take Joey away”. I, like the majority of people here, can’t see the humour in this",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 395,
                      "content": "[deleted]",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 168,
                      "content": "That’s the worst part to me - is that there is NO joke. It’s vitriol.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "Honestly I have spent a lot of time around comedians and I have noticed you can tell just about any sick joke you want if it is FUNNY. This is not.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 782,
                  "content": "I think OP knows exactly what he's doing, but doesn't care. It's easier to just ignore it and refuse accountability.\n\nOP is repeatedly choosing to bring a bully around to torment their loved ones. Major YTA.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 292,
                      "content": "I think OP likes seeing them get hurt. There’s no other reason someone could think this behavior was acceptable.",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 66,
                      "content": "OP is probably just as bad as her second husband.",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 40,
                      "content": "Totally! I’m imagining they have low self esteem and feel Mike is the best they can do. Even though Mike continually shits in their family. I hope this is eye opening for OP!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "I suspect Mike makes \"jokes\" at OP's expense, too.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 738,
                  "content": "OP isn't blind; she's willingly closed her eyes so she doesn't have to acknowledge her husband is an AH. If you acknowledge a problem, it exists. If a problem exists, you need to address it. \n\nShe's worried she'll have to choose between her husband and her family. She doesn't realize that her inaction has already made that choice for her.\n\nYTA",
                  "id": 43,
                  "comments": [
                    {
                      "score": 66,
                      "content": "> her inaction\n\nHonestly, that too generous. She is a gaslighting bully that *activley* supports here husbands bullying and insists that everyone else not just accept it, but insists that their not being bullied when they plainly are - under threat of family turmoil and breakdown.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 64,
                      "content": ">OP isn't blind; she's willingly closed her eyes so she doesn't have to acknowledge her husband is an AH.\n\nIt's just as likely that she too is someone who's utterly against adoption and doesn't see Joey as actual family. She probably bristles when they tell the child to call her aunt. Such an AH.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 54,
                      "content": "Yep. The brother and his wife just went no contact. Can't blame them",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Maybe she's not blind, she just likes assholes?",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 42,
                  "content": "yes this, if he had made an off colour joke one time that didn't land and he then apologized and never joked about your nephew's parentage again then maybe we'd have a case for his intentions. But this is repeated and he has been told time and again that the jokes are not funny or appreciated. After time 1 he's just being an ah.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Ah dude I've been diagnosed with a literal personality disorder and even I read this with my jaw dropped. Sometimes reddit reminds me I'm really not so bad. Point is, I find it impossible to believe that OP or her husband could be so unbelievably dense. Thus leading to the logical conclusion that they behaved like class-A bellends.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I bet he has alot of funny jokes for her about all her insecurities too",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "The joke was not even a joke let along humorous.\n\nIt's just bringing up a painful subject to hurt someone in the guise of a joke.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1493,
              "content": "The reaction was getting thrown out of the house. Accept the reaction.",
              "id": 52,
              "comments": [
                {
                  "score": 413,
                  "content": "This. I hope he gets more reactions that see him excluded from events.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 225,
                      "content": "I hope that both he and OP currently excluded from future events, OPs family deserve to have family events/parties they can enjoy without OPs husband being a bullying AH and OP enabling that crap.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Though I am not quick to recommend one being isolated from family, it’s warranted in this case. Adopted kids can get bullied by peers. The last thing they need is the adults in their lives following suit.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Perfect. \n\nSo many \"Adults \" need to grow TF up. \n\nWant to be a prick? Deal with the fallout.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "As a now adult adopted child, my dad would  have kicked the ass of anyone thinking this was a joke. And my dad was a white collar non-athletic guy, but it would have been gloves off, fists of fury.\n\nI never new my bio folks - but I know who my PARENTS are",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Exactly.  Trying to get someone to react is meaning harm. Obviously you want to upset them and push buttons.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Actually he does mean harm. His actions show that.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Exactly. He’s trying to get a reaction HE enjoys. The object of his “joke” does not enjoy it. The other pr sent do not enjoy it. Perhaps you enjoy watching Ching your husband be cruel - which would make you just as mean.\n\nI’m trying to figure out how the joke is funny at all: there is nothing witty about it. No play on words. No intelligence. No double entendre.\n\nAll it is is an unkind jab at a sensitive subject.\n\nThere is not universe in which Mike should not have been asked to leave. He’s a bully and your family has decided that bullies are so last year.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "“I like to make everyone around me feel stressed and shitty! Why won’t anyone hang out with me? People are so sensitive nowadays.”",
              "id": 61,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "My family grew up very cut throat. Most jokes were at the expense of others or at any sign of weakness. Like, I didn't use soap for a bath one time, my sister noticed the soap wasn't used, and 20 years later I still get soap for xmas and a joking comment. \n\nIt's taken years of being around functional people to know this isn't normal behavior. OP's husband is probably from a family like that, and it needs to be addressed because it's unhealthy for everyone involved. I've been very mean to people under the guise of humor.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2225,
          "content": "Came here to say this.  OP, YTA.  Your husband is a bully.  Good for your parents for standing up to him.",
          "id": 63,
          "comments": [
            {
              "score": 1070,
              "content": "Notice how OP didn't refer to the child as their nephew - just \"adopted a boy\". Way to let everyone know your real feelings on adoption. JFC these two sound perfect for each other.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Isn't victim blaming page 1 of the abusers handbook?",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1661,
          "content": "Yep, a lot of abusers and bullies hide behind \"it was just a joke, you're too sensitive\". YTA, both OP and OP's husband.",
          "id": 66,
          "comments": [
            {
              "score": 198,
              "content": "And I bet if someone asked him to explain the joke, he'd call them names for even asking and not understanding. Cause it aint funny and tbe husband knows. \nAlso who the heck jokes about an adopted child'a bio parents??? That's tasteless. \n\nYTA, OP. Get your husband in line, he isn't funny, he is a bully",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 53,
              "content": "“I’m just joking” was my ex husband’s favorite way to be abusive to me.\n\nOP and her husband are TA. YTA.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Wait until he starts \"joking\" at her expense. We will see a post titled \"AITA for ruining dinner because of my husband's 'joke'?\"",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1628,
          "content": ">He especially like to joke with my brother \"Ethan\" and his wife. Ethan used to be okay with it \n\nNah, fam. He's not joking *with* Ethan, he's being a deliberately cruel bully. He either doesn't care or is enjoying the fact that he's hurting your family. \n\nYTA OP.\n\nHonestly, I think your family should ban Mike from any further family gatherings until he apologizes *profusely* and gets therapy. You sound like you need it too. Cruelty ain't a good look.",
          "id": 70,
          "comments": [
            {
              "score": 560,
              "content": "And he’s not really targeting Ethan, he’s targeting Joey, a child who has presumably not had an easy start in life. He is a bully, OP. Your parents are fabulous.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "And Ethan was never really okay with it — he likely brushed off the earlier attempts in the hopes that they would be brief. Meanwhile Mike kept it up in order to get a reaction.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 885,
          "content": "He’s the only one laughing and claiming they’re jokes, and he might genuinely even think so, because he lacks the empathy necessary to understand anything beyond his own pleasurable feelings, and as he actively enjoys other people’s suffering and discomfort… Bully mentality.\n\nI find it very concerning, as well as OP’s enabling. They’re okay with it now because the jokes are aimed at other people, but this won’t last forever.",
          "id": 73,
          "comments": [
            {
              "score": 318,
              "content": "Well actually -- SHES laughing too - which is worse. They're both bullies and getting off on the reaction of her brother and his wife, and the poor kid, being hurt by these 'jokes'.",
              "id": 74,
              "comments": [
                {
                  "score": 301,
                  "content": "OP also kept insisting to her mother that it was them that ruined NY by “escalating” the situation.\n\nOP married this guy watching him make jokes at other peoples expense and getting these reactions.\n\nOP is a bully as well.",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 851,
          "content": "I've learned from this forum, it's great to make the jokester explain their jokes.\n\nWhy is it funny that the bio parents are at the door? Oh, because they might be trying to take their kid back and ruin our family? That it might cause psychological damage to us and our adopted child? Explain to me again how that's funny.",
          "id": 76,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 623,
          "content": "And in a super cowardly way, hiding behind a \"joke\".\n\nShow me a jokester/prankster and most of the time, I'll show you an asshole.",
          "id": 77,
          "comments": [
            {
              "score": 395,
              "content": "Exactly this. \n\nOP: my husband is a jokester\n\nTranslation: my husband is a ginormous asshole who likes to make \"jokes\" at people's expense\n\nI wonder how funny OP finds her husband's jokes? Wouldn't doubt if he makes them at her too.",
              "id": 78,
              "comments": [
                {
                  "score": 60,
                  "content": "Literally as soon as I read that I knew we were dealing with a real asshole. I know a lot of truly funny people and I'd never describe any of them as a \"jokester.\"",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "I've had bouts with old roommates where we pranked eachother constantly but no one would describe any of us as pranksters, because we were mutually doing it to eachother in harmless ways. Joking and pulling pranks with others who are clearly into it in and of itself is not a problem. \n\nIf only one person is doing all the joking/pranking then you get a \"title\" and fall into one of two categories in my mind. It's not a 100% rule but I've found that the way people describe themselves or another a person reveals their nature. \n\nJokester/prankster = asshole. \n\nComedian = non-asshole.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 324,
          "content": "It shows a lot she tells her brother her husband means no harm with the jokes but doesn't tell her husband to knock it off with jokes that make people uncomfortable. He's perfectly capable of keeping his mouth shut but enjoys the reactions.",
          "id": 81,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 314,
          "content": "Definitely YTA.\n\nIs your husband like 13 yo? He has the emotional maturity of a 13yo bully whose defense is always \"But, I was just joking!\"\n\nETA: You should expect you brother and his wife to go no contact with Mike and likely you since you are still so CLUELESS!!",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 42009,
      "content": "MIKE RUINED the celebration.\n\nWow, idk if I’ve read such an out of touch post on AITA… ever.\n\nYTA. And so is your husband. “Mike has been making silly, lighthearted jokes that involving Joey's bio parents as a way to mess with Ethan and his wife.” WHAT THE ACTUAL FUDGE. That is TERRIBLE. Teasing an infertile couple about their adopted child’s bio parents? I am mortified.\n\nEdited to add: I am super freaking proud of your parents!!!!",
      "id": 83,
      "comments": [
        {
          "score": 5448,
          "content": "Finnish people have a word for when someone else does stuff but you are the one ashamed for it.",
          "id": 84,
          "comments": [
            {
              "score": 3149,
              "content": "Germany has one as well. \"Fremdscham\".",
              "id": 85,
              "comments": [
                {
                  "score": 1180,
                  "content": "It’s actually the feeling I get watching the Office and Stromberg.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 936,
                      "content": "I can’t watch cringe comedy bc I get this feeling! It’s too overwhelming for me",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "I actually have to skip the episode Scott’s Tots because of this feeling.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1147,
              "content": "I just call it *second-hand embarrassment* 🤦🏻‍♀️",
              "id": 89,
              "comments": [
                {
                  "score": 578,
                  "content": "Collateral Shame.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 135,
                      "content": "Oooh, \"collateral shame\" is *good*.  I usually say \"vicarious cringe\".",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Well you can't just say that and not tell us what it is!",
              "id": 92,
              "comments": [
                {
                  "score": 65,
                  "content": "myötähäpeä in Finnish.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 37,
                      "content": "[deleted]",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1633,
          "content": "Even after they were literally asked to stop.\n\n\"It's just a jooooooooooke.\"\n\nYTA. Wow.",
          "id": 95,
          "comments": [
            {
              "score": 41,
              "content": "Right? That would’ve been a perfect time to be mature and admit that the joke was extremely insensitive.",
              "id": 96,
              "comments": [
                {
                  "score": 26,
                  "content": "Jokes are supposed to be funny, right? I'm having trouble seeing how this is a joke to begin with.",
                  "id": 97,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "That was the copout my little sister used when she wanted to say mean things but didn't want to get in trouble for them lol. She was a tween. OP's husband might not be a tween but apparently he still acts like one.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 782,
          "content": "Right what exactly is a lighthearted joke about adoption following infertility? Thats a situation where you need all the family support you can get, not people tearing you down.",
          "id": 99,
          "comments": [
            {
              "score": 36,
              "content": "this would be so hurtful, i honestly hope they’re okay after dealing with this asshole. i’d probably cry",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "I sure hope the kid isn't nearby.  One would be shocked by how much little kids understand.  He makes these jokes another year or two, that kid is gonna know what's up.",
          "id": 101,
          "comments": [
            {
              "score": 20,
              "content": "Hopefully OP and husband will not be in the kid’s life at that stage. He doesn’t need to hear his place in the family being invalidated.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "> Mike has been making silly, lighthearted jokes that involving Joey's bio parents **as a way to mess with Ethan and his wife.”**\n\nShe fucking admits, _in her own post_ which is presented in the best possible light, that he does it to fuck with them, and still thinks he did nothing wrong.\n\nHow fucking idiotic can you be?",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "Exactly this. I was also mortified about his \"jokes\". Who does that? And what is so funny about a couple being infertile and adopting a child?\n\nYTA OP and your husband is a bully that hides behind sentences \"but it was a joke\".",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "INFO: OP, can you explain how that joke was funny? I’ll wait. \n\nAlso, did anyone laugh at your husband’s joke?",
          "id": 105,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "I'm adopted. I'm very sure I would have been incredibly upset every time my \"uncle\" made a shitty comment like that as a joke. Thankfully my siblings never said about my bio parents. My brother and sister often said that I was adopted as an insult. My usual retort was at least mom and dad chose me! Too bad we can't tell the kid to use that one.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23296,
      "content": "Wow yeah YTA.\n\nSorry but your \"Mike\" is an asshole. Not uncommon for the \"jokester\"s who love to crack jokes to \"mess with people\". Fuck that, it's not in good spirit, it's one-sided, bullying and just disgusting . It's not lighthearted or silly, it's just mean. The sentence \"Relax, it was just a joke\" is horrible. Your Mike hides behind this excuse to be an asshole and a bully to people, to push their buttons, to be mean and then retreat when they get upset by calling it all a joke. You are enabling and supporting that, which makes you no better.",
      "id": 107,
      "comments": [
        {
          "score": 9464,
          "content": "I want OP to tell us EXACTLY how this joke is funny. Seriously. Explain this joke to me and tell me what part is so hilarious.",
          "id": 108,
          "comments": [
            {
              "score": 4813,
              "content": "The thing is, what Mike finds funny about this is the hurt and anguish he causes in other people like the fucking antisocial asshole he is. \n\nI believe he also does this to OP and OP is desperately afraid to step out of line or else she becomes the butt of his \"jokes\".",
              "id": 109,
              "comments": [
                {
                  "score": 1600,
                  "content": "Bingo! The funny part for Mike is that it makes people upset.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 755,
                      "content": "Definitely. That’s what “he likes to get a reaction” means. When you’re trying to be funny, you’re trying to make them *laugh*. When you’re being mean, any reaction works for you.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 212,
                      "content": "Mike seems like the kind of guy who would get super offended if somebody made these “jokes” about him.",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "My ex husband was like this. He made lots of hurtful jokes about me. If I got upset he would tell me I was too sensitive. He would make these jokes in private in in public. He was the lead singer of a popular local band and he would make mean jokes about me on stage in front of hundreds of people. I would try to laugh it off, but how fucking embarrassing. Eventually, I told him I couldn’t take it anymore. He told me he was unwilling to “change who he was” because I couldn’t take a joke. \n\nAfter I told him I wanted a divorce, he would beg me to let him try to change, but after ten years of this shit, I knew he meant what he said originally about not being willing to change.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "This. It isn’t even a joke. He just wants a reaction and hurting people is a way to get them to react.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "She literally admits that Mike likes to see people react.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 962,
              "content": "See, it's funny because they love their son and his bio parents just show up and screw up their lives and possibly try to take him away. Isn't that hilarious? /s",
              "id": 116,
              "comments": [
                {
                  "score": 317,
                  "content": "😂🤣😂🤣 OMG, I’m bent over laughing so hard. That is some knee-slapping, rib-tickling *fun* right there!!! \n\nYTA and what is wrong with both of you?!?",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 353,
              "content": "That is the best reaction to a hurtful, or racist, or whatever, joke. Don't let your emotions show, try to look puzzled, and say \"I don't get it. Please, could you explain it to me?\"\n\nYTA, OP.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 46,
              "content": "Yes OP! Please explain the joke, I don't get it either!!!",
              "id": 119,
              "comments": [
                {
                  "score": 26,
                  "content": "I wonder if Mike had something \"\"\"funny\"\"\" lined up in case Ethan had said \"Joey's bio parents who?\".",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "She said \"he was trying to get them to react\".... That sounds like a 12 year old bully that had parents who didn't pay attention to him. Not a person who's old enough to get married and somehow found a wife (that is ok with this behavior and supports it).  \n\nI believe he does find it funny. But this is sadistic and completely inappropriate.",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "Yeah, there's no clever pun or twist, it's literally just 'Your child is adopted! Hahahaha!'",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "You see it is funny to him. It is not his fault they do not have a sense of humour.  \n\n\n(/s just in case it is not obvious)",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1548,
          "content": "Exactly.\n\nOP, you say you talked to Mike and he “100% means no harm and he was just trying to get them to react.” But can’t you understand how those two things are mutually exclusive? The “reaction” he’s looking for is the response of people who are hurt. He is intentionally hurting your brother and his wife for his own amusement. \n\nMike’s clearly an AH, and if you can’t see that then you’re an AH too.",
          "id": 124,
          "comments": [
            {
              "score": 485,
              "content": "This!!\n\"Trying to get a reaction\" or \"a rise out of somebody\" or \"just giving someone a hard time\" are all terms to try to weasel out of the fact that you are indeed trying to upset that person, and for what? You're own sick comedic pleasure?\n\nOP is TA and Mike is as well.",
              "id": 125,
              "comments": [
                {
                  "score": 26,
                  "content": "[deleted]",
                  "id": 126,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 431,
          "content": "I also NEED to know how many times Joey has overheard these jokes. If I was Ethan and his wife I would never let Mike around this child again.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 229,
          "content": "He’s probably been doing this since he was a teen, antagonizing his classmates, and no one has ever kicked his butt.",
          "id": 128,
          "comments": [
            {
              "score": 20,
              "content": "I’ve known people like this - no one has ever kicked their ass. So, they act like gross dicks their whole lives. I know a 74 year like this.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "I absolutely LOVE IT when I encounter these type of \"Mike\" characters, because it's open season on roasting the fuck out if them.  Turning the tables and telling them \"it's just a jooooke\" when their face gets sour..love it.",
          "id": 130,
          "comments": [
            {
              "score": 29,
              "content": "yep and I would bet 9 out of 10 times, when you \"joke\" with a person like this, they end up pissed, maybe even want to  fight.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Like there are plenty of people who crack alot of jokes, yet somehow the people who make the offensive jokes don't seem to realise its only them that get hated.\n\nAlmost like jokes aren't the issue and it's the content of the joke and how you say it.\n\nMe personally I make a fuck ton of jokes, but my humour sense is 50 year old dad.\n\nHard to get offended at a dad joke, and even if people dislike the dad joke they aren't equally upset they just kinda groan and accept it as a dad joke.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 20179,
      "content": "YTA no one likes your husband. He's not funny. His jokes aren't cute. No one thinks he's clever, or amusing. He does mean harm otherwise why would he keep pick, pick, picking at this very sensitive subject? Your husband is a bully. You're enabling your husband to bully your relatives.",
      "id": 133,
      "comments": [
        {
          "score": 4177,
          "content": "OP, this. Get therapy.",
          "id": 134,
          "comments": [
            {
              "score": 3796,
              "content": "OP you're a fat disgusting whale.\n\nOh it's just a joke /s.\n\nThat's what your husband is doing. It's not a joke. It's cruel. And you're defending it.",
              "id": 135,
              "comments": [
                {
                  "score": 2617,
                  "content": "A: Knock knock\n\nB: Who's there?\n\nA: You're ugly\n\n...\n\nA: Why aren't you laughing?",
                  "id": 136,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2156,
          "content": "[deleted]",
          "id": 137,
          "comments": [
            {
              "score": 1499,
              "content": "Knock knock.\n\nWho's there?\n\nOP's first husband.",
              "id": 138,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 400,
              "content": "I bet Mike probably does",
              "id": 139,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 275,
              "content": "OP is an AH because her parents were just joking when they kicked Mike out",
              "id": 140,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 46,
              "content": "He 100% does but OP is probably so used to his bullying of other people that they're convinced it's normal behavior and how normal couples are",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 388,
          "content": "He does mean harm cause the very first thing she said was he is just looking for a reaction.",
          "id": 142,
          "comments": [
            {
              "score": 58,
              "content": "that stood out to me too. how can you know someone does that and still be okay with it?",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 298,
          "content": "\"he's just trying to get them to react\" because as normal, decent people they have been politely ignoring him in hopes he'll go away. Problem almost solved.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Its honestly hilarious how OP doesn’t realize that her husband is the person who everybody dreads to see at a party. Like the person who everyone actively avoids.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "As soon as she said he’s a “jokester” I was like ahhh he’s an asshole",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "Yeah and the joke isn’t even funny in a “dark humor” kind of way. It’s just fucking dumb and low effort.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Right? I’m guessing it was going on for years and they couldn’t take it anymore. They didn’t overreact, in fact they probably took upon themselves for a while before reacting",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "It must be so frustrating for Ethan knowing that every time he sees Mike he'd just be waiting for a cruel \"joke\"\n\nSounds like he mostly put up with it and hoped Mike would stop, but I'm sure it really bothered him and worried about Joey hearing the \"jokes\"",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Certainly not clever that’s for sure, that joke was horrible. I’m getting 2nd hand embarrassment from it.",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13531,
      "content": "YTA so much, especially Mike\n\nKnock knock\nWho’s there?\nMikes an asshole, fuck Mike. \n\n\nWhat? It’s a joke??",
      "id": 151,
      "comments": [
        {
          "score": 11236,
          "content": "Knock knock\n\nWho's there?\n\nNot Mike, he got kicked out\n\n&#x200B;\n\nETA: Wow, thank you for all these awards, I wasn't expecting them, lol",
          "id": 152,
          "comments": [
            {
              "score": 851,
              "content": "Genuinely funny!",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 676,
              "content": "No, it's his wife trying to get back in.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 364,
              "content": "Knock knock\n\nGo away Mike",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "See, this was actually funny - it subverted my expectation within a limited context.\n\nKnock knock\n\nWho's there?\n\nIT'S JUST A JOKE BRO C'MON ITS FUNNY",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Oh, but it is Mike because he got kicked out.  Now he's trying to get back in!",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "BIL should tell this joke to TA next time at a dinner party. THAT would be funny.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Knock knock\n\nWho's there?\n\nDisowned OP because she supports and brought a bully into the family.",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 946,
          "content": "Knock, knock.  Who's there?  Mike.   Fuck off, Mike.  You're an asshole and no one wants you here.\n\nThankfully OP's parents have Ethan's and his wife's backs.\n\nYou, OP, YTA.  You also don't sound so smart.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 280,
          "content": "Best joke I’ve heard today!",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "This is infinitely funnier than the lame excuse for a joke Mike told.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "HAHA best joke! Hope Mike falls and lands on a cactus! \nI can say that, because it’s a joke! 🤔🤣",
          "id": 163,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8751,
      "content": "YTA\n\nYour husband is an asshole, and you are enabling him.\n\nMaking jokes to try to get people to react after they asked you not to is bullying and harassing, not lighthearted jokes.\n\nYour parents didn't overreact, they kicked out a disgusting bully. Or they were just joking, OP and you are overreacting over a harmless prank kkkkkk",
      "id": 164,
      "comments": [
        {
          "score": 1528,
          "content": "People like Mike are exhausting to be around, and they usually don’t have any actual friends, just people who are stuck with their company.",
          "id": 165,
          "comments": [
            {
              "score": 304,
              "content": "Or if like Mike do have \"friends\" it usually translates to: people who are bullying assholes just like him.",
              "id": 166,
              "comments": [
                {
                  "score": 38,
                  "content": "Or people who are easily manipulated and mistake arrogance for confidence which seems to be OP's case. Doesn't make it much better, but it sounds like she's just a fool who thinks being a loud mouthed asshole makes someone funny and confident",
                  "id": 167,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Yep, and it sounds like Ethan made a boundary a long time ago with the jokes and Mike continues to cross it. Just because you make a joke doesn’t mean it isn’t insensitive or inappropriate. Also, I bet Ethan wasn’t okay with them in the beginning, he probably just got tired of them and made the boundary.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Agreed. Mike is a bully. It is not a joke if you hurt people. It is not funny if no one else is laughing. It is not lighthearted banter if you have been repeatedly told to stop. \n\nMike is being nasty and cruel. Your parents were 100% justified to ask him to leave and you both owe your family an apology.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6310,
      "content": "YTA.\n\nWhat if someone took your greatest insecurity and poked at it. Over and over and over and over again. Like some shitty, hurtful groundhog day. \n\nAnd when you said something about it, they would tell you \"Well, calm down, it's a joke.\"\n\nWould you like that? I don't think so.\n\nYour husband is nothing more than a cruel, mean bully. And you are his enabler.\n\nAlso, \"Mike\" isn't just hurting the parents, he is hurting the kid as well and that makes it even worse.\n\nYTA.",
      "id": 170,
      "comments": [
        {
          "score": 1836,
          "content": "She married someone who probably does already poke at her greatest insecurities. She has learned not to react to appease her husband and probably feels like if she can learn to shove her hurt and shame down deep then so should everyone else. Everyone must do whatever they can to not hurt the feelings of the person who is \"just joking. \"",
          "id": 171,
          "comments": [
            {
              "score": 342,
              "content": "She's the boat rocker https://www.reddit.com/r/raisedbynarcissists/comments/77w8lf/dont_rock_the_boat/",
              "id": 172,
              "comments": [
                {
                  "score": 80,
                  "content": "Wow, thanks for linking this. This was an amazing read and it's the first time I see it.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 863,
          "content": "Thank you!  OP never mentions the child's age, but if the child is old enough to understand Mike's jokes, not only is Mike bringing up one of the parents' biggest fears (their child being taken away), but also likely the child's (being taken away from Mom and Dad).\n\nOP, since you are defending Mike's \"jokes,\" please explain how they're funny.  I'll wait. \n\nUntil then, YTA.\n\nAlso, if everyone isn't laughing, it's not a joke, it's bullying.",
          "id": 174,
          "comments": [
            {
              "score": 825,
              "content": "And maybe I'm overthinking it, but the fact she doesn't refer to Ethan's son as her nephew is telling.",
              "id": 175,
              "comments": [
                {
                  "score": 268,
                  "content": "No i think you're onto the main issue here",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 254,
                  "content": "Yeah I was wondering why OP referring to him as a boy instead of her nephew bothered me so much.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 151,
                  "content": "god damn, i didn’t realize that until you said it. that’s just cruel",
                  "id": 178,
                  "comments": [
                    {
                      "score": 193,
                      "content": "2 years Ethan's been that child's father, and she refers to him as \"a boy\", not \"my nephew\"",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Adoption is an emotionally complicated and personal thing for a child - to joke about it in front of him just goes beyond AH to I don’t know what but I’m aghast he could do that.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Yeah like this op:\n\n knock knock.\n\nWho's there?\n\nNot your family because you choose abuse!",
          "id": 181,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4260,
      "content": "YTA. He isn't funny, even if you both think he is. He has continually done this\n\n>as a way to mess with Ethan and his wife\n\nand\n\n>he was just trying to get them to react.\n\nWhat on earth is funny about that?",
      "id": 182,
      "comments": [
        {
          "score": 1498,
          "content": "Then they “boo-hoo” about….getting a reaction!! The reaction was that they offended everybody present and got kicked out!! There you go you got your reaction….why are you here complaining about it?!",
          "id": 183,
          "comments": [
            {
              "score": 570,
              "content": "Classic abuser behavior. Poke at you to get a reaction and then shame you for the reaction. Ugh I really hate “Mike”.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "Wonder if Mike is also the type to complain about people being too sensitive these days and how you aren't allowed to say anything without people being offended",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "> There you go you got your reaction….why are you here complaining about it?!\n\nhttps://i.imgur.com/SHq1GFm.jpg",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 247,
          "content": "Right, I'm a self proclaimed jokester as well, I love making my friends and family laugh. But that's what I'm fishing for, laughs, not \"a reaction\". I specifically want positive reactions and laughter. Sometimes I miss the mark, but if someone says they're not comfortable joking about something you stop.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2620,
      "content": "[removed]",
      "id": 188,
      "comments": [
        {
          "score": 602,
          "content": "My husband has never gotten in a fight in his life - but if someone said something so cruel about one of our children *and thought it was funny*, there's a good chance he'd take a swing at him.   It would certainly be the last time that person would have any interaction with our family.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Now THAT would be funny.",
          "id": 190,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "Lol for real. I would have gone across the table at the \"relax\" comment.",
          "id": 191,
          "comments": [
            {
              "score": 38,
              "content": "*Broken nose, bloody lip*\n\nRelax Mike, it was just a joke... So sensitive.",
              "id": 192,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 28,
          "content": "As he's walking up, just stand over him and say \"relax bro, it's just a joke\", but I doubt he'd understand it.\n\nAbsolutely, YTA",
          "id": 193,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "That would have been a great punchline!",
          "id": 194,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1941,
      "content": "YTA. Making fun on an issue regarding not being to have kids is cruel. You are clearly married to a cruel guy. Saying it's \"just a joke\" is justifying a form of bullying. Mike ruined the occasion, you ruined it more by defending him.  Your mum is right, you are delusional.",
      "id": 195,
      "comments": [
        {
          "score": 318,
          "content": "You hit the nail on the head. Mike isn't a \"JOKESTER\", he is a straight up \"BULLY\". This is one of the greatest fears for adoptive parents.",
          "id": 196,
          "comments": [
            {
              "score": 24,
              "content": "A joke is only considered a joke when everyone is laughing about it. Doesn’t seem to be the case with Mike",
              "id": 197,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}