{
  "post content": "This may seem like silly situation but I really am wondering if I would be an a-hole here. For some background, I work in a office job in a big room with desks that have thin cubicle walls. We are supposed to be spaced out but they sat me right next to another person, who I share a cubicle wall with. \n\nThe woman I sit next too trains to do body building competitions. While I think that’s pretty cool, during her cutting season she tends to eat a lot of bland, gross, strong smelling foods (think like eggs and broccoli, she eats a lot of broccoli). Now this not normally a problem for me because I have an almost nonexistent sense of smell due to 24 years of bad allergies. But when I can smell something with really strong odors it tends to make me nauseous (this is important). \n\nThe woman is in her cutting phase right now and shes kinda...smelly. Like it honestly smells like a mixture of rotten eggs and what I like to call broccoli farts. I don’t think it’s body odor because I can’t usually smell that unless I’m right up on people and I don’t think it’s her eating at her desk because she’s a loud eater and I haven’t heard her eating. \n\nI think she’s letting out silent farts because she always gets up to go to the restroom after. And like I said this usually doesn’t bother me because I can smell most things. But this smell is so bad that it’s making me gag and cover up my face. \n\nI don’t want to embarrass her but WIBTA if I got a air freshener for my desk and sprayed it whenever I smell the broccoli farts?",
  "id": 1,
  "comments": [
    {
      "score": 13,
      "content": "NAH \n\nBut don’t get a spray. Just get a general one that slowly and constantly releases scent designed for a small space like a bathroom.\n\nAnd maybe aromatherapy roller balls that you can apply to your wrists or under your nose silently.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "I was thinking of getting a small oil diffuser instead. My boss has one at her desk and the eucalyptus scent always makes me feel like I can breathe better.",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "That would be a good idea! Or one of the one that uses reed sticks. \n\nI do like the roll on aromatherapy or perfume thing too because it’s something that you can do that makes no noise at all that nobody will know you’re doing that can give you a little scent",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "Nta as long as you ask everyone if they have allergies before getting one. I’m allergic to to most spray air fresheners and would feel very ill, and some peoples reactions make their throats close. Its important to consider safety, but your nta at all. Its not like you called her smelly to her face.",
      "id": 5,
      "comments": [
        {
          "score": 2,
          "content": "You make a really good point. I’m allergic too most air fresheners that have a strong flowery smell. I can only really deal with slightly fruity or linen smells. \n\nThere are only 6 people on my side of the building and 3 of them sit too far away. The only person who could say they may have an allergy too the air freshener is the coworker but she has a tendency to make up health problems. Like saying she now has asthma due to having to wear masks. \n\nPlus no one has ever had a problem with my boss using the oil diffuser at her desk so I might get a small one for mine and do a eucalyptus scent.",
          "id": 6,
          "comments": [
            {
              "score": 2,
              "content": "Wait, like wearing masks caused her asthma or she’s only now complaining of her asthma now that she’s wearing masks? \n\nBecause I do have super mild asthma. I mean, super mild as in when I went digging around to find my inhaler one time it was expired by two years because I literally never need it since I stopped exercising hardcore. (Mine is exercise induced) \n\nBut now that I’m wearing masks and my breathing is just a little bit harder, I’m definitely reaching for my inhaler about 1000x more than I ever was before. My doctor has even added a second inhaler to my regime. \n\nI mean, you obviously know your coworker and how dramatic she has a history of being, but if someone told me that I magically have asthma now hat I’m wearing masks, it would probably really hurt because these masks have legitimately made it just slightly harder to get air sometimes and my asthma just isn’t bad enough to begin with that most people don’t know I had it at all.",
              "id": 7,
              "comments": [
                {
                  "score": 2,
                  "content": "Oh trust me I feel you because I have mild to medium asthma. Mine is mainly allergy based but it’s super manageable usually. I only use an inhaler when I’m sick or having an allergy attack, about 5 times a year. I have been using my inhaler more lately but that was because of needing to change my allergy meds. I do agree that the masks make it harder for me to breathe sometimes but I just choose to go out less. \n\nAs for my coworker, I cannot say for certain she’s lying about asthma. But she has never brought up asthma as an issue until she started talking about how the masks irritate her asthma and how she had to go to the doctor to get asthma medicine for her boys because the masks are giving them asthma. \n\nI would normally not bat an eye at this if it wasn’t for the fact that she’s one of those people that talk nonstop about herself and her problems and she is notorious for lying or making up problems to tell people. Plus she’s one of these people who think the pandemic is a skam and masks don’t work/only cause health problems. I have many stories about her.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 1,
                      "content": "If you cry wolf too many times, you face the consequences... \n\nI just wanted to put it out there that it is feasible that people who “didn’t” have asthma before are having issues with masks now, but I totally feel you on the annoying dramatics.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NAH - this just seems like a regular office problem. As long as you are not obvious or rude about it, it should be fine",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "You need to speak to HR or her manager, and they can deal with it. People have allergies and an air freshener can be bad for those, so I would not recommend that.\n\nESH (you only if you do actually get the freshener without taking steps to address the problem).",
      "id": 11,
      "comments": [
        {
          "score": 3,
          "content": "I can just imagine opening that email. \n\nHR, my coworker keeps farting and I don’t like it.",
          "id": 12,
          "comments": [
            {
              "score": 1,
              "content": "[Oh](https://www.askamanager.org/2012/02/coworker-makes-bodily-noises-and-smells-all-day-long.html) boy, [do](https://www.askamanager.org/2016/06/my-coworker-complained-about-my-burping-and-farting-my-manager-gave-away-my-project-and-more.html) I [have](https://www.askamanager.org/2017/04/my-coworker-keeps-telling-me-that-i-smell.html) links [for](https://www.askamanager.org/2012/12/update-from-the-reader-with-the-farting-burping-coworker.html) you! (Only three of these are actually about farts. One's about general potential odoriferousness.)",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "Thankfully that's what they're there for.",
              "id": 14,
              "comments": [
                {
                  "score": 5,
                  "content": "No. HR is there to protect the employer.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 1,
                      "content": "If someone is causing an uncomfortable work environment with smells, they will get into it. Source: they did for me with cologne and perfume. They made my area fragrance-free.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA: There are several types that don’t require spraying, are neutral in scent & can be very affective. There’s good advice about HR etc. but you can get one of the stationary ones immediately. I’ve used them in some really smelly places where people had “varied” hygiene habits.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis may seem like silly situation but I really am wondering if I would be an a-hole here. For some background, I work in a office job in a big room with desks that have thin cubicle walls. We are supposed to be spaced out but they sat me right next to another person, who I share a cubicle wall with. \n\nThe woman I sit next too trains to do body building competitions. While I think that’s pretty cool, during her cutting season she tends to eat a lot of bland, gross, strong smelling foods (think like eggs and broccoli, she eats a lot of broccoli). Now this not normally a problem for me because I have an almost nonexistent sense of smell due to 24 years of bad allergies. But when I can smell something with really strong odors it tends to make me nauseous (this is important). \n\nThe woman is in her cutting phase right now and shes kinda...smelly. Like it honestly smells like a mixture of rotten eggs and what I like to call broccoli farts. I don’t think it’s body odor because I can’t usually smell that unless I’m right up on people and I don’t think it’s her eating at her desk because she’s a loud eater and I haven’t heard her eating. \n\nI think she’s letting out silent farts because she always gets up to go to the restroom after. And like I said this usually doesn’t bother me because I can smell most things. But this smell is so bad that it’s making me gag and cover up my face. \n\nI don’t want to embarrass her but WIBTA if I got a air freshener for my desk and sprayed it whenever I smell the broccoli farts?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Meh, see if you can ignite them. Better to light a candle than curse the fartness.  \n\n\nI'd say NAH, but obviously there is one asshole in play.",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YWNBTA. also NAH. You're not confronting her or being mean about it. It sounds like a tactful way to handle the situation. I would get one of those air fresheners that goes off at certain intervals.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    }
  ]
}