{
  "post content": "\nBasically, my brother inlaw (my husband's brother) passed away from cancer 2 weeks ago. His widow/wife aka sister inlaw has never really been on good terms with my inlaws/her inlaws. They were having issues in the past and now from what I gather, my mother inlaw is planning on going to court for grandparents rights to get visitation of the kids.\n\n\nMy inlaws had been asking my sister inlaw to give them my brother inlaw's wedding ring so they could keep it. She refused and they got into a huge argument then she left with the kids. They went over to her home yesterday hoping to take the ring from her but she told them she didn't have it, and that she buried it with my brother inlaw. When my parents inlaw mentioned this and were devastated, I suggested that she might just be lying to get them to drop it. Suddenly, they got up and quickly got into their cars and went over to her house and had another huge argument there. Sister inlaw called me later cussing at me saying I was horrible to be basically meddling in her life and encouraging my inlaws to come after her and harrass her. I argued that I only made a suggestion and that her real issue was with them. She hung up after telling me to mind my own business and stop getting involved. My husband berated me for what I said and said that his parents are crazy, and that I shouldn't approve of their behavior or even help them harrass my grieving sister inlaw. I mean my parents inlaw are also grieving and I, too, am grieving and my sister inlaw's words hurt me when all I did was just make a suggestion when I saw how devastated my parents inlaw were.\n\n\nEDIT My sister inlaw and I aren't close. she seems to resent me for some reason even before this sitation took place.",
  "id": 1,
  "comments": [
    {
      "score": 32013,
      "content": "You’re grieving?! What in the what? You participated in the harassment of a grieving widow but it’s ok because you’re also grieving so the grieving widow should be more considerate of you. That’s really what you’re going with?\nYTA, leave the poor woman alone and ado maybe be mindful that if anything were to happen to your husband, this is the same crazy that you’ll be subjected to.",
      "id": 2,
      "comments": [
        {
          "score": 13506,
          "content": "Right?! And why do his parents want his wedding ring when it apparently isn’t a family heirloom or anything? This is nuts. I can’t imagine what that poor woman must be going through.",
          "id": 3,
          "comments": [
            {
              "score": 9757,
              "content": "This poor woman barely buried her husband 2 weeks ago and these vultures of a “ family “ are already going after her for grandparents rights and a wedding ring????? \n\nAnd op thinks it’s okay cause they don’t get along…..",
              "id": 4,
              "comments": [
                {
                  "score": 5475,
                  "content": "Don't forget the SIL doesn't like her for \"some reason\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3378,
                      "content": "[removed]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 507,
                  "content": "Exactly.   She also has minor children.  This woman is probably not even back to work yet and is still processing reality and these people want, let me check, HIS WEDDING RING.  From his widow! I'd let them continue to be insane.  They aren't getting anything from a family court",
                  "id": 7,
                  "comments": [
                    {
                      "score": 49,
                      "content": "It’s truely disgusting how some “ family” can be. OP. Is just as bad.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "my uncle died 2 weeks ago and one of my cuzins (who didnt visit him the 2 years he was sick) is trying to take evrything in his house while her dads long time gf/caretaker is still living in it. she started 9 hours after her dad died. some people are just trash.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Oh wow I’m so sorry for your loss.   When my dad  died suddenly, my parents were separated.  His family took everything  before the coroner even had my dad at the morgue his brother took everything .  Even the gold watch off his body.   I happen to ask the coroner for my dads wallet and my uncle had it.  They threaten to arrest him if he didn’t turn it over  23 years later I still won’t forgive him.  He has been trying to get me and my siblings to forgive him to change his karma, we refuse still",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I hope she's in the US because most states don't have grandparents rights and the courts will tell them to f off.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3794,
              "content": "That ring is a symbol of her marriage to him. I really don’t understand what claim his parents even have to it. And harassing a widow to try to take a symbol of their marriage is absolutely horrible.",
              "id": 12,
              "comments": [
                {
                  "score": 1321,
                  "content": "You just explained it to yourself right there. They want to control and rob this woman of everything, including the last symbol of her marriage. The cruelty is the point.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 323,
                      "content": "Not only that, but they didn't mention the ring being a family heirloom either.. generally if a wedding ring isn't heirloom, the groom's wedding ring is bought by either the groom/bride or is part of a set bought by them... thus rightful owner is the wife. Even if it was heirloom, she'd own it unless he had a will that he expressly left it to someone since they were married, at least in most states.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 576,
                  "content": "That’s what baffles me too. It’s most meaningful to the poor widow.\n\nOp, yes, yta, a flying monkey ah.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 217,
                  "content": "I can’t even figure out how anyone thinks anyone but her should have the ring. If she did lie it’s because they are too much and they have no right to even ask what they did!  \n\nYTA. Stay out of it.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Right?! It’s nobodies business what she does with the ring, it’s hers! Smh",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 168,
                  "content": "Agreed. I don't see why they would want it so badly when it's not symbolic of their relationship with him. There has to be something else that would be a better reminder for them of their son. It's honestly creepy that they want his wedding ring. Seems that they're only doing this just to be spiteful.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 22,
                      "content": "And if that wasn’t bad enough OP plants the seed that she is lying about it. At least she didn’t suggest exhumation to get it back I suppose.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 127,
                  "content": "That's hers. No reason for them to have it",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "My dad kept my mom's wedding ring after, and then we the kids kept them both after that. I have no clue why wedding rings would ever leave the immediate family, like ever. Even if it's a family hierloom, then I just goes to the kids",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "This exactly. This is beyond horrible. I’d be devastated if someone tried to take a symbol of my marriage, especially if they have no respect for the marriage (as seems here)",
                  "id": 22,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Sounds like they couldn't convince their son to leave her in life so not they want to do it I death. Taking the ring, going to court over visitation rights, I'm sure they're finding every last connection they can between their DIL and son and making sure they're in control of it",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Totally agree. Wedding rings are exchanged for a marriage. The parents have absolutely no right to make that demand. Can you imagine the parents of a deceased daughter requesting the wedding rings from her husband? So wrong.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Yeah, in my husband's family, the widow has the husband's ring bent into a heart shaped pendant (so far it's been the husband going first). Both his mom and grandmother did that. Unless it were an heirloom ring, the only reason they could want it is spite.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 657,
              "content": "Also why is it so weird to think he was buried with his wedding ring… my grandpa recently passed away and he was cremated with his favourite hat, his favourite chocolate and an Elvis memento and then his ring was placed in his urn before he was buried",
              "id": 26,
              "comments": [
                {
                  "score": 431,
                  "content": "My mother had so much stuff in the casket the undertaker told me he wasn't sure they could close it.  I said \"So you want me to hop on the lid like it's an overfilled suitcase?\"   Sarcasm is my love language.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 157,
                      "content": "We put a Hershey’s chocolate bar in the pocket of my husbands shirt because he loved chocolate. Lol. I also did not have a tie on him. When his mom asked me about it I told her he hated ties when he was alive so I wasn’t putting one on him in his final resting place. She understood that one, but then, I love my MIL.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "This is just like Luke’s uncle in Gilmore Girls.  The casket is packed.  There’s a football that gives the lid a bounce when they try to close it and it kills me every time.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Probably because 'it was his and they aren't married anymore\" or some such fucking bullshit.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1133,
          "content": "I hope the widow documents the shit out of this. Hopefully the court sees how unhinged these people are and laugh them right out the door with “grandparent rights”. Wtelf.",
          "id": 31,
          "comments": [
            {
              "score": 173,
              "content": "Troxel v Granville; grandparents can't supersede mom's rights unless mom is a danger to the kids. Almost certainly she's not. Widow mom never has to let the pit viper in laws see the kids again if they behave this way.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 168,
              "content": "I know what you meant, but I read wtelf as “what the elf”",
              "id": 33,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 394,
          "content": "How the hell would op feel\nIf that was HER  husband in that grave and her in-laws were coming at her for his wedding ring…..  \n\nYTA OP.  I wouldn’t blame the SIL. At all if she took the kids and never seen or talked to you guys again",
          "id": 34,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 165,
          "content": "Sister in law for some odd reason doesn’t like OP. I wonder why 🤔",
          "id": 35,
          "comments": [
            {
              "score": 254,
              "content": "Oh she addressed this in a comment- she posted a picture of her brother in law in the hospital and shared health updates on social media when they didn’t want her to. She is a full nightmare.",
              "id": 36,
              "comments": [
                {
                  "score": 110,
                  "content": "Oh holy fuck that’s awful. She is really the type of person to think her opinion matters more than others and clearly attention seeking.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 56,
                      "content": "There is a layer of cruelty too. I absolutely believe that a person could be self-centered enough to disrespect the concentric circles of grief, I have seen it happen, but after reading her comments I totally believe that a big part of this was revenge for the social media thing and a way to kick her poor SIL when she was at her lowest.",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Omg that’s disgusting. It’s a complete disregard and disrespect of their wishes and privacy. Wow, op is absolutely disgusting",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 63,
          "content": "Read her comments on this thread. JFC she is awful and so are her in-laws. I feel terrible for this poor widow. I hope she takes her kids far away and never looks back. Op YTA you MIL is TA and your FIL is TA.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "> My inlaws had been asking my sister inlaw to give them my brother inlaw's wedding ring\n\nIs that a weird custom I am not aware of? Since when does anybody else than the widow/widower keep the wedding band of the deceased?\n\nI see a lot of entitled people here. In-laws feel entitled to the ring. OP feels entitled to make suggestions that are hurtful to the widow, and to be treated with tender care and love because she is, supposedly, grieving.\n\nTensions between families are not rare, but these people are disgusting. YTA.",
          "id": 41,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "A grieving widow with children to care for on her own, now. OP you're heartless.",
          "id": 42,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "YES!! YTA, OP. Since when does anyone besides the wife get a dead man’s wedding ring?",
          "id": 43,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Exactly this. OP is grieving?? Her grieving deserves more sympathy than the widow? How on earth?? OP is so blinded by her dislike to SIL that she failed to see how demented it is for the parents to demand the \"wedding\" ring of the deceased. Wedding ring! OP it isn't called \"Parent-Child Ring\" for a reason! OP didn't even bother to consider the children that perhaps one day may want to use their father's ring in the future. massive YTA!",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15677,
      "content": "INFO: Why did his parents want to take their son’s wedding ring away from his widow, who gave it to him when they got married?",
      "id": 45,
      "comments": [
        {
          "score": 7479,
          "content": "Because they're spiteful and they hate her.",
          "id": 46,
          "comments": [
            {
              "score": 3410,
              "content": "I have to agree.  You, MIL and FIL all sound awful. \n\nShe just lost her husband, the father of her children. Not only are they not entitled to anything including this ring but they are going to sue her and cause further financial stress.\n\nThis lady needs to get the hell away from these people.and never see them ever again. OP you and your extended family are the AHs.",
              "id": 47,
              "comments": [
                {
                  "score": 683,
                  "content": "Agreed. Can't IMAGINE why the widow has historically had issues with OP and the inlaws. It doesn't sound like any one of them could understand a boundary if they were given a dictionary with the appropriate entry circled, highlighted, and bookmarked. \n\nWhat a bunch of AHs. Wonder if the mysterious \"dislike\" for OP is because the deceased told the wife early on what an awful busybody (OP) his brother married.\n\nOP, YTA.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 30,
                      "content": "They sound like classic boundry stompers except the husband is dead/was too sick and he can't/couldn't deal with their bullshit so the wife did on his behalf.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Right? They are thinking of coming after her for grandparents rights? That’s going to cause her additional emotional and financial stress",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Seriously she should take to a lawyer NOW and see what she has to do to avoid any court subpoena. Moving out of state perhaps? I have no idea but I hope she is able to cut her losses and she and her kids never see those horrible people again.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 924,
              "content": "That sure is what it sounds like…",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "And probably live down the block from a Cash4Gold franchise.",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2369,
          "content": "I wondered the same. A wedding ring has nothing to do with parents... It's a symbol between husband and wife.",
          "id": 54,
          "comments": [
            {
              "score": 365,
              "content": "The only thing I could think of that would give the parents a link to the ring is a potential family heirloom, but then theoretically the ring would be passed to one of the kids rather than back to the parents",
              "id": 55,
              "comments": [
                {
                  "score": 98,
                  "content": "Well, I’m betting the whole grandparents rights debacle is the first stop toward them trying to take the kids permanently, so I suppose it all fits together really. Totally despicable.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Yes!!! My daughter's dad and I were divorced, but still close friends and excellent co-parents! We lived a mile apart, shared 50/50 custody and were extremely flexible with our daughter's schedule, to allow her time with both families and not miss out on fun stuff,  like family vacations,  BBQs, parties, etc. \n\nHer dad passed away when our daughter was 14. It was devastating for both of us.  My relationship with his family had been somewhat difficult since the divorce, however,  I always tried to take the high road, not stoop to their level of pettiness, as an example for my daughter. \n\nWithout her dad to maintain balance, my daughter was struggling with her relationships with her dad's family.  He had   been a bit of a safety net for her and with him gone, they were invading her privacy and imposing their viewpoints on every aspect of her life.\n\nMy daughter became extremely stressed our and wanted to limit time with her dad's family. I wanted everyone to get along, but my daughter and her needs came first.\n\nAs soon as we limited visits to special occasions and holidays, his family lost their shit,  filed for custody of my daughter,  made up a  crap-ton of lies about me, and hired a private investigator to dig up as much dirt on me as possible to assist with their court case.\n\nIt was shocking, scary,  and devastating. My daughter lost a parent and instead of being able to grieve, she had to immediately worry about losing me too, through the court proceedings. \n\nThankfully, mental health evaluations were a requirement in court for us, and the in-laws. A wonderful family mediator was selected to also interview my daughter, who at 14, had her own thoughts/feelings about her situation. \n\nLong story short(er), the mental health testing (MMPI)  revealed all of the narcissistic tendencies of my daughter's grandmother,  her need for control, etc. That, along with my daughter's conversation with the mediator, shut down the entire process and my daughter stayed with me, with minimal, supervised contact with her paternal family.  However,  all of that should have been avoided - it caused a lot of unnecessary bullshit",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 89,
              "content": "And is now the property of the wife since she’s the beneficiary of her husband.",
              "id": 58,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 489,
          "content": "Literally came here to ask the same thing and yeah, seems very spiteful.",
          "id": 59,
          "comments": [
            {
              "score": 142,
              "content": "Incredibly so. Without some really powerful reason, OP and the parents are definitely TA.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 283,
          "content": "[removed]",
          "id": 61,
          "comments": [
            {
              "score": 24,
              "content": "It's probably to pawn it, for whatever purpose the money would be used for. So many people turn into vultures (except I hate to malign vultures, who just need to survive) when a family member dies. Absolutely disgusting.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 198,
          "content": "It wouldn’t matter if it’s a family heirloom she is his family he gave it to her.",
          "id": 63,
          "comments": [
            {
              "score": 104,
              "content": "Since she has children, I’m presuming are biologically/or through adoption the husband’s. She would be well within her rights to hold onto the ring for their children.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 58,
          "content": "Exactly this!! If the sister in law was still married to BIL at the time of death then she should inherit everything unless he had a will with specific requests. And it's HER wedding ring, why would the parents hold any claim to it whatsoever.  OP did not say the ring was a family heirloom passed to him from his father temporarily,  while he was alive, or ownership would revert back to his father. I can't understand why OP or the grieving parents think they have any claim to the ring. OP please don't go around talking about how you are grieving.  His parents lost a son, a woman lost her husband,  children lost their father.  Do not try to make this about your grief.  I don’t blame your SIL for being angry with all of you. Trying to get a ring from a grieving widow, how low can you go?",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8554,
      "content": "Info: why do these people think they have a right to his wedding ring? That’s something between him and his wife, has nothing to do w his parents/ extended family…..\n\nLeaning to YTA because your assessment of this situation is unneeded and not helpful. Not sure how it’s your business either!",
      "id": 66,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8408,
      "content": "YTA, all of you. (Excluding your husband and the widow.) Her husband died 2 weeks ago. How about leaving her alone with all this bs?\nAlso it would only be reasonable for a widow to keep her husbands ring.\n\nA wedding ring is something symbolic for the relationship. It’s a sign of partnership. It’s already nasty of your in laws to even ask her to give it to them. Her marriage is really none of their business.",
      "id": 67,
      "comments": [
        {
          "score": 1349,
          "content": "That what I was thinking. The parents have no rights to the ring! Why they would even think they did is beyond me. \n\nOP YTA and so are your parent in-laws. I hope sister in-law gets a restraining order on them.",
          "id": 68,
          "comments": [
            {
              "score": 411,
              "content": "The ring is the start. Her kids are next.\n\nBut OP is sad, so it's ok.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "seems like they know they don’t have any real right to the ring either, they just wanted an opportunity to spite this poor woman",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "Agreed. YTA, and the rest of the family (except the widow and your husband).",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4367,
      "content": "YTA - because you are now saying that you 'just make a suggestion' - no you didn't you accused her of lying.  EVERYONE HERE IS UPSET and you just accused a grieving widow of lying! \n\ni suggest you stay out of this completely - nothing good can come from discussing any of this with any of the people in your story.\n\nEveryone needs to get legal counsel.",
      "id": 72,
      "comments": [
        {
          "score": 692,
          "content": "“Tee hee there I go again with the wild accusations, so quirky and innocent!” \n-OP probably",
          "id": 73,
          "comments": [
            {
              "score": 25,
              "content": "“It was just a suggestion! Tee hee”",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2926,
      "content": "YTA - why would she give her dead husbands wedding ring to her in-laws? That makes absolutely no sense. She has every right to keep it or have it burried with him. And your husband is right, you should stay out of it and stop encouraging this horrible behavior. She’s grieving and deserves some peace.",
      "id": 75,
      "comments": [
        {
          "score": 389,
          "content": "Since we don't know how their relationship (widow & dead hubby) she has every right to sell the ring or melt it down & make nipple clamps or something out of it. \n\nTotally agree that it's hers & OP needs to stop adding drama",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "If she WAS lying about it to get them off her back, I don't blame her one bit.  How entitled of them, to think that they get his wedding ring, of all things!",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2213,
      "content": "> My inlaws had been asking my sister inlaw to give them my brother inlaw's wedding ring so they could keep it.\n\nThey did ***what???*** They asked a grieving widow to give up her just-deceased husband's *wedding ring*?? What is ***wrong*** with these people?\n\n> I suggested that she might be just lying\n\nWhat is wrong with ***you??***\n\nYes, **obviously** YTA but you're not the only one: your husband's parents are, too.\n\n> all I did was just make a suggestion\n\n**MY ASS.** You accused a grieving widow of lying about what happened to her husband's wedding ring. You were already TA, and you're doubling down on it. Now YTA^2.",
      "id": 78,
      "comments": [
        {
          "score": 924,
          "content": "Well we can see why she gets along with her in laws so well. They’re all toxic alike.",
          "id": 79,
          "comments": [
            {
              "score": 44,
              "content": "she's her in law's favorite. even her own husband said shes TA. its honestly very sad for OP's husband and SIL. Theyre grieving and have to deal with OP and the parents.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "OP may be piling on now…. But once SIL gets the hell away, the in-laws will need a new target. Buckle up OP, I smell Karma comin right at ya!  Oh YTA.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1805,
      "content": "Why would the parents get the ring - a symbol of the love your BIL had for his wife - instead of the wife? \n\nYTA, but, more specifically the wife is not an asshole, and the parents are clearly assholes (and are very likely responsible for the shitty relationship). \n\nIf you’re not going to tell your in-laws they are batshit crazy (which will probably not go well for you), just stay out of it.",
      "id": 82,
      "comments": [
        {
          "score": 351,
          "content": "Not even waiting 2 weeks before gunning for Grandparents' Rights?  Oh yeah, marinara abounds.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "Ya I'm pretty stuck on that as well.  Like, OP's inlaws don't really have a claim on ANYTHING, but the wedding ring is literally the very last thing on that list of things they don't have a claim to.  It's just odd to even want it.",
          "id": 84,
          "comments": [
            {
              "score": 33,
              "content": ">It's just odd to even want it.\n\nit's just cos they're being vindictive ghouls.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1483,
      "content": "The ring belongs with his wife! Giving it back to his parents would be odd. Worse is STEALING it from a grieving widow.\n\nIt was a symbol of their marriage and vows, not something that connected him to his parents.\n\nThey are the AH’s for believing they are entitled to it. \n\nHad they not tried to harass and rob her maybe there would be another keepsake she could have agreed to give them.\n\nYour husband is hugely correct and sees this situation clearly. Follow his lead\n\nYTA, but not quite as big as your in-laws.\n\nEdit: I keep thinking that actually you’re a pretty big AH. You introduced the idea that she was lying which added fuel to the fire. You’re actually responsible for causing them more grief. \n\nThe ring is not their son. Having it will not ease their pain.",
      "id": 86,
      "comments": [
        {
          "score": 1147,
          "content": "Seriously what the fuck is wrong with you people. She buried the love of her life and you're now wanting jewelry back. Fucking disgusting. What's next saying that you would like the engagement ring back because it was purchased with mutual money and his parents should have it. There's a special spot in hell for that family.",
          "id": 87,
          "comments": [
            {
              "score": 57,
              "content": "Is it even wanting it ‘back?’  Usually a wife buys her husband’s ring.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "I’m fuming from reading this post. Like what on earth makes the parents think they have any right to their sons jewelry that is a symbol of his marriage?!? Maybe if they had been divorced or something, but they were still married when he passed. It’s also only been 2 weeks. The pain is probably still so unbearable for this poor woman. And they’re trying to take her kids away from her?! What absolutely vile human beings. Maybe if OP offered a valid reason like the sister in law is a drug addict or something then it would make sense, but no explanation as to why the hell they think it’s justified to try to take this woman’s children away from her. I’m so appalled from reading this. I hope OP’s husband leaves her. Even he doesn’t agree with his own parents in this situation... OP,clearly you’re the favorite daughter in law already, you can are trying so hard now to kiss your in-laws asses.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1051,
      "content": "YTA.  This is incredibly inappropriate.  You and your husband's family need to stop right now and offer a heartfelt apology.\n\nThe wedding ring belongs to the wife.  She is the one who gets to decide what to do with it.  It is not even remotely your job or your husband's family's job to say what happens to it.  Burying the ring with the deceased is totally standard.  \n\nI'm sorry to say that you and your in-laws sound like the kind of people who belong on Jerry Springer.  You should all be utterly ashamed by your behavior.  What are you all thinking to harass and berate a bereaved woman.  \n\nYour husband sounds like the only person in the family who has decency and basic social skills.",
      "id": 90,
      "comments": [
        {
          "score": 55,
          "content": "The ILs and OP are delusional!  YTA for sure.  If my husband just died and my ILs showed up at my door demanding anything, but especially his freaking wedding ring, I'd kindly tell them to F*** off and maybe call the cops to get them to leave my property.  And let's not forget, he's only been dead 2 weeks and they're already talking court and grandparents rights.  The whole lot of them are assholes.  Poor SIL and kids having to deal with this circus!",
          "id": 91,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}