{
  "post content": "Okay I don’t even know where to start with this whole thing. I’m using fake names even though I don’t think my family use reddit. Sorry for formatting, I’m doing this on my phone. So I, 18F, live with my mum and my mum’s partner (Edna). My brother (Winston, 24) used to live with us but moved out when he had a baby with his girlfriend. I moved into the bigger room when he moved out. He knew when he moved out that if he moved back, he’d have the smaller room. Winston now wants to leave his girlfriend and move back in, but the baby’s cot is too big for the small room. \n\nTonight I was sat downstairs with my mum, Edna, Winston, my twin (Emma) and Winston’s girlfriend. He asked if I would consider moving back to the small room so he could fit the cot into the bigger room. He said he’d pay more board to our mum and reimburse me for any of the things I couldn’t fit in the small room. Now the only reason this may be a problem is since moving in May, I’ve bought so much more stuff. My mum offered to pay for shelving but it would honestly be such a struggle to fit everything I have in that room. It would be a double bed, shelves, desk and chair. \n\nWhen I say this room is small, I mean it. There is a double bed, small drawers and a desk and it’s such a tight fit as is. My room is what I view as my sanctuary. I sleep there, I spend a lot of time there because it’s the only space away from my family and the invasive dogs. Emma said that if I refuse the deal, I’d be directly impacting the life of my nephew and Winston. \n\nHere’s where I might be the a-hole. I don’t think that I should have to move out of my room. I genuinely have so much stuff in here now and I think I would have to sell so much of my stuff just to fit in that room. I want to cry. It’s a lose-lose situation and I’ll feel crap with either decision. WIBTA if I didn’t want to move to the smaller bedroom?",
  "id": 1,
  "comments": [
    {
      "score": 15,
      "content": "Are you an adult who pays a share of rent or are you a dependent child? If you're a dependent child then you don't get to refuse. The people who pay for the house get to decide who lives in it and in which room.\n\nMoving to the smaller room will be uncomfortable for you but it'd be actually impossible for your brother and his baby.\n\nIt's unfortunate that something has happened to your brother and this affects you, but that's how life is sometimes.\n\nIf the room is small I'd consider getting a single bed so you have more room for other stuff.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "You haven't mentioned any workable alternatives.  If it were just him, of course you wouldn't need to move again.  If it were just small but the baby still fit, that'd be different as well. However, if a safe sleeping spot for the baby can't fit in that room, they're still going to need to put the baby somewhere.  The situation isn't going to just vanish.  If there's any rooms that can convert, anywhere to dig up extra storage, etc look for those alternatives now.  If you parent is taking him and his baby into the house, it is going to be crowded - find a better solution or they will find whatever they can, and you'll lose any chance to improve the situation.\n\nSo far, NAH... but plenty of potential for it to get worse from here.",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA you are only 18 no one should expect you start pay rent. He is an fully grown man. When he decide to have a baby he should have think about all the scenario. He can't come back and use his child as blackmail tactic to your parents and discard you whenever he wants. Your brother's gf should shut her mouth because thats your parents house.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay I don’t even know where to start with this whole thing. I’m using fake names even though I don’t think my family use reddit. Sorry for formatting, I’m doing this on my phone. So I, 18F, live with my mum and my mum’s partner (Edna). My brother (Winston, 24) used to live with us but moved out when he had a baby with his girlfriend. I moved into the bigger room when he moved out. He knew when he moved out that if he moved back, he’d have the smaller room. Winston now wants to leave his girlfriend and move back in, but the baby’s cot is too big for the small room. \n\nTonight I was sat downstairs with my mum, Edna, Winston, my twin (Emma) and Winston’s girlfriend. He asked if I would consider moving back to the small room so he could fit the cot into the bigger room. He said he’d pay more board to our mum and reimburse me for any of the things I couldn’t fit in the small room. Now the only reason this may be a problem is since moving in May, I’ve bought so much more stuff. My mum offered to pay for shelving but it would honestly be such a struggle to fit everything I have in that room. It would be a double bed, shelves, desk and chair. \n\nWhen I say this room is small, I mean it. There is a double bed, small drawers and a desk and it’s such a tight fit as is. My room is what I view as my sanctuary. I sleep there, I spend a lot of time there because it’s the only space away from my family and the invasive dogs. Emma said that if I refuse the deal, I’d be directly impacting the life of my nephew and Winston. \n\nHere’s where I might be the a-hole. I don’t think that I should have to move out of my room. I genuinely have so much stuff in here now and I think I would have to sell so much of my stuff just to fit in that room. I want to cry. It’s a lose-lose situation and I’ll feel crap with either decision. WIBTA if I didn’t want to move to the smaller bedroom?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Nta, it’s your room…your opinion matters. Solution: your mum gives up her room or change the double bed to a single bed and everything should be fine in the tiny room…he is single…he doesn’t need a double bed",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I might be the a-hole because of things my sister has said. I would be impacting my nephew’s life directly if I didn’t move bedrooms, but I’m struggling as my room is like my one place to get away from the world and I have too much stuff for a tiny bedroom.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA\n\nTheir poor planning is not something you should feel bad about. They should've thought about living arrangements before having a baby. Would it be possible for him to get a smaller bed for the small room? If anyone should be giving up a room it should be your mother since she allowed him to move back in. There are plenty of alternatives that they can do without asking you to sacrifice your room.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA\n\nSay no, it is your room.\n\nif he needs room for a cot he should get a single bed to free up space.\n\nThis is not your problem. Say No and keep saying no. Perhaps Emma can give up her room instead if she is so concerned.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Winston needs to get an apartment, or have less custody until he has an apartment he can have his baby in. Just because someone has a baby doesn't mean they get to encroach on the lives of everyone around them because of it. He made terrible decision after terrible decision. He needs to get the smaller room because it's the only thing that's going to light the fire under his ass to get a grip.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "YWNBTA\n\nYOU are fine not to give up your room. \n\n&#x200B;\n\n\"Emma said that if I refuse the deal, I’d be directly impacting the life of my nephew and Winston.\" .. true. But if you agree, you would be directly impacting YOUR life. Priorize yourself.\n\n\" My room is what I view as my sanctuary. I sleep there, I spend a lot of time there because it’s the only space away from my family and the invasive dogs. \" .. this works for dogs and your family, buit not your nephew. All will EXPECT you to \"help out\", because \"family!\".\n\n&#x200B;\n\nBut **you should move out anyway.  Otherwise you will be the automatic free babysitter.**",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}