{
  "post content": "My partner and I (me 35NB and 60M) hosted a dinner party for some friends, let’s called them “Mark” (55M) and “Gertrude” (45F). Gertrude is allergic to glutens so cooking for her has always been a bit of a challenge.\n\nI really didn’t want to have a dinner party on a Wednesday because I am the gourmet cook in the household and people expect me to make gourmet food for them. I work late that day so the time I start cooking dinner, I am already exhausted.\n\nBut Mark and Gertrude insisted on coming ASAP. Because Gertrude is unemployed while Mark was recently laid off. I offered to refer him to my current employer who is hiring for multiple positions and Mark wants to see what’s available.\n\nSo I ended my WfH day at 3:30 and began slow cooking oxtail stew. I mix my own source using fresh ingredients and a little bit of miso. For some reason - most probably tiredness - kept thinking miso is gluten free because it’s made of soy, not wheat or corn.\n\nMy partner “Casper” offered me to help me do some cooking and when he saw the miso, told me that miso can have trace gluten in it and we can’t serve the oxtail. By the time dinner had been stewing for over 1.5hrs and there was not enough time to make anything else. So we ordered sushi takeaway instead.\n\nWhen Gertrude and Mark arrived she was excited to smell the oxtail cooking on the stove, because that was her favourite. I apologised and explained the situation and offered sushi instead. Gertrude was quiet the whole evening and starred daggers at me.\n\nIt got worse because Casper and Mark are both socially inept and dug into the oxtail stew while commenting on how delicious it was. At that moment I really wanted to dig a hole in the ground and disappear.\n\nLater today I saw that Gertrude had made a passive-aggressive social media post calling me TA without actually naming me. Her words were something along the lines of “some stupid asshole thought it was a good idea to add miso in a dish that never required miso for thousands of years just to feel smart. And now my dinner was ruined. SMH.”\n\nThe comments were agreeing with her and there are other allergic people calling me an ignorant asshole. And I just feel really bad. I tried to do two nice things for Mark and ended up being called TA.\n\nSo AITA?",
  "id": 1,
  "comments": [
    {
      "score": 5204,
      "content": "Of course you're NTA. You didn't know miso had gluten. Gertrude really overreacted. I don't know why she \"stared daggers\" at you. You provided something else to eat. I'm sure it's not the first time she's been at a meal while others ate something she couldn't have.\n\nAnd to shame you about it on social media was disgraceful. She needs to get over herself.\n\nThey don't sound like good friends either, \"insisting\" they come over early. Don't they understand the meaning of the word \"No\"? I'd have been tempted to tell them if they came early I wouldn't open the door.",
      "id": 2,
      "comments": [
        {
          "score": 1447,
          "content": "Because Gertie liked a good oxtail soup and hers didn't have miso as an ingredient.  Well then, Ms Gertie should have brought something, then.  Her attitude towards OP is unbelievably entitled.  She not only expected a good meal, but prepared the way she cooks.  Well I guess Ms. Gertie should have cooked the meal.  It would be the last time she broke bread in my home.",
          "id": 3,
          "comments": [
            {
              "score": 250,
              "content": "But gluten-free bread, mind you /s",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 217,
              "content": "I’m here just to say I have never put miso in oxtail stew but I bet it’s amazing. I will have to try that.",
              "id": 5,
              "comments": [
                {
                  "score": 110,
                  "content": "Asian here, mom makes awesome oxtail soup. Typically it's tomato based but she throws a dash of soy sauce for flavor. Nearly everything we eat has a dash of soy sauce, I would assume with miso it would be very awesome as well.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 54,
                      "content": "I’m in the UK and my go to umami is Worcestershire sauce but have used soy sauce instead on occasion.  It’s great and it’s amazing the difference a dash of something you can’t taste in the finished dish can make.\n\nNot tried miso though.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "American Jew here: Soy sauce makes everything savory - and some things sweet - better. I use it all the time.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I am not Asian but I also put a splash of soy in almost every savoury dish I make. It’s like windex for food.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Aussie here, and believe it or not, Vegemite works too.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "It is! Miso is full of glutamates. A little can go a long way to complement and enhance the flavour of many stews/soups, as long as the base isn't super light/delicate like chicken soup",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I followed an online recipe once and added miso to my mapo tofu. It was life-changing.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I put it in cottage pie and it's really good",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "As will I.  LPT - add butter to your red sauces.  Velvety smoothness.  \n\nMustard to chicken soup.  Game changer.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 162,
              "content": "Who needs “ friends “ who are not satisfied until they do a Yelp review of the friendship ?",
              "id": 15,
              "comments": [
                {
                  "score": 56,
                  "content": "100% NTA - So Gertrude basically invited herself over for dinner...then has the gall to complain how it's cooked? Guarantee she's probably not even celiac but just decided that she's allergic because she read somewhere that getting tired after eating bread might be a symptom...and was upset that you inadvertently called her out on it. Not to mention thousand year old Chinese oxtail recipes also include soy and miso so just because she's not used to it doesn't make it wrong. \n\nSomeone actually celiac would have been appreciative you remembered at the last minute and warned her instead of just serving it.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 9,
                      "content": "[deleted]",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yeah, I just can't imagine any of my friends being this unpleasant to me, someone who behaved like this would be in the ex-friends bin in no time.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "Don’t forget OP was also referring her partner a job.  Wow how ungrateful can you be, it’s an honest mistake and it usually includes trace amounts of gluten and there was only a little bit but OP still went out of their way to Oder sushi which isn’t cheap!",
              "id": 19,
              "comments": [
                {
                  "score": 56,
                  "content": "I was just thinking that. OP was making them dinner, the mistake was caught in time, and an alternative bought,  and also referring her partner for a job and this woman thinks it's ok to pull this passive aggressive crap?  that would be the last time I did anything for either of them, and there probably wouldn't be a job recommendation either.  So rude, and so silly.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 5,
                      "content": "> that would be the last time I did anything for either of them\n\nAt the very least mrs Gerty wouldn't be getting so much as a smile from me. Mark didn't complain, or post. He's just married to an entitled cranky pants. NTA and op, i have no dietary restrictions. I would feel honored and blessed for anything you chose to throw together....I'm still drooling over your stew! 🤤",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I’m really not clued up about gluten so apologies if this is a stupid question but doesn’t rice have gluten? I know you can get gluten free pasta so assume you can also get gluten free rice but I’m equally sure the local sushi place would just use standard rice..\nI’m overthinking this aren’t I?",
                  "id": 22,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I just looked it up and rice is gluten free.  I’m clearly not gluten free and I have no one in my life who is, but if I did I’d just look it up.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Rice has starch, and the word \"gluten\" means \"sticky\". There exists something called \"glutenous rice\" which is a sticky rice and is gluten-free, confusingly. \n\nRice itself comes from a plant that is unrelated to gluten-containing plants such as wheat. Rice is gluten-free. (\"Wild rice\" is unrelated to \"rice\", it just looks similar - similarly, \"buckwheat\" is unrelated to \"wheat\". Both Wild rice and buckwheat are gluten-free.\n\nGluten containing grains include: wheat, spelt, rye, barley, kohorsan. Wheat has the highest proportion of gluten, and that's why it's used for bread and cake - it rises better. \n\nOats contain \"beta-glucan\" which is *not* gluten, but is chemically similar and can trigger intolerances in some people. However, outside of Scotland, Oats are often milled in the same machinery as wheat, meaning that there is often cross-contamination.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -30,
              "content": "Next time she should've just not say anything and let her suffer the consequences. Maybe then the daggers are warranted....",
              "id": 25,
              "comments": [
                {
                  "score": 34,
                  "content": "Don't joke about that. Enough people are dumb enough to not take allergies seriously already.",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "Intentionally poisoning someone is a crime.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "That is just beyond inappropriate.  I know how I react with a significant sensitivity, while it won't kill me, it surely would make me sick.  It's foolishness like this that lead those who are woefully uninformed to pull stupid pranks , tricks...etc that have devastating consequences for which one refuses to take responsibility for.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 364,
          "content": "Thanks. They were usually pretty nice to me and I think the stress of being laid off got to them both :( I was happy to help Mark find a job. And thought the whole “we have to come over that day” was just because he was eager to get back into employment.\n\nThey were friends of Casper’s from the 80’s. So there’s an element of me being the newcomer to the circle as well.",
          "id": 29,
          "comments": [
            {
              "score": 507,
              "content": "Cooking GF can be really challenging bc they sneak it into things that absolutely don't need it.  You tried to do a nice thing.  You made an honest mistake.  You corrected it as soon as you realized it.  You were a gracious host.  Your guests were aholes.  Shaming you on social media is unforgivable.  They should feel free to never eat at your home again.  NTA",
              "id": 30,
              "comments": [
                {
                  "score": 249,
                  "content": "Yeah I can't believe that reaction. Anyone who has to avoid gluten (or any allergen really, but especially gluten) *knows* that it can be trace in a lot of things you wouldn't expect, and people who don't deal with it every day aren't going to be fully versed in it.\n\nI thought this post was going to be about someone getting sick because of the ingredient, *but no*, OP figured out the mistake and was able to warn the person in time! There's nothing more OP could have done given the time constraints.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 104,
                      "content": "I'm a line cook and the amount of times I have to tell our servers anything out of the fryers is contaminated is ridiculous. You'd think when you've got a menu full of breaded fried stuff, gluten free folks would put two and two together and realize we don't have millions of fryers in order to keep everything separate. \n\nAnd I'm talking as a guy with a pork allergy, I also can't eat half the stuff I'm cooking every day because we've only got so much space to work with. The flattop most stuff gets cooked on is just a slab of hotness you cook on, and the grease does what it wants. Don't even get me started on glycerin as a pork byproduct (most of the time, and I can never remember which type is the plant one)\n\nIt sucks, but not everything can always be 100% allergie safe, and when that happens you've just gotta suck it up and make do like an adult. Not complain about your \"friend\" online, for cooking you and your recently laid off husband a meal (who then also provided an alternative meal before she even arrived!)",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "My coworkers kids have such severe celiac that they can’t eat anything that was prepared in a gluten kitchen. They had to buy all new everything when their kids were diagnosed two years ago. Her son is also scared to eat anything that doesn’t come from explicitly gluten free restaurants or their house. \n\nEven small cross contamination from traces is too much for some people",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I know, I also have weird food intolerances and was expecting something like \"and then my guest had to use her epi-pen and rush to the ER\" or \"and so she ate a gluten free granola bar from her purse in the bathroom while the rest of us enjoyed a gourmet meal\"\n\nBut OP bought her sushi! After spending hours after work on a weeknight making food when it wasn't convenient for her. \n\nI bet the social media post didn't include the sushi. Also it really doesn't seem like these two are actually friends? They're just there for the free meal.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Not only warned them but procured other food! Huge NTA.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I was making a gluten free cake for a friend's birthday and it's a mine field. Icing sugar can have gluten in it fgs! You have to be SO careful with coeliacs.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Shame *them* on social media! /s …ish",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": ">They were friends of Casper’s from the 80’s\n\nIs Casper 35, or is that a typo.  He's have been 1 year old in 1989.\n\nNTA, but Gertrude is.",
              "id": 38,
              "comments": [
                {
                  "score": 135,
                  "content": "OP is the one who's 35, Casper is the one who's 60",
                  "id": 39,
                  "comments": [
                    {
                      "score": 82,
                      "content": ">My partner and I (35NB and 60M)\n\nI'm reading this the other way, but I'm probably wrong and I'm guessing you're correct.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "Casper is 60M. I am 35NB. Sorry for the confusion!\n\nCasper taught at a university and Mark was his student from the 80s.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Wow. Your partner seems pretty inconsiderate for someone with that much life experience.\n\nHas anyone said anything to make you feel self-conscious about being “the newcomer in the circle”? To my mind, *Casper* should be incredibly self-conscious — about volunteering your labor at an inconvenient time, about making the situation more awkward as you describe, and apparently about doing nothing to support you in the face of Gertrude’s mean, childish behavior.\n\nI’m sure you get a lot of people making assumptions about your relationship dynamic because of the age gap, and maybe you’ve become defensive about it. But it’s weird to me that you could be treated so poorly and be left wondering if you deserved it, and I do wonder if that’s an indictment of your relationship.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 86,
                      "content": "She’s in her SIXTIES and acting this way? NTA OP, yikes",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "NTA.  Gertrude was rude as F.  Posting on social media, how mature.  You made a simple, unintentional mistake.  Dont make excuses for her, bye bye Gertrude.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "As someone with coeliac disease, I’ve had this happen so many times - I’m never bothered as I know it’s a minefield if your not GF yourself. She sounds like a (insert many bad words I can’t say)!",
              "id": 45,
              "comments": [
                {
                  "score": 61,
                  "content": "Exactly. I have even glutened myself when a manufacturer changed the recipe for something I've used hundreds of times before. \nProviding an alternative with the sushi was a great accommodation. Unemployed, but still eating sushi? Could be hungry instead!",
                  "id": 46,
                  "comments": [
                    {
                      "score": 28,
                      "content": "[deleted]",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Could have gotten gluten with the sushi too if Gertrude had soy sauce with her sushi.\n\nEdit to add :NTA  but Gertrude is",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "It’s frustrating AF, but just kinda part of what we have to live with. I always really appreciate any effort made to accommodate me, it really is so kind and lovely. These things happen.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "If you're the new person in the circle, all the more reason to treat you with kindness.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "OP, you should reply to that comment to set the record straight. \"I'm so sorry you didn't enjoy the sushi I bought for you to ensure you had a gluten free meal after inviting yourself for dinner\"",
              "id": 51,
              "comments": [
                {
                  "score": 5,
                  "content": "Pretty sure OP won't, but I want her to!",
                  "id": 52,
                  "comments": [
                    {
                      "score": 2,
                      "content": "OP could just leave the link for this post as a response.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "It's not stress, it's entitlement. \n\nThink of it this way. You have provided them with both income and a dinner. That's helping take stress off of them. Gertrude might not have been able to eat the oxtail, but she still got fed. Sushi is not cheap. But because she wasn't fed what she wanted, she took offense and complained about you on Facebook. She also twisted the events to suggest that she didn't eat or that she'd ended up eating scraps, because that's what the phrase \"dinner was ruined\" implies. She got *sushi*. \n\nIt really sounds like she's treating you like a restaurant.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "The shaming on social media I would not forgive.  I'd do a screenshot of the post and text it to her and Mark and tell them you will not be cooking for them again. From now on, gluten goes in everything!",
              "id": 55,
              "comments": [
                {
                  "score": 2,
                  "content": "And revoke the offer to get Mark a job. I wouldn’t want to introduce that level of toxicity to my work place.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Girl, you did nothing wrong. If it wasn't for your post I wouldn't have known miso can contain traces of gluten either. I can't read Kanji so looking at the package I'd never figure that out even. \nPlus you made something else available for her in short notice (sushi is pretty expensive where I live). No idea what Gertrude her problem exactly is, but it's not on you.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "You caught the error before Gertrude ate it, and ordered her a nice meal as a replacement. You are NTA, at all. You made a mistake. The men, on the other hand, are giant AH for not only eating in front of Gertrude, but talking up how good it is.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "OP I admire your restraint in not stabbing Gertie with a fork.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "OP, this would be the end of the friendship for me. What an awful woman! \n\nShe can cook for all of you moving forward, IF you want to continue this friendship, but I'd never cook for her again. I'd just tell her you don't want to be trashed on social media for making a mistake, so you won't be cooking for her again.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Unemployed friends insisting they come over early for a free gourmet dinner",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This is a perfect reason to end a friendship.  She sounds super immature.  It’s sounds like you’re in a completely different place and mental state and they not even there. I have a celiac friend who can’t eat gluten and if I even mess up she would have been chill and happy I ordered sushi think of how I could accommodate her.  Not posting on social media like a victim for sympathy.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Gertrude is the definition of \"get a job\"",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I'm coeliac and omg Gertrude is the worst. My response would always be a very genuine \"it's okay,\" and \"thank you so much for double checking.\" I may make jokes if it's my favourite food, but Gertrude is ridiculous. NTA",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Time to stop inviting these pushy ingrates to your house. They forced you into it then she acted as if you did it on purpose. It's HER problem and you provided an alternative. I would never cook for her again. NTA",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Happy Cake Day",
          "id": 66,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1958,
      "content": "So let me summarize and see if I have this straight. A couple of unemployed moochers invited themselves to your house for dinner on a weeknight. Then when you accidentally put gluten in one of the dishes, you made accommodations for the gluten allergy person… and they complained about the food?\n\nNTA",
      "id": 67,
      "comments": [
        {
          "score": 342,
          "content": "I have a friend who does this with vegan food. I made a vegan meal for her, and ate bacon throughout the whole dinner. She complained a ton, but didn’t invite herself back.",
          "id": 68,
          "comments": [
            {
              "score": 93,
              "content": "i'm vegan and i cook meat for my friends when they're over. we could be friends instead!",
              "id": 69,
              "comments": [
                {
                  "score": 84,
                  "content": "Yes! I like vegan food, I just don’t like people who invite themselves over on weekdays and then have menu demands.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 28,
                      "content": "i've generally stopped going out because i hate feeling like i'm forcing people to accommodate me, it's embarrassing and makes everyone else feel bad because \"we have nothing to feed you\" even when i'm not there to eat 😭 and no matter how much you say it's okay and not expected of them, everyone still ends up feeling weird\n\nsome people just really feel entitled! i keep snacks in my purse now so nobody has to feel awkward about it. once went to a friends unannounced and she told me she felt bad that she didn't get oat milk for my visit! i pulled my carton of oat milk out of my bag and told her i didn't expect her to. we both made oat milk hot chocolate\n\nedit so i'm not an asshole: i coordinated the visit with her sibling that lived with her at the time to make sure i wasn't stepping on any toes",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "Vegan is a choice though. Having Celiac disease is NOT a choice. Although Gertrude was AH.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 2,
                      "content": "thanks for your comment but i actually have contamination OCD and this is how it manifests. it's not clear in the post whether Gertrude has celiacs or a gluten intolerance, which are different things with different levels of severity. many people don't eat gluten by choice and many people aren't vegan by choice (alpha-gal or any other reason)",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "You missed the part where the moochers aren't even OP's friends, they are the partner's friends, but OP was expected to cook for them and deal with their shitty attitudes.\n\nNTA, OP, but you need to have a conversation with your \"socially inept\" partner about how he put you in an extremely awkward situation and needs to manage his friends.  Personally I'd refuse to cook for his friends in the future - if he wants to have them over, why doesn't he cook for them?",
          "id": 74,
          "comments": [
            {
              "score": 15,
              "content": "Missing the part where OPs partner, inviting his useless friends, is 25 yeards older than OP. \n\n\nSeriously this sounds like a horrid shitshow. \n\n\n> \"socially inept\" \n\n\nSocially inept my ass, he's twice their age and using it to get away with treating people like crap.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "I agree, the moochers are the AHs here. And the SO is not much better since he should know that the OP would be tired. \n\nThis whole situation is dumb because they don't even know if the miso had gluten in it. All they had to do is check the package the miso came in and see if it contained wheat or barley.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "What's even crazier is that a lot of sushi has soy sauce in it, and if you look at the back of a bottle of kikkoman for the ingredients the first one is: wheat.\n\nI would *kill* for sushi but I always have to be careful about it.",
          "id": 77,
          "comments": [
            {
              "score": 5,
              "content": "Not all “soy” sauce has gluten.  You can get tamari which is gluten free. Not all brewers process with wheat.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Kikkoman counts as gluten-free where I live as it's a naturally brewed soy sauce that tested low enough to be considered gluten-free. They also make a completely gluten-free soy sauce though.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I think OP should reply to that social media post with some of your phrasing here.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Came here to say this - OP lost their chance at being the AH as soon as their \"friends\" invited themselves over and demanded free gourmet food.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 771,
      "content": "I would never invite these assholes to dinner again.\n\nThey INSISTED on coming on an inconvenient night. You made an error so ordered take out sushi and instead of saying thank you she posts on social media about it. Wow. I can't fathom the rudeness. \n\nNTA",
      "id": 82,
      "comments": [
        {
          "score": 93,
          "content": "Can someone really insist they come over for dinner? A simple “sorry. Unfortunately tonight doesn’t work for us” and lock the door would have worked fine.",
          "id": 83,
          "comments": [
            {
              "score": 41,
              "content": "Hopefully OP learns a valuable lesson about the importance of saying no to bullshit requests like midweek hosting.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Exactly. Such drama. Talk about immature and insane",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I'm kind of confused why, when OP had dinner foisted upon her, she proceeded to make a dinner that was that labor-intensive. Hours long. \n\nYou insist on rocking up to my place for dinner [I'd refuse, BTW], and I'd have some basic B chicken, rice and veg. And not end my WfH at 330.",
          "id": 86,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 587,
      "content": "\" some stupid asshole...And now my dinner was ruined.\"\n\nWow.  The entitlement.  You understand  that you no longer have to invite Gerturde over  anymore, right?  \"Thems fighing words.\" Buggs  Bunny\n\nYou made a mistake.  NTA don't cook for her again.",
      "id": 87,
      "comments": [
        {
          "score": 41,
          "content": "Some real Choosing Beggars energy!",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I would genuinely post this story to her post and tack on \"Given how rude you are now being, despite my best efforts to feed you something that wouldn't make you sick, on a night you KNEW was inconvenient for me, you are summarily uninvited from my house until further notice.\"",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -43,
          "content": "Guaranteed Gertrude will never eat there again as she won't want to get ill.",
          "id": 90,
          "comments": [
            {
              "score": 77,
              "content": "Then nothing of value would have been lost.",
              "id": 91,
              "comments": [
                {
                  "score": 5,
                  "content": "Exactly 😀",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I mean, she didn’t get ill and even had free sushi!",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 395,
      "content": "\"I spent hours cooking dinner for a couple of guests mid-week after a long day, because one of them wanted to come over so I could do them a favor. In my exhaustion, I made a mistake and included an ingredient one of them was allergic to. I immediately ordered food in, as there was no time to cook something else from scratch, and felt awful because all that effort had been wasted.\n\nThen, the guest decided I had been an asshole to her for my honest mistake, and bitches about it on social media, calling me names. I don't think I'll be cooking for her again.\"",
      "id": 94,
      "comments": [
        {
          "score": 89,
          "content": "\"I don't think WE will continue being their friend, and will take the job opportunity off the table for Mark.\" Fixed it for ya.",
          "id": 95,
          "comments": [
            {
              "score": 12,
              "content": "I dunno, better help with the job so they'll aford their own meals.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "**NTA\n\nI really hope OP sees this comment, it hits the nail right on the head.\n\nAlso, Gertrude sounds like a real asshole.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "And neither oxtail nor sushi is cheap! Oxtail is now luxury food at its current price and I live in a Caribbean area where it is easily available and affordable. Every oxtail stew round here has soy sauce (and butterbeans) and in my native Ireland we would have used Guinness. Both gluten based and easy to ‘muscle memory’ something similar with the miso.\n\nI have multiple allergies and I would order my own sushi or ask for the equivalent of a PBJ from a person who cooked an expensive meal, cared to warn me it might be unsafe, was doing me a favour re job hunting and was doing all that midweek to my schedule because I’m not an entitled AH.\n\nAnd I literally cook for a living too. I am nervous about cooking for celiacs because my allergies are like I eat all the gluten as it is fills in the stuff I can’t and thus my kitchen isn’t suitable plus as someone who gets a similar response as glutened to my intolerances (which are on top of the allergies) I am terrified of making someone feel that ill. \n\nI am a nightmare dinner guest as a lot of food likes to try to kill me and people are scared to cook for me as a professional. I always offer to bring my own and also despite currently being unemployed due to health and broke, I would not go to anyone’s house empty handed either. And then write Facebook messages. \n\nI’m seeing why Gertrude and Mark don’t have a wide circle of favours to call upon. Absolute audacity to basically complain about OP when Gertrude’s own partner ate the oxtail and flaunted it and OP accommodated her. Extra dash of AH to season the entitlement.\n\nNTA. If I was OP I would ignore the FB message and then decline to take the work recommendation further or provide any reference as Mark is going to tank their career creds with angry vaguebook Gertrude and his social awkwardness. Take the FB as a heads up to shut down further issues with these two. And leave Casper to it since their gang doesn’t like incomers.\n\nAlso my Irish granny lived on a dairy farm and the most annoying contrary just awkward cow of any herd was always called Gertrude. None of the other animals got named but Gertrude was basically how my very proper grandparents who cared deeply about their livestock could say ‘that asshole’ and not sell her to the glue man instead. So I was laughing at the name choice :)",
          "id": 98,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 284,
      "content": "NTA\n\nYou didn't intentionally do anything wrong.\n\nBy the time it was pointed out to you that miso contained trace amounts of gluten, it was too late to do anything.\n\nYou DID provide Sushi for her to eat.\n\nGertrude is an AH.  Instead of accepting what happened as a mistake, she chose to roast you on social media.  Not a mature or nice person.\n\nI personally would never, ever, invite them to dinner again.\n\nLet your partner meet Mark for coffee or lunch if they want to catch up or network.\n\nHugs and Good Luck",
      "id": 99,
      "comments": [
        {
          "score": 28,
          "content": "I agree don't ever invite them again, no big loss honestly.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "When I read the headline I thought OP served it to the person with the allergy but no, they didn't even do that, and instead graciously provided an alternative for her.\n\nAbout as clear as an NTA as I can imagine. But whoa, this Gertrude sure is T A!",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I'd just reply to her social media post calling out how rude she was link to this post.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 188,
      "content": "What did the label on the miso say? I am gluten-intolerant: the white miso paste I buy does not list any gluten allergens, and has never caused me any problems.\n\nLooking it up, I see that miso paste made with fermented soy and rice is gluten-free (like mine), while some kinds may have some fermented wheat or barley and are not gluten-free.",
      "id": 103,
      "comments": [
        {
          "score": 162,
          "content": "I got white miso too. Pretty sure no miso ever contains gluten. There was a warning on the label that said the white miso I got was made with machinery that also made gluten products and trace amounts of gluten could have gotten into it.",
          "id": 104,
          "comments": [
            {
              "score": 90,
              "content": "[deleted]",
              "id": 105,
              "comments": [
                {
                  "score": 22,
                  "content": "Yeah, I buy a miso that is gf but at restaurants it hit or miss due to the soy sauce. Commercially made soy sauces have wheat in them usually. I have to buy a special gf soy sauce. It tastes the same, just has a different thickening agent.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Actually gluten free soy sauce tastes a little less salty. My fiancé can't eat gluten, and when visiting my mom I accidently overdosed my meal with soy sauce not expecting the amount of salt.\n\nGluten free soy sauce is superior.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "This is correct. Thank you.",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 84,
              "content": "So the miso itself didn't contain gluten as an ingredient but could have cross contamination. \n\nWhich can cause a severe reaction depending on how sensitive the person is. \n\nCross contamination is always a concern though anytime a person with a gluten allergy eats outside their home. \n\nMy cousins have severe celiac disease. When they go anywhere, they bring their own food. Because it's cooked in their gluten free kitchen.",
              "id": 109,
              "comments": [
                {
                  "score": 33,
                  "content": ">Which can cause a severe reaction depending on how sensitive the person is.\n\nAnyone else find it hilarious that she didn't even toch the gluten but this still happened? 😂🤣\n\n\"It was an accident, but that will NOT happen again Gertie and I've learned my lesson. From now on...It's going to be intentional\"",
                  "id": 110,
                  "comments": [
                    {
                      "score": 28,
                      "content": "That was kinda my point. \n\nSushi, unless made in a gluten free restaurant, also has the possibility of cross contamination. \n\nChances are she would have been fine with the soup but I completely understand OP not wanting to risk it.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "OK so I agree with what you're saying, but a \"gluten allergy\" isn't a real thing. You can be allergic to wheat, or barley or other grains containing gluten, but not the gluten itself. Coeliac disease is of course a very serious autoimmune disease that causes horrible reactions to gluten, but a gluten intolerance is more mild, and people woth an intolerance can tolerate some gluten although how much is different for different people.\n\nIf I were OP, I would have shown the friend the miso and asked what they wanted to do about it. Then they can make the decision as to how serious it is. If they have coeliac disease they might not want to touch it. However, some coeliacs do eat foods with \"may contain\" warnings, myself included.\n\nNTA but you should have given her the option to decide for herself OP",
                  "id": 112,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I agree with you, I personally am sensitive to gluten. I have IBS and too much triggers a flair up. So I avoid it or limit my intake. \n\nI would have done the same thing you suggested. But OP still would have had to order the sushi just in case. \n\nBut it appears that's what the gf calls it herself. \n\nI'm wondering if the gf isn't one of those people that's a bit performative with the sensitivity. Labeling something an allergy, which indicates a painful possibly life treating reaction might be an easy way to get accommodation but it will also lead to people taking it seriously and not serving you something you are allergic to.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "That was my question, if Gertie’s sensitivity is severe enough that possible cross-contamination on miso machinery is a problem, wouldn’t eating out of a home kitchen that is definitely not gluten-free be an inherent risk?",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": ">  Pretty sure no miso ever contains gluten.\n\nThis is false, sometimes miso contains wheat or barley.",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "I'm learning to play the guitar.",
              "id": 116,
              "comments": [
                {
                  "score": 8,
                  "content": "Not gluten, but this is what I did when a friend with severe nut allergies was coming. Cleaned the kitchen a lot and switched to a new sponge - and I bought new containers of everything we were going to eat, because I don't know if I've cross contaminated my own containers with the same utensil before.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I love ice cream.",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "And those trace amounts, if present, are probably at the same level as the traces there will be in your kitchen if you normally cook with flour.  So certainly, if she has severe coeliac disease, it could be a problem, but in that case she shouldn't be eating anything from your kitchen at all.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Some has gluten, if it was fermented with barley or wheat. But most miso is certified gluten free.\n\nEdit; OP, NTA. You need to never invite these people again, ever.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Miso often contains gluten, same with soy.",
              "id": 121,
              "comments": [
                {
                  "score": 9,
                  "content": "With soy, my understanding is that mass market soy sauce contains gluten but traditionally made soy sauce does not.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Idk. I have celiac. I have to buy very specific soy sauces. It’s actually hard to find. Most soy sauces have gluten.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I actually had to follow a GF diet at one point in my life (turned out I'm allergic to something else) and I ABSOLUTELY would've assumed that miso is GF\n\nI also have an allergy that sneaks its way into the most random things, and recently went to my cousin's for a BBQ. They knew better than to assume sausages were safe, so they had burgers...not knowing that it's also added to burgers too! So everyone had (delicious wagyu 😢) burgers whilst I had frozen chicken nuggets 😂\n\nI cracked jokes about my 'kid's meal' but I absolutely did NOT blast them on social media. \n\nSeriously, fuck Gertrude",
              "id": 124,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Yeah so she cant have anything in your kitchen then. If shes that sensitive, that means if you use any cookware that had gluten on it at any point it would contaminate it. My brother has celiacs and thats what he has to deal with so yeah, she either has to risk it or accept reality and make her own stuff completely gluten free in her own gluten free kitchen.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "If you’re sensitive enough to react to things with “may contain traces of gluten” you shouldn’t eat anything prepared in a normal, gluten contaminated kitchen either. Your cutting boards have been used for bread, you have flour everywhere in the little scratches in bowls and on spatulas. Anything wooden is out. Cast iron as well. I’m gluten intolerant but “may contain traces of…” is fine for me.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "I just checked the miso soup I had at work just to be sure I hadn’t overlooked it when I bought it. It’s also gluten free.",
          "id": 127,
          "comments": [
            {
              "score": 3,
              "content": "Not all of them are. You need a grain to ferment it with. Typically it’s rice but it’s also common for it to be barley or wheat. You cannot just assume they are all the same. Also, celiac disease doesn’t exist in Japan due to genetics so things may not be properly labeled if you’re buying a Japanese product due to the lack of knowledge of the disease there",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Came here to say this. I’ve eaten a shitload of miso and never had an issue",
          "id": 129,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 141,
      "content": "[deleted]",
      "id": 130,
      "comments": [
        {
          "score": 25,
          "content": "Even the ones that are not made from wheat still may contain traces of gluten due to cross contamination. And for a celicac or allergic it may be enough to trigger a reaction.",
          "id": 131,
          "comments": [
            {
              "score": 42,
              "content": "The people I know with a severe enough reaction to cause concern about cross contamination, don't eat any food that's not prepared in a gluten free kitchen. \n\nBecause unless the kitchen is gluten free completely, cross contamination is always a concern. \n\nJust serving bread separately from the soup could cause cross contamination.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "[deleted]",
              "id": 133,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "It does, and it doessss.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Apparently when the package was read it said, \"may contain trace amounts\" it was a cross contamination issue. But, unless someone needs to know that they won't have any clue. I didn't think about miso having gluten. \n\nBut I always ask the ingredients if desserts because I'm allergic to peppers and people will throw them into just about anything! I had some pumpkin pie that had cayenne in it. Never made that mistake again. But if you ask someone without my allergy they'd assume a pumpkin pie would be safe because most of the time it would be. I also don't eat anything that just lists \"spices\" because that could be safe or it could kill me.",
          "id": 135,
          "comments": [
            {
              "score": 4,
              "content": "I have a friend who is allergic to cinnamon.  She has to avoid a lot of things because they don't specify which spices are used on packaging.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I can’t often eat scrambled eggs not made at home because many places put flour into the batter. It’s one way to make them fluff better.",
              "id": 137,
              "comments": [
                {
                  "score": 2,
                  "content": "Weird I never knew that!",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 88,
      "content": "NTA\n\nYou made a mistake and corrected it.\n\nBut 35 and 60? What's up with that?!",
      "id": 139,
      "comments": [
        {
          "score": 21,
          "content": "Also OP excusing their partner as being 'socially inept,' for eating the soup in front of Gertrude. The man is 60 years old, he should know better by now that that's not okay. \n\nOP doesn't say, and I may be inferring incorrectly, but did Casper invite them over and have OP cook despite them being tired? Because if so, that's also concerning.",
          "id": 140,
          "comments": [
            {
              "score": 9,
              "content": "That's what I thought, too. Age gaps can work, but if the older partner has any controlling attributes (such as insisting OP cook when they don't want to), then there's some red flags on the horizon.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Scrolled way too far to see this, my initial reaction as well.",
          "id": 142,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "there were so many small things in this post that threw me, the ages are a big one but also OP saying Wednesday is inconvenient bc they work late and then saying they finished at 3.30",
          "id": 143,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 78,
      "content": "NTA. Your unemployed friends \"insisted on coming ASAP\" for dinner, used an ingredient that is usually gluten-free (not all miso labels have the ingredients in a language other than Japanese), you provided a reasonable substitute for the guest, and she sniped at you online. Please tell me she didn't use soy sauce with her sushi!",
      "id": 144,
      "comments": [
        {
          "score": 7,
          "content": "I was wondering that as well. I have yet to find a brand of soy sauce that does not have a cross contamination warning.",
          "id": 145,
          "comments": [
            {
              "score": 2,
              "content": "And it's usually brewed with wheat. There are GF versions available, but I feel like I see a cross-contamination warning on nearly every type of prepared food these days.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "San-J Tamari is certified gluten free. It is widely available at nicer groceries and online! It is delicious as well. I have purchased from Thrive Market and most of my local groceries. \n\nhttps://san-j.com/",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I can send you some links.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}