{
  "post content": "My husband and I are in are late 20s (27 and 28). We’ve been together for 5 years, and married for 2.  he began playing a phone game called Marvel Contest of Champions. And he managed to spend almost 60k dollars. \n\n58k isnt a small amount to us. Last year our combined income was 219k (67k for me and 152k for him). Although he should be making more soon. \n\n\n\nAfter seeing our bank statement, I sat him down and said that this type of thing can’t happen. And that for the sake of our financial future we’d have to really watch his spending. And it would need to be controlled for the foreseeable future. \n\n\nWell he made a Reddit post, and someone said I could get more replies here. Since he tried to use 1 saying I should cut him some slack as an, *I told you so*.\n\n\nAnd after showing him the replies that contrasted the 1 he showed me.  he basically said I was an A hole. \n\n\n\n\n I did contact Apple, and got a lot of it refunded. 53.7k to be exact. Just the 2 huge concurring bursts of purchases. The others littered throughout the month, and the ones exceeding the 60 day period weren’t refunded. I couldn’t come up with a plausible explanation to get them Refunded without looking to suspicious.\n\n\nwe had separate accounts.  But I decided I needed all our money in 1 place to keep an eye on it. And him. From now on.\n\n\nSo am I the A hole for cutting him off?",
  "id": 1,
  "comments": [
    {
      "score": 8552,
      "content": "NTA.  Anyone that would drop $58k on a phone game cannot be trusted with the family bank account.",
      "id": 2,
      "comments": [
        {
          "score": 4927,
          "content": "$58k *in a month.*\n\nThat's more than some people earn in a *year.*",
          "id": 3,
          "comments": [
            {
              "score": 1380,
              "content": "That’s more than I earned the last 2 years :/ (due to medical issues)",
              "id": 4,
              "comments": [
                {
                  "score": 1490,
                  "content": "This post made me sick like holy fuck 58k blown on a stupid phone game",
                  "id": 5,
                  "comments": [
                    {
                      "score": 579,
                      "content": "Made me feel better about my shitty financial decisions",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 277,
                      "content": "I bought LAND for close to that amount. I am so startled right now.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 259,
                      "content": "i´ve been that person addicted to a phone game. I realized I was in trouble when I spent $600 on it in a month. How you get past the 2k range, idek",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 128,
                      "content": "This is the reason microtransactions are so profitable. For every 1000 people who spends absolutely nothing, there are probably at least 1 person like OPs husband.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I work with kids and some of them have gotten in trouble for blowing cash on these games. Because they're kids, and the companies that make the games exploit children's undeveloped understanding of money. I have real concerns about a 27-year-old having this little impulse control.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "sike my mom needs to work 4 years straight no holidays to make 58k\n\n(but i live in a 2nd world country so thats not that bad really its actually good making 1200 dollars a month)",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "How do you even do that?!  Is he not working and gaming 24 hours?  JFC there are junkies who would think that was out of control.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "When my son was about 6 i think, my cousin let him play on her phone while watching him (I didn't let the kids play with mine, too many risks). Him, not knowing better or having any real concept of money yet, spent $50 in a game. That was a huge amount in my opinion for a game! I cannot imagine $58 THOUSAND. My son learned his lesson and it's never happened again but you can be sure I'd be cutting off access to my husband or kids for an amount far less of it happened in my house.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I legitimately thought i misread the number the first time. 58k is wild to spend in one month in general, especially on something like a phone game. Like... How??",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Right?!?  I have been keeping track of every penny I spend other than non essentials (rent, phone etc).  I try and keep it under $1000 each month.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 125,
                  "content": "Hey you dont have to qualify your statement about why you made less in 2 years. It’s okay to make less, you dont have to explain why—people make less money it shouldnt be shameful.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "Also more than I earned in the last 2 years, and I didn't have any major medical bills. I made 56k in the last 2 years.",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "Yep. It is A LOT of money.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "Exactly-I used to make around 30k a year…..",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "That's more than I earned in the last four years (also due to medical issues). \n\nI'm sat here desperately saving to try and fund an electric wheelchair at 3k knowing it's probably going to take me around two years to save that up and this guy blows 58k in a month?\n\nHonestly, no matter what my income was, if my partner blew that much on a game I would be divorcing him. \n\nNTA but is this really who you want to be with for the rest of your life? Someone who you can't even trust with the family bank account? Someone who spends almost your yearly income on a game in a month? Honestly, you deserve better.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I make that in two years, perfectly healthy, 45 hours a week.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 414,
              "content": "Hiiiii I'm a teacher who earns less than that and seeing the amount made me feel ill.   \n\n\nI realise that some wealthier people can afford to lose that much, so I'm not necessarily in the right position to judge. But then if I look at it as he spent over a third of his yearly income in a month, that's insane too. Or a quarter of the household income. Jaysus.   \n\n\nNTA OP and I don't know what to tell you, other than most of us on this site are not qualified to give you advice.",
              "id": 22,
              "comments": [
                {
                  "score": 74,
                  "content": "The entire reason phone game exist is to land one or two WHALES, who spend money like water. If you're a phone game developer, it only takes a few of these guys to make your nut.",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -36,
                  "content": "So, you feel she had the right to take money HE earned, out of HIS acct, and put it under HER control...   \nThat's illegal and immoral...   \nAnd the fact that you're willing to cater to someone doing something like that because you don't like what he spent a Portion of HIS money on gives me a hint that you have No right being a teacher of children...",
                  "id": 24,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Found the husband. \n\nHe has an addiction. His spending is irresponsible and, frankly, very concerning. As a married couple, large purchases need to be discussed with your partner. At the rate he’s going he will soon bankrupt their household. Until he receives help, he can’t be trusted with money during his bender.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 180,
              "content": "Ikr?! Like even if it was spread out over a *year* that would be a lot of money, *possibly* doable with their high income but probably still pushing it. But in a MONTH?! Dudes gonna burn through their entire annual income in 3 and a half months playing a fkn marvel app... I can't fathom how someone could be so financially irresponsible that they spend TWO THOUSAND DOLLARS A /DAY/ on an app!!!",
              "id": 26,
              "comments": [
                {
                  "score": 75,
                  "content": "Right? I don't earn that in three years! I've never so much as spent NINETY NINE CENTS to go up a level in Candy Crush.\n\nI'm amazed it's possible to spend that much on a game...Gardens of Time sells packages of \"goldbars\" and shit for around 4.99, so even if I bought ever package possible I don't think I could spend that much in a year, let alone a month.\n\nNTA",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "It was actually in two weeks (from what I saw in his post). So more like 4K a month?!",
                  "id": 28,
                  "comments": [
                    {
                      "score": 62,
                      "content": "That's just bonkers. I almost feel like there's a serious mental issue going on here, I can't imagine someone spending 4 grand a day on a fkn mobile app when they're not *THAT* well off. (Like they have a reasonably high income but nowhere NEAR \"4k per day on a game\" levels of rich!)\n\nSuddenly blowing tens of thousands of dollars on a mobile app is an enormous red flag that something is seriously going on with him. I'd be curious to know if he has ever shown any prior indications of money problems (does he normally just blow thousands like it's nothing?!) or if this is a new sudden thing.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 88,
              "content": "This is almost twice our annual salary, and we support 5 kids.\n\nIt infuriates me to think this is in any way acceptable.",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "Even if we're assuming it was a 31 day month, that's still almost $2k **A DAY**. That's the price of a top-of-the-line graphics card - EVERY DAY. Right now I could book a week-long trip to Disney World for less than that. OP, if he can't get his spending under control, RUN.",
              "id": 31,
              "comments": [
                {
                  "score": 2,
                  "content": "If I had $2,000 right now, I could literally solve 80% of my problems in the next hour... bruh😞",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "More than this teacher.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Seriously and their salaries listed like that shit is relevant, you could make millions a year, 60k is still A LOT.",
              "id": 34,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "That’s more than I earn in two years working for a university in Florida. \n\nOP, you’re NTA.",
              "id": 35,
              "comments": [
                {
                  "score": -3,
                  "content": "So, you feel she has a right to tell him what he does with money he made?",
                  "id": 36,
                  "comments": [
                    {
                      "score": 4,
                      "content": "They’re married. It’s *their* money.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "That's more than I have *EVER* earned in a year",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Thats what I spent on my house!!!",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "Hijacking to link the husband's post:\n\nhttps://www.reddit.com/r/relationship_advice/comments/pquqzo/my27m_wife28f_wont_let_me_spend_any_of_our_money/",
          "id": 40,
          "comments": [
            {
              "score": 87,
              "content": "Holy shit. Dude says he doesn't \"communicate\" because he doesn't want to \"go down\" for domestic violence.\n\nNTA, OP. And run.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Can we discuss his domestic abuse comments that no one is addressing from his original post.",
              "id": 42,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "wow, not a lot of love from him to his wife there.",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Thank you!",
              "id": 44,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "The troll vibes are super strong.",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I'm reading the top-tier thread. Doesn't take a Batman to figure out that the guy has a gaming addiction.",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Thanks for linking.  If this is real, OP has way bigger problems than the $58K in one month.  His comments are concerning and cruel.",
              "id": 47,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "I’d also give him a flip phone to use.",
          "id": 48,
          "comments": [
            {
              "score": 58,
              "content": "I'd give him a Nokia. Snake doesn't carry microtransactions.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "🏅🏅🏅",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "I spent $4.49 on a mobile game once and felt absolutely stupid, how on earth you would spend that kind of money I don’t know 🤯",
          "id": 51,
          "comments": [
            {
              "score": 8,
              "content": "The game is make so you can compete with other people, and gain the one who spends more money. \n\n2 idiots like OP husband is enough to pay the game (can't be only one because competition is needed)",
              "id": 52,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Right? I feel bad spending $10 for an all day Pokemon Go event or however much it costs, even when that means I have a fun day with friends catching rare pokemon in the park. \n\nFifty grand though, how?!",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "If this amount is really correct, i would try to retrieve the money. Or go to a lawyer. \n\nAnd i would think about sending my husband to a doctor. If he think it is right to spend so much in a game, something must be wrong with him. I spend sometimes 70$ on Love Nikki and i feel bad about it. \nI even would think about breaking about, at least if he doesn't think his behavior was wrong and that he needs help - in whatever form.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "$58k on *any* game!",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "He’s a Whale, the type of addictive personality that these lootbox games try to target\n\nEdit: NTA and check out this video:\n\nhttps://youtu.be/wroOJqxFPe8",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "WTF? This is why I prefer paying for a game ahead of time instead of micro transactions. You end up paying way more.....\n\nNope he's gotta earn that trust back real bad, may I suggest couple's counseling and financial advice together to really show him how bad him spending that much is. He needs a seperate account for his fun money and that's it. But he used up at least 5 years worth of fun money already.\n\nNTA",
          "id": 57,
          "comments": [
            {
              "score": 2,
              "content": "His ‘pride’ won’t let him ask her to go to therapy since she has the money.  Like wtf?",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "> Anyone that would drop $58k on a phone game cannot be trusted with\n\n... literally *anything*",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This might be crazy, but what if this is an elaborate ruse to make people download the app? This situation is definitely far fetched, but also bafflingly believable. The question of finding out if it is possible to spend that much and what on, can be answered by downloading the gane. I did. Did you?",
          "id": 60,
          "comments": [
            {
              "score": 2,
              "content": "Nah it doesn’t sound like a game that appeals to me. And in-game purchase prompts piss me off rather than tempt me. I’d rather pay a flat fee upfront for a game and enjoy the content, unharassed.",
              "id": 61,
              "comments": [
                {
                  "score": 2,
                  "content": "I downloaded the came but could still don't understand how they spent over 50k on this",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2685,
      "content": "He spent 58k on in-app purchases for a stupid phone game? There’s bigger problems at play. I’d suggest an ultimatum for therapy on gambler’s addiction. I think you did the right thing, but the way might have been harsh. I’d suggest a temporary probation of funds for x many months until he could have that self control. And if truly a gambler’s addition, he probably shouldn’t be using gaming apps with in-app purchases like that. I still cannot comprehend how someone spends that much on a game with zero return. Hell, gambling would have at least possibly done something for you guys.",
      "id": 63,
      "comments": [
        {
          "score": 456,
          "content": "In a month as well??????",
          "id": 64,
          "comments": [
            {
              "score": 415,
              "content": "How the hell do you even do that?? I’m wondering if there’s a way to like buy drugs or something and then make the bank statement look like you spent money on something else. There may not be, idk, but being able to spend $58K on an app in a single month is almost less believable.",
              "id": 65,
              "comments": [
                {
                  "score": 165,
                  "content": "For real. Can you buy a car through in-app purchase?",
                  "id": 66,
                  "comments": [
                    {
                      "score": 143,
                      "content": "You wouldn't download a car",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 69,
                      "content": "Isn't that how these fancy folks buy their Teslas?",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "I don't know the details of how it would be money laundering but that would be less nonsensical. \nIf so maybe he was hoping to pass off malicious spending as just incompetent",
                  "id": 69,
                  "comments": [
                    {
                      "score": 2,
                      "content": "But he makes the lion’s share of the money and they had separate accounts before this. No matter what result he would be hoping for with malicious spending, he’d be hurting himself more than he’d hurt OP.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "This game is so addictive, it’s 100% the game",
                  "id": 71,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Wait really?",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "It's called money laundering, and it can happen. I work in online horse wagering and it's something we receive training for every year.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 109,
              "content": "They're called \"Gacha\" games. You can purchase packs for real money to have a chance at summoning a new unit. \n\nTo put things in perspective, the game I play lets you buy a $100 pack every day, and some people actually do it. I went and tallied my purchases over the last 2 years and was mortified by the results, but I was nowhere near $68k. Microtransactions really get to some people.",
              "id": 74,
              "comments": [
                {
                  "score": 41,
                  "content": "Some games let you buy *multiple packs* that are worth upwards of $100. \n\nOne YouTuber I watched spent $1000 on one gatcha game in the same hour for a video to see just what the odds were to pull something he wanted. \n\nGame doesn’t bat an eye at multiple $100 purchases.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "> a $100 pack every day\n\nthat would still be just around 3000$ at worst. Still bad but nowhere near the amount OP mentions.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Lots of those games have multiple types of packs you can buy. Just went into two of the games I play - one there's 17 packs I can buy today, another has 28 packs I can buy today plus 6 packs I can buy an unlimited amount of. If you get deep into it and want to win I can see someone buying everything every day.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "He obviously has a gambling problem.  Anyone who sees nothing wrong with spending $58,000 in one month on a game is a selfish idiot.  No way could I be married to someone like that.  He doesn’t give a damn about anyone else but himself.  He would spend you and your kids into the poorhouse without a second thought.",
              "id": 78,
              "comments": [
                {
                  "score": 3,
                  "content": "This. He needs to go to Gamblers Anonymous and seek out therapy for his gambling addiction.\n\nOP - I'm so sorry. \n\nHonestly - he's the perfect example of a person who needs a \"dumb\" phone instead of a \"smart\" phone.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "Her husband is a \"whale\", and is part of the 1% of people who play mobile games that underwrite the rest of the people who don't pay.  The games are explicitly *designed* to appeal to these sorts of people who have poor impulse control, and get them to spend exorbitant amount of money.\n\n\nYour husband needs professional help, and to learn how to avoid situations that trigger this dependency.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Seriously.  If he has to play a phone game, get one for 9.99 where that's all you'll ever spend.",
          "id": 81,
          "comments": [
            {
              "score": 89,
              "content": "These games are build for gambling addicts. You buy crystals and spin them like a slot machine in search of the 1% chance top prizes.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Yes, this almost textbook gambling addiction. He may not be winning actual money but the release of dopamine in the brain is the same as a gambler hitting a win. Then they begin chasing losses by speeding more $$ and getting a bigger dopamine high.\n\nHe needs to quit playing these kinds of games, full stop. He also needs some kind of addiction counseling as this issue will not go away on its own.\n\nSource: partner is a recovering problem gambler.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Especially as this particular game really pushes the loot box gambling model. They’re mercenary and manipulative, beyond anything else I’ve played.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Things I do not believe: this man with a gigantic spending/gambling problem had over $60,000 in his bank account (about half of his take home income) to spend on a mobile game.\n\nThat they got $50,000 refunded with very little fuss and that it apparently only took one days of communication.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1194,
      "content": "I'm absolutely flabbergasted that someone could spend so much on a video game. Like can you imagine the help you could bring someone's life if you donated that money instead? Ridiculous",
      "id": 86,
      "comments": [
        {
          "score": 438,
          "content": "I spend a lot of money on video games… but this is the down payment for a house, or a car in full right?",
          "id": 87,
          "comments": [
            {
              "score": 156,
              "content": "A nice car at that :/",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "Shoooooooot, $58k would replace both of the 20 year old Honda Civics that my husband and I own",
              "id": 89,
              "comments": [
                {
                  "score": 10,
                  "content": "58k is more than what I spent buying my house.  It’s a small house in the rural south, but I can’t even imagine spending that kind of money on anything but a house.   It’s crazy.",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I could buy like… 5-6 of my car with that money",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 52,
              "content": "That costs more than my Fiancé’s 2019 car (bought in 2020). Hell that costs more than my car and his car combined.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Can’t believe I moved back with the parents over the pandemic and some guy spent essentially three years of rent on a marvel mobile game. Dude. Disney literally doesn’t need your hard earned money.",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "58 could get a down-payment and nice car",
              "id": 94,
              "comments": [
                {
                  "score": 3,
                  "content": "Shit houses are dirt cheap where you live if that's true.",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "i live in a singlewide and own the lot and paid $55k.",
              "id": 96,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Two. That’s two cars paid outright.",
              "id": 97,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "That’s like twice the down payment on my house.",
              "id": 98,
              "comments": [
                {
                  "score": 2,
                  "content": "*cries in major city*",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My brand new car cost 20k. He could have bought 3 of them with that smfh.",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "It would be a very nice car for me, fully adapted to my (invisible) disability, pay for the full course for my drivers license and I would still have enough money to pay my car insurance for at least 5 years. \n\nThe amount of money OP's husband threw away at a game (in a month!!) is outrageous.",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 69,
          "content": "Especially a mobile game!",
          "id": 102,
          "comments": [
            {
              "score": 177,
              "content": "[removed]",
              "id": 103,
              "comments": [
                {
                  "score": 51,
                  "content": "marvel contest of champions is a game i play. playing for 3 years , never spent a dime and nearly completed all content. all you need is skill. i know its addictive but HOLY FUCKING SHIT , 58k?!?!? , max my friends i know spend 1k a year cuz on 4th of july , this game has some insane offers that cost money (i avoid it) . [I used to upload vids on this game and you'll see its cool.](https://www.youtube.com/channel/UC1fB606mQTs-pD9ra5m7sYA) but u/My_Husband_is_dumb needs to seriously stop the husband before he spends more.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 40,
                      "content": "I saw the original post her husband made. He said \"but the crystals make it faster to progress\" \n\nDude is impatient with a gambling addiction",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "Those games have a laser focus on exploiting addictive behavior. They are explicitly designed to make a small handful of people who are vulnerable to specific behavioral conditioning to just give up tens of thousands of dollars.\n\nOP's husband needs help for gambling addiction, but the biggest AH are the mobile gaming industry and the fact that it's 100% legal for them to design things to intentionally exploit vulnerable people.",
          "id": 106,
          "comments": [
            {
              "score": 5,
              "content": "Yeah, these games have to make a profit somewhere and it’s not from unskippable ads (usually for other games from the same devs) or purchase prompts that the vast majority of users ignore—they only really need a slim percentage of users with deep pockets to get hooked.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I heard a story about one of those competitive game where players fight each others. A (large and wealthy) group of friends decided to drop money on it to see how much was needed to be invincible. $300k to have an account at the top of the food chain.\n\nI played on various games on internet or phone (never paid anything btw). Most payments will lead you nowhere. Grinding a bit during an event will bring you the equivalent of $100 or $200 of in-game content.\n\nSome games give you real bonus if you drop $10 a month, but the logic is the same if you want more.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I preordered Devil May Cry 5 for almost a 100 euros and I cried... And didn't buy games after that for 3 months cuz I spent that money on one game lol xD",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 719,
      "content": "How is it even possible to spend 60k in one month on a game?!",
      "id": 110,
      "comments": [
        {
          "score": 605,
          "content": "Easy. \n\nHookers to blow you while playing: 30k. \n\nCocaine to blow while hookers blow you: 28k. \n\nFooling your wife into thinking you spent 58k on a phone game in a month? Priceless. \n\nHonestly, there's is no way this dude spent 58k on a game",
          "id": 111,
          "comments": [
            {
              "score": 197,
              "content": "~~I agree. Unless OP has proof this money was actually spent in this game she should assume it was spent on stuff he is trying to hide from her~~",
              "id": 112,
              "comments": [
                {
                  "score": 207,
                  "content": "Unfortunately the outlandish part is that he CHOSE to spend 58k on a phone game not that it's possible to spend 58k on a phone game. Phone games are extremely predatory. They always have 2 types of in game currency and the developers purposefully ensure the players experience is difficult/less enjoyable without the paid for currency.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Personally I have played mcoc and it does have premium Currency that you can buy you can also get that much by grinding (there is no seperation between paid and grinded like how some gatchas have paided gems mcoc does not) honestly I have no idea how he spent that much in a month.even if it's on cyber weekend or December which is when most people spend maybe like 1-5 k (I get Christmas tho it's the Christmas event is crazy but most people spend like 1k max) how does some guy spend 58k in a month I don't understand especially since I'm mostly f2p(spent less than $qpp in the 3-4 years I've been playing) and have gotten through most content in the game. I honestly have no idea how or what he did with that much money.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "But its so hard, for a months worth of playing, the game never really asks for that much. He must have gone above and beyond to do that. If it was just ”I need it to upgrade this” then no, I don’t think he could even spend that much. So I assume he just bought 58k worth of currency in a short time, since she managed to get some refunded he probably had most of the in game currency unusef",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 126,
                  "content": "Eh, I work for a bank and I've 1000% seen people spend wild amounts of money on shit like this, and worse — all on a credit card. I've seen people spend hundreds or thousands in a month on only fans. People obsessively spending money on micro transactions of some kind (is it a video game/app? Online gambling? Some kind of cryptocurrency? Sometimes I can't tell) to the tune of thousands of dollars. \n\nYou name it, I've seen it. Email from a guy whose fiancee recently died tragically and was just now learning she spent tens of thousands on eBay with his credit card. Older gentleman who bought thousands of gold bullion on credit. People who seem to be spending their money on international calls or chats — likely porn once it's over a thousand dollars and the charges are constant. \n\nOne dude opened a credit card, made a transaction as large as his entire $25,000 balance to pay scientology, and then just never paid it. One email from a customer furiously railed against us because we \"allowed\" her to spend $15,000 over her credit limit (can happen for any number of reasons) and she was a shopping addict who went to Hawaii on vacay. Total balance was probably close to 50k.  Transactions were mostly designer shopping. \n\nOne woman said she was financially struggling after Covid hit because her husband lost his job so now she was paying for all the expenses and I pulled up all her transactions and her checking account showed that she'd just dropped $500 at chanel, $750 at Barney's and for *months* had been going to a cheesecake bakery multiple times weekly where her cheesecakes were $50-$75 every time. \n\nI've seen people spend close to $10,000 on the home shopping network and QVC *in a single day.*  Enough transactions and it will usually crash my system when I try to review it lol. The low end of this is when kids spend like $1,000 on Xbox, apple, or Amazon Kindle because they don't know or aren't being watched. When adults do this it happens like op described. \n\nIt's definitely possible he spent it on OTHER stupid things but people can and do spend thousands on micro transactions, QVC, cheesecake, high end designer shopping sprees, gold, Xbox, porn, etc all the time.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 77,
                      "content": "[deleted]",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Wow I need to hear more of these stories.",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "She did say she looked at their bank statement and that there indicates where the money was being spent. If there were a bunch of ATM or CashApp transactions on the statement, THEN I would consider that theory.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "She says in the post she got some of the money refunded from Apple so... it was spent on the game.",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "She says she got most of it back from Apple, that seems like pretty good proof.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Doesn’t it show in bills or account statement on what it was spent on",
                  "id": 122,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yes, it would be hundreds upon hundreds of $1 to $100 transactions to the same Apple Store company/game.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 84,
              "content": "Unfortunately, it is possible.\n\nThere are a large number of games on the market that basically function like gambling, but aren't regulated in most countries. They exploit the same addiction patterns as slot machines, etc. Their entire funding model is based around \"whales\" like OP's husband (players who spend thousands upon thousands of dollars) for worthless digital \"stuff\".\n\nI know of people who've spent close to that amount on these games, and with way less base income than OP's household has. It's horrifying, but it does happen.",
              "id": 124,
              "comments": [
                {
                  "score": 14,
                  "content": "In two weeks?\n\nThat's a tier 60ish item every 12 minutes, every hour, for 8 hours every day for two weeks straight. He'd have to spend all his time mashing the purchase button with no time left to play the game.\n\nTh stories I see about 'whales' are people spending 500-1000 in a month, not 100k+",
                  "id": 125,
                  "comments": [
                    {
                      "score": 63,
                      "content": "As someone who plays this game, I know you can spend much quicker than people in this thread seem to believe. \n\nIt takes one button press to buy the $100 currency pack.\n\nIt takes one button press to spend that newly acquired in game currency on 10 of the highest cost \"loot box\".\n\nIt takes one button press to open all 10 at once. \n\nIf someone is speeding through it, it'd take maybe 20-30 minutes to spend and use $58k in game.\n\nThe biggest youtuber for this game regularly opens $300-$500 worth of crystals in a single 10-12 min video, and he stretches those openings to hit that time.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "An argument like the one you just made (about the particular game and the prices of the relevant items) is fair enough. Those numbers make it seem like there must be other sources of gambling than the one he's admitted to.\n\nHowever, people scoffing at how \"nobody spends that kind of money on *video games*\" are minimizing a very serious actual problem, presumably through ignorance of how these systems work.\n\nAnd while most high-spending players are dropping more moderate sums, there are certainly extreme outliers:\n\n- https://yukaichou.com/gamification-interviews/exclusive-interview-man-spent-30000-single-game/ (30K spent)\n\n- https://www.gamesindustry.biz/articles/2019-10-16-space-ape-games-chasing-whales-is-not-our-strategy (150k spent)\n\n- https://venturebeat.com/2016/10/14/the-deanbeat-this-player-spent-2-million-in-a-mobile-game-then-he-led-a-boycott/ (2 million spent)",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "You do realize that it takes 5 seconds to spend 99.99$ on the game, right? It’s the cost of the unit pack. And i phone has 1 click pay feature. \n\n\nYou’re stressing yourself out with all this math. Takes 2 seconds to buy 100$ worth of “units”.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I just said this to someone else but I work in a bank and once saw a transaction history that was basically $10,000 in QVC and Home shopping network...in a single day. \n\nShopping and gambling addictions aren't really about the end result so much as the potential/possibility. I doubt he cares about playing the game anymore.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Marvel contest of champions is a game i have and still play, it is ABSOLUTELY possible.",
              "id": 130,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "No, every single action in such a game can be made faster/easier by using crystals. But paying 100$ for crystals will bring you nowhere. And there are lootboxes with random content that you can buy.\n\nAn average player working on the game for one month will get in-game content that would cost thousands to obtain immediately by paying.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "[removed]",
          "id": 132,
          "comments": [
            {
              "score": 45,
              "content": "[deleted]",
              "id": 133,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 47,
          "content": "He must really suck at the game.",
          "id": 134,
          "comments": [
            {
              "score": 5,
              "content": "Nooooo shit",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Look at some of the sidebar items on r/gachagaming .   Addiction to some of these games would make 60k seem small.   I definitely read of at least 1 that hit over a million on a gacha",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Easy, it's not even that difficult. And when the transaction history is full of apple store/google pay to the same company it's hard to say, sorry I spent it on drugs and hookers.\n\nFor someone just starting, a few thousand a day is very very doable. Once established it's hard to spend more than maybe $1k, with occasional spikes when new stuff shows up.",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "It's probably a gacha game.. so you spend money and theres an x% chance that you'll get x item. I want to say most gacha games are pay to win and they prey on people with gambling addictions. I started playing a few gacha games and it can be hard to stop spending once you stop- although 58k in a month is VERY concerning. (In my case I spend like $15-20 per month which imo is much more reasonable)",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 495,
      "content": "Woah. 58k would change my life. I can’t imagine somebody being irresponsible enough to spend that in less than a month on a video game. NTA",
      "id": 139,
      "comments": [
        {
          "score": 152,
          "content": "It would literally cover the tuitions for my undergraduate and masters degrees….feel sick just thinking about that amount",
          "id": 140,
          "comments": [
            {
              "score": 36,
              "content": "Me too! I thought it was a typo at first… I literally feel sick to my stomach on how much that is",
              "id": 141,
              "comments": [
                {
                  "score": 9,
                  "content": "If I had that money I could literally pay off my loans I took out for the MSc 4 times over at least which is infuriating. I’ll be paying this loan for 30 years until it’s waived and will probably never fully pay it off.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Your loan is like ~12K$? Im a little confused what you mean by “i could pay off my loans [] 4 times over at least”",
                      "id": 143,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "It would pay off all my partner's and my debts, plus the wedding and honeymoon we have planned, with some seed money left over for a house down payment.\n\nTo spend that in a game at all, let alone over ONE MONTH?  I hope this is fake, because I'm too angry at the thought of people burning money like that!",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "same. This post completely ruined my mood",
          "id": 145,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 295,
      "content": "So you're telling me your husband managed to spend $2000 a day, every day, on in-game purchases. That is, $2 every single minute if he played for 16 hours straight every day for a month. \n\nHe must be quite quick at making purchases and have very little else to do with his time, while also somehow making $150k a year at a job that doesn't interfere with his ability to spend time blowing 2k a day on a mobile game.\n\nAnd then after he blew the equivalent of a year's salary for you, you calmly sat him down and said 'We should control our spending and consider our financial future'. And he was like 'no this is perfectly reasonable, let me post to Reddit about it'. \n\nYes, I see, this all sounds very plausible.",
      "id": 146,
      "comments": [
        {
          "score": 243,
          "content": "More like 4K a day on average. Since he spent 58k in about 2 weeks. he’s an engineer. And 150k a year isn’t exactly Forbes type money.\n\n\nAnd after I sat him down, I called Apple and was able to get the most recent purchases refunded. But his kabam account was suspended as a result.",
          "id": 147,
          "comments": [
            {
              "score": 75,
              "content": "Oh right, ok, that makes it much more plausible.",
              "id": 148,
              "comments": [
                {
                  "score": 154,
                  "content": "Less plausible actually. I mean that’s twice as fast as your suggested rate.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 135,
                      "content": "INFO: Did you actually see the transactions yourself? He needs help for a gambling addiction. \n\nSecondary edit: just saw the husband's supposed post. I'm very worried and concerned for you and your safety. If you haven't read it already I suggest googling \"Lundy Bancroft why does he do that free pdf.\" Please give it a read and consider how and if it applies to your situation.\n\nHis reaction and complaint seems financially and verbally abusive. His addiction is out of control.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": ">kabam account\n\nWell the Kabam account makes it much more plausible given how especially bad the microtransactions are in Marvel Contest of Champions.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "That was obviously sarcasm..",
                      "id": 152,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "What do you find difficult to believe about it? Have you heard of one-tap payment on cell phones? I play a game like this and I control myself, but it wouldn't even be difficult to spend this amount at $170/tap. The people who routinely rank first in the events in my game spend even more than this.",
                  "id": 153,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Forbes money maybe not, but I make about half that as a skilled professional and carry a family of five as the only earner.\n\nHe could have given a thousand dollars each to sixty charities and still come out massively ahead because of the tax credit.\n\nIt's going to he really hard not to face the moral implications of this spending choice IMHO.",
              "id": 154,
              "comments": [
                {
                  "score": 1,
                  "content": "I don’t think we get tax credits for charitable donations anymore, after the republicans changed the tax code to transfer wealth to the 1%.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You can write the cash off your income up to a certain point. But yeah, Trump killed itemizing for the people who needed it the most.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Why were Apple asked to do a partial refund?",
              "id": 157,
              "comments": [
                {
                  "score": -8,
                  "content": "I just told them a minor did it",
                  "id": 158,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Might want to delete this comment…",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -1,
                      "content": "This is bullshit behaviour. If an adult has genuinely made these purchases, then you should suffer the consequences of those decisions. You’re committing fraud.",
                      "id": 160,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -15,
                      "content": "you should not have called and got a refund, he is a grown adult that made the choice to spend that king of money. he needs to suffer the consequences of his actions, this does not look to kindly on you for ringing up and lying",
                      "id": 161,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "That is very plausible. Check the christmas events especially 2019 and you see that people spent at least  $100k to get the top 1 spot",
          "id": 162,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 181,
      "content": "NTA. He has a serious addiction and needs to practice some restraint. \n\nI suggest you open a separate account for him, that he can manage for himself. Both you paychecks should go into your main account,  and then a fixed amount can be automatically transferred to his \"fun money\" account.",
      "id": 163,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 120,
      "content": "NTA. He spend $60k on a phone game. In a month. He spent your yearly salary… in a month. You can only afford a couple more months of this.",
      "id": 164,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 92,
      "content": "NTA. Your husband is an irresponsible child. Call a divorce lawyer.",
      "id": 165,
      "comments": [
        {
          "score": 34,
          "content": "No, it sounds like he’s a gambling addict. So yes to the irresponsible part, but addiction isn’t confined to adolescents or young adults. There are otherwise mature and well adjusted people who struggle with this",
          "id": 166,
          "comments": [
            {
              "score": 18,
              "content": "Just because it’s an addiction doesn’t mean his wife has to stay with him while he figures it out",
              "id": 167,
              "comments": [
                {
                  "score": -1,
                  "content": "Where did I say she had to?! What the hell",
                  "id": 168,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "He also basically says in his post that he would beat her if it wasn't legal. Dude is a loser all the way through.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He is worried about beating his wife over this.\n\n\"Ive have some problems with anger/violence in the past. And I don’t really wanna go down for domestic violence.\"\n\nShe should run.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah, but he ain't one of those people...",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 72,
      "content": "INFO Can you link his post?\n\nBased on what you've written I'd say NTA since I can't imagine spending that much money on a game, he essentially spent your earnings for a year. You don't accidently spend that much on a game, he's got a problem and needs help.",
      "id": 172,
      "comments": [
        {
          "score": 77,
          "content": "[this is it according to someone in the comments of my original post](https://www.reddit.com/r/relationship_advice/comments/pquqzo/my27m_wife28f_wont_let_me_spend_any_of_our_money/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
          "id": 173,
          "comments": [
            {
              "score": 161,
              "content": "So he has abusive/violent tendancies and has a gaming addiction??? Babe, he needs serious help and restricting his access to your money isn't gonna solve the underlining issues. NTA for doing it obviously because he can't be trusted with $, but you've got bigger problems.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "The same person wrote both posts. This has to be bullshit because I know from experience that even if your credit card has a $60k limit, if you suddenly drop more than $600 in one month on the App Store, Apple automatically flags your account and you have to confirm it’s legit. I know this because my kid *tried* to spend $700 on a game because they didn’t think anyone had to pay it.",
              "id": 175,
              "comments": [
                {
                  "score": 44,
                  "content": "Sound logic….except it was **his** *debit* card",
                  "id": 176,
                  "comments": [
                    {
                      "score": 92,
                      "content": "Girl leave now. He literally posted on Reddit with a threat of domestic violence. Get out now.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -3,
                      "content": "Unless he has a habit of spending 60k in a month, the bank would flag it as suspicious activity and freeze his card from online transactions.",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "not if he had a habit if spending money like that. they may flag you the first couple of times, sure, but if you confirmed that you are indeed spending that much money regularly, they'll stop flagging it.",
                  "id": 179,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "THIS. My partner and I play Pokemon Go (come at me, I know we're too old for this shit) and routinely buy 99c packs (we've not spent close to the OP, please don't worry haha) and one night while buying multiple packs my card was blocked by my bank for suspected fraud. I was using PayPal through the app store with the card linked - my PayPal also blocked further transactions. I had to call to unblock my DEBIT card. It's also happened to my partner - different bank.\n\n\n\n\nIdk if US Banks are different but in Australia most banks have diligent fraud teams that will not play when it comes to frequent deductions that are not comparable to usual spending habits.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Based on his comments on that post, your only reasonable way forward is divorce.\n\nHe's not remorseful. He feels violent impulses towards you.\n\nYou make enough money to support yourself.  Divorce this guy, spend some time solo and talk to a therapist to figure out why someone like this appealed to you, and how to avoid such a big mistake in the future.  It's worth getting out now so you can have a chance at a healthy relationship in the future.\n\nIn the meantime, put a limited amount of money in his account each month (or maybe each week at first) so he has control of his own spending money and can start trying to practice impulse control.  It will also reduce conflict between you two by removing your role as his financial jailer.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}