{
  "post content": "I have two children with my ex. Our daughter’s 5th birthday was the first birthday we weren’t together so we came to the agreement that I would plan everything and he would pay for it. He said I could spend as much money as I wanted and since our daughter was taking the breakup badly, I wanted to go all out for her special day.\n\nDespite acting like he wanted no part in the planning, he was an absolute nightmare. I had his credit card and he originally said he didn’t need me to tell him everything I was spending money on but then he suddenly started being nasty about it. He kept demanding I tell him everything I’d booked and would criticise every little thing. I didn’t care about him wanting input into the party but the way he was speaking to me made me feel dirty for needing to have him pay for everything. I only sucked it up because our daughter knew about some of the things I had arranged for her already which I would’ve had to cancel if I started fighting with him. \n\nNow our son’s 2nd birthday is next month and my ex has once again suggested I plan the party and he’ll pay for it. I've refused because I’m not going to let him make me feel the way he did while I planned our daughter’s again. I told him he would need to plan the party and that I wanted no part in it. He has apologised for how he behaved and he claims he’d never do it again. Granted he has been a lot nicer to me recently but I’m still not comfortable putting myself in that position again. \n\nSince I won't plan the party, he’s making up bullshit claims that I favour our daughter over our son. He’s also said if I don’t plan a party our son wouldn’t have one since he’s too busy to plan it but he could always ask his mother for help.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 8159,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 3161,
          "content": "But make sure to take pictures of him and the cake so you can show him when he’s older",
          "id": 3,
          "comments": [
            {
              "score": 2141,
              "content": "She declines doing the work for him again because he was an asshole. He begs and promises he won’t be an asshole again ever! She politely declines again. He proceeds to be the blazing asshole he is again proving her point. Assholes rarely change, NTA",
              "id": 4,
              "comments": [
                {
                  "score": 557,
                  "content": "This was my ex. He couldn’t understand why I banned him from all events and said- you want a party you plan and pay- and do it on your parenting time. He only was able to con a neighbor 2x into making a cake then gave up. So yeah do this and do your own parties without him.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 133,
                      "content": "How hard is it make a cake? You can even buy one SMDH",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "Why are you participating in this argument? Just plan a small party & pay for it. Solve your problem.\n\nYour son is 2. He won’t remember.\n\nESH",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 101,
                  "content": "That's why you divorce them! This man's nonsense is no longer OPs problem.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "This should be the top comment. An astute observation. \n\nOP is NTA.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "How is it so hard for people to understand that when you break up/divorce you can't demand your ex cover for your shitty parenting. This is the second post today where I want to scream \"THEY'RE YOUR EX SO THEY NEED TO HANDLE THEIR OWN PARENTING\" \n\nSeriously my parents were divorced and my parents split my birthday and xmas day in half (change over at lunch) amd the best thing about having two households was THE TWO CAKES i got every year. My dad couldn't do much with his limited time with me, but he always got me a professionally decorated cake (which was ridiculously priced for just the two of us) and we had whatever I wanted for dinner, either he made my favourite or I picked the restaurant.\n\n It doesn't have to be extravagant to show your kids that you care, just put in a little effort and plan SOMETHING to show you care.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Oh the ex will always be an asshole, no doubt, but OP is opting to punish their son instead. \n\nDo a party at home, don't take the Ex's offered money, but DO take the Ex to court to get child support.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Exactly",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Hence the divorce, I'm sure...",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -7,
                  "content": "I suspect he didn't anticipate the £700 price tag.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 29,
                      "content": "But he’s perfectly happy to suggest the same arrangement again, without setting a budget, and is now complaining that she *isn’t* being as extravagant as last time. So I don’t think he’s actually upset about the financial aspect.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Because “spend as much as you want” doesn’t actually mean that?",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -7,
                  "content": "So let's punish the kid? Doesn't need to go all out but he's already proven to not care, she's just coming down to his level. No one wins. Now everyone is an AH\n\nMy parents split up and my dad did not make my mom's life easy for any event. But she never just dropped her hands and gave up because he could be a dick. The kid deserves more.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -9,
                  "content": "I have a feeling she got ridiculous with the 5 year olds party, and he felt she was spending way too much. Spend as much as you want means within reason.  Just because its not your card doesn't mean you can go overboard. A  5 year old doesn't need a massive party with venues and events. She got carried away going \"all out\" and had to be reigned in.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Spend as much as you want means spend as much as you want. If you mean something else then don’t say “spend as much as you want”. If you don’t say what you actually mean you don’t get to turn around and be nasty when people take your words at face value.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 43,
                      "content": "I can see how you would get this interpretation, but if it were true I think we'd be seeing 2 things we aren't seeing:\n\n\\- Instead of a bunch of small criticisms from the ex, there would have been \"he said I was spending too much\" and him backtracking into a price limit.\n\n\\- He wouldn't be trying to do it again, or if he did he'd be offering on condition of a price limit.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "My mom tried shaming me because on my 2nd birthday I apparently decided I wanted to wear my cake with the pictures to prove it.\n\n\n\nOnly one of us had control over our facilities at that time, mom!",
              "id": 21,
              "comments": [
                {
                  "score": 17,
                  "content": "Your mom tried shaming you now for something you did when you were two while under her supervision. She sounds like a peach./s",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -20,
              "content": "And he can see how you went all out for his sister and not him. Your son is more important that your feelings about your exes rudeness.  Hes only two, but you set the bar with sisters party and to do nothing for him?  You would be showing favoritism. Why should his gma be the one to give him a party? If dad isn’t responsible then you need to step up.  He’s your son regardless of his dads involvement.  I see a golden child in the making.",
              "id": 23,
              "comments": [
                {
                  "score": 17,
                  "content": "He's not even 2 yet. He won't remember his sister's party and in a year's time won't remember his own. You are imagining a golden child. Stop it.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 178,
          "content": "OR, OP, tell your ex you'll do separate parties moving forward. The kids can have two! You do what you want to do, and then when they go with their dad, he can plan what he wants.\n\nIn the event of a peaceful divorce between two people want the kids to come first, it makes sense to do joint parties. In the event of a divorce of someone who treats you like garbage, you don't need to celebrate anything with him. You can be polite at pick up and drops offs. You can communicate when it comes to important things with the kids. Otherwise, that's it.",
          "id": 25,
          "comments": [
            {
              "score": 16,
              "content": "Yes, do this. Kids are happy with a cake and games at home, just invite a few friends. Doesn't need to cost much. \n\nHe can organise - or fail to organise - a separate party.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "This 👆🏾👆🏾👆🏾👆🏾👆🏾👆🏾👆🏾👆🏾",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Yes, this exactly",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Yeah, why is she booking venues for a five year old's party? Bizarre.",
          "id": 29,
          "comments": [
            {
              "score": 106,
              "content": "Most people in my area don’t have large enough homes for a gathering of more than 3-4 kids. Parties are usually at gyms, parks, or Chuck E. Cheese type places, all of which have to be booked in advance.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "Do YOU want a small army of excited and full of energy 5 year olds running through your house? Forget Freddy Krueger, THAT is the real nightmare. There's a reason you can book out play gyms, trampoline parks/bouncy gyms, arcades, etc. It's so you can let them burn off all that energy in a safe, contained space that's fun for everyone. Bonus points to the ones that actually have decent food, so the adults can have a snack while smiling, waving and saying \"Yes, I saw you! That was a really big jump!\"",
              "id": 31,
              "comments": [
                {
                  "score": 33,
                  "content": "Oh heck yes.  The difference between a venue with greasy pizza and a sticky floor vs a venue with coffee for the adults and comfy chairs to sit in is like $150.  And realistically the cheaper venue has hidden costs anyway because they charge extra to order enough food to feed everybody.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Jeez, that's cheap. Around here it's about 15 a head and that does not include food. So most kids share parties! My 7 year old had a joint party with 2 other kids and we made the food ourselves and still cost 200 each family (inflatable Park, 30 kids). Sharing parties is also good because it means that it's not a different party every bloody weekend.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Maybe not \"venues\" like for the wedding, but places, where children can play and have something to eat in the eating area. There are so much possibilities - indoor playgrounds, museums (some of them), swimming pools, zoo etc.",
              "id": 34,
              "comments": [
                {
                  "score": 3,
                  "content": "True. I guess my son's fifth was at a gym in an old school. It cost maybe $30.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Also, some people live where it gets cold.  Winter birthdays are awful for that.  There is absolutely no way to do it for less than $300.  These places are absolutely predatory.    \n\n\nI even looked at the local community centres.  It would have been $250 for an empty room with a cold floor.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I mean, seems like that’s their lifestyle. Or was. I wouldn’t fall for it again if I were her.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Mom guilt - 5 year old having a hard time with the divorce and mom wants to let her kid forget all the shot they have been through in the last year or however long. \n\nI mean a venue could be anything from a kid’s play area to the community club house. She didn’t say she booked a ballroom at the local hotel.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Yeah, I’m wondering what kind of money we’re talking about here, since she didn’t say. A typical party, or a Kylie Jenner party? Someone can say spend what you want, but assume it’s for a normal party. \n\nAlso, people are saying he’s a bad father. This post was way too vague to assume that. Maybe he works long hours and OP doesn’t.",
              "id": 39,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "I mean I've been to two 'venue' parties as a kid. One of them was in an arcade and the other was in McDonald's.\n\n We don't know how big her house is and how many kids are going to be there either so it could be reasonable, but like a commenter below suggested more INFO on the scope of this party would be appreciated.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Yeah, and dont tell you ex about your party plan. Let him find out afterwards. \n\nOr, tell him you will do it if he signs a contract you will draw up and instead of a CC, give you CASH for what he wants to contribute.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1905,
      "content": "He’s your ex for a reason. \n\nWhy are you participating in this argument? Just plan a small party & pay for it. Solve your problem. \n\nYour son is 2. He won’t remember. \n\nESH",
      "id": 42,
      "comments": [
        {
          "score": 374,
          "content": "I agree, you absolutely do not need to include your ex anymore. It’s the perk to splitting up - freedom! Have your own party and do not invite him. You’re new to this, but I can assure you this is how it goes.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Does that really make her an asshole as well? She shares custody with him, she can't ignore him. And organising a to lavish birthday party for a two year old is stupid not asshole-ish.",
          "id": 44,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 748,
      "content": "Well, we see why you are divorced.\n\nDocument all of this. Screen shots of any texts he has sent. \n\nThis behavior is going to wind up with you both in family court.",
      "id": 45,
      "comments": [
        {
          "score": 120,
          "content": "This is such a bad plan anyway.  Put a budget together and give it to him -once-.  He can either accept the whole thing and let you use the credit card or reject it and have separate parties.  No haggling, mush less drama. \n\nBuying the kids’ affection with parties is a bad plan anyway.  They need you two to be the grownups and learn to co parent without fighting. ESH .",
          "id": 46,
          "comments": [
            {
              "score": 17,
              "content": "The problem is, the ex is playing a game where he says he will pay for it all, and then act like he is being taken advantage of. Give him a budget and he will just argue that the cost is way out of his range and \"she knew it.\" That is what he wants to argue in front of a judge. \n\nSome parents get bitter over the divorce results, so they will lash out (nobody should be surprised by this). If the dad is paying child support that he doesnt think is fair (im not arguing that issue) he could easily argue that paying for extravagant birthday parties for small children on top of what he is ordered could be unfair. Im not justifying his behavior, and keep in mind that some moms have taken advantage.\n\nThe ex in this situation though is doing bait and switch, and then gaslighting with the false favoritism claim.\n\nOP just needs to keep any parties that she manages under her own budget. If ex wants to throw a party, he can do the same. OP is right to tell this guy that he made a big deal about it, now he can do it himself.",
              "id": 47,
              "comments": [
                {
                  "score": 1,
                  "content": "I agree the ex is playing games-  but this is why OP she shouldn’t play. Stick with the plan, submit the budget. Then he only has one answer: yes or no.\n\nIf he starts to haggle just don’t play. That’s a no and he can plan his own party.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Sticking with a budget that he says he will pay for IS playing his game. OP just cant trust him. That why it has to be her budget on her dime, or he can do it himself.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "[removed]",
          "id": 50,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 441,
      "content": "You are split up. It's time for separate parties.\n\nForgot to add a judgement, nta.",
      "id": 51,
      "comments": [
        {
          "score": 16,
          "content": "This, I have divorced parents and for years begged to not be forced into a bday party where both parents were there. My parents were horrible together and it took far too long for them to become aware that I recognized that.",
          "id": 52,
          "comments": [
            {
              "score": 6,
              "content": "My best friend had the same issue as a child and as an adult has a strained relationship with both parents due to their behaviors towards one another. They never split her parties and every year she dreaded her birthday. I took her for a concert one year that was on the actual day of her birthday, she still talks about it almost 2 decades later. The drama two unhappy parents carry always trickles down to the child.",
              "id": 53,
              "comments": [
                {
                  "score": 3,
                  "content": "Absolutely!!! I hated my parents together. The fake smiling and pretending to be friends was so uncomfortable. Luckily they eventually recognized it but I had many years of dreading holidays prior to that.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I'm glad they learned eventually. I hope that you've got peace in life. Big hug!",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "[removed]",
          "id": 56,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -6,
          "content": "Just FYI, judgement has to go at the top if you want it to count",
          "id": 57,
          "comments": [
            {
              "score": 9,
              "content": "> judgement has to go at the top if you want it to count\n\nNo, it can go anywhere in the comment, as long as it's a top level comment.",
              "id": 58,
              "comments": [
                {
                  "score": 0,
                  "content": "I see. I’ve seen different comments on it.",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Thanks",
              "id": 60,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 293,
      "content": "NTA - it’s his second bday and he won’t remember whatever you do. Keep it small to your friends and family and do it at home.",
      "id": 61,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 261,
      "content": "INFO How much did you wind up spending on your daughter's birthday?\n\nUnless you went completely crazy on the bithday, I'd say N T A, but...if you would up renting a circus or somthing (yes, I'm exaggerating, but you get the point!) then Y T A.\n\nIf you did wind up spending an excessive amount on a 5 year old's birthday, then I can see your ex getting upset about it.\n\nBut for a 2 year old... as others have said, a cake and small party at home would be plenty. You don't need to hire magicians or clowns or bouncy castles (for example.)\n\nEdited to add judgement. NTA all the way.",
      "id": 62,
      "comments": [
        {
          "score": 127,
          "content": "Right? INFO missing, like how much was spent. She said she went all out to make it special. Plus it’s on a credit card, sooo those have limits. Maybe he thought it would be smaller price tag and gave a credit card with a smaller limit.",
          "id": 63,
          "comments": [
            {
              "score": 58,
              "content": "For all we know OP might have gone crazy spending and the ex freaked out.",
              "id": 64,
              "comments": [
                {
                  "score": 66,
                  "content": "Then he could set a budget in advance, same as he should now. ESH",
                  "id": 65,
                  "comments": [
                    {
                      "score": 46,
                      "content": "It depends. Expectation of telling anyone to plan a 5 year old birthday party can range from 200-500 dollars. If you go spend 3k on it, I would be pissed.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Agreed. I mean they need to be able to communicate for the kids sakes. This is the first of a billion decisions they'll make as Exes who share kids. Together they need to agree on a budget of (hypothetically) $300 and stick to it.\n\nIf she spent 2K on a pony, a Disney Castle and a professional Cinderella without clarifying the budget then I can see him freaking out. If taking 10 kids to McDonalds for $125, then he's TAH",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "He he shouldn’t have told her to spend as much money as she wanted.",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "It certainly seems poor communication was one of the factors in the divorce.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 68,
          "content": "I spent around £700. He wasn't upset about the money, he was upset about something unrelated and used the party as an excuse to be a dick.",
          "id": 70,
          "comments": [
            {
              "score": 45,
              "content": "Arrange a small celebration this time as your son is just 2. Plan for a big event for his 5th birthday- 1) it makes things even between your daughter and your son 2) your son has a much better chance of enjoying everything when he is 5 vs when is 2.\n\nAsking your ex to plan and pay for a party is fine - any discussion on the topic is redundant though ( you do not need to bother if his mom is dragged into the planning part or not. They can plan all they want and arrange something. It’s not your concern anymore!) NTA",
              "id": 71,
              "comments": [
                {
                  "score": 18,
                  "content": "> 2) your son has a much better chance of enjoying everything when he is 5 vs when is 2\n\nThis is true. When my son turned 2, he started crying when everyone at the party crowded around him and started singing happy birthday, because it startled him! He also got grumpy towards the middle because it was nap time. Turning 5 was a much better experience lol.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "That’s how my ex was, too. It’s not about the money - it’s about the control. Being able to browbeat you over every little decision is his way of keeping his control over you and the kids. \n\nNTA. And I highly recommend having separate events from now on. You won’t have to deal with his issues or presence, and the kids get double the parties. They’ll love it & he’ll hate it, lol",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "NTA if you find it in your hart write down some ideas write them to him and he can take care of booking everything. Just ideas no work/paying yourself . It's his child too.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "This is not waht you said on the main post",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "This. The complete lack of context honestly makes me suspicious that OP did indeed spend crazy amounts. For Miss 5, they should've agreed on a budget. \nFor Mr. 2, calm down, he's TWO, ffs.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 144,
      "content": " “Tell me your budget and Venmo me the money and I’ll take care of it.  Last time it seemed as though you have a different budget in mind and got mad at me. I wanted to be explicit this time, so there’s no misunderstandings. I’ll provide receipts and a refund afterwards if necessary.”",
      "id": 77,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 89,
      "content": ">I had his credit card and he originally said he didn’t need me to tell him everything I was spending money on but then he suddenly started being nasty about it.\n\nInfo: was it normal spending or did you take the piss?",
      "id": 78,
      "comments": [
        {
          "score": 39,
          "content": "I think OP has been vague about her spending for a reason. She had booked several things (that the girl knew about), maybe other things as well.",
          "id": 79,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "She said £700 in a comment",
          "id": 80,
          "comments": [
            {
              "score": 13,
              "content": "Unless they’re absolutely minted, that’s a hell of a lot.\n\n\nAverage mean UK salary is around £33k, so around £26.5k after tax. That’s including salary weighting for London. With the current cost of living crisis, £700 on a kid’s party seems mind-boggling.",
              "id": 81,
              "comments": [
                {
                  "score": 7,
                  "content": "I don’t disagree!! That’s insane!",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Booked and thingS in the same sentence, has me thinking she took advantage of the situation and credit card. As well as she said she went all out, and he had said it would be ok at the start, then suddenly he was interested-id say likely because he didn't realise she was going to go all out Kardashian style and wanted to know where his money was being spent, and why it was costing so much, likely much more than he anticipated and probably because she did more knowing it was coming out of his pocket.\n\nAnyway, the kid is turning 2. They won't remember it. They can have a basic party, cake, party food, playtime doesn't need to be extravagant because again, hes 2 years old. Kids that age are happy playing with a roll of toilet paper, anything that makes a mess and anything that is brightly coloured or makes funny noises, and they'll fall asleep before its even time for the cake. Have family and maybe friends who have kids they know, come. There's no need to go all out because let's be honest, there comes a point where it stops being a party for the child and starts being a party so the parent can show off to other parents",
          "id": 83,
          "comments": [
            {
              "score": 30,
              "content": "If that’s the case why would he offer the same deal this time around?",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 47,
      "content": "NTA. If he doesn't do anything, throw a party during your time with the kids.",
      "id": 85,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 42,
      "content": "What exactly does it mean \"I wanted to go all out for her special day\"? I mean, the girl turned 5... and you had booked several things (that she knew of - and maybo other that she didn't know of). How much were you actually spending?\n\nI think judgement may depend on this. Maybe he told you money was not a problem when he thought about snacks and cake for 5-year-olds, some games, maybe a clown... but if you went and rented the Disneyland hotel and the characters to sing Happy Birthday, he would have been pissed. OR maybe you were planning a regular party for a 5-year-old and he was being a miser. We can't know unless you tell us what you had planned.",
      "id": 86,
      "comments": [],
      "relation": "No"
    }
  ]
}