{
  "post content": "My GF has been dealing with a drinking problem, owing to some serious trauma in her past. She's been up front and open about it from the start, but it's been a lot to handle, particularly whenever we go out to eat. I've offered to not drink in front of her for the time being and not go to restaurants that serve alcohol. But she's told me that just because she can't drink doesn't mean I should feel I can't, and that she wants to try new foods and be able to go to places with me. Today she suggested that we go for late night bowling or out to eat so she can meet my best friend who just got back into town. I hesitated, because she's been triggered in both spots, not being to stop crying in the bowling alley because of her anxiety and trying to cope with sobriety. Last time we went downtown she made us leave two different restaurants because she didn't like the vibe, and when we did find a spot she ordered a glass of wine after I pleaded with her not to. She didn't end up drinking it but then could barely look at me for the rest of the night, like she completely disconnected and wasn't really there. It was scary to see. With all this in mind, and remembering how she's been telling me all week how exhausted she's been because of work I didn't think going out for a late night was a good idea. I texted her, \"I need to do some work tonight, and after the week you've had I think it'd be best for you to rest. We could Prime (Amazon Prime watch party) if you'd like.\" I will be the first to admit that was poor wording from me and would naturally come off as me telling her what to do and mansplaining to her. That was not my intention, but I very much understand how it would be read that way and acknowledge it was a mistake. She was understandably upset with that, \"Well I don't really need you to tell me what is good for me and I am trying to make time for you and I wouldn't suggest it if I was that beat, but fine. Forget it.\"\n\nI tried explaining that I didn't intend to tell her what to do but was concerned that the last two times we'd gone out after she worked a full day she ended up getting triggered, having bad anxiety, telling me that she was exhausted and ended up in tears both nights. I told her that I didn't want to see her struggle like that or have a borderline dissociative episode like that night downtown. That didn’t land either “I can just spend it with somebody who actually wants to hang out with me. You can have a pleasant f\\*\\*\\*\\*\\*\\* Sunday without whatever f\\*\\*\\*\\*\\*\\* dissociative, triggered attitude you think I'm going to bring to the table.\" I haven't responded to that because I honestly don't know what to say and felt that anything I did was just going to make it worse. My first text wasn’t great, but I'm also hurt by what she said at the end. I struggle with my own anxiety and depression, and I've spent the entire evening feeling like the lowest piece of trash. Am I the @\\*\\*hole here?",
  "id": 1,
  "comments": [
    {
      "score": 7,
      "content": "This isn't about being an AH or not.\n\nThis is about the fact that your gf clearly needs some serious help with her trauma.  Therapy possibly medication etc.\n\nI'm gonna say NAH",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Yeah, NAH, but I really hope the OP considers joining [Al-Anon](https://al-anon.org). Making himself in charge of her sobriety isn't healthy for either of them.",
          "id": 3,
          "comments": [
            {
              "score": 5,
              "content": "I absolutely agree, I'm not a professional and not equipped to provide the help she needs. She is in AA and has a sponsor. I've encouraged her to find a primary care doctor here (she moved from another state 6 months ago). She's also a veteran and I've encouraged her to see if the VA can set her up with a therapist or provide some resources to do so.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA. \n\nI think you were actually really considerate thinking ahead of how your girlfriend would feel in those spots. \n\nHowever, this is a conversation that should have been had with her. You should have asked how she feels about going to those places she previously had a bad experience in and talk it out, instead of making a decision without her input.",
      "id": 5,
      "comments": [
        {
          "score": 2,
          "content": "You're right, and that is a conversation I intend to have with her. We've talked about what happened each night after it happened, but today I should've started with that. Not to throw it in her face but reflect on what happened before, suggest a few alternatives and check in to make sure she didn't feel pressured to go out because I'd enjoy having a cocktail or two. We both have the 4th off so I try again tomorrow, apologize for any misunderstanding and come at it from this angle. Thank you",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Specifically about the text I sent my GF, which she interpreted as mansplaining to her. I included my original text, along with her responses. I also gave some background without revealing any identifiable details so readers could have some perspective. I am asking the community if I was an @sshole tonight\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy GF has been dealing with a drinking problem, owing to some serious trauma in her past. She's been up front and open about it from the start, but it's been a lot to handle, particularly whenever we go out to eat. I've offered to not drink in front of her for the time being and not go to restaurants that serve alcohol. But she's told me that just because she can't drink doesn't mean I should feel I can't, and that she wants to try new foods and be able to go to places with me. Today she suggested that we go for late night bowling or out to eat so she can meet my best friend who just got back into town. I hesitated, because she's been triggered in both spots, not being to stop crying in the bowling alley because of her anxiety and trying to cope with sobriety. Last time we went downtown she made us leave two different restaurants because she didn't like the vibe, and when we did find a spot she ordered a glass of wine after I pleaded with her not to. She didn't end up drinking it but then could barely look at me for the rest of the night, like she completely disconnected and wasn't really there. It was scary to see. With all this in mind, and remembering how she's been telling me all week how exhausted she's been because of work I didn't think going out for a late night was a good idea. I texted her, \"I need to do some work tonight, and after the week you've had I think it'd be best for you to rest. We could Prime (Amazon Prime watch party) if you'd like.\" I will be the first to admit that was poor wording from me and would naturally come off as me telling her what to do and mansplaining to her. That was not my intention, but I very much understand how it would be read that way and acknowledge it was a mistake. She was understandably upset with that, \"Well I don't really need you to tell me what is good for me and I am trying to make time for you and I wouldn't suggest it if I was that beat, but fine. Forget it.\"\n\nI tried explaining that I didn't intend to tell her what to do but was concerned that the last two times we'd gone out after she worked a full day she ended up getting triggered, having bad anxiety, telling me that she was exhausted and ended up in tears both nights. I told her that I didn't want to see her struggle like that or have a borderline dissociative episode like that night downtown. That didn’t land either “I can just spend it with somebody who actually wants to hang out with me. You can have a pleasant f\\*\\*\\*\\*\\*\\* Sunday without whatever f\\*\\*\\*\\*\\*\\* dissociative, triggered attitude you think I'm going to bring to the table.\" I haven't responded to that because I honestly don't know what to say and felt that anything I did was just going to make it worse. My first text wasn’t great, but I'm also hurt by what she said at the end. I struggle with my own anxiety and depression, and I've spent the entire evening feeling like the lowest piece of trash. Am I the @\\*\\*hole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. I mean, you maybe didn't word things great, but that doesn't make you an AH.\n\nAlso, as long as we're being honest, your girlfriend sounds like a gigantic AH.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA, and I sympathise as one of my ex's was an alcoholic as well. You were being very considerate of her needs like that, but it would have been best to talk about it as a team rather than just saying that's what is going to happen. You did make this decision without her, and it's likely why she blew up. But I know that talking to her about plans can be tricky and daunting, especially if she's already feeling out of sorts.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    }
  ]
}