{
  "post content": "English isn´t my first language and there isn´t really an English equivalent of what my current housing is called, so I´ll just stick with apartment.\n\nFirst, a bit of backstory. I(19F) suffer from social anxiety as a result of bullying when I was younger. Because of this, I wanted to challenge myself when I start college by sharing an apartment with someone else. So, I moved into this shared apartment a week before college started and was met with possibly the dirtiest room I have ever seen. My room wasn´t too bad, but the shared kitchen/entry and bathroom was straight up filthy. It was incredibly dusty, there were stains everywhere, including the bathroom, and even the inside of the refrigerator was so dirty that the bottom drawer was actually stuck! My mother did a really incredible job cleaning up the place, she worked so hard to make clean the kitchen/entry and the bathroom, while I unpacked, assembled furniture from IKEA, tidied and cleaned my room. It took us three days to make this apartment habitable, and I am incredibly grateful for everything she did to make my first apartment as homely and clean as possible.\n\nThe problem I am now facing, and the reason I want to move out, is my roommate. I don´t have anything against my roommate, she´s nice enough, it´s just that we have been sharing this apartment for 2 weeks now and she has slept here, without her boyfriend, once. She and her boyfriend alternate between sleeping at his place or at her place, which is also my place. I don´t mind it when they´re at his place, I actually prefer it, the problem is when they´re here, and I can hear them... passionately hugging... in the middle of the day... or keeping me up at night. This paired with my anxiety is stressing me out and making me terrified of leaving my room when I know they´re here. It got to the point where I missed a day at school because I was too scared to walk past them. I have also missed several meals because I´m scared of bumping into them in the kitchen. I´m fine when it´s just her, but I can´t handle it when her boyfriend is here.\n\nSo, I want to move. Because of the way this student-apartment-complex-thingy works, I don´t have to put in a three months’ notice or anything. I just have to submit an application to change apartments. If my application is accepted, I will have both apartments at the same time for the remaining days of the month, and the move will be finalized at the end of the month. The apartment I want is literally in the same building, just the address next door. The problem is that if I move, I feel like I´m throwing all the hard work my mother did, back in her face. And considering how she´s like, that is most likely how she´ll feel too.\n\nWould I be the a\\*\\*hole if I moved?",
  "id": 1,
  "comments": [
    {
      "score": 10,
      "content": "NAH, but have you tried talking to your roommate or mentioning your issue? I know it's really hard to do, but that might save you from having to move. If you're worried about how your mom would feel, talk to her about it and tell her why you're thinking of moving. I bet she'll understand.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NAH\n\nIt's not your fault for having anxiety and it's not their fault for having a normal relationship.\n\nCould you first try talking to your roommate about not passionately hugging in the common area because it makes you uncomfortable?",
      "id": 3,
      "comments": [
        {
          "score": 1,
          "content": "Came here to say this. It's been 2 weeks and it could get better with a simple conversation",
          "id": 4,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH- but are they having sex in the common area?  Why are you afraid to walk by them? It seems the best thing to do is ask the roommate to keep their weird sex stuff confined to her closed bedroom.  If they’re already keeping to the closed bedroom then trust me, they have no idea you’re even walking by.  They may not even notice if they’re doing it out in the open. \n\nThis sounds like it could easily turn into a liveable situation. If they’re screwing around in the kitchen and on the couch, ask them to please only do that in their room.  Or go out to the living room and turn the tv on and sit down and start watching it.  That might motivate them to retreat to her room without you saying anything.  The best thing would be to just talk to her directly in person or even with email and explain your social anxiety and that you want both of you to be happy when you’re there.  Ask her if there can be a schedule of when she’ll be home and when she’ll be at the boyfriend’s. If you can work that out, then that takes away the anxiety of just never knowing what to expect.\n\nAs far as moving and your mother go, if you move yourself to the new place and don’t involve your mother in the repacking, unpacking, and cleaning of the new place, then you’re not being an asshole to her no matter what your mom thinks. If you call her up and expect her to help you with the move, then she’d be justified being irritated.  Also is the other place you’d move to empty all the time? Or would you be taking a chance with another roommate?  Look you can do what you want as long as you accept sole responsibility for doing it.  If you move don’t even tell your mom until she  it’s said and done and just give her the new address and the backstory.  \n\nThe issue here isn’t your mom’s feelings.  It’s you beginning to live like an adult.  Whichever decision you make you need to be careful not to let yourself get so consumed with anxiety that you stop making yourself step outside your comfort zone any time anxiety flares.  If you let anxiety control you like that it will begin to do so more and more until you have isolated and paralyzed yourself which will smother your future. I’ve been there with anxiety, but you can’t let it keep you from your responsibilities. Missing an hour of class due to being unable to push yourself to make a ten second walk by them where you can ignore them if you like seems excessive. You can stay contained in your classes/bedroom/bathroom when they’re there if you invest in a cheap tiny fridge/microwave. Then you only have to deal with them as you go in and out. Again, it seems like you’re on your own a good amount of time anyway which believe it or not is a roommate jackpot. Would the want to move in together in the new apartment and you stay where you are? A decision really should not be made until you’ve talked or communicated with your roommate. It’s better to do in person. Try everything you can to be there in person, but if you must email be calm and even apologetic, not accusatory.  Start out saying what you like about being her roommate or something.  Compliments usually keep people from getting defensive.\n\nThe other thing to do regardless of if you move or stay is to go to student health and ask for help with anxiety if you aren’t already receiving it. Therapy, medication, exercise, good diet, and a structured schedule is the best way to keep anxiety from taking control of you. Ask if there are student support groups for those who suffer with anxiety.  You’ll fall among people who understand and might even make a friend that you can room with for the rest of college so you don’t have to deal with the awkward stranger-for-a-roommate situation every year.  I think you should try to make it work there instead of moving, but if you do move, keep your mom out of it, go to student health, begin to work on your anxiety, and find a group of likeminded people to vent to and befriend. Good luck:",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nEnglish isn´t my first language and there isn´t really an English equivalent of what my current housing is called, so I´ll just stick with apartment.\n\nFirst, a bit of backstory. I(19F) suffer from social anxiety as a result of bullying when I was younger. Because of this, I wanted to challenge myself when I start college by sharing an apartment with someone else. So, I moved into this shared apartment a week before college started and was met with possibly the dirtiest room I have ever seen. My room wasn´t too bad, but the shared kitchen/entry and bathroom was straight up filthy. It was incredibly dusty, there were stains everywhere, including the bathroom, and even the inside of the refrigerator was so dirty that the bottom drawer was actually stuck! My mother did a really incredible job cleaning up the place, she worked so hard to make clean the kitchen/entry and the bathroom, while I unpacked, assembled furniture from IKEA, tidied and cleaned my room. It took us three days to make this apartment habitable, and I am incredibly grateful for everything she did to make my first apartment as homely and clean as possible.\n\nThe problem I am now facing, and the reason I want to move out, is my roommate. I don´t have anything against my roommate, she´s nice enough, it´s just that we have been sharing this apartment for 2 weeks now and she has slept here, without her boyfriend, once. She and her boyfriend alternate between sleeping at his place or at her place, which is also my place. I don´t mind it when they´re at his place, I actually prefer it, the problem is when they´re here, and I can hear them... passionately hugging... in the middle of the day... or keeping me up at night. This paired with my anxiety is stressing me out and making me terrified of leaving my room when I know they´re here. It got to the point where I missed a day at school because I was too scared to walk past them. I have also missed several meals because I´m scared of bumping into them in the kitchen. I´m fine when it´s just her, but I can´t handle it when her boyfriend is here.\n\nSo, I want to move. Because of the way this student-apartment-complex-thingy works, I don´t have to put in a three months’ notice or anything. I just have to submit an application to change apartments. If my application is accepted, I will have both apartments at the same time for the remaining days of the month, and the move will be finalized at the end of the month. The apartment I want is literally in the same building, just the address next door. The problem is that if I move, I feel like I´m throwing all the hard work my mother did, back in her face. And considering how she´s like, that is most likely how she´ll feel too.\n\nWould I be the a\\*\\*hole if I moved?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH but as someone who has had and still has anxiety issues, leaving the problem will only make it worse next time",
      "id": 8,
      "comments": [],
      "relation": "No"
    }
  ]
}