{
  "post content": "I recently uploaded a ad on Facebook market place saying I’ll build a custom pc. Couple hours later I get a new message, I open it and someone wants me to build a pc for him, simple enough. He sends a picture of a pc that’s easily 5 grand, I inform him of this and he says can you build it for 1200? I said not in a million years which he replies with make me a cool pc with a 3090 for $1200. For those who don’t know 3090s are around 1 grand. I told him that’s not going to happen I could make you a cool looking Pc but it’s not going to have a 3090. He gets really mad saying he’s 13 and has been earning money by mowing lawns for 3 years and he deserves this pc. I congratulate him and say I still can’t do it in which he demands i take money out of my own pocket and pay for the rest. Blocked him and thought that was over. I told my gf about it and she said I was the a-hole. Now I have around 170k in the bank and she said I could’ve easy payed for it which is true but I have no reason to do it. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 5237,
      "content": "You offered to build a pc, not buy a pc for someone.\n\nNTA",
      "id": 2,
      "comments": [
        {
          "score": 1593,
          "content": "She can pay for it if she's going to act that way. And then there will be all the other unrelated kids you don't know who will arrive. NTA.",
          "id": 3,
          "comments": [
            {
              "score": 908,
              "content": "This. OP, tell your GF she was right, it would be a kind thing to do, then hold out your hand for the 2k (or whatever). Tell her that you're impressed by her kindness and that she's willing to pay for the PC for him. See how she reacts, then ask why you should be expected to do the same if she's not willing to.",
              "id": 4,
              "comments": [
                {
                  "score": 304,
                  "content": "Ooooo please do this OP. I can’t stand when people volunteer other people for things or expect someone to do what they won’t 🙄",
                  "id": 5,
                  "comments": [
                    {
                      "score": 52,
                      "content": "AND she was nice to enough to spend his money for him to.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "agree, plus let  her know she needs to start learning how to build PC's coz once word is out you've started a Charity....your names will be everywhere",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 118,
              "content": "Right!\nFriends of 13 yo: where'd you get the awesome PC?\n13 yo: OP, here's his contact info\nFriends: bet it was expensive AF\n13 yo: no man I got it for $1200\n\nHere comes all the other kids thinking they can get the same deal\nNTA",
              "id": 8,
              "comments": [
                {
                  "score": 34,
                  "content": "I live with a 14-year-old.  News of the new PC and what he paid for it would be all over his friend group in about half a second.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Half of them won't even be kids, parents will ask, will tell friends and they will contact claiming to be kids.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "NTA and how do you know they're actually 13?  Versus making up a story to manipulate you?",
          "id": 11,
          "comments": [
            {
              "score": 40,
              "content": "Does it matter? It's not doing the 13 year old any favors to teach them other people should just give them shit.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "He demanded OP pay 4k out of pocket simply because he \"earned it\" mowing lawns.\n\nThat seems like a perfectly fine reason to assume that they're telling the truth, either because they're physically 13 or they're mentally 13",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "[deleted]",
          "id": 14,
          "comments": [
            {
              "score": 41,
              "content": "Lol. \"Ask\" ?\n\nSounds like kid didn't even ask just demanded.\n\"I earned it\"\n\"Stranger give me free stuff\"",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I struggled for years with guilt because my abuser-relative wanted to keep my free labor and I had finally walked away.  Some people are taught to believe that they should always put their own needs last, and other people's wants first.  Therapy helps.  This could well be a real person struggling to know if their action was valid and reasonable.  If the gf is manipulative and reinforcing the idea that OP should be a doormat to the demands of others, it's a very real possibility that this is real.  Even if it's not, there might be ghosts reading this and wanting to know if they did the right thing, refusing to comply with demands of the entitled people in their lives.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "OP just wanted to throw in they had \"170k in the bank\"",
              "id": 17,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "Yeah and 13years old like nobody has ever lied online to get what they want.",
          "id": 18,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1760,
      "content": "NTA, but your Gf's point of view is weird and concerning",
      "id": 19,
      "comments": [
        {
          "score": 665,
          "content": "It’s not real money it’s just her bfs money",
          "id": 20,
          "comments": [
            {
              "score": 103,
              "content": "He should have asked her to pay for the rest",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Yep, NTA OP, dump this girl, anyone that sees your savings as free money for anyone else who asks doesn't need to be a current anything except possibly 'enemy' so better make her an 'ex'.",
              "id": 22,
              "comments": [
                {
                  "score": -7,
                  "content": "Lmao chill your tits.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It's really easy to pat yourself on the back for spending someone else's money.  She gets to feel all generous while putting literally nothing in the pot.",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -5,
              "content": "And what's his is hers",
              "id": 25,
              "comments": [
                {
                  "score": 2,
                  "content": "Mi dinero es mi dinero. Tu dinero es tu dinero. \nMy money is my money. Your money is your money. Relationship doesn’t change ownership of money unless they have a joint account which they dont",
                  "id": 26,
                  "comments": [
                    {
                      "score": 0,
                      "content": "I feel my sarcasm was lost",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 59,
          "content": "Yeah, the 13 year old has worked for his money but OP didn't deserve their hard earned money?",
          "id": 28,
          "comments": [
            {
              "score": -18,
              "content": "Three years and you only have 1200? I understand the kid being upset because he's worked hard, but honestly it's the parents that are assholes.",
              "id": 29,
              "comments": [
                {
                  "score": 33,
                  "content": "Wait, what? How much do you think a 13 year should have after working for 3 years? And how are the parents assholes?",
                  "id": 30,
                  "comments": [
                    {
                      "score": -23,
                      "content": "14 year olds can work jobs at locations like publix and chick fil a. \n\nThe least they could possibly get paid is minimum wage, so they'd make 1200 in a couple of weeks. \n\nEven if the kid can't find a job because of age, 1200 is still way too little for mowing lawns for 3 years.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "3 years is 36 months. In half of those you can't mow lawns in the first place. How many lawns do you think a 10-13 year old is gonna mow? Making 100 bucks a month is very good.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Plus not every lawn will need to be mowed by random 13 year old kid. \n\nMy first house had a really steep back yard. Too steep even for my dad to mow it with the super light, easy to manuever electric mower I owned, and he was a full grown adult man. I maintained it with a machete and a modified weed whacker. I had steel toe shoes from work and cut proof pants I wore to deal with the flying debris. I'm not letting a kid back there to \"mow\", they'll get seriously hurt! \n\nMy current house has a landscaping service built into the HOA dues. We don't need to pay someone else, we already pay for it. Plus, it's super dry here, so the lawn doesn't actually grow all that much anyway, and is only not dormant for about 3 months of the year. \n\nMy neighbor growing up was really particular about how his lawn was mowed, and wouldn't let anyone else do it. \n\nOur house growing up had a decently large front yard, and a pool in the back, so my dad wouldn't have let a random kid mow. Front was too large to do by push mower in the heat/humidity, the riding mower wasn't kid friendly (short people like kids couldn't push the brake without setting off the dead man switch and making it backfire. Learned that the hard way), and the back was too risky cause large water filled hole. \n\nAnd those are just some examples I can think of off the top of my head!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "1200 seems fair as going by that amount that works out to $7 per week but that is not counting the fact that he probably bought a drink and treated himself over the 3 year's be able to save that amount in 3 year's sounds like he is a smart kid so he would spend half save half",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "According to his Gf's logic, I could ask OP for thousands of dollars too because hey, he's got enough money and I need a new car but don't have enough money to buy one. I mean, is OP obliged to help anyone who needs something just because he has the money?",
          "id": 35,
          "comments": [
            {
              "score": 3,
              "content": "Maybe she's right, we could ask Jeff Bezos or Elon Musk, ...",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 786,
      "content": "NTA\n\nWhy would you pay for something out of pocket for someone who's been rude to you that you don't even know. \n\nI don't understand how your GF would think that would be a good use of your money. Like, if you were going to spend 3.8k on random people, then surely you would donate it to charity and not to an entitled kid who wants a fancy pc",
      "id": 37,
      "comments": [
        {
          "score": 73,
          "content": "And atleast with a charity you get tax receipts NTA",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Nah, OP better buys all of us a new Pc. We all deserve it. /s",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yeah, there's lots fo great ways to give to single moms, disabled people, homeless people, cancer patients with crippling medical debt, a 13 year old being entitled is not a great candidate even if he DID want to help some stranger!",
          "id": 40,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 426,
      "content": "NTA - I worked for three years, where is my private island?",
      "id": 41,
      "comments": [
        {
          "score": 75,
          "content": "You better not get it before I get my beer garden. I worked overtime.",
          "id": 42,
          "comments": [
            {
              "score": 44,
              "content": "I've been working for 6 years straight!!! Still nobody is giving me a goddamn house somehow😡",
              "id": 43,
              "comments": [
                {
                  "score": 10,
                  "content": "Hey you won't get dirt until i get my villa, i worked 5 years on call!",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I worked for 20 years straight, never received anything for free.",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Lol. Kid’s in for a rude shock to learn he’s only got around another 50 odd years to work yet.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Shit if you include babysitting as a teen I've worked for thirty years. I deserve a continent by now.",
          "id": 47,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 251,
      "content": "NTA -- Tell your girlfriend if it means that much to her then why doesn't she pay the difference for him?.",
      "id": 48,
      "comments": [
        {
          "score": 14,
          "content": "[removed]",
          "id": 49,
          "comments": [
            {
              "score": 0,
              "content": "Bad bot - partial copy of Godsthetics' post from 3 hours before yours.\n\nReport-> Spam ->Harmful bots.",
              "id": 50,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 103,
      "content": "NTA, i'm more worried about the gf that said you were the ah, is she used to just getting gifts from you, and you always pay everything?",
      "id": 51,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 94,
      "content": "Tbh you could have posted this into  r/choosingbeggars\n\nNTA",
      "id": 52,
      "comments": [
        {
          "score": 47,
          "content": "I did I got a couple people telling me that I was kinda a dick about it",
          "id": 53,
          "comments": [
            {
              "score": 84,
              "content": "What the heck.\n\nI guess People get all defensive because its about a Child. But choosingbeggar is a choosinbeggar no Matter the age.\n\nAnd ,as someone Who knows how expensive these components are, I find it ridiccolous that there even are People Who tell you that you should have just bought the rest out of your pocket and given him pc that is 2-3x more expensive than he could afford.\n\nAlso even if you wanted to do a VERY generous act and agreed to that, it most likely would have ment that there would have lined up more kids trying to take advantage of you, after letting this first kid to take advantage.",
              "id": 54,
              "comments": [
                {
                  "score": 21,
                  "content": "I want to know *why* a 13 year old needs a 3090. I have a 1650 super and can play all my games on normal or slightly above normal graphics just fine. You can upgrade later. \n\nI know there's games (like Tarkov) that need a better graphics card, but from what I've seen of games like that ... 13 year old kids shouldn't be playing those.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Obviously he doesnt *need* it. But you know, People often want the Best of the Best, especially kids, even tho their usage of computer would never require anything even close to that high end components. But its just cool to have 😁",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Nah. The 13-year-old was being rude and demanding. You were under no obligation to be civil to him. Kid's gotta learn manners sometime.",
              "id": 57,
              "comments": [
                {
                  "score": 3,
                  "content": "If it was even a 13 year old kid. I have doubts.",
                  "id": 58,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I read the post. There were some sarcastic remarks but no one actually calling you an ah",
              "id": 59,
              "comments": [
                {
                  "score": 18,
                  "content": "I got a couple direct messages saying that I was a dick I’d be glad to show u in our own dms",
                  "id": 60,
                  "comments": [
                    {
                      "score": 37,
                      "content": "dm on reddit is 90% someone that already knows their take cant survive a discussion so its pretty safe to just assume the opposite of what the dm says",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "That's fucked up.  Add those people to the AH list along with the 13 yr old kid.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I wonder how many of them are 13yo kids who desperately want a PC XD.",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "No, you weren't. You advertised a service, not to give your money away.",
              "id": 64,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Those were from other 13yo looking to pile onto discounted computer systems ;)\n\nAside from the plain outrageous nature of this entitlement, if your GF had her way, what would the kid learn about the value of money?",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Lots of people seem very eager to spend other peoples money. I’ve also built a PC and you’re 100% in the right. The money he had barely would cover the cost of a single component never mind the entire build never mind your time and expertise. This kid came to you and said not only will you build this for me for free, you’ll also pay for the bulk of the components. Wow what a great deal for you!",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Too many people let kids off easy because they're kids. It's possible that they were the same way and don't want to reflect on it, or maybe they're raising their own kids that way. Who knows? But being a child doesn't excuse shitty and entitled behavior. And if people let a kid get away with that kind of behavior, then the kid has a good chance of growing up and staying that way. You're NTA.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Ignore them. They are probably choosing beggars also.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 74,
      "content": "Nta. That kid is super entitled. Even if he was family you have no obligation or reason to pay for a pc for him or anyone.",
      "id": 69,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 56,
      "content": "NTA\n\nYou've done a great service to the gaming community for keeping a toxic 13 yo off the servers",
      "id": 70,
      "comments": [
        {
          "score": 18,
          "content": "🤣",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "[removed]",
          "id": 72,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 34,
      "content": "NTA. Why should you be expected to build and fund a computer for a random kid? He can keep saving for it. You are running a business, not a charity.",
      "id": 73,
      "comments": [],
      "relation": "Support"
    }
  ]
}