{
  "post content": "My wife(44F) makes quite a bit less than me(45M) so our joint expenses are split 70/30. For the most part things like vacations and where we bought a house are decided based on what she can afford, but there have been several times I've paid in full for vacations to places I really enjoy and wanted to share the experience with her.\n\nShe has a 23y/o son from her previous marriage. When she and I got together I told her I wouldn't mind paying extra for things here and there until her son was 18 and working or in school so she could take care of him. For the majority of our relationship, he has lived with his father. He decided against college or trade school and hasn't expressed any interest in starting to figure out a plan for the immediate future let alone his life. He floats from job to job, and his father is pretty much the same since the kid graduated. Therein lies the problem: every few months they'll call her for a few hundred dollars here, a few hundred there, 20 bucks this week, 80 the next. Sometimes it's her son calling for help, sometimes it's her ex-husband. This has caused her to be short on funds for our plans, or things she volunteered to cover on more than one occasion. Her reasoning when its her ex asking is that since their son still lives with him, she has to help him. I get that to a point.\n\nWe were supposed to go on a vacation later this month. Nothing major or fancy but just time away. We had agreed to split the cost and all that was left to pay for were the hotels, rental car, and some reservations. Her ex-husband called needing help getting his car out of impound and getting caught up on rent. Their son hasn't been able to get to work without the car because he doesn't want to ride a bike or take a bus. Almost 5 grand later they're set up but my wife told me she can't pay for her portion of our vacation, so I told her I was canceling it. She called me a heartless ass, that she's just taking care of her son and we've been arguing over it but my stance is this: they're both able-bodied adults that keep making a series of life decisions that keep them at a stand still (like quitting jobs over little things, smoking, going out) and her always digging them out of their hole is starting to impact our lives more and more, and I didn't sign up for that. AITA for canceling our vacation instead of just footing the entire cost myself?\n\n\\*\\*\\*To clarify: She contributes 30% of her pay to our joint expenses: bills/utilities, emergency fund, retirement. 70% of her pay she keeps for her personal expenses and to spend or save how she wishes. Dates, vacations, and fun things we choose to do together are budgeted and planned based on what we can afford from our personal funds. Pool that money together than pay together.",
  "id": 1,
  "comments": [
    {
      "score": 23217,
      "content": "NTA\n\nWhy are you married to her though, since she clearly puts her ex and grown son before you and your marriage? \n\nShe's enabling their financial irresponsibility, and that will never change.",
      "id": 2,
      "comments": [
        {
          "score": 7463,
          "content": "OP is subsidizing the ex through a financial polycule.",
          "id": 3,
          "comments": [
            {
              "score": 4541,
              "content": ">polycule.\n\nTIL what a polycule is.\n\nEdit: just to add that it is not a Pokémon as I first considered.",
              "id": 4,
              "comments": [
                {
                  "score": 1774,
                  "content": "It's not a pokemon.....yet. give them time.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1139,
                      "content": "> It's not a pokemon.....yet\n\n<Dugtrio has entered the chat>",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 73,
                      "content": "Dugtrio is already there",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 208,
                  "content": "Don’t keep us in the dark! What is a polycule?",
                  "id": 8,
                  "comments": [
                    {
                      "score": 649,
                      "content": "Essentially it is a polyamorous term for people who are sort of networked together. I.e. I'm dating my girlfriend, my wife has a boyfriend or girlfriend, all of us together form a polycule. Think like a molecule diagram but for relationships that aren't one to one.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 391,
                      "content": "A polycule is a portmanteau of the words \"polyamorous\" and \"molecule\" which is used to represent the greater dynamic of poly couples (and their extended relationship). \n\n\nPartner A (displayed in the model below) is in a relationship with partner B\n\nPartner B is in a relationship with partner A and partner C\n\nPartner C is in a relationship with partner B\n\nIn this model the entire group would be considered a \"polycule\". Partner B would be considered a \"hinge\" as they are the connecting partner between 2 people whom are not in a relationship directly. The relationship between partners A and C would be considered \"metamours\" meaning they do not have a direct relationship but share a mutual partner. If partner A and partner C were to have a romantic relationship alongside their shared partner (partner B) then the group could be considered a thrupple (throuple). \n\n\n(Partner A)----(Partner B)----(Partner C)",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 160,
                  "content": ">not a Pokémon\n🤣🤣🤣🤣🤣🤣🤣🤣\n\nBrilliant comment",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 111,
                  "content": "Honestly I have been reading through the polycule comments for so long I have forgotten what the original question was 😂.",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 109,
                  "content": "Polycule, I choose YOU!",
                  "id": 13,
                  "comments": [
                    {
                      "score": 85,
                      "content": "Polycule used Google Calendar! It’s super effective!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 77,
                  "content": "\"Gotta catch 'em all\" still kind of fits.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": ">it is not a Pokémon as I first considered.\n\nDon't give them any ideas",
                  "id": 16,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I’m convinced the creators of Pokémon already went off the deep end with sick inspirations. \n\nAnyone who has watched Pokémon AND the John Waters film “Pink Flamingos” should be able to spot the obvious parallels between Jesse & James and the “filthiest couple on earth” aspirants Connie & Raymond Marble.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": ">polycule\n\nA polycule is three or more people who are connected romantically and/or sexually.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Glad I’m not the only one thinking polywrath with Hercules’ hair 😂",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 158,
              "content": "Yeah, I understand helping out her son but the ex is just ridiculous. There is absolutely no need to keep paying for him, and she is enabling him & her son. OP is NTA, as his wife agreed to pay her share before going on the holiday & spent above her budget knowing this.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "What did you just call him?\n\nAlso A polycule is three or more people who are connected romantically and/or sexually,”",
              "id": 21,
              "comments": [
                {
                  "score": 53,
                  "content": "I thought that was called a thrupple?",
                  "id": 22,
                  "comments": [
                    {
                      "score": 127,
                      "content": "Thrupples are for threesomes. Polycule covers all the permutations.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 92,
                      "content": "A thouple would be three people who are all dating each other. That's actually very rare long term. A polycule is the greater circle of connected people IE my girlfriend and her husband, my male partner and his other partners. I'm not in a relationship with those people. They are however part of my polycule since they are involved with my partners.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Potentially... Strictly speaking \"thrupple\" is a \"three person couple\" so three people how are all dating each other.  \"Polycule\" covers pretty much any possible configuration of people, so as other people are saying... All thrupples are a polycule, but not all polycules are thrupples.\n\nAlso most people within the poly community call it a \"triad\" relationship if all three people are dating each other, because frankly there are not many people who like the word \"thrupple\".  It just... Doesn't sound good, as a word 😅😅.  \n\n\"A V relationship\" works for a relationship where two of the three people *are not* dating, because that relationship looks like a \"V\" and not a triangle.  Triad=triangle specifically.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "As a Polyamorous person.  I freaking hate that word. Just saying.  Totally my personal opinion.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "the only one getting fucked here is OP. At least financially",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "[removed]",
              "id": 28,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "So it's more than one cule.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1418,
          "content": "Seriously. This has been going on for more than 5 years. There is no reason for the ex or the son to change their patterns, because she's enabling it.\n\nOP, your wife is reasoning that she has to give them money because she's taking care of her son. Can you get her into marriage counseling so she can understand that in fact she **isn't** helping her son, she's hurting him. He has the capability to work and support himself. He's choosing not to because he doesn't have to with her as his safety net. He's already 23, the window to retrain is closing rapidly and soon he will be a copy of his dad.\n\nHer ex is not her responsibility, under any circumstances. If he's careless and gets his car impounded, leading to the son not getting to work, that's an issue to solve between father and son. She does not need to fix this for them. \n\nYes, they'll be mad, and they'll do everything they can to emotionally manipulate her. That's where the counseling comes in. She's going to need help to recognize how these patterns developed and what she's gaining emotionally from them in order for her to find the way to break the pattern.\n\nOr, this is the rest of your life. Soon the son will get someone pregnant, and then what will she do? NTA, but you need to do something fast.",
          "id": 30,
          "comments": [
            {
              "score": 327,
              "content": "This is honestly the first bit of helpful advise I've seen thus far. A marriage is a partnership, and OP's wife seems to be caught in a slew of emotional turmoil connected to her son, and helping her through that will exemplify that partnership much more than just tossing her out or chastising her.",
              "id": 31,
              "comments": [
                {
                  "score": 16,
                  "content": "Especially since it doesn't really sound like OP *wants* or *needs* to leave.\n\nTo me it sounds like this OP has either felt or been told that the whole son thing wasn't his business before and wants confirmation that it's cool to try to tackle this with his wife now.\n\nThere are posts (and letters, going back through probably the entire history of relationship advice columns) where someone asks a relatively mild question but seems to want permission to leave their relationship but assuming that's what's happening every time is about as helpful as suggesting a different operating system every time someone asks how to fix their computer.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": ">This is honestly the first bit of helpful advise I've seen thus far.\n\nYou're right, but to be fair, AITA is explicitly not an advice sub. (A few years ago when the sub was getting started, sometimes comments would be removed if they focused too much on advice rather than judgment.) OP would get much more thoughtful responses across the board if he posted in /r/relationships or /r/relationship_advice.",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "Not sure of the circumstances of why the son is living with the Dad, but could some sort of mom guilt be behind her enabling? Is she trying to ease some sort of guilt she feels?",
              "id": 34,
              "comments": [
                {
                  "score": 10,
                  "content": "Probably. I imagine having a baby in your early 20s could lead to a lot of complicated feelings.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I was waiting for this. Mom guilt it is a real thing.\nSource: my son is 29 and I still have mom guilt and send things I can't afford",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "This is a great response. Much more realistic and productive than the people saying “Why are you even married to her bro?” Complex issues like this come up in marriages. The first step should always be trying to solve them together with your partner.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "/u/cancelledvacation You are NTA, your wife is enabling her son over this.  You should read this good adivce in the comment above.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Well said! Much better than I did!!! 👏👏👏",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I left a comment already but wanted to second this. My mother is just like OP’s wife, she enables my older half brother. He’s now in his forties and has his own kid and she’s only gotten worse. (She was raising his kid more than he was.) He can ultimatum his wife if he wants but she’s already made her choice. Maybe OP can leave her unlike my father with my mother, or the counseling will help. But my parents are still in eternal misery with each other. Might be OP’s future.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "👏👏👏👏👏",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 908,
          "content": "Exactly what I was thinking. She might as well go back to her ex since she's funding his living. If she doesn't put a stop to being their ATM, and let them figure out adulting on their own, they'll always run to her.\n\nOP is NTA",
          "id": 42,
          "comments": [
            {
              "score": 385,
              "content": "But without op paying most of her bills,  and giving her this lifestyle boost, she won't be able to support the not ex AND keep the nice lifestyle she wants.  She'll have to move into a crappier lifestyle, house and won't get vacations or nice dinners.  She knows she'll end up cleaning up all their messes and living in poverty since her money will all go to their partying. She has her cake and can eat it too. \n\nThis way she can help out her real husband while also getting nicer shit for herself from the 'sugar daddy'.  Why even be with her?  She isn't building a savings for the future or prioritizing time/memory building with op since she knows she won't have a future with op. Id go on the trip alone and let her spend that time with her real husband. And definitely make sure she can't touch his savings account because once they know the jig is up, they'll start going on cash grabs to get as much as possible before the divorce.",
              "id": 43,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 140,
              "content": "I've been in this situation. I had to tell her pretty bluntly that she'll never have a real relationship with me if she spends so much money, time, and emotion on her ex, who was a lazy, obese, fast food addict. At some point, priorities must be chosen. And yes, the kid may be a choice, but there's always strings with the dad.",
              "id": 44,
              "comments": [
                {
                  "score": 8,
                  "content": ">  had to tell her pretty bluntly that she'll never have a real relationship with me if she spends so much money, time, and emotion on her ex\n\nWhat did she decide?",
                  "id": 45,
                  "comments": [
                    {
                      "score": 11,
                      "content": "She picked me. Then 3 years later she picked some other schmuck",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Well, now I have to know what she chose. I’m invested.",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "What happened in the end?",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Right? This post belongs in r/adulting.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 453,
          "content": "You plucked these words right out of my brain. Not only is her ex and son financially irresponsible wife is also. It’s a good thing they keep their finances separate because she would send his money to the two loves of her life also. \nNta",
          "id": 50,
          "comments": [
            {
              "score": 189,
              "content": "Except since op pays 70% of her expenses, he is funding them by freeing up all her money for them. If I were op I would immediately shift that split% to 50/50.",
              "id": 51,
              "comments": [
                {
                  "score": 86,
                  "content": "Bet if they divorce, she's gonna get 50% of everything, not 30%",
                  "id": 52,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Which is why totally separate finances in marriage is stupid. Assets are generally divided equally in divorce. The law sees it as one big pot of money.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "This marriage makes no sense financially.\n\nIf you’re posting here, it likely makes no sense personally either. \n\nErgo, why are you married?",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 407,
          "content": "Not only that, but every time he 'covers' for her when she doesn't have the money to pay for something she promised she would...\n\n...he's enabling HER to enable them.\n\nThis vacation, TBH, is a great test of the future viability of the relationship.  If she doesn't understand and agree that OP isn't responsible for covering for her, then it's over and time to go their separate ways.",
          "id": 55,
          "comments": [
            {
              "score": 87,
              "content": "Exactly. By using her vacation money to fund her son's and ex's bad choices, and expecting her husband to pick up the slack so they can still take the trip, *the husband* is the one that's actually giving them the money, not her.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Agreed.  Hell I would just go on the vacation by myself but I’m petty that way",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 225,
          "content": "> She's enabling their financial irresponsibility, and that will never change.\n\nToo often people confuse enabling over help. Sometimes I feel its because they want to *feel* like they're helping but actual help requires way more effort.\n\nScenario off the top of my head. You got a friend that's an alcoholic and spends way too much money on booze when they go grocery shopping and are often struggling to have food to eat. Giving them money so they can go to the grocery store again is not going to help. They'll just buy more booze. If they really want to help, they would go grocery shopping with them. They would help them get into rehab. They would go to their house and take away all their alcohol. Etc.\n\nThat's harder than just giving them some money though and actually having a conversation and helping her son actually plan for a future, budget, live within his means... and unbelievably her ex, is way harder than opening her wallet. Its pure selfish feelings of wanting that dopamine hit of being needed. Its almost intentional to avoid actual help because then they would stop needing her. It was never about helping them, it was about them needing her and how that makes her feel.",
          "id": 58,
          "comments": [
            {
              "score": 38,
              "content": "Sometimes time is a big factor too tbf. My dad is pretty much supporting his sister and her adult daughter after his sister’s restaurant failed and her daughters not really going anywhere.\nMy mum gets pretty annoyed about it but I get why my dad can’t just leave them to implode, and he already stretches himself too thin with work and helping out other family members to look after himself.\nSometimes money really js all you can do, even if it’s not the best solution",
              "id": 59,
              "comments": [
                {
                  "score": 25,
                  "content": "That is very different from the circumstances OP described though. At least he made it sound like college and a more stable and productive life for the son was an option. That as an adult, the Ex can't get his shit together and it seems like living beyond their means or reckless actions play a part in their money woes. All these issues are constant and no improvement or maybe even effort to improve their circumstances are happening.\n\nStill, even with your dad, I would have a talk about it being great that he's helping, but is he helping or enabling? What are they doing to lessen the burden on him even a little bit? What actions are they taking so they can lessen the time your dad has to help as much as possible?\n\nHopefully your dad has these answers but it sounds like OP's wife does not.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Great points",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This is more complex than that. Yours is the definition of help in a vacuum sans any emotional attachment. It's great to say that you should actually attack the root cause of an issue and that is defined as help. I agree with this assesment that the wife is not actually helping and just enabling the behavior. I agree that what she is doing will never allow for growth or change and that the husband is enabling her to enable them financially. But, sometimes help is not accepted. Let's use your alcoholic analogy but make it a child and not a friend. If her kid is an alcoholic that lives on his own and spends way too much money to the point that he doesn't have rent or food that's an issue. Adressing the root cause of it \"the kids alcoholism\" is the right move. Going with them to the grocery store or getting them in rehab are valid options, but what if the kid doesn't believe they have a problem? What if when offering to help address the root of the issue the mother is met with denial and anger? People that tend to have issues don't like to be reminded or even shown that they have an issue. Since the truth is they probably know but aren't ready to admit it yet. Common sense would say just cut these people out of your life because they are exhibiting toxic behavior that is now affecting the person trying to help. But, this person is your child. You don't give up on your children, you always try to love and protect them, and if they won't address the root cause of their issue you find a way to help any way you can. Even if for the time being it only allows them to keep doing what they are doing. I still agree that the new husband is NTA, he has no dog in this fight and should not be penalized because her wife's ex and kid cannot get their act together. Just trying to point out that in life most situations aren't as clean as \"just go address the root cause of the issue\"",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "He's married to all three of them.",
          "id": 63,
          "comments": [
            {
              "score": 63,
              "content": "Hes married to none of them.  He's just the bank roll.  She gets a nicer lifestyle for a cheaper price and her real husband is supported. Im sure she doesn't want to live in that crappy run down life of being a maid again so she's using op. He needs to go on the trip without her and give her time with her husband.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 64,
          "content": "I mean. I can see the son thing. No matter the age, they’re you’re kids. I get it to some degree. Not everyone is capable of letting them from under their wing. And instead end up enabling them. But he doesn’t want to take the bus or the car…that’s a bit much. But the ex…yeah. Either way, OP is not the asshole. And either way you’re right, why is he with her?",
          "id": 65,
          "comments": [
            {
              "score": 55,
              "content": "But it's not like her kid's starving on the street, he's just too fucking precious to take the bus to work.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The best thing a parent can do is cut the strings and let the kid figure it out on their own. If they don't, they've raised a useless kid.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "This was my thought. I'd be cancelling the marriage as well as the holiday.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Cancel the vacation? I'd have cancelled last Christmas, Valentines Day, Bastille Day, Cinco de Mayo, Mother's Day, - everythang.\n\n I can't afford to subsidize your spending money on people who don't live in my house and don't like working for a living. No way.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6893,
      "content": "NTA.  All of these comments talking about a house fund like that solves the problem.  She has already established she can't budget HER money let alone something you contribute to as well. What are you supposed to do when she takes from the house fund for her ex and son.... People are delusional.",
      "id": 70,
      "comments": [
        {
          "score": 3413,
          "content": "Precisely, a house fund doesn't always solve the problem. Some people see the total in a house fund and go 'I can afford that' and from my experience and that of my friends, the house fund starts getting tapped into when a spouse goes through their savings spending freely or always giving to others.",
          "id": 71,
          "comments": [
            {
              "score": 1511,
              "content": "Please take this from someone who was in your wife's shoes: IT WILL NEVER STOP!!! I learned to put my foot down but it took years. Exception is that my son never asked for anything and always worked but he and his father sucked at budgeting. My husband and I helped out more than we should have. Let me tell you that it's a relief know that the bank of ex-wife is CLOSED.",
              "id": 72,
              "comments": [
                {
                  "score": 243,
                  "content": "Wish my sister would learn this.  She still pays and has been for 30 years......",
                  "id": 73,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Jesus!",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I did it way too long, hopefully she'll come around.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I wish my mom would learn this and stop supporting my 42 y/o sister.  But when she passed there will be no bank of the sister open…",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Ouch!\n\nOne of our cousins needed a wakeup call when all of their overtime money (and then some) went to the (now, thankfully ex) spouse's family: both divorced parents, their new partners, two sisters and their rotating door of significant others.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 186,
                  "content": "My marriage (not a short one) actually ended largely in part to this behavior.  Every day it was $80, $120, $50, for \"gas money\" for an adult child with an active addiction problem.  No amount of begging, information, or counseling stopped the flow of money.  One month the entire sum of my earnings was handed to this adult child in ONE DAY (I didn't earn a lot back then, but it was still a healthy amount), and the very next day I was getting harassed by my spouse for spending too much \"unexpectedly\" at the grocery.  I couldn't stomach him anymore after several years of him draining our life.  We hadn't taken a vacation in over 6 years because of his irresponsibility (and I don't mean fancy vay-cay, I mean like... a weekend away somewhere with an indoor pool).  I was so stressed by the end, and GLAD when it was over.  No more working my life away just to cut coupons for rice and beans.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 31,
                      "content": "The relief if real! I'm glad you got out.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "oof. what’s happened with them since? did they just continue the same routine without you?",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 335,
              "content": "NTA. If you really want to get rid of this issue is to remove the father from the equation. if the son is going to need money, or help for whatever reason, then it should be on the condition that he lives with you guys, so that you can supervise that the money is being used correctly and so that you can have some influence on him so that he can get his life together. If he wants to continue staying with his dad, then his dad should be responsible for funding his lifestyle. Because it is quite obvious that the kid didn't have a good role model growing up, and he's not a lost cause yet.   \n\n\nBut you might not want to take up that responsibility and that is totally understandable.",
              "id": 81,
              "comments": [
                {
                  "score": 587,
                  "content": "That's the whole kicker of it- I've suggested to her before that if she wants to help him, he can move in with us. I get her wanting to help her son, and he's always been closer to his dad and wanted to be with his father because he didn't have as many rules living with him. If he was in trade school or college I'd have no problem covering more of our finances and recreational time so she could help him out but any suggestion to move forward and improve just her son's circumstances are always met with resistance.\n\n\"It's hard for him to wake up and be on time for a 930am shift, he's not used to it.\" \"He feels safer driving to work.\" \"His friends are there.\" \"He gets bored easily so he quit.\" \"He just needs time to figure himself out.\" \"Not everyone is cut out to work a job you have to wear a button up shirt.\"\n\nAt the very, very least if her son had reasonable excuses for quitting jobs so often, like bad pay, bad managers, bad work conditions, etc., I'd be a lot more yielding.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 265,
                      "content": "Whoo boy, that's some enabling, which is too bad. When those chickens come home to roost it won't be pretty.",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 223,
                      "content": "Do you have a prenup",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 171,
                      "content": "WOW THE EXCUSES.  \n\n\nIt's hard for me, a 43-year-old lawyer with ADHD and Delayed Sleep Phase, to wake up, get dressed, and be prepared for 9 a.m. Court. But you know what? Nobody but me cares about that; trials still start at 9 and I better TF be there. It was hard for me to get to 9 a.m. classes and 8:30 finals, but here I am, actually doing the thing, 15 years after starting law school.  \n\n\n\"Feels safer driving to work.\" I'm sorry, but someone in the Least Likely to Be A Victim Demographic needs to just get his head out of his ass and stop being scared of his own neighborhood. If he's that scared of the bus/walking/a bike, he needs a therapist, not mommy paying for his dad's car to get out of impound. If he REALLY NEEDS to drive, then I guess he can really figure out affording a car payment, insurance, gas, etc.  \n\n\n\"He gets bored easily and quit\" FOH. Life is boring. Full stop. Like 80% of the time, shit is boring.   \n\n\n\"I can't wear a shirt with Buttons\" OMG is he literally 3 years old? Are his hands broken? Was he born without thumbs? What the absolute shit is this?  \n\n\nNah, she needs to quit or you need to quit her. NTA.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 135,
                      "content": "The son is 23 years old.  He sounds lazy and irresponsible .  If he moves in, your wife may give him even more money",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 117,
                      "content": "Your wife created this problem and if you stay with her this is going to be the rest of your life. My little brother is 36 and moved his “disabled” fiancé into my parents home last year and neither of them work. She gets a small SSDI payment every month. this is your future if you stay with this woman. Cut your losses and leave.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 86,
                      "content": "* \"It's hard for him to wake up and be on time for a 930am shift, he's not used to it.\"\n* \"He feels safer driving to work.\" \n* \"His friends are there.\" \n* He gets bored easily so he quit.\" \n* \"He just needs time to figure himself out.\" \n* \"Not everyone is cut out to work a job you have to wear a button up shirt.\"\n\nOoo, this isn't good.  With that attitude, I personally would never allow her son to move in.  He'd never work, he'd never leave, you'd be supporting him, and your wife would be perfectly okay with that.  \n\n\n(NTA, by the way)",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "I'm currently 22, about to be 23. I skipped college/trade school but still came up with a plan on what to do, I work at a casino as a card dealer and make about 30-35/hour on average. If school was the main thing he wanted to avoid, he could still be in a good position if he planned properly. He clearly won't and your wife will forever support him long into her life, and maybe even after it depending on inheritance. The dad sounds barely above a deadbeat that's teaching his son all his bad habits. Good luck, cuz getting your wife to see this is bad is likely not going to happen.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "Yeah, those are not excuses. Those reasons for quitting are actually just what being an adult is all about. No one wants to wake up early to go to work to live and eat. Yet we all have to do it. Why should the son be an exception?",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "You are more patient than I - I have a 22 and 20 year on top of an 11 and those excuses would not cut it.  He is not a kid anymore and she needs to understand those are not reasons for not working.  He sounds like he has no desire to work well because it is work.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Sounds like her ex taught their son how to be irresponsible and your wife taught him that she'll always be there to bail them both out.\n\nOr maybe deliberate. \"I'll get a job to prove that I am willing and able, but then I'll quit soon after because getting up and going to work every day is no fun.\"",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 255,
                  "content": "God, don't let the son move in!",
                  "id": 93,
                  "comments": [
                    {
                      "score": 77,
                      "content": "Good lord no. \n\nIt reminds me of my old neighbor's son who barely graduated high school, holds 3-5 jobs a year and he's 26 years old. When they plead for him to be more proactive with taking control of his life, he replies that he's \"waiting for his YouTube/Discord channel to take off.\"",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "I like the idea, but Ops post makes it sound like they're both lost causes. They both quit jobs for minor stuff,  and the son refused to bike or use public transportation to keep his job once the car was impounded. It's tough to think he's going to magically become a hard worker overnight.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "This!  Very well said! Supporting the son, I understand. Supporting the X I do not - he should be taking care of himself and if the son wants funds he needs to prove that he is doing something to better himself. If he’s just taking money and blowing it nope, sorry you’re on your own.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This is the first good answer I read here. Speculations about OPs wife still being in a kind of relationship with her ex are really not helpful as infidelity is not a part of the problem here. \n\nOPs wife loves her son and wants to help him. But the way she tries to achieve this will not lead to success, as neither son not ex seem to be able to manage their finances properly.\n\nOP needs to sit his wife down and together they need to sit the son down and find a way where him getting money is connected with achievments like holding down a job or attending a college.\n\nI would like to add that people are mistaken if they think that young people are able to manage her life the moment they turn 18. Often the grown up behaviour does not set in before the age of 25, and they need a lot of guidance in the meantime. \n\nOP saying that he did not mind to pay here or there till her son was 18 implies that he expected her paying for her son to end then, and she being able to contribute to the lifestyle he obviously can afford more easily than she can. Of course it is his right to do what he wants with his money, and obviously he likes his wife to be with him on his vacations, but he seems oddly unaware of the fact a mother will never stop being a mother and will likely support her son no matter what. I have a feeling that he is quite distant to this part of his wifes life.\n\nHis wife needs to accept that her way to help her son does not work, and that she needs to either engage fully and help him to do better with all her might, or to quit helping and to let the son lie in the bed he makes. Both ways are not easy and she will need OPs help and not be able to be there only for OP.\n\nI really hope they can manage this.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Do not let the son move in.  He is 23 and needs to be responsible!",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "OP... Show your wife these comments so that she can see she nerds to be firmer and apply some tough love.\nThey know she'll always support them, so why bother?? SHE'S AN ENABLER!\n\nAlso, NTA NTA NTA NTA",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "This happened with me and an ex. He was horrible at budgeting his money, would borrow from our joint account, continue to do it to where it would eventually overdraft, then expect me to pay for all the fees AND replace most of what was taken out, despite having nothing to do with it. He was essentially stealing money from me.",
              "id": 100,
              "comments": [
                {
                  "score": 38,
                  "content": "That exact same thing happened to me, too. He seemed to think having a debit card for a joint account meant an infinite supply of money that automatically regenerated whenever he spent. Of course when he overdrew the account by $400 every other week, he thought it was beneath him to put back MY money… just one of the many lovely reasons he’s my ex.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yeeeeep! It's a form of financial abuse!",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My ex husband was stealing my cash out of the safe, mismanaging money I gave him to invest and eventually he was stealing my opiates to sell to buy nitrous. The last straw was when he stole my car while on vacation and was found by a 100 person search and rescue team a mile into the woods meditating in a snow melt stream while in full psychosis. Why was he doing drugs? Because he was mad his business didn’t take off after I paid for his doctorate and worked. I even had to go back to work 4 months after a near fatal accident that left me with permanent brain damage. I’m sorry you went through that but I empathize!",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Your wife, by giving them money and expecting and *demanding* that you then give her money to cover what she gave them, if effectively giving your earning to her ex husband.  So he's really an ex in name only - you are a sugar daddy to her, paying for the lifestyle of her true loves, her original husband and child.  For her to be angry at you for not paying for the living expenses and irresponsible choices of her ex and adult son tells you what you need to know, which is that you are distantly third in terms of her priorities here - hate to say it man but that's not how marriage is supposed to work and it's not gonna get better, she is still totally invested in her real/original marriage, you are just her lifestyle provider and funder, time to go.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "If my SO tapped our house fund for anything but the house, I would drain it and keep it somewhere they can't touch.  If they argued with me, then I would force sale the house and they can figure out where to live.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yup. No matter how you look at it, she is sabotaging joint financial decisions they have made without his permission. They agreed this money was going to a shared vacation, and she instead spent it on enabling her son. Given that, he is being EXTREMELY reasonable. If either my husband or I have $5,000 of joint money to a family member without the other’s approval, it would end in a big fight. The only possible exception would be for something like emergency surgery, and even then, they usually bill you afterwards, leaving time for a conversation. \n\nAll OP did was calmly say “We are cancelling the vacation then.” I’m having trouble finding the words to express just how fair and calm that response is. \n\nIt doesn’t matter how you manage shared costs, whether your bank accounts are fully joined or whether you have separate accounts like OP and his wife. You don’t spend $5,000 of money earmarked as “ours” without your spouse’s agreement. Full stop.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3161,
      "content": "NTA. Wife is supporting two fully capable adults who find it easier to get handouts than work a steady job or make reasonable decisions about spending. It appears she will continue to do this unless she's shown real-world consequences.",
      "id": 107,
      "comments": [
        {
          "score": 932,
          "content": "Plus the car being impounded. There are very few ways, if any, for that to happen to someone who DIDN'T deserve it (meaning they were doing something wrong and the car was impounded). Then you add the fact the son won't take public transport and you're talking about bad decisions all over the place...",
          "id": 108,
          "comments": [
            {
              "score": 407,
              "content": "The public translation thing is really annoying. I’m a 26 yo female that has been taking public transportation alone nearly every single day for 12 years, day and night to get to work, school, everywhere else. Even in the dead cold winter. If I could commute everywhere on public transportation, her grown ass son can too until he has the funds to get his car fixed.",
              "id": 109,
              "comments": [
                {
                  "score": 84,
                  "content": "Yeah, when I lived in WV - mountains, scare transportation, snow, etc.  I took the bus - moved and rented a room on the bus line so that I could go to work and by 23 I had a job (graduated HS and college) and was working in a job I would stay in for 10 years.  Way old enough to do what is necessary.  \n\nAdd on that there is an EX too getting money. There is a reason he is an EX and he does not need any more $$$ being sent his way.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 73,
              "content": "This! The son can’t use “I can’t get to work without the car” when there are options he is refusing to utilize.\n\nNTA",
              "id": 111,
              "comments": [
                {
                  "score": 7,
                  "content": "I'd love to have easy transport to work so I don't have to drive. Lol. But that doesn't exist where I am.",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2535,
      "content": "NTA. She has crossed the line from \"helping her son\" and is well into \"enabling her son AND her ex.\" You're right that they're both able-bodied adults and they're both CHOOSING to be lazy because they know your ex will give them whatever they ask for; son *could* have continued working but didn't because he didn't want to ride a bus - that is a choice, not a need. \n\nHonestly you should spend the time you would have been on vacation talking with your wife about learning the difference between helping and enabling; if she wants her son to live a full adult life, she has to accept that continuing to bail him out of unpleasant situations will hold him back.",
      "id": 113,
      "comments": [
        {
          "score": 312,
          "content": "Exactly this and explain to the wife that there are serious boundary issues if the ex is calling her directly asking for money. Yea they share a child together but that child is grown and there should be no reason for him to call her asking for money. \n\nAlso, OPs wife broke his trust and essentially said he didn’t matter although they had previously talked and agreed on the terms of the vacation. The wife should’ve already had that money set aside for the vacation and if she wanted to help son and ex then it should’ve come out of what she had leftover.",
          "id": 114,
          "comments": [
            {
              "score": 38,
              "content": "Also, what kind of approval, acceptance or positive regard does she think giving to the ex and adult son are buying her?",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The only time my mom called my dad after the divorce was money - but at 18. It stopped and she called to say Hi or if I (the child) had a medical emergancy that required his assistance like the time I was in the hospital. \n\nThat’s it. That is the only time they talked. \n\nThe Hi was because they knew each other since they were kids so they still cared if one another was alive but it was like a 15 minute convo and off the phone.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "This is the truth. My MIL constantly enabled my husband's brother's irresponsible behavior so that he never learned the right tools to be an adult. He is over 50 years old. He still lives in his room and still works the same stockboy job he worked in high school. His 86 yo mom still pays his cell phone. My husband left home at 20 and has taken care of himself ever since. NTA.",
          "id": 117,
          "comments": [
            {
              "score": 16,
              "content": "My husband and I both have a sibling like that, one is 41 and the other is 42.  We are both working out asses off to afford a house and BOTH of our enabling parents are leaving their homes to the kid still living at home in their will.  Yet both parents are giving us sh*t for not providing grandkids yet…well I wonder why we can’t afford it…",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Exactly. It sounds like the son opted to live with dad because he's the easygoing parent. Now whenever things go wrong, they both rely on OP's wife to bail them out.\n\nThere is a necessary conversation to be had between OP and his wife about what appropriate support would look like. Perhaps it's letting the son move in with the requirement that he maintain steady employment and make progress towards independence (at least that would remove supporting the ex from the equation).",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Right - For real - an emergency is something popping up unexpectedly - not a monthly need that keeps rising up because 2 grown men who live together - have for quite some time cannot figure out how to pay bills or keep themselves employed and out of trouble.  A car towed means that either they left the car somewhere they were not supposed to be, do not have proper insurance/license, there was something wrong with the car or they committed some kind of crime.  Giving that they just paid for car repairs - going with broke down.  Unless it was engine failure or something - there is no reason that is should have taken so long that the son was no unemployed because he could no longer get to work - though - buses exist along with Uber, Taxis, etc.  Now when my car breaks down - I get a taxi.   They don't just tow cars for giggles.  \n\nMaybe the wife could take a class on finances.  A lot of classes are free - online - some thru banks or lenders and others just out there.  Once she completes it - she can then suggest it to her son.  Her ex is plenty old enough to figure his shit out by now.  He is an adult, and she is under no obligation at all to offer him any sort of support.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "NTA. All this plus therapy for your wife. That would be an absolute must for me. She needs to learn what a healthy relationship between a parent and a young adult looks like.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1516,
      "content": "NTA. It would be different if your wife spent the money on her minor son (her son is a 23 y.o. adult) or a medical emergency, or any kind of emergency for her, you or her son. But it wasn't. If you keep footing the bill you are subsiding her 23 y.o. son and ex-husband. I wouldn't be happy either. \n\nPlus, it's a vacation, not an essential expense.",
      "id": 122,
      "comments": [
        {
          "score": 294,
          "content": "This, yeah. She’s calling him heartless, but if he paid for their vacation, he’d basically be financing her ex and son. And since this isn’t the first time, and not likely to be the last… it would just go on and on.",
          "id": 123,
          "comments": [
            {
              "score": 3,
              "content": "Absolutely.\n\nHappy cake day. :)",
              "id": 124,
              "comments": [
                {
                  "score": 3,
                  "content": "Ha, thanks! Hadn’t even noticed.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You are very welcome. :)",
                      "id": 126,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "you're totally right.\n\nHappy cake Day",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 728,
      "content": "NTA but this issue goes well beyond paying for vacations. Your wife has clear boundary issues that must be addressed before they affect paying for neccesties",
      "id": 128,
      "comments": [
        {
          "score": 61,
          "content": "Absolutely correct here. Situation is a symptom of a much bigger issue for OP's wife. NTA",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Yes, and calling OP a heartless ass is a projection of her fears. She hasn’t learned that taking care of yourself emotionally and financially aren’t selfish behaviors, so she can’t see that OP is being a responsible adult.",
          "id": 130,
          "comments": [
            {
              "score": 5,
              "content": "It'd be one thing if her son needed real help to get ahead but what he's asking for is support so he can continue his no effort lifestyle",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Is also a lesson for the wife that her enabling with the money lending affects THEIR life and she needs to get her head around it. She bugeted for the vacation, she spent it elsewhere, no vacay.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 562,
      "content": "NTA. Normally, I find it strange when couples are this hung up on who pays for what, but in this case, I'm with you. Your wife isn't taking care of her son, she's enabling him. It's obviously going to be tough for her to turn the money faucet off, but she's going to have to if her son is ever going to learn to be an adult.",
      "id": 133,
      "comments": [
        {
          "score": 156,
          "content": "My initial instinct was to side with the wife bc of the financial setup, but swerved straight into NTA with the details of the ex and kid. Yikes.",
          "id": 134,
          "comments": [
            {
              "score": 45,
              "content": "Same. First thought was “yeah, probably” but i also then thought NTA very quickly.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I feel the same, except you said it better. NTA.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 340,
      "content": "NTA At all. You're correct. This is starting to impact your lives more and more. You are under no obligation to subsidize their lifestyle. And if your wife doesn't see that by giving them money then expecting you to pay for things that she is supposed to is subsidizing them, she's being willfully obtuse.",
      "id": 137,
      "comments": [
        {
          "score": 248,
          "content": "My biggest beef is that the son apparently had the option for biking or taking the bus.  He just DiDn’T wAnT tO. There are plenty of places where I know that’s not an option (which is a very different scenario imo) and I understand needing to support your child but this is catering to your child when there are alternatives after bad choices have been made. He will never grow if she only enables him.",
          "id": 138,
          "comments": [
            {
              "score": 34,
              "content": "Yeah, where I grew up, there really isn't any public transit. In fact, the only thing available is Uber and I'm not sure how prevalent it is there. So when you see someone riding a scooter in the middle of a snowstorm, you know they aren't able to afford to fix their car OR they don't have a license.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Depends on what OP means by 'didn't want to'. Does he just not like taking the bus, or would it be a ridiculously long trip? I remember needing a car to my college classes (I lived at home). There WAS bus transportation but it required two transfers and was almost two hours one way; driving was 15 minutes.  \nShe needs help setting boundaries (wondering if OP is the reason the marriage broke up and she feels a lot of guilt?). If she feels that she still needs to contribute to adult son, give him a set amount each month. No more handouts for the ex. NTA, OP, but maybe you can help her with keeping the boundaries instead of criticizing.",
              "id": 140,
              "comments": [
                {
                  "score": 20,
                  "content": "I get it, but the you bite the bullet and take the bus or bike if there isn't another way to get there. It sucks, but you can't get the car out if you aren't earning anything. Would you given up on your college mid-semester if your car broke down? Or would you have got on that bus until you could make other arranements?\n\nIf it was a 1x ask due to an emergency, sure, but they are asking for money every week and then when this issue arises, not even making an effort to go to work? Nope. \n\nAlso, in most cases, a car isn't impounded for no reason, so either father or son made a bad choice to get into the situation.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I agree with this. But, of course, the alternative to taking the long bus ride is to find alternative, closer employment.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is valid. I used to be able to walk to work in about 25 minutes. The bus there would have been over an hour. Obviously, you do what you have to do.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 270,
      "content": "Edit: To everyone coming in here late, when I judged this half the responses were Y T A. \n\nThis will be unpopular to some, but I'm going with NTA.\n\nThere are some factors here that maybe I'm misjudging, but to me it sounds like your wife wants to continue to supplement her ex and son's lives with her own finances. You don't seem to approve, but you also seem to accept it's her decision. She has a history of prioritizing her son as she should, but also she seems to be enabling her ex and son with her decision making. I don't think you are an AH for not wanting to supplement her ex/son with your income, which is exactly what would be happening if you continued to pay for the vacation with only your money. I don't see anything wrong with what you did, but I also see why others would not agree. It sounds like you had an agreement the vacation was to be split cost, and your wife tried to flip on that.",
      "id": 144,
      "comments": [
        {
          "score": 32,
          "content": "No one is saying he's ta though.  He's being used by his wife",
          "id": 145,
          "comments": [
            {
              "score": 25,
              "content": "You weren't here 2hrs ago",
              "id": 146,
              "comments": [
                {
                  "score": 9,
                  "content": "Even before i saw the comments I already knew some people were going to say OP is an AH",
                  "id": 147,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Which is insane.  Mooches are just *the worst*",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 194,
      "content": "NTA. she is wrong thinking she can give away her money and then be suported by you. they are all adults and are not sick",
      "id": 149,
      "comments": [],
      "relation": "Support"
    }
  ]
}