{
  "post content": "I’m a senior in high school and today after a PE class we were joking around in the locker room and messing around, I pulled a ceiling tile out from the ceiling. Here’s the thing, there’s this one freshman who looks like he could barely pass for a 7th grader and he’s pretty socially awkward. I dont know him well, but he comes off as an iPad kid. He saw me next to the hole in the ceiling and shouted out, “He’s venting! He’s sus!” like an Among Us reference. Guys started laughing at him it he didn’t seem to mind. Then, while we were waiting in the hallway, i thought it might be funny to joke around so I walked up, nudged him, and said “Guess what? I’m the impostor.” I hoped everybody would have a chuckle, including him, but he just kind of walked back to the locker room looking dejected. I didn’t mean to make him feel bad, but I know he does. Am i the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 37,
      "content": "Just go apologize to him next time you see him. Like \"hey, I didn't mean to weird you out in the locker room. I was just showing that I got your reference. \" or something like that. It could be bothering you more than it is him so it couldn't hurt to make amends regardless.",
      "id": 2,
      "comments": [
        {
          "score": 23,
          "content": "thanks for the advice man, i’m gonna apologize tommorow",
          "id": 3,
          "comments": [
            {
              "score": 8,
              "content": "Let us know how it goes",
              "id": 4,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Good on you.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "NTA\n\nThis guy knows what’s up!",
          "id": 6,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Update: I talked with him yesterday and apologized, and he was ok. I ended up teaching him to play baseball in PE too!",
          "id": 7,
          "comments": [
            {
              "score": 2,
              "content": "Booyah! You just made my day.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "No, you were trying to show him you got him and he didn't understand. Try again - maybe tell him what he said in the locker room was pretty funny and does he watch xx or like xx or something. Let someone else see you a comfortable senior being friendly with a 7th grader and maybe his social cred will go up too. NAH",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "I don't understand what went wrong. The kid yelled he's venting. OP responded by making a reference to the same game. You can only vent if you're an imposter in the game so yes it all adds up to the same reference. Why was that mean?",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA since it sounds like you weren’t intentionally trying to hurt him but just trying to play along with his joke. but you weren’t very smart. You know he’s awkward etc and you assumed that he didn’t mind when he was laughed at. You’re likely wrong. He probably did mind and then you dug it in further trying to joke around with him.\n\nit wouldn’t hurt to have a chat with him, part of him being awkward could be coming from the fact that he looks like a 7th grader. Heck maybe he skipped a grade or two and should be a 7th grader and he feels weird. An older kid genuinely being nice to him might help. snd who knows that “ipad kid” might actually be a cool dude.",
      "id": 11,
      "comments": [
        {
          "score": 3,
          "content": "thanks for the advice man! i’m talking to him tommorow",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "If it happened the way you put, NTA. I suspect there may be a little white-washing to the story to make you seem less like an AH, but I could be wrong.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Wow I’m old. I didnt understand any of this 😭🤣🤣",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "I have no idea what anything you said means but why are you vandalising the school.  AH for that really.",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I think i’m the asshole because i made a kind of nerdy kid feel bad on accident\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m a senior in high school and today after a PE class we were joking around in the locker room and messing around, I pulled a ceiling tile out from the ceiling. Here’s the thing, there’s this one freshman who looks like he could barely pass for a 7th grader and he’s pretty socially awkward. I dont know him well, but he comes off as an iPad kid. He saw me next to the hole in the ceiling and shouted out, “He’s venting! He’s sus!” like an Among Us reference. Guys started laughing at him it he didn’t seem to mind. Then, while we were waiting in the hallway, i thought it might be funny to joke around so I walked up, nudged him, and said “Guess what? I’m the impostor.” I hoped everybody would have a chuckle, including him, but he just kind of walked back to the locker room looking dejected. I didn’t mean to make him feel bad, but I know he does. Am i the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YTA. But you're not a bad dude. You're just learning about how to be careful with other people's feelings. We learn by making mistakes. If you learn from this, you won't be an asshole at all.\n\nIn the future, you have to draw attention to the kid who is already confident and popular and strong. If you're going to make a joke that draws a bunch of attention to somebody, do it to somebody who can handle it. If someone is smaller than you, only ever lift them up. That's your job. If you are bigger than someone, you only help them. You can make fun of the kids that are bigger than you. I know you were not trying to be mean. But you were insensitive to the situation. This is called reading the room. Taking the time to imagine what it might be like to be another person. That's empathy, and it's an important skill. \n\nYou should apologize to the kid and let him know that you're sorry for drawing a bunch of attention to him. Then do something nice for his ass. Buy him a cookie, invite him to join you, or just include him and things in PE class. Be his buddy. He's small, he could use it. Plus you never know. Maybe one day he will be a lot bigger than you are and you will be very happy that you were his buddy when he was small.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    }
  ]
}