{
  "post content": " \n\nHey reddit community,\n\nfirst of all I´m sorry if I do some rookie mistakes in my post. It´s my first reddit post ever and I´m not a native speaker.\n\nA few weeks ago I visited a girl I was already dating over a short time about two years ago. It didn´t work out because I went to Australia after we finished school and she left our hometown to study. Anyway recently I saw some Instagram post from her being back in town so I wrote her and she invited me to visit her in the city where she´s now studying.\n\nThe visit was great. We went out, had a lot of fun and hooked up. I didn´t really expect our connection to be that good after having no contact for two years. It really felt like we were on the same level on everything. We also had some really deep talk about live and so on. I never thought she was the kind of person who you could talk to about stuff like that.\n\nTherefore after I came back I thought a lot about her and I talked with some of my close friends about her. Of course I was asked if we had sex. And I just didn´t have the mental strength to deny it. I don´t hook up very often and that weekend was very special for me. I didn´t brag about it, but I didn't want to lie to my friends either.\n\nLast saturday she sent me a screenshot where a friend of her, and I thought of me too, sent her this:\n\n**\"LOL, didn´t know that \\[my name\\] came up to visit you and fuck you. xD xD\"**\n\n&#x200B;\n\nI told her I never said to anyone that I only visited to fuck her and that I´m really sorry that she got a message like this. I asked my friends who told that rumor around and one guy tells me that he was at the same party as the guy who sent the text. He told that dude that I visited her, but not that we hooked up. Apparently he guessed that by himself. The shitty thing on top of all that is that another guy visited her and told everybody they hooked up although they didn´t.\n\nShe didn´t answer me for three days so I sent another voice message explaining that I only talked with close friends about the weekend and never braged about it public or stuff like that. I told her that I´m really sorry and that it would suck if we never had contact again beacause of this shit. She didn´t even listen to it.\n\nI know I´m kind of the asshole here because if I had kept my mouth shut there wouln´t be any rumor at all. On the other side I think the real dickhead is the guy who sent her that text. Who talks to a close friend like that? \"He visited you to fuck you lol\". Seriously?\n\nIs it justified for her to ghost me forever? I mean we are not 16 anymore and it shouln´t be such a drama if people know we hooked up? I really understand that she´s pissed, and I told her that I´m angry at myself for that shit that happend but in the end it´s just others people gossip is it? And she doesen´t even live in this city anymore and said that she´s not in contact with these people anyway.\n\n*I´m really torn apart if I´m such an asshole here that she´s justified to break up contact like this.*\n\nThanks for any constructive comments.\n\nEdit 1: Concerning the motive of the guy who sent her the text: He actually knows her very long and I think she considers him as a good friend. Once at a party He told me: \"If you want her go for it, when she's that drunk it's so easy. I know him since two years and we played online games together a lot in the past. He has a girlfriend since two years. I  can't really explain myself his motive except complete ignorance about beeing such a dick to her and to me.\n\nEdit 2: Concerning how she talks about sex: She was very open, you could talk with her about anything. At one point during the weekend I saw a message from one of her girlfriends saying: \"Have fun you two <3\". I don't know for sure if it was ment sexually, but I wouldn't  be suprised if it was.",
  "id": 1,
  "comments": [
    {
      "score": 106,
      "content": "ESH.  Except the girl.  You should have just kept your mouth shut.  What you do with this girl should have been kept private.  It is more evident given how immature those friends ended up being.  The girl is thinking that you told a lot more intimate details than she is comfortable in sharing.  It will be up to her if she decides to contact you so just leave it be.",
      "id": 2,
      "comments": [
        {
          "score": 64,
          "content": "Wait, what?\n\n&#x200B;\n\nYou don't share things from your personal life with friends?",
          "id": 3,
          "comments": [
            {
              "score": 0,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 36,
                  "content": "He admited he had sex. That's well whitin acceptable.",
                  "id": 5,
                  "comments": [
                    {
                      "score": -6,
                      "content": "In some places it is, in some it isn't, with some friends it is, with some it isnt. You don't kiss and tell and this is why. For the most part you should be able to share with your friends he obviously doesn't have good friends, i hope this is a lesson of social etiquette that should be very valuable to him",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -10,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 54,
      "content": "[deleted]",
      "id": 8,
      "comments": [
        {
          "score": 18,
          "content": "The dude who sent the text probably likes the girl OP hooked up with. He texted her cause he’s totally jealous",
          "id": 9,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 26,
      "content": "YTA. I realize you were excited about getting to hook up, but you should never talk about sexual encounters without explicit permission. And yes, you are fully capable of stopping yourself from talking about it or answering questions about it.\n\nYeah, the people ridiculing her for it are a-holes, but you're in the wrong, too. She has every right to ghost you, as you've shared her private business with other people.",
      "id": 10,
      "comments": [
        {
          "score": 77,
          "content": ">YTA. I realize you were excited about getting to hook up, but you should never talk about sexual encounters without explicit permission\n\nWHAT?  \n\n\nThis is an insane rule. Obviously you shouldn't be crass, but you are well within your rights to share this sort of thing with friends. You don't need permission from everyone involved to talk about things that happened with you.",
          "id": 11,
          "comments": [
            {
              "score": -2,
              "content": "[deleted]",
              "id": 12,
              "comments": [
                {
                  "score": 27,
                  "content": ">because it involves someone else in a situation they likely don’t want others to know about.\n\nAgain, what?\n\nHow repressed do you think people are? Assuming all of the involved are adults (seems like it) having sex it's ridiculously common, not something you hide. Or don't you think she told her friends about it?",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "If you don’t want people to know you’ve hooked up with someone then don’t hook up with them. Or tell them, “I’m worried this will cause drama, please don’t tell anybody we hooked up.”\n\nPeople talk all the time and it’s irrational to assume this will never pop up, especially when you share the same friends. Just OP visiting her was enough for a “friend” in the group to text her, “omg I can’t believe you fucked Op” as a douchey way to fish for info",
                  "id": 14,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Well, dont tell multiple gossipy friends  when you dont want one of them come back to her with idiotic text. Cause while most adults manage not to talk about sex they have, gossipy groups always leak information in worst possible way and always have assholes in them. This one seems to have multiple and this could not be the first occasion they acted like that.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -9,
              "content": ">This is an insane rule. \n\nAn insane rule that stops people from getting killed because their families are obsessed with family honor.\n\nThis is the world we live in: a world that judges people, sometimes cruelly, for their sexual behavior.  You *keep your mouth shut* about your hookups unless you discuss it with the other person first.",
              "id": 16,
              "comments": [
                {
                  "score": 10,
                  "content": "Nah fuck off. My life my choices. Don't want people to talk about you having sex? Don't fucking have sex, you lose that boundary once you consent.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 0,
                      "content": "And I feel if they're stressing that much, they can mention they'd prefer you to not talk about it",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "What the hell? You shouldn't have to deny that you had sex with someone, except when it was explicitly agreed upon. He's not an asshole for mentioning that he had sex with someone, and she's being really immature about it. Who cares that they had sex? I mean, if you're embarrassed to have sex with someone or don't think you should be having sex for some reason, maybe don't?",
          "id": 19,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12,
      "content": "NTA - neither you nor the girl are the assholes here. The people mocking her now are.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "ESH. And I'm tempted to say the S stands for \"sixteen\".\n\nYou're not a huge asshole, and I get that you were proud of your, ahem, achievement. But what you do in private is still a private matter, especially when it's not a random fling with a random stranger - and maybe even more so when you're getting that sort of good connection you were talking about. So not a huge asshole, but still kinda sucks.\n\nNow the girl, that's the same thing. I get that she's upset, because hell, deep talk and good times, that's not something most people get a lot. When she has that experience, and then suddenly gets a text which makes it look like you did all that just to get laid so you could brag about it afterwards, of course she gets mad. And if she won't talk or listen to you, that's understandable as well - to her, it might just look like you're trying the same trick one more time. Add to all that that you don't know if she's been in exactly such a situation before, and been hurt like that by other guys. At the same time, refusing to listen never helped anyone. It's understandable that she's pissed, but until she gets over it and listens to your side, she's kind of an ass too.\n\nThe greatest asshole, of course, remains the text sender.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA, you didn't force that guy to be a dick to her. She shouldn't be taking it so hard, I mean she did do it on her own accord. Sounds to me like she's embarrassed, or something, and that's on her. You can't control her feelings. That other dude, yeah, he is a dick. Give her some time and space, then reach out again. If she ghosts you because of things like this, that's on her, you can't control how she feels, you can only do your best to make amends. Good luck.",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "NTA. I dont see how you did anything wrong.",
      "id": 23,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA.\n\nI'm failing to see how you're the asshole for talking about your own life. There were no details, no embarrassing fetishes or mishaps, and nothing wrong with sharing what you did.",
      "id": 24,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "You probably not asshole, just naive, your friends are assholes.\n\n> Is it justified for her to ghost me forever? I mean we are not 16 anymore and it shouln´t be such a drama if people know we hooked up? \n\nProbably yes, but not because you are massive asshole. While you feel good, she ended up ashamed and possibly feeling used. Plus people spread rumors about her sleeping with dude she did not. As someone else here said, a guy having sex have achievement. Unfortunately, same thing for girl is kind of opposite socially. Basically, being playboy is cool, being slut or \"taken advantage off\" is not in such circles. Often from exactly same people who see it as achievement in you. Since your friends are apparently assholes like above and you \"just didn´t have the mental strength to deny it\" and talk openly about sex, you and them are not safe to socialize with nor have sex with.\n\nThe text you quoted here makes it sound like you came to her just to score sex. Meaning, it accuses you of something that sounds more sinister then what it was. She might believe that about your motivations that night.",
      "id": 25,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA. I can't lie. I don't volunteer info, but if someone I know asks me if I hooked up with someone or not, I don't even have to answer for them to know the truth. So I believe that he could be talking to his close friends about this visit, and not have tried to share that they hooked up, but for them to know it happened. \n\nFrom what OP said, he didn't volunteer that info or brag, it was directly asked and he didn't deny it. Not kissing and telling isn't the same as outright lying about it either (and anyways, good friends would spot the lie).\n\nThe assholes are the ones who spread that info (if any did) and the guy who sent the text. It was none of his business.\n\nI feel for you man, someone being a jackass ruined whatever you had with this girl.",
      "id": 26,
      "comments": [
        {
          "score": 2,
          "content": "Thank you, you describe it perfectly. At one point my friends asked me if something happened and I said maybe but had to grin, so they knew instant. It felt impossible to lie about it. I actually really liked her, otherwise the whole thing wouldn't concern me that much I guess.",
          "id": 27,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}