{
  "post content": "I’m 28 (nb) and a new professor at an art college. I teach core classes about politics, sociology, and anthropology. Most teaching evals, feedback from my dean and chair, and students feedback give me high ratings in creating a safe environment for discussion. Students say I do a good job relating to students from different views, backgrounds, and expressions. \n\nThis is something I take seriously—especially as one of the only (that I know of) out non-binary professors at the college. I also take it seriously as someone who firmly believes in the integrity of the classroom. And empowering students to have hard discussions. \n\nI make it a point to never complain about students. Even when they say something transphobic. I politely encourage them to learn and I’m rated as pretty gentle about getting them to think another way. \n\nRecently, I had one of my most uncomfortable teaching experiences which seems silly. I had a student who is not from Japan, never spent time in Japan, but loves anime and used a hypersexual, over exaggerated, baby like voice known as “anime voice”. \n\nShe took on what she perceives as a Japanese name and I just really acted over excited over the top constantly. \n\nAs someone who has had women students from Japan, I felt like it was at least mildly racist and just cringe for everyone to listen. \n\nI pulled her into a convo and tried to let her see how I at least saw it. And she has since retaliated saying I don’t respect the accents or names of students. \n\nThis hurts. Admittedly, I’m a white professor but this student is not Asian. I suspected she might be on the spectrum so I tried to be gentle but firm but as an autistic person, autism is not an excuse for inappropriate behavior. \n\nShe reported me as an unsafe professor which I feel like ruins it for the international students I teach, whose names I pronounce correctly, whose accents I support, and the LGBT+ students who get to have an out non-binary professor for the first time. \n\nThe admin is mostly white and they kept asking “are you sure she isn’t from Japan?” And I’m like yes, 1. This is not how people from Japan talk 2. She did a project about where she is from and she admitted to never spending time in Japan. \n\nAs an anthropologist, I feel it’s deeply irresponsible for her to use this voice. And since it is perceived as hypersexual, it made me super uncomfortable. I’m not sure how other students felt because I didn’t want to give her any attention over it. \n\nPeople have suggested I was too harsh. That people can take on the names and accents they want to. Am I the a**hole here?\n\nedit: she has audibly moaned a couple times. The second time is when I pulled her aside before class (before many other students were there). I also have a class full of anime fans and people who love the subculture in the class. I’m also feminine/queer presenting and AFAB, so it made me uncomfortable how she would also compliment me in the voice or say how much she loved my dresses. Other students have complimented my fashion but not like this. Something was off about it.\n\nSecond edit: I’ll take comments stating “YTA” that’s why I’m here to learn. But comments questioning whether or not I’m trans or I experience transphobia isn’t okay. I’m read by society as a male because I’ve taken hormones for years. Had surgeries. Not that I need to explain this to somehow justify this students behavior or explain what others have pointed out: the class is being sexually harassed.",
  "id": 1,
  "comments": [
    {
      "score": 5993,
      "content": "NTA at worst, it’s racist, at best it’s distracting. You’re doing your due diligence in using this as a teachable moment, and you didn’t even call her out in front of other people. Her reaction is a reflection of her ignorance.",
      "id": 2,
      "comments": [
        {
          "score": 2505,
          "content": "In the update OP says student moaned a few times 😳. I think they need to be less gentle and more firm. While I think creating an open classroom is important, a leader of a team must make hard decisions and from time to time put their foot down.",
          "id": 3,
          "comments": [
            {
              "score": 1219,
              "content": "At that point it becomes sexual harassment and really fucking creepy.",
              "id": 4,
              "comments": [
                {
                  "score": 2,
                  "content": "So is no one going to say that maybe the parents are to bl-....nevermind, I'm not using that card",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "LOL. so creepy!  yuk!",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 618,
              "content": "OP is being sexually harassed and they're worried if *they* are the asshole.\n\nEdit: sorry, they, I was taking my cue from the AFAB part. I suppose the emphasis looked like I was emphasizing the pronoun whereas I meant to emphasize the subject.",
              "id": 7,
              "comments": [
                {
                  "score": 445,
                  "content": "Worse, their whole *classroom* is being harassed…and admin is still questioning if they’re the asshole.\n\n\nEdit to the proper pronouns. Quite right to the Redditor who corrected me, my deepest apologies! My brain got stuck on the “feminine presenting,” which is no excuse. Thank you!",
                  "id": 8,
                  "comments": [
                    {
                      "score": 68,
                      "content": "No problem! Happens to the best of us! Kudos to you for being honest and understanding! :)",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "they\\*",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "*they*",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yeah, it's unfortunately a trend and it's so fucking **uncomfortable**. I just look at my students and say \"absolutely not\" with mean teacher face and normally they get it. However, twice I've had to get their homeroom teacher and explain to them in their native language that it's inappropriate to make that noise in a classroom.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 217,
              "content": "Exactly. It's fucking racist toward the Asian students in the classroom, and it's also inappropriately sexual. It's likely that your university has a behavior reporting system, and I encourage you to use it. You can submit a factual report about the student's behavior, and the conduct committee and dean of students will deal with it. File a report for each instance. If she escalates, the conduct committee can bring in the chief diversity officer, counseling office, Title IX investigator or other administrator as needed. This is not your responsibility to deal with. Your responsibility is to provide a safe, positive, intellectually-stimulating classroom experience for your students, and this student is being disruptive in a very inappropriate way. I urge you to get out in front of this before she spins her narrative - the one who talks first and talks the loudest is often believed.",
              "id": 13,
              "comments": [
                {
                  "score": 32,
                  "content": "Title IX is a great call. You can provide a lot of context in your report, at least where I am, and then it’s official in the university system and no one can pretend it wasn’t raised as an issue.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 143,
              "content": "I work in schools and have also had to report behaviour multiple times. Op should honestly be going down the sexual harassment route instead of the ‘racial’ route (in quotes because the student is white and being racist). \n\nAdmin and schools will frequently be really tricky about race, accents, etc. etc. because it can blow up in their faces really quickly. If you report the student for hyper-sexual inappropriate behaviour (such as moaning) and frame it as harassment against yourself and the students, admin normally act a lot quicker in your defence.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Right? This will not fly in the workplace. University is preparation for a professional career.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Right? The moaning is a title IX waiting to happen",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "NTA. I'd say Op needs to report her to her boss, or her bosses boss. If nothing is done about it, ask students how they feel and note down their responses.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You know that saying \"have an open mind, but not so open that your brain falls out\"? Your brain is slipping if you have to do such cringy woke analysis on yourself before telling creepo student to STFU and Deal. NTA",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 316,
          "content": "I feel about 100 years old after reading that. I’ve never heard “anime voice” outside of anime. Not only are you NTA, you reacted far more gracefully than I would have.\n\nIt’s hard to believe that someone would try so hard to be so annoying! This girl must be *exhausting.* And I believe the moaning borders on sexual harassment.",
          "id": 20,
          "comments": [
            {
              "score": 143,
              "content": ">I feel about 100 years old after reading that. \n\nAnd presumably there are people at the school who are older, less aware of anime and the way some fans can \"over invest\" in the culture of a country they have no actual experience of. I can't believe every teacher will be as careful to avoid confrontation as OP is. \n\nWhat OP did was ideal. Handled perfectly. NTA in letters a dozen feet high.\n\nBut if the pupil ignores the effort OP made and carries on like this, surely at some point an older person is going to point blank tell her to \"stop making stupid moans and talking in a racist accent\". We old people don't have time for fetishising Japan, we're rapidly approaching death, our time is precious and to us Japanese cartoons are Akira and the badly dubbed Battle of the Planets where everyone had the decency to not sound Japanese at all.\n\nActually Ulysses 31 was also good, especially if you liked the BeeGees.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "I’ve never heard it happening outside of high school. When I read collage my mouth dropped open. I wonder if this is a new thing she’s picked up because I would assume that shit would have been shut down pretty quickly in high school. Also she much be taking other classes? Is she like this with other professors?",
              "id": 22,
              "comments": [
                {
                  "score": 21,
                  "content": "My guess is no. But I’ve wondered about it often.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 12,
                      "content": "In which case, it could be that, as you are NB, she believes that you'd be open to her \"non traditional\" persona. Which is a twisted logic but I can see how she could get there. Definitely report it, and keep a log of all instances of her behaving this way, even if they're so minor you wouldn't bother reporting them. This probably wouldn't turn into an 80s psychological thriller type situation, but it's better safe than sorry, and covering your back would be a good shout.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I’m not sure what a “hypersexual anime voice” is? The only anime I’ve ever seen is Sailor Moon about 25 years ago lol is there a specific show I can look up so I have a better idea what you’re talking about? I literally googled “hypersexual anime voice” but your Reddit post was actually at the top lol",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I've known people like the student described they exist and are exhausting AF to be around.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 250,
          "content": "If I were in that class, you'd be my hero. I can't stand that way of speaking. You sound kind and amazing, she sounds god awful. NTA",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "Dude yeah. NTA. The student is making you all non consensual participants in their kink and it’s not ok.",
          "id": 28,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "At best its cringe, and not the good kind.. I'm an anime buff and I feel insulted by what the student was doing...",
          "id": 29,
          "comments": [
            {
              "score": 8,
              "content": "\\*moan\\* Are you in pain? Should I call 9-1-1 or can you make it to the doctor's/nurse's office on your own?",
              "id": 30,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I had to laugh at your saying at best, it's cringe and not the good kind.  Is there a good kind of cringe? lol",
              "id": 31,
              "comments": [
                {
                  "score": 2,
                  "content": "Schadenfreude",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "It’s also just extremely inappropriate and unprofessional. College is like an entry level professional experience. This is where you’re really supposed to start acting like an adult. And in no way is this person going to have professional success behaving this way. OP was in the right to try to correct and help this person with what is clearly a kind of cosplay fetish behavior.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Not just racist but appropriation somewhat.\n\nNTA",
          "id": 34,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2786,
      "content": "NTA\n\nMet plenty of weebs in college. At worst it's racist and fetishizes an entire culture, at \"best\" it's distracting and affects the learning environment for everyone else .  \n\nSet a boundary. Spin the \"it effects everyone else\" angle with her moaning. \n\nShe obviously doesn't care about her behavior coming off as racist and cringe.",
      "id": 35,
      "comments": [
        {
          "score": 1035,
          "content": "The moaning is sexual harassment. Full stop. NTA.",
          "id": 36,
          "comments": [
            {
              "score": 296,
              "content": "THIS! \n\nTitle IX isn’t just for students. Report this.",
              "id": 37,
              "comments": [
                {
                  "score": 75,
                  "content": "Well, if it's in front of the class they need to report as mandatory reports",
                  "id": 38,
                  "comments": [
                    {
                      "score": 11,
                      "content": "they probably don't tbh.\n\nit's unlikely the students are covered by mandatory reporting laws - unless there are minors or people with disabilities that are protected by whatever location OP is in. this also likely doesn't constitute sexual abuse, it doesn't in my state at least /shrug.\n\n&#x200B;\n\nedit: they could need to report due to college-specific guidelines. additionally, idk how title xi works when only students are involved. \"Mandatory reporting\" is just a very specific thing that this likely doesn't cover.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "I can’t believe the moaning is an issue in COLLEGE. I’ve had it up to here with my middle schoolers doing it but jfc.",
              "id": 40,
              "comments": [
                {
                  "score": 16,
                  "content": "I hear you. Me too. Stupid TikTok.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Wait until the fake Tourette’s and DID students start interrupting the class.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 285,
          "content": "What I wish people would understand is you can be a big fan of anime without being a weeb.",
          "id": 43,
          "comments": [
            {
              "score": 116,
              "content": "🙃 I went to high school with someone who wore cosplay as their normal day wear, complete with cat ears and tail combo.",
              "id": 44,
              "comments": [
                {
                  "score": 128,
                  "content": "I'm a big proponent of letting kids express themselves in their clothes like that. But also of teaching them time and place - like maybe not being a distraction in a place of learning.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Eh... I disagree. Saying \"they shouldn't wear cosplay/cat ears because it's distracting to other students\" is similar to when schools blame girls for having their shoulders exposed and \"distracting the boys\". Or saying \"boys can't wear skirts/dresses because it's distracting other students\" (a common transphobic argument). \n\nWearing cat ears might be \"weird\" but is it *that* much \"weirder\" than a lot of other things teenagers do? And who does it harm? If they wear them every day I doubt other students would be distracted for long. Let kids dress how they want and teach other kids not to be judgemental-- that's the more important lesson. \n\nNow with that being said, obviously moaning/making others feel sexually harassed is different. But I think people in this thread are justifying *a lot* (like policing people's clothing) on the basis of \"these people are weird and I don't like it\", not *really* because of true concerns regarding racism or sexual harassment.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "That’s fucking weird. \n\nAnd yet I really enjoy anime.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 35,
                      "content": "I myself have binged a few animes on Netflix and crunchyroll, but there's a line that shouldn't be crossed.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "Meh, cat ears are pretty mainstream headbands now. My daughter has had a gaggle of them that she’s been acquiring for about 5 years. She still wears a pair every day. \n\nIt’s now more unusual to her peers to see her without ears than with. It’s not a weeb thing; she just discovered anime a few months ago. She just likes her cat ears. She’s also 10.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I bet she loves Louise on Bob's Burgers.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Several of my dearest late-30s friends all jumped on the headphones with cat ears. The early zoom gatherings with them were hilarious, and at one point almost every participant was using them to general hilarity.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "yeah hasn’t Ariana Grande been wearing them for years?",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I know that is super odd, but I find that rather enjoyable, kids these days seem to be open minded to the point of crazy lol, but better a little cat ear and tail than bigotry eh :)",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I'd prefer that over this.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Eh, this doesn’t bother me as much.  But I say that as someone who went to a school where we had to wear dresses in Wednesday’s for chapel and when I wore a bright pink skirt with a bright t shirt and houndstooth tie (early 90s and 12 years old), I was told that it didn’t count as a dress and that it was offensive to god.  I was over sexualized from age 10-12 in that school.  And treated like crap because I had ADHD and am on the spectrum.  So maybe I’m just bitter.",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "ded",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I am almost 53 years old, and I wear a cap with cat ears, cat eyes and even whiskers!\n\nI also wear a sweater with a hood with cat ears, and it says \"I'm a cat\" on it. And I have sky blue hair \\^\\_\\^\n\nIt's a part of my daywear and who I am (and I also wear beautiful, classical and timeless pieces too, lol ! I'm a chameleon)\n\n... BUT that attitude is a least disturbing !\n\nNTA, op",
                  "id": 57,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Why the downvotes ?",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -6,
                      "content": "I'm gonna go ahead and let you know: what you described is also disturbing.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Probably a furry rather that a cosplayer or weeb FYI\n\nAnd honestly where's the harm in dressing a little silly if everything is covered up and you aren't being racist or overtly sexual (e.g. kinkwear). It's different to the original situation which crosses both boundaries.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "I worked with a guy who wore a little bell choker and sometimes cat ears. At a laboratory.",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "I’m not an anime person but my perception is most anime fans aren’t weebs so hopefully they haven’t ruined being a fan for everyone",
              "id": 62,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Weebs should always be closeted, sincerely a weeb 😔",
          "id": 63,
          "comments": [
            {
              "score": 12,
              "content": "What is a weeb?",
              "id": 64,
              "comments": [
                {
                  "score": 128,
                  "content": "A weeb, short for *weeaboo*, is a derisive term for a non-Japanese person who is so obsessed with Japanese culture that they wish they were actually Japanese. But not just a normal Japanese person, they wish they were the type of over-the-top caricature of Japanese culture that is depicted in anime. Particularly prevalent in the way they type/speak and dress. They pretend to appreciate the culture but they have a completely warped sense of what Japan is really like and how Japanese people actually act, and assume/pretend it is how certain cartoons depict it to be. It’s a fetishization.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 12,
                      "content": "and weeaboo is a word that came from Perry Bible Fellowship. \n\nhttps://pbfcomics.com/comics/weeaboo/",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I met a teenager once (when I was an adult, through music) who fully claimed that she lived in Japan most of the year and was Japanese and when asked what highschool she went to named a school in Tokyo, but when another person in the cast who spoke Japanese tried talking to her, it turned out she did not speak Japanese, and her grandparents made it clear that they didn't know what she was talking about. It was very strange, and I felt really bad for her.\n\nThe funny part was that the opera we were putting on was The Mikado, which if you aren't familiar with it, basically in the 1880s Gilbert and Sullivan wrote a whole operetta that is just a racist joke about Japan. It's a great show if you can get past the racism, and for the time period, wasn't awful, it's more silly than cruel, but yeah, not a good depiction of Japan.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "You can websearch \"weaboo\" for further information, but it's briefly a Japanophile who takes the adoration of the culture and moreover anime subculture to strenuous excess.",
                  "id": 68,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "It's short for weeaboo, and comes from the [Perry Bible Fellowship](https://pbfcomics.com/comics/weeaboo/)",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Never reveal your power level",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "NTA. I am half asian and attracted a lot of people like that in college. The technique I learned was just to ignore or steer the conversation elsewhere but I never had a prof intervene. They treated me like a babysitter. So I appreciate OP looking out for your students!",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah I think we forget that women can be weebs and it’s racist when women do it too.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1302,
      "content": "NTA\n\nI'm very curious how her other professors are handling this or if she only does this in your class. I would be very distracted by a fellow student essentially playing a character all during class.",
      "id": 73,
      "comments": [
        {
          "score": 1155,
          "content": "Yeah people are commenting saying I was the one making it distracting or sexual but I could see students visibly become uncomfortable with the noises and sounds she was making. Not just the accent.",
          "id": 74,
          "comments": [
            {
              "score": 215,
              "content": "[deleted]",
              "id": 75,
              "comments": [
                {
                  "score": 698,
                  "content": "That’s why I’m asking. At first I allowed it, it’s a close knit class and they clearly excluded her a lot because of the voice. So I felt bad. And tried to make sure she was okay. But then it continued so I pulled her aside to talk before class one day and first made sure she was okay. and then tried to let her know for her own benefit that it was making people uncomfortable. She wasn’t in trouble/didn’t face consequences for it.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 270,
                      "content": "First off, NTA. What does your chair say?   \nPersonally I think you needed to shut that behavior down the first time it happened in your class, but I know how awkward correcting student behavior can be, especially as newly minted faculty. I’m surprised your school isn’t backing you, most art schools would not be ok with a student being so racist/sexist (having attended both a SLAC and a R1, that sounds like R1 bureaucracy.) If your chair isn’t involved, you need to loop them in. If your chair is involved and isn’t backing you up I’d make an appointment with the Title IX coordinator, or someone in the Diversity and Inclusion Office (if they aren’t the same person).",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 79,
                      "content": "I don’t think you’ve handled this brilliantly. You first permitted it, then told her it was making others uncomfortable but still permitted it. The sexual content makes it inappropriate for the classroom and you would have been wise to raise it with administration when it first came up. \n\nUltimately, it’s great you want to create a self space for free expression. But I think you need some more rules around how you do that.",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Honestly, I would say yes. As the authority in the room, you should act. This is college, not elementary school or daycare. The student should be behaving appropriately for an adult environment. Maaaybe this would be appropriate behavior at an anime convention, but in a college classroom, students are there to work and learn, not act out. If this girl wanted to be Anime Girl in the dorm, in the cafeteria, at the student union, then I guess that’s her journey (although she may damn well get in trouble if there are students of Japanese descent who see these shenanigans) but it sure AF doesn’t belong in a classroom.\n\nAs for reporting you, last time I checked “pretending to be an anime character” is not a protected class. You are not obligated to provide a “safe environment” for that. And in fact it might be a good subject for a class or two on the difference between cultural appreciation and appropriation.\n\nAs for the comments on your personal appearance, I would suggest saying something to her, that would be appropriate at ANY job to say to anyone who comments inappropriately on one’s appearance: “I’d prefer it if you didn’t comment on my appearance. It makes me uncomfortable.” This is your workplace and you have a right not to have someone saying that stuff.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 87,
                  "content": "It absolutely is. Otherwise, why have an authority figure? It's not a merely a social situation -- it's a classroom. Students have paid a lot of money to be there. This weeb is an attention-grabbing fetishist whose behavior needs to be logged and reported. She really is creating an unprofessional environment, and very new college students will need a little more help correcting classroom dynamics than, say, a small grad student seminar. OP, NTA.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Excellent answer.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yeah. I'd hate for some students to feel like they can't attend",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "Of course it's necessary. The student is distracting \\*at best\\* but is also performing racial microaggressions as ... her personality? And she's sexually harassing the classroom. In what universe is it appropriate for the authority figure in the room to basically act like other students' discomfort is the discipline? They deserve an appropriate learning environment, the professor deserves an appropriate working environment, and she's taking that from them.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "Fellow students don't have the power to censure their peer (and frankly they shouldn't!). It's the authority figure's responsibility to maintain professional standards of conduct so that students are able to focus and work effectively. If this student were touching fellow students inappropriately, spraying heavy amounts of perfume into the air, or answering questions only in a \"polly want a cracker?\" parrot impression, there might be social costs to that behavior, but it would still be the authority figure's job to respectfully intervene.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Definitely. She is making people uncomfortable. It's his job to make the classroom a comfortable and safe learning environment",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 107,
              "content": "If you see students becoming uncomfortable (especially *moaning)* you should call her out tbh. Tell her those noises are distracting during class! That she's interrupting other students. Maybe she'll keep using the voice but it's perfectly reasonable to tell a student they can't make sexual noises in the middle of class.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Is it possible to find a video clip of this in anime that would both highlight the problem and be “safe” to share at work? \n\nThere was a story at one time about a guy who was sexually harassing his stepsister by making references to stepsister porn. Their parents failed to see how saying “stepsister” was a problem until someone was able to clearly lay out to them that it was a porn reference. They may have even had to link to examples. But it solved the problem.",
              "id": 87,
              "comments": [
                {
                  "score": 45,
                  "content": "Yeah OP refers it to an \"anime voice\" but I'm assuming it more like hentai acting but idk what exactly she is doing that is overly sexual, I'd like to be able to hear a clip to gain better insight!",
                  "id": 88,
                  "comments": [
                    {
                      "score": 14,
                      "content": "It's possible her \"moaning\" is just the usual wordless vocalizations commonly heard in anime. To the inexperienced English speaking ear, it probably sounds like erotic.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "yes I am...masochistically curious about exactly how annoying this can get.  Like, anime voices are annoying in Japanese, so it exceeds my imagination how annoying the english imitation would be.",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "At that point she is putting on a performance for effect,  not participating in the class in good faith, and clearly trying to make other people part of her - whatever - without their consent.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I've had students use the baby-talk voice before. I suspect it was effective for her in dealing with certain types of white cis men (she is Chinese, and this was in China, at an international college), and since I'm enby and masc, she thought she'd try it with me too. Mortifying. I ignored it, but now I'd probably say--once--that I need them to use their grownup voice. And then drop it.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Yes, as a current college student, I wouldn’t be able to handle being in a class with someone behaving like this. It would be far too distracting.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "The other professors don't seem to recognize her accent or behaviour as not natural, or sexual, which does seem odd.",
          "id": 94,
          "comments": [
            {
              "score": 32,
              "content": "Or she’s spotted OP as being the most ‘understanding’ and ‘diverse’ professor and thought she could get away with acting like this. And if OP is more feminine presenting probably feels more comfortable acting overtly sexual than she would in front of a man. So she amps up the act in front of OP",
              "id": 95,
              "comments": [
                {
                  "score": 33,
                  "content": "You describe what I was attempting to say elsewhere better than I could—thank you for that. I’m regularly treated like the diversity hire. I’m visibly the youngest and I’m often seen as the accepting professor in good and harmful ways. Sometimes students think empathy means being a doormat, which for me it isn’t because that isn’t really being nice. But the difference is that it is usually about deadlines with most students. That’s what they try. Oh you’re the young professor with tattoos? Can I submit things late? This I’m used to handling. But It isn’t being overtly sexual around me. That feels different. And over my head.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 15,
                      "content": "It’s a really hard thing you’re dealing with here, made harder I think by your younger age, I highly doubt this would be going down if you were 45 and not 28. While having a younger, more empathetic professor is great and amazing, there always seems to one who takes the smaller age gap as an indication that you are peers instead of teacher/student and pushes the boundaries. Which is what I think this girl is doing. She’s enjoying the attention from her classmates (even if it’s bad attention) she’s enjoying being the quirky one. And she’s enjoying acting out her sexualised persona in front of someone she doesn’t view as a ‘threat’\n\nI agree with what other commenters have said and would move away from the racism angle with this (and it IS racist) and focus on the sexual harassment and I think your bosses will be a lot more receptive and pro active. ‘I’m being sexually harassed by a student’ gets people in charge moving A LOT quicker than ‘she speaks in a racist cartoon voice’",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 803,
      "content": "She’s MOANING during class?! Wtf",
      "id": 98,
      "comments": [
        {
          "score": 187,
          "content": "Go take a look at the teacher subreddit. Middle and high school student’s newest taunt is to sexually moan loudly while teachers aren’t looking, and parroting other “sexual” talk.\n\nThough in this case I’m not sure if he means it’s a sexual moan or like the type of exaggerated dramatic moaning sound you sometimes hear in anime.",
          "id": 99,
          "comments": [
            {
              "score": 120,
              "content": "Is this new?\n\n\nI remember most of the guys I knew in middle school moaning randomly and playing the penis game when the teachers went out the room. (The one where you yell penis the loudest)",
              "id": 100,
              "comments": [
                {
                  "score": 15,
                  "content": "I think it’s the type of sexual remarks. My sister is in HS and this year a video went semi viral on tiktok of a student yelling to a teacher, in class, that she had “the fattest ass known to man” or some shit like that. And like… teachers can’t really do much against being cat called like that by a bunch of 14/15 year olds.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Haha I miss middle school 😂",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "*They\nOP is nonbinary",
              "id": 103,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "I teach middle. On top of the moans I also have to deal with a lot of “step bro step sis” jokes and kids who openly discuss hentai and try the “it’s a name for anime!” Excuse . Really really uncomfortable",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Elementary too.  It’s disturbing.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Man I'm old. We made barnyard animal noises when their backs were turned.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 557,
      "content": "NTA\nFetishism aside, she's disrupting class with her moaning, and that also creates a hostile learning/working environment.\n\nYou can't force her to change her voice, as cringe as it is, but you can insist that the moaning stops.",
      "id": 107,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 383,
      "content": "You should probably add in your original post about her moaning in class lol. Cause that change it from yta to Nta. I know as a college student that would be hella distracting and super uncomfortable. I wouldn’t even want to be there. There’s a time and place for those voices where it just isn’t cringy. I have friends who do the anime girl voice when they stream on twitch as vtubers but turn the voice off as soon as they are back with us and not putting on a show. Or tiktok, anime club, or convention is fine but idk In real life just normally having that voice just feels out of place unless there’s a lot of reason for it. I think it wouldn’t be so bad if she didn’t moan lol.",
      "id": 108,
      "comments": [
        {
          "score": 382,
          "content": "I wonder if it’s worth it to add that we have a lot of anime fans and people who love the subculture in the class. People who love to cosplay, draw, get super into it. I support them. But they don’t do anime voice or moan in class.",
          "id": 109,
          "comments": [
            {
              "score": 513,
              "content": "NTA, this isn't an accent, it's an affectation. You don't get accommodation for a hobby.\n\nWhile she shouldn't need to suppress an accent or a gender identity or a hair style, she should be expected to respect the class as a professional setting. Most of us have to behave slightly differently at work or school than we would at home or around friends or other fans. So, anime voice shouldn't be used except to explicitely make a point about anime specifically, or it's just inappropriate, since it is clearly and deliberately sexualised. In the workplace, inappropriate behaviour has consequences when a private interest interfers with the workplace environment. She needs to learn code switching now, and could use the pointer that anime voice coming from non-japanese people can be perceived as racist / appropriation / mocking / artificially / sexy.",
              "id": 110,
              "comments": [
                {
                  "score": 17,
                  "content": "Say it again.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "Yes you should add it. \n\nLike using the high pitched tiny voice? That’s annoying but harmless and you shouldn’t comment on it. As an anthropology and sociology professor you could always casually bring up a topic about cultural appropriation and fetishizing a culture… and see where the convo goes and maybe she would absorb that what’s she doing is wrong. \n\nBut MOANING?! People moan out of sexual pleasure or out of pain. I would have gone “are you alright? Do you need to go see a nurse? Because moaning like that makes me concerned. Oh you’re fine? Then stop making inappropriate and distracting noises.”\n\nBecause like… no. That’s creepy and would make a lot of people feel uncomfortable.",
              "id": 112,
              "comments": [
                {
                  "score": 50,
                  "content": ">But MOANING?! People moan out of sexual pleasure or out of pain. I would have gone “are you alright? Do you need to go see a nurse? Because moaning like that makes me concerned. Oh you’re fine? Then stop making inappropriate and distracting noises.”\n\nYup. Was a teacher, and when students did dumb shit like that, I'd call them out in a way that embarrassed them for acting out. (though not to students where it wasn't a call for attention)",
                  "id": 113,
                  "comments": [
                    {
                      "score": 10,
                      "content": "That wouldn’t be my first approach (am a teacher too but with littles) and my standard mode of operation does involve sarcasm - but only when kids and I are comfortable and I know they understand me. \n\nIn this case I would have started with genuine concern - are you ok? Are you in pain? Then why are you moaning? \n\nBeing in uni though…ffs, control your mouth noises when you’re in class!",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "I can’t speak for all anime fans/cosplayers of course but out of the ones I do know. They pick and choose times were they feel it’s appropriate to use the voice. And make it the least awkward. So again I  normally hear it at conventions, tiktok, twitch and clubs. I wouldn’t say it’s a super duper bad thing if someone does it all the time. The student themselves has to know or have some idea that people aren’t going to be as accepting to it but still does it and in that sense they should at least be a little willing to make it better even if it just please stop moaning in class lol. The issue really runs into the sexual stuff as you say. Unless there’s a reason they can’t control the moaning that is something that talking to them about makes you Nta cause that passes some lines. My guy friends personally love to do the moaning stuff in friend group calls because they know it makes people uncomfortable but in person they never once do it cause they know socially it just isn’t accepted and they don’t want to make outsiders uncomfortable.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Hey! As someone who lived in Japan and still works there regularly, I know the voice you're referring to. And saying that Japanese women/girls don't use this voice is categorically incorrect. If you'd ever visited Japan you'd notice young girls using it everywhere during normal everyday settings. Many girls working retail or at restaurants use it and all the girls at maid cafes or working at the hostess clubs use it.\n\nSo sorry but you're wrong. This is a style that young Japanese girls her age adhere to. It's super super annoying (to be honest I hate it and worry about their vocal cords) but as an Asian woman I don't find it racist at all. She's copying what she sees as a style she likes. All teens do this and btw, it's not a sexual style, it's supposed to be cutesy.\n\nMoaning however is not normal (and not part of the style) and shouldn't be done outside a brothel or bedroom. If you had stopped at just saying the moaning is inappropriate I'd say you're in the right but maybe in the future leave it to Japanese people to decide what they find racist.\n\nEdit: Someone below and elsewhere on this thread pointed out that the student isn't copying the normal gyaru high pitched voice that many Japanese girls use. The student is copying a very racist tik tok trend (called hentai voice? or something like that sorry I don't use tiktok). So I think OP probably has the right grasp of the situation and my image of what the student was copying was way off.",
              "id": 116,
              "comments": [
                {
                  "score": 41,
                  "content": "The girl is not Japanese and has never been to Japan.",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 38,
                  "content": "[deleted]",
                  "id": 118,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Hmmmmm.... I didn't catch the hentai voice tik tok thing. I'm old so I just thought OP was complaining about the ギャル voice every waitress in Japan uses and was like \"I know it's annoying but what's the big deal?\". \n\nThe hentai voice tik tok thing is very racist wow. I'm glad I'm not on tik tok... That site is wild.",
                      "id": 119,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "> they're definitely being racist by trying to \"be\" Japanese\n\nThat's an interesting take.  I'd suggest that in today's age we are largely free to choose the cultural norms we want to follow, and not forced to follow the ones imposed on us by our birth nation.  I mean... why is participating in Gyaru fashion okay, and using an annoying voice not?  \n\nSide-note...  if I were a teacher I'd suppress any moaning in my classroom (really?  people do this?) regardless of cultural connotations.  Just... no.",
                      "id": 120,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "> Many girls working retail or at restaurants use it and all the girls at maid cafes or working at the hostess clubs use it.\n\nMy understanding is that they’re required to use a higher pitched voice. That shit sells. It’s called service voice. It’s not normally sexual but it definitely can be. \n\n> trains the newcomers to raise their pitch.\n\n> \"Girls with a lower pitch have a struggle when they come here to work at first,\" she said. \"But after a month or so, you see a transformation. And after three months, they have a completely different voice.\"\n\n[Article](https://www.nytimes.com/1995/12/13/world/tokyo-journal-japan-s-feminine-falsetto-falls-right-out-of-favor.html). \n\nJust because you hear it walking through Akihabara (using this example because that’s where I heard it most) doesn’t mean it’s completely real.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yes service voice is what I was referring to and I realize its not real. But also when I was on college this voice was on trend amongst the gyaru ladies during work hours and off work hours. They thought it was cute and honestly a lot of Japanese guys seemed to love it. I was just referring to the workers in shops because I assumed most people on this subreddit meet a ton of Japanese teen girls everyday but they probably have heard it as a tourist in a restaurant or shop if they’ve ever visited Japan",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "That article is pretty condescending, isn’t it? Modern Japanese women don’t like to ‘squeak’? The translation of the elevator girl’s patter is also ham-handed (honorable self’? Good lord) and the description of her is mocking. \n\nA service voice and anime/gyaru/kawaii voice are miles apart. Maid cafes and hostess clubs are not normal social situations. I don’t know anyone who talks like that in a normal social setting.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -8,
                  "content": "Thank you. I am wondering how OPs lack of East Asian culture & comminication is adding their interpritation if the students presentation. Like they say the \"anime voice\" is perceived as sexual but I'm wondering how much is her biased, inacurate perception? As you say being cute is not inherently sexual & personally I appreciate that it's more acceptable to be childish as an adult in some cultures. \n\nI asked in a comment elsewhere what the \"moan\" what actually like too. As I wondered if it was more normal that they think. Like how if something suprising or impressive happens & in English you say \"oh my god\" where as they would say \"woooah\" in a loud extended way, which to those not used to it could be mistaken for a moan. There are a lot of nuance & I'm not seeing any explicitly sexual examples given.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -12,
                  "content": "[deleted]",
                  "id": 125,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I guarantee that as an anthropology professor they know enough about Japan to know this student's behavior is bullshit.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "She's disrupting the class and creating a hostile environment. The moaning is also affecting the class and you which can be classed as sexual harassment. She clearly isn't going to stop, if I were you, I'd drop her from the course. You don't need to bend over backward for someone who is willfully disruptive and making others feel uncomfortable. Using anime voice is fetishizing and the \"accent\" is racist.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Draw the line at moaning in class. That is not okay, regardless of the accent!",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "As a college student, I would make a report if someone was obviously moaning next to me in class. With or without anime voice.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Moan or not it's extremely inappropriate in a classroom setting",
          "id": 131,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 227,
      "content": "NTA.  She isn’t Japanese, she’s just creating a racist caricature that contributes to the fetishization of Asian women.  You do respect the accents of students - what she has isn’t a natural accent it’s a tone deaf act.  \n\nAnd audibly moaning in class is just sexually inappropriate behavior.  I would report that to someone if you can.  Whether or not she’s on the spectrum it creates an uncomfortable environment for everyone else and since she’s likely to take a defensive/accusatory stance if you try to address it yourself, it’s better to let the university deal with it (while hopefully still keeping in mind her being on the spectrum).",
      "id": 132,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 169,
      "content": "NTA, she sounds like a weeb and as an Asian (non-Japanese) person, that would annoy the shit out of me as well.",
      "id": 133,
      "comments": [
        {
          "score": 17,
          "content": "Also (non-Japanese) Asian. I would be alternating between cringing and rolling my eyes. Who the fuck MOANS in a college class?",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 167,
      "content": "NTA. This is college, not high school or elementary school. I feel you, as the professor, have the right to run your course as you see fit…as long as it isn’t discriminatory. People in college are considered adults. She was making you and others uncomfortable with inappropriate vocalizations. Her right to use this voice is not more important than your and the other students right to not have to put up with it.",
      "id": 135,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 148,
      "content": "NTA. people defending anime voice bc it’s on TikTok…okay that’s literally a platform for artistic expression. Let it stay on TikTok. She isn’t being oppressed by being asked to behave professionally in an academic setting. Also, to those saying this is a specific Japanese subculture—amazing! Happy for them. This woman is not Japanese however and this classroom is not in Japan. She is not being respectful to anyone with this behavior.\n\nEdit: deleted a typo",
      "id": 136,
      "comments": [
        {
          "score": 18,
          "content": "Ok, I need examples. Somehow I managed to create a bubble that does not contain \"anime voice\" and now i am extremly curiuos. Please send/post me a link or tiktoker I can check out. Thanks !",
          "id": 137,
          "comments": [
            {
              "score": 14,
              "content": "I for one am extremely happy that I've curated my internet experience in a way that hasn't exposed me to this.",
              "id": 138,
              "comments": [
                {
                  "score": 5,
                  "content": "unfortunately I am fucking up my youtube algorithm trying to figure it out 😂 no success yet",
                  "id": 139,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah I can't find any examples on YT or TikTok and I don't know what else to try searching for lol",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}