{
  "post content": "My (f35) family is Mexican and we live in TX. Everyone in my family is bilingual and they tend to mix English and Spanish constantly.\nMy siblings spouses have all learned some Spanish, some better, some worse, but they can still participate in all conversations.\n\nI’ve been with my husband for 10 years. He took a few classes but he found it too difficult and decided that he can’t learn a language as it’s his thing just like math isn’t his thing and he dropped it.\n\nEvery family gathering (there are a lot of them) he feels left out because everyone switches back and forth and he doesn’t understand them. I have to translate for him and it really must be uncomfortable for him.\n\nThis year he said that he’s not coming, he feels excluded and even when he talks with non Mexican spouses, they mix and match languages and he felts it’s to mock him because there’s no need to.\n\nI called my mother and told her that they must promise to not speak Spanish because it’s excluding my husband or were not coming.\nMy mother was angry, she told me they’re not going to police their speech, that they were accommodating for the first few years but he made no effort and it’s ridiculous that he doesn’t even try. I told her to at he did try but she knows it’s difficult for him.\n\nShe said that he’s no longer invited and I can come on my own. I was really angry and repeatet my ultimatum. This didn’t go down well. My whole family is pissed off, my husband is on my side and I don’t know anymore. AITA for giving them the ultimatum?",
  "id": 1,
  "comments": [
    {
      "score": 31884,
      "content": "Yta \n\nWell your husband is ta but you're the one joining in so. \n\nA couple classes simply isn't enough to be able to claim he just can't get it. Him not wanting to try is not your family's problem. Him being upset people dare speak a language he can't and feeling mocked also isn't anyone's problem but his own.\n\nEta with this getting attention I want to say that I know some people simply can't learn languages to a degree where communication is possible and that's not their fault, but to me it seems like husband is actively not trying at all instead of trying hard and failing.",
      "id": 2,
      "comments": [
        {
          "score": 12505,
          "content": "He’s had 10 YEARS, and he still can’t participate in a basic conversation. And thinks other spouses are doing it to ‘mock him’. What an entitled ass YTA",
          "id": 3,
          "comments": [
            {
              "score": 3643,
              "content": "Tbf they probably are mocking his lack of family participation. Really 20 years and you don't understand anything going on. My Spanish is shit but I try and have yet to meet anyone from anywhere who isn't willing to teach you their language.",
              "id": 4,
              "comments": [
                {
                  "score": 3161,
                  "content": "You can even learn from exposure. Just being around her family for 10 years or more should have allowed him to figure out basic phrases, and if he doesn't understand what someone says, he can ask. It's another way of learning.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2095,
                      "content": "The husband seems like he is refusing to learn.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 398,
                      "content": "Seriously! I know a very small amount of Spanish and I've already picked up a few phrases and words from the Mexican restaurant I've worked at for a month! One month... and this guy can't learn a simple phrase or two at least in 10 YEARS? And he doesn't even want to try, not even for his wife's family? That sounds downright disrespectful, honestly.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 321,
                      "content": "I'll have been with my partner for ten years in the Spring, and up until covid we spent two weeks with his family every Christmas. They speak mainly Mandarin. It's *difficult!* There are no classes in my little city and learning on my own is very, very slow going. But simply by being around them I get enough little stuff to begin to participate in the conversation.\n\nSpanish is...just so, so much easier than Mandarin, when we're coming from English as our base language. I don't know what OP's husband's excuse is.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 110,
                      "content": "I think this to be true. Spanish is one of the easiest languages to learn and he’s got his own reference library right in the home so he needs to try harder.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 72,
                      "content": "Can confirm. I’ve lived in TX for a year and a half, knew no Spanish other than hello and how are you. Although I’m by no means fluent and don’t fully understand I can at least pick up key phrases for context and respond in (no where near perfect) short responses",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My cousin’s GF is Mexican.  He took Spanish in school so he knows some, but he’s gotten better being around her and can actively participate in most conversations with them thanks to context clues, basic knowledge, and exposure.\n\nI do really well with reading, writing, and speaking other languages, but comprehension is tougher because native speed is often fast and I have a hearing impairment.  But exposure helps that as well.\n\nYeah, OP’s husband clearly isn’t even trying or apparently willing.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "This.\n\nMy inlaws are Italian but they speak English if I'm around. But they'll still speak in Italian sometimes. Recently, my MILs sister came to visit. She doesn't speak any English but I knew what she was saying when she asked me a few questions (she asked my husband and I if we went dancing on our anniversary) because I understood a few key words from hearing my inlaws use them.\n\nSounds like her husband just doesn't give a shit.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Seriously! I can’t speak Spanish outside of a handful of touristy things, but I could pick up on basic meanings of some things just by watching Narcos, ffs. 10 years of being around it at family functions…this guy just doesn’t want to learn.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "If he has difficulties with math he may very well have difficulties with learning languages (and also learning music) because it uses the same area of the brain.\n\nI'm speaking as someone who grew up in a trilingual household. In 30ish years I haven't yet picked up a second language, not even enough to get by, and not for lack of trying. I occasionally understand something subconsciously (e.g. someone asks me to pass the tissues in Arabic and I pass the tissues) but if you asked me to repeat the phrase or translate I have no idea.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Right? I have basic high school Spanish and French language classes under my belt, I vacation in Mexico once a year and nobody chides me when I fumble my skills. It takes some effort on my part but I TRY to improve. OP's husband is a brat and should go pout in his little corner like the \"victim\" he is.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I dated a guy whose family speaks both English and Spanish and I started using Duolingo a little bit each day so when they talked I could try to understand. It takes time but I bet in the year or so I did that I was comprehending more than this guy is in ten years. \n\nBottom line: if you want to learn, you can. \n\nIf you just want to make trouble and act like a victim then it makes perfect sense that people will exclude you.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My Spanish is minimal and every time I try to use what little I know the people I'm speaking to slow down and try and and encourage me.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Wasn’t learning spanish not his thing?   Math isn’t my thing, but I’ve had to learn it throughout my life.  \n\n\nI hope this means I can email my kids teachers and insist they never send math homework home with them because it’s not my thing?",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yeah it’s one thing to not be able to be fluent, but if you’re marrying into a family where English is not the native language I think you have a bit of a responsibility to at least learn some conversational aspects of the language. No one is expecting you to deliver massive sermons and speeches, but after ten years you should at least be able to do _something_",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Not everyone can learn languages easily or at all though. My best friend and I have been very close for over a decade. Her first language is Arabic. She’s spent years trying to teach me. I can read the alphabet, I can sound out words, but I only know very simple words, and can’t piece together a sentence for the life of me. I’m very much a kinaesthetic learner. I have a processing disorder that makes it very hard to learn visually or orally. \n\nHowever, having said that, OP - YTA. You don’t get to make demands like that. Neither does your husband. He’s an AH too. He either needs to learn to suck it up and at least learn a couple words (please, thank you, excuse me, how are you, those type of every day words), or suck it up and keep his mouth shut. Are they making fun of him? Who knows. But you still don’t get to make demands like that.",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1421,
          "content": "Piggybacking this to say the following:\n\nI've been married to my born-and-raised in Mexico husband for 10 years. Do I speak Spanish yet? No. I can follow a simple conversation and contribute a bit, but even with some Duolingo and babble lessons, I struggle.\n\nWhen my in-laws visit, we figure it out. They speak broken English and I speak broken Spanish and for everything else there's Google translate. \n\nThis dude isn't even giving the bare minimum try and is telling people what language they can use in their own house. \n\nOP, YTA.",
          "id": 21,
          "comments": [
            {
              "score": 530,
              "content": ">This dude isn't even giving the bare minimum try and is telling people what language they can use in their own house.\n\nThis is what gets me. For some learning a new language is very difficult, especially if they've grown up monolingual. That's just how some human brains work.\n\nBut he isn't even willing to try and communicate? Yeah, no, eff that.",
              "id": 22,
              "comments": [
                {
                  "score": 987,
                  "content": "For me it was the total audacity to say to someone, \"No, you have to speak English in your own home when I'm there.\" \n\nWhen we go to visit my husband's family in Mexico, I do the nod-and-smile. I can't imagine the balls it takes to try and force them to accommodate my shitty language acquisition skills.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 106,
                      "content": "This exactly!! I can't imagine demanding my own family not speak German when my spouse was in THEIR house. The entitlement there is amazing. My family has a lot of different languages mixed in. Both of my brother in laws speak native Hindi but know English and other languages as well. I'm always impressed at how they switch from language to language with ease, I've tried to learn Hindi over the last four years. Going to their families house I'm usually one of the only ones who don't speak it fluently - but they see I make an effort, google translator has helped and they never make me feel like I don't belong there. I just can't get over the thought of feeling like it's my right to say no, you can not speak your language in front of me. It's amazing someone would think this was acceptable.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Yeah, it's not even that he's not willing to try to communicate. He not willing to take a plate of food, say \"gracias\" and then sit quietly and enjoy being with his wife and the people who make her happy.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I mean shit when I’m with the in-laws family they speak English but tell stories about people I don’t know and have no context of, and it might as well be another language, you just nod along, try to keep up and be friendly.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I'm horrible at language acquisition.  I've tried. I've got some auditory processing issues that I think get in the way but the bottom line is I suck at it. \n\nI would like to think 10 years of some exposure like this would leave me moderately conversational buuuuuut I am not hopeful.\n\nI have *never* been bothered when other people talk a different language around me, and if I'll be around it I can usually pick up a few phrases.\n\nThis is both lazy and entitled.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "So odd. The husband should at the least be able to tolerate conversations or words he isn’t apart of. This is about husbands ego and OP is TA for feeding into it.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Piggybacking this piggyback to say this:\n\nI've been married 5 years, together for 10 years with my Congolese born and partially raised wife.  I am not fluent nor can I really get by in basic conversations in French nor Lingala.  I've also tried Doulingo, albeit not babble.  I'll gain some confidence after Doulingo but get crushed when I get around her family and they mix Lingala in with the French. \n\nWhen my mother-in-law comes and stays with us, she is much more comfortable in French but we will make things work, similar to you using broken fragments of each of our native languages and Google translate.  \n\nI do feel like I am missing getting to know my in-laws on a deeper level, and I desire to truly learn French and Lingala.... One day.  Some day I will but until then I will continue to put effort in to get by with them and be grateful for their patience- definitely not demand they cater to my shortcomings.  \n\nOP, YTA.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "> is telling people what language they can use in their own house\n\nIt's totally the \"ugly American\" syndrome where some tourist goes around in Mexico angrily yelling at people to \"speak English\" and they mutter \"¡Vete a casa gringo!\" and he says \"What'd they say?\"",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 547,
          "content": "Everyone should be okay with him not learning Spanish because it's \"not his thing\". But when OP's mom says speaking English exclusively is \"not our family's thing\" she's a monster.",
          "id": 31,
          "comments": [
            {
              "score": 701,
              "content": "He's going to her parent's home where the normal language is Spanish! Demanding they only speak English in their own home is some kind of entitled ASHHOLE behavior.",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "She’s a reasonable person.  Imagine someone saying not to speak your native tongue in your own home.  Fuck outta here.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "This! OP and husband are so entitled.",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 385,
          "content": "💯💯💯 My gf and I met and got together with neither of us speaking the others language. My gf learned English in 6 months to C1 lvl and I learn spanish with a goal of having a C1 lvl by the end of 2023. Everyone is different but I feel like he had 10 years to learn spanish and he never felt it important enough to learn OPs and her familys language? I would see that as hella rude. He is TA and she is even supporting this behaviour.",
          "id": 35,
          "comments": [
            {
              "score": 220,
              "content": "I dated a German girl for only a couple years, but in that time, even my dumb ass was able to at least grasp a few basics... enough to introduce myself, order some food, ask people to say it slower/please repeat, and I don't speak German well, please forgive me",
              "id": 36,
              "comments": [
                {
                  "score": 12,
                  "content": "I had a bilingual (Spanish/English) roommate for a year of university. By the end of the year I could manage basic conversation with her exclusively Spanish-speaking parents.\n\nOP's husband has had a full **decade** of living with a Spanish-speaking spouse, while also living in an area saturated with Spanish, and he still hasn't learned some Spanish??? That's unfathomable to me.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 19,
                      "content": "It’s not an inability to learn; it’s a *refusal* to learn, and that makes OP’s husband TA, and OP TA for demanding her family accommodate his obstinacy. YTA to both of them.\n\nI used to work with someone whose mother immigrated from Italy. In the 30+ years this woman lived in the US, she made no attempt to learn English, just flat-out refused and stayed in her little Italian-speaking enclave. Her kids found it frustrating but couldn’t make her learn what she didn’t want to.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "My high school German class had a song we sang that covered some of those things! LOL",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "For real. I’ve been learning Spanish slowly over the past three years I’ve been with my man, and even though my boyfriend is perfectly fluent in English, I have a big vocabulary and he’s always open to learning something new. I admire his culture and I want to learn from his mom and there’s no way for me to do  that without speaking Spanish.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Also, when you can't use it, it's hard.  TEXAS?  Might ass well be Mexico City or Madrid lol. (Ignoring accents, etc.)",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "But he decided it \"wasn't his thing\" and dropped it. It's not like it's difficult for him, he just won't try. Then, he'll demand everyone switches at their own home.\n\nBTW, even if they agreed and they seriously tried, in an informal setting with the people they grew up in Spanish, I really doubt they could pull it off. I know I couldn't be talking to my dad in English for a whole dinner yet we are both capable of talking to others in English. I don't know if all monolinguals get this but it's usually like this. \n\nPS. ¡Mucha suerte con tu español!",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 214,
          "content": "Spanish is hard to learn as an adult when you're a native English speaker.  The words are out of order or something that is taking a bit extra time to learn.  But he should keep trying.  He has a fluent Spanish speaker at home to work with or he should get over it.\n\nI work at a company where 95% or more are Spanish speakers if not native speakers.  I am far from conversational in Spanish, I read better than I speak, I speak better than I can understand.  I can't roll my rs at all, but I sub in a d sound.  \n\nStill I'm trying.  Planning some time with my grandmother in law to work on my Spanish.",
          "id": 43,
          "comments": [
            {
              "score": 283,
              "content": "I bet nobody is expecting him to speak Spanish without an accent, or to even speak it at all, but after 10 years he should at least be able to understand a fair deal.\n\nEdit: typo",
              "id": 44,
              "comments": [
                {
                  "score": 58,
                  "content": "This. Nobody was pressing him, he was the one who made demands. Her family was not judging him, but they have no obligation to change and hide their roots to accommodate him after 10 years",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yeah. I can't speak Japanese, but after watching a shitton of anime, I still can't speak jp save for a few simple words, but I can understand some of it. Actually surprised how husband here doesn't understand Spanish at all when exposed to it for 10 years",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 199,
              "content": "The words are 'in the correct order' for the grammar rules for Spanish.\n\nI am sure OP's relatives (especially the spouses) aren't talking about nuclear physics in espanol. He should be able to get the jist of the conversation.\n\nPobrecito bebe!",
              "id": 47,
              "comments": [
                {
                  "score": 66,
                  "content": "El marido se esta perdiendo la oportunidad de entender que \"what's the matter pumkin\" no es igual a \"que te pasa calabaza\".",
                  "id": 48,
                  "comments": [
                    {
                      "score": 4,
                      "content": "me lo encanta cuando ustedes hisbanohablantes agregan un pronombre reflexivo \"se\". Lo traduzco en mi lenga y sueno tan lindo !",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Actually, it's probably easier to have a conversation about nuclear physics in your choice of foreign language than make casual conversation, because casual conversation tends to be full of a lot of slang, hanging sentences, in-jokes and insinuations etc. that are much harder to learn and get right.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This reminds me of one of my students who speaks Spanish at home. She's very bright, but struggles with reading and speaking words with 4+ syllables. She said she likes Spanish better because they don't have all these big words. I explained that at school she's learning vocabulary beyond conversational so that's why it seems harder and that Spanish has plenty of big long words too. She just doesn't hear them at home.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": ">!Pobrecito bebe!\n\n\n\nlástima que no aprendió español (this is 100% Google translate).",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "It is not really that hard, even if you get your words in a weird order, we will understand you. But I agree it is a bit overwhelming. Simply focus on time and person (verbs need to be in the correct time and person) and you will be fine. Learn simple past, simple present and stick with \"ir + a + infinitive\" for future.\n\nFor your rs, there is an exercise. Whenever you are going to pronounce it, try smiling. In general, Spanish requires for the speakers to open their mouths a bit more than English.\n\nIm a Spanish teacher and my first language is Spanish. Trust me, English is harder.",
              "id": 53,
              "comments": [
                {
                  "score": 15,
                  "content": "Even if the verbs are not in the correct tense and person, you can understand someone speaking. \n\nEnglish, as a Spanish speaker who learned when I was well in my 30s, is almost imposible to speak without an accent and some sounds I don't hear/ can't pronounce them, but when I talk with someone I make the effort to understand and be understood. This is the most important thing.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": ">It is not really that hard, even if you get your words in a weird order, we will understand you.\n\nRight there! I'm Danish and speak German on a broken and shameful level but guess what, the Germans still understand what I'm getting at. We have some laughs over my broken German, they try some broken Danish and we all laugh. Hifive!",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Native English speaker here, and I'm sure English is a b-i-t-c-h to learn as a second language. There are exceptions and quirks to ev-er-y-thing!",
                  "id": 56,
                  "comments": [
                    {
                      "score": 7,
                      "content": "To learn at a perfect level, yeah. But a nice thing about English is that it’s a language with a low threshold to be understood. We understand people even if they don’t conjugate, even if they drop prepositions, even if they barely inflect anything at all (I’m talking about grammatical inflection, not intonation, but that too). It’s much easier to be understood even if your English is super broken, as compared to a language like Turkish or Icelandic where you have to know a lot more grammar before you’re able to be understood.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I have been speaking English my whole life (my dad taught me) but I still cant make a difference between some words like \"bi*ch\" and \"beach\", or \"choose\" and \"shoes\". It is rather frustrating. \n\n  But in Spanish if you pronounce  \"vaso (drinking glass)\" vs \"bazo (spleen)\" it is ok and everyone would know what you are trying to say based on the context.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I believe my friend said that she was told to put a pencil under her tongue when she was having trouble rolling her Rs as a kid. Spanish is also her first language, but she had trouble with that. When we were discussing it, she said that in Spanish the r sound for the rolled Rs is made towards the front of the mouth. I (only language English) took speech class for my Rs in elementary school and was taught to make the sound towards the back of my mouth. I imagine that makes a difference in trying to learn how to roll Rs later on. I can't roll my Rs, but I haven't tried the pencil trick.",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Spanish is one of the easiest languages to learn as a native English speaker, it's not Cantonese ffs.",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Duolingo app has a free version. It's really good.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I learned Chinese as an adult. Its mostly in how much effort you put into it",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Guess what? All vocab, no grammar is actually really comprehensible to a native speaker. If someone in the wrong order words starts to use, it's still something you can understand. \n\nI moved to a foreign country with a basic grasp of the local language. Five years in, I can just about manage a job interview and can converse well. My grammar is shaky as heck, because I can understand the words people say to me and say sense-making words back. My absolute number one top tip for learning a language is to *use it*. Jump in, speak bad and ungrammatical Spanish with your colleagues! It flexes the brain muscles you need, and I have yet to meet anyone who is offended that I speak their language badly rather than not trying at all.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I’m much better at reading and writing in Spanish than I am speaking it too. I actually find it easier to understand it when spoken then to speak it because when I try to speak it I have to search for words, versus when people speak to me I’m like “oh hey, I know that word”",
              "id": 64,
              "comments": [
                {
                  "score": 5,
                  "content": "I still have issues with conjugation to speak well, but understanding others didn’t take long at all.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 6,
                      "content": "And he doesn’t have to speak it.  They all understand English and he can speak to them in English he just has to learn to listen in Spanish.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It’s hard but it’s probably the easiest language for an English speaker to learn.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": "OP is sin vergüenza, de veras.",
          "id": 68,
          "comments": [
            {
              "score": 124,
              "content": "Completamente de acuerdo. Me daría vergüenza tener un esposo que en 10 años, no pueda comunicarse en español. Sospecho que es el prototipo de caricatura de gringo que espera que todos hablen inglés.",
              "id": 69,
              "comments": [
                {
                  "score": 55,
                  "content": "My only experience with Spanish is playing duolingo casually for about a year and I understand most of what you posted - enough to get the gist of what you are saying. OPs husband doesn't seem to be even trying.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Só como experiência, quanto de português você consegue entender escrito?\n\nAinda acho que a OP e o marido são TAH, mas é interessante jogar uma terceira língua na mistura.\n\nAbraços da língua irmã",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "And I used Google for what I didn’t recognize. Like- instantly.  No excuse after 10 years.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Totally a caricature. I mean, I guess I can.... kind of(?) understand not learning Spanish, but expecting everyone else to switch?!? That's a no from me and I'd also be embarrassed to have a spouse like that.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I'm google translating this to see which one is the Spanish word for asshole.\n\nI am now a better husband than OP's ;)\n\nEdit:\n\n\"OP's husband is shameless, really\".",
              "id": 74,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 159,
          "content": "[deleted]",
          "id": 75,
          "comments": [
            {
              "score": 111,
              "content": "I think learning Spanish vs learning Mandarin are like, completely different. My husband is Chinese American, and I'm visiting his family now. His mom, dad, and grandparents speak very very little English. I have tried to pick up a few words here and there but the pronunciation is ridiculous, and they speak shanghainese so it's even harder. \n\nI guess the difference here is that I am starting a Mandarin course in university in January so at least there is an attempt because we have a new baby and I would never want him to miss out on communicating with that side of his family, and would also like to learn myself.\n\nIt is difficult though and sometimes feels very futile, so I feel for your husband.",
              "id": 76,
              "comments": [
                {
                  "score": 12,
                  "content": "Tone is something else, but my mom studied Mandarin and always told me it was actually super easy to learn its structure. Writing though, ouf....",
                  "id": 77,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I actually live in Japan and studied Japanese full time at an intensive language school for a year, then have 5 years speaking/reading so kanji is pretty good for me and I love learning it, and although I know Chinese and Japanese characters are different, some have similarities so I'm a bit more confident about that part at least!",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yes they’re different, Spanish is insanely easier.  It’s by far the easiest language for an English speaker to pick up.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "For tone I recommend watching a bunch of mandarin movies, after a while even when I didn’t necessarily know what they  words were I could identify the dialects and mood.  Definitely helped with being able to feel out the vibe around when my ex and his family were talking (i.e. whether or not they were shit talking)",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Having studied multiple languages over my life to various degrees of success, tonal languages are a completely different beast. I can deal with grammatical issues like verb tense and word order (German is a bit of a trip compared to French, Spanish, or Italian), but for the life of me, I just can't hear the difference between some of the tones in tonal languages. Squeaky high tone? rising tone? flat tone? it all sounds like Shi to me",
              "id": 81,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Spanish and Mandarin are two very different beasts for English speakers I think, at least they were for me.\n\nI spent a few months screwing around on Duolingo then spent 7 months backpacking from Mexico down to Patagonia.  From the start of the trip I could handle the basics, by the end I was doing really well (with the exception of trying to understand Chileans for some reason, they're tough haha).  I was riding a bus in Colombia, this chick sat next to me, we chatted for over an hour in 100% Spanish - I struggled for words at times but we managed a pretty decent talk.\n\nOn the other hand I also lived in China for almost a year, and in a place with no other westerners around me so I was pretty well immersed (this was Inner Mongolia twenty years ago).  Even though I learned to read about 600-700 characters I never got past the basics of conversation - I could order food, handle simple directions, but that was pretty much it.  Never even got close to what I could do with Spanish.",
              "id": 82,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I think this is utterly ridiculous… I feel like people on this chain have spouses that only speak English.  My husband speaks Arabic and English and I speak Mandarin and English.   We both did not expect the other to learn each other’s languages.  Arabic and Mandarin are insanely difficult to learn.  We each know a few words but I would never expect him to be able to have full conversations in Mandarin and vice versa.\n\nHowever with OP I do think her husband is TA.  My husbands family will speak Arabic in front of me.  I may not understand but I’m not taking offense or feel left out.",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "Both the OP and the husband are TA. He don’t want to learn the language or at least be mature enough to not whine about feeling excluded  than that’s on him. Banning a language is not only rude it also has some unpleasant and dangerous historical echos that he surely doesn’t want to perpetuate or maybe he does 😬",
          "id": 84,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 90,
          "content": "Happy Cake Day!!!",
          "id": 85,
          "comments": [
            {
              "score": 200,
              "content": "I was working with a team that had two Norwegians, one Mexican and one Malagasy. After six months I'd learned enough Norwegian, Spanish, French and Malagasy and my colleagues were almost fluent in Swahili, English and each of the other language that a colleague spoke and they didn't. You OP have had that lazy bum, sorry I mean husband, for ten years. A whole decade. And even without taking actual classes, he hasn't picked anything from you? Colour me shocked. \nYour husband is lazy and you've enabled him. Of course YTA.",
              "id": 86,
              "comments": [
                {
                  "score": 5,
                  "content": "While it's likely husband has just been lazy with regards to languages I have to say that sometimes there is just a block.  I fluently speak English (main) French, Russian, Ukrainian, and Korean. Spanish for some reason is a nightmare for me. I took 2 full years of it in college and just couldn't get it to click.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "Thanks :)",
              "id": 88,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "Wow OPs husband doesn't respect her,  her culture or her family.  And OP tolerates his disrespect, sad.",
          "id": 89,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10211,
      "content": "YTA 10 years, and he hasnt learned enough spanish to even just get by? Thats on his shoulders. If he feels excluded, he should put that energy into his own effort of learning spanish, to get included.\n\nEDIT: Literally 15 minutes on duolingo a day, and i bet he can get by in conversation in a couple of months.",
      "id": 90,
      "comments": [
        {
          "score": 2244,
          "content": "Seriously. 10 years and the most Spanish he probably knows is \"Nacho Cheese Chalupa, por favor.\"",
          "id": 91,
          "comments": [
            {
              "score": 834,
              "content": "I think I was in line behind him at Taco Bell.  Ordered a KaseahDilla.  Extra mild sauce please.",
              "id": 92,
              "comments": [
                {
                  "score": 273,
                  "content": "mild sauce would be too hot for him.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 134,
                      "content": "Ketchup is too spicy for this dude",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Emphasis on the L",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "I nearly died trying not to laugh the day I joined my (then) second grader for lunch one afternoon and the lady who was telling them their lunch choices for the day said \"..or a cheese quesadilla\" which she pronounced \"Case-a-dill-uh.\"\n\nGrowing up in Texas, I think part of me died hearing her say it like that.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I'm in NZ and we use the phrase, 'weak sauce'.  Is it common elsewhere?",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "Actually, that's perfect. She said they switch between English and Spanish and you used cheese not queso.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 93,
              "content": "Probably pronounces \"por favor\" like Peggy Hill.",
              "id": 99,
              "comments": [
                {
                  "score": 15,
                  "content": "I haven't even seen the show and I bet I know exactly how she does.",
                  "id": 100,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I'm absolutely not fluent in Spanish, but Peggy speaking espanol hurts my white ass lol",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This brought back: “The only Spanish you know is what you learned at Taco Bell. And Beavis couldn’t get that right” after Beavis said “spaghetti”",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Skip the por favor part and you nailed it.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Dos cervezas porfavor. and Dónde está el baño. Most important phrases",
              "id": 104,
              "comments": [
                {
                  "score": 7,
                  "content": "Yay! I'm learning Spanish, and this is the first thing I've fully understood out of context of a lesson! Lol.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Sorry to be that person, but it should be el bano (with a tilde over the n)",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 560,
          "content": "I always thought people who say they \"suck at math\" tend to say they are good at something else like english or languages.\n\nWhat is he good at then?\n\nYall are both AH.",
          "id": 107,
          "comments": [
            {
              "score": 292,
              "content": "Right? At first I read that to say “he’s a math person but isn’t great at English or the humanities or language.” But if he sucks at math, and he sucks ay language skills, then what the fuck could he possibly be good at?  Other than whining 😂",
              "id": 108,
              "comments": [
                {
                  "score": 148,
                  "content": "I bet he could talk your ear off about the intricacies of the Civil War. Just that war. But he’s an ace at that for sure.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 145,
                      "content": "Nah.  $100 says he’s one of those “history is boring” people. My money is on (American) football.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Except he probably calls it The War of Northern Aggression, and glosses over all the parts that make the Confederacy look bad.",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "[deleted]",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "Whining and complaining. He's good at whining and complaining. Has a true talent for that.",
              "id": 113,
              "comments": [
                {
                  "score": 8,
                  "content": "He also seems to be good at finding a wife that is good at catering to his whims.",
                  "id": 114,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "People who suck at math likely suck at music and languages.\n\nIt's a myth that being good at English makes you good at languages.\n\nLanguages uses the same skill set as math and music. Music and math use logic patterns and are their own languages. All living languages today are also logic patterns.\n\n(Also just as a side note being a native English speaker makes you worse at math than native speakers of other languages like Turkish, it's because our language obscures base 10).",
              "id": 115,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I thought I was bad at math. \n\nTurns out that I'm great at math, in college, when I can use a calculator. I was bad at arithmetic.",
              "id": 116,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 236,
          "content": "I can't see how he wouldn't have accidentally learned enough to get by after 10 years just by being around them.",
          "id": 117,
          "comments": [
            {
              "score": 89,
              "content": "[deleted]",
              "id": 118,
              "comments": [
                {
                  "score": 5,
                  "content": "Tfw I had never heard neither the words pucheros nor moping.\n\nNow they will be directly tied together forever in my brain.",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "You'd have to really be trying not to learn...",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My ILs speak a language I didn't. After a very short time I was able to understand basics, a little longer and I could even answer some times. Even my AH BIL who truly doesn't try AT all, has picked up enough to follow conversations, even though he will not answer in that language. It's really difficult not to pick up a language when you hear it somewhat regularly.",
              "id": 121,
              "comments": [
                {
                  "score": 5,
                  "content": "It really is. I live in a super white area and can still at least exchange a polite greeting in Spanish and get the gist of what’s happening even if beyond pleasantries I have to answer in English. That’s just from like … being around the few Spanish speaking friends I’ve had? Listening at restaurants? I would LOVE to have this opportunity for years of Spanish immersion. Aside from this guy being a cabron, he’s also a pendejo",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Lol I feel like a total failure, I'm 30 and I am Spanish. My family speaks Spanish and my bf's family speaks Spanish and I can't.\n\nI practice on Duolingo but I can't put together anything, I can usually get an idea of what people are saying based on a few words but they speak fast and use slang",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Probably because he doesn't see the extended family very often so never uses it. Languages are hard to learn as an adult, doubly so if someone isn't skilled at foreign languages.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Right! I've been with my mostly Spanish speaking BF over a year and even though I don't speak it very well AT ALL I can at least understand enough to get by and answer Si o no 😂😂 when were with his family. Except when they speak very fast, no I don't understand. But we're teaching each other.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "It wouldn't surprise me if \"took a few classes\" really meant \"took one class, went to a few sessions, never practiced, got upset he wasn't immediately fluent\".",
          "id": 126,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "15 minutes a day? A few months?\n\nThat won’t do, OP said husband can’t do math so he dropped it as well. He won’t understand what consistent studying will do for his language skills (that he also dropped). Clearly.",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "My partner and his family speak Spanish, been together 8 years. I haven't learned Spanish and that is 100% on me. I could not imagine being so entitled as to tell them how to communicate, that they aren't allowed to speak the language their most comfortable with. Hell, I don't even ask my partner to translate, because again it's my fault I don't understand. Now that we have a son, I do not want them speaking anything but Spanish around him.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Don't forget that he's married to someone who could teach him daily. I mean it's not that hard if you are willing.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8111,
      "content": "YTA.  I am a white man who married into a Mexican family and I find that ultimatum disgusting.  I don't speak Spanish, but I don't expect the rest of the family to only speak in English.  Your husband needs to stop whining.  Either he puts more effort to learn the language, or he deals with not being able to understand everything.  It's not THEIR problem that HE has a problem.",
      "id": 130,
      "comments": [
        {
          "score": 2424,
          "content": "White woman in a relationship with a hispanic man from a mixed country  family and agreed. I studied Spanish, I thought I spoke Spanish, but that was before I met my bf's 75 year old El Salvadorian mother.  I can follow maybe 50% of what the El Salvadorian and Guatemalan cousins say and maybe 75% of the Mexican Spanish when everybody's sober and nobody's excited and talking over each other. At parties it's a considerably lower rate. But what I do is understand the conversation isn't centered around me and if someone does have a question for me I can't understand, my bf or one of the bilingual cousins generally steps up and I appreciate it. But I'd never tell them they can't speak Spanish in their own home because I'm there or avoid spending time with them because I can't understand 100% of what they say.",
          "id": 131,
          "comments": [
            {
              "score": 881,
              "content": "“When everybody’s sober” hahahaha! If you hadn’t mentioned El Salvador, I would have thought you married one of my Tios.",
              "id": 132,
              "comments": [
                {
                  "score": 323,
                  "content": "TIO?!?! What’s a Tio? How DARE you exclude ME from this conversation.\n\n/s",
                  "id": 133,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Looks like somebody you think is named Tio is going to get his ass kicked.",
                      "id": 134,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 459,
              "content": "My sister's ex bf is Cuban, his family invited me and my sister to go to the Dominican Republic with them. Yep, two white girls who can't speak Spanish. We sat there, let the native speakers talk, would occasionally get translations from the family but never once complained. Because we KNEW we were the odd ones, realized we were in THEIR territory, and wouldn't dream of trying to tell them to speak English so that we could be \"more comfortable\". I can't believe OP is Mexican and is trying to change her family's ways for a white man. Lmao.",
              "id": 135,
              "comments": [
                {
                  "score": 286,
                  "content": "> I can't believe OP is Mexican and is trying to change her family's ways for a white man.\n\nI 100% believe (if this isn't just a chud's creative writing exercise) this was written for sympathy by the husband who \"isn't racist because I married a Mexican\" but is still mad that these people have the audacity to not speak English in America. I mean, the entire post is \"oh my poor husband\", constantly showing how much he's done (not much), how hard it's been (it's not), and how *he* feels (but not anyone else, including the wife, except for how angry she is, but not at the husband who has done nothing wrong).",
                  "id": 136,
                  "comments": [
                    {
                      "score": 89,
                      "content": "She said \"my husband is on my side\". Of course he is, it's his side. I'm not a fan of conspiracy theories but I support this one.",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "I kind of wonder if he actually knows some Spanish and that's how he found out the spouses were making fun of him.",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 59,
                  "content": "Plus, before our flight we drove to Miami and stayed with his grandparents and cousins. Not a single one was bilingual. Sure, it sucked not being able to communicate but they were nothing but welcoming and friendly. Got to have Cuban coffee, they cooked for us, the TV was in Spanish and I got to experience a culture outside of my comfort zone. And I had a great time, and knew it wasn't about me, it was about them seeing their family when we live three states away. So OP's husband should be able to suck it up for a holiday.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "Native English-speaking person of Scottish and Irish descent (not simply saying “white” b/c plenty of first-language Spanish speakers are very white) living in a Mexican/Tejano area. \n\nI’m embarrassed at how little Spanish I speak, and am learning on DuoLingo and by watching Spanish-language TV. My neighbors who don’t speak English are very tolerant of my very bad Spanish and we all muddle along…but the key is, we TRY. OP’s husband isn’t even trying. And rather than make other arrangements, she’s coddling him.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "Dw, I’m Salvadorian and I also can’t understand my family when they’re drunk lmao",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "\"maaaaas, despaaaacio, por favooooor\"\n\n*hiccup*",
              "id": 142,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "My friend had a bf that spoke Spanish so as an adult she learned the language to communicate with him. She ended up marrying someone else, but she became so good at Spanish that she taught it in high school for many years. And was most kids favorite teacher.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I imagine OP’s husband has a sulky attitude about this and that’s why others aren’t making the effort to translate or support him in the conversations.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Totally agree! Dude married into a bilingual family and expects them to change for him. He hardly makes an effort to learn the language and pisses and moans that he can't understand it. Now OP and husband are throwing a temper tantrum because her entire family won't cater to him. \n\nOP and husband both huge YTA",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Im extremely monolingual and just horrible at learning languages. But I can’t imagine taking it personally that other people aren’t. I like traveling, I like people, I like other cultures. I don’t assume people speaking other languages are making fun of me. I’ve been in lots of situations where I’m the only all-English speaker and I do plenty of smiling and nodding but it’s fine. Seems like OP and her husband are looking for a problem where there isn’t one.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "There's also the long game to consider. My white stepbrother married into a South American family, and his formerly-bilingual wife is forgetting her English due to early onset dementia. He's stepped up his efforts to learn Spanish, but it's not something you can cram. He's losing the ability to communicate with his own spouse.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "White woman in a relationship with a Hispanic man. I grew up in TX and knew that it would serve me well to learn Spanish due to my state’s proximity to the border. I started learning in high school and college. I saw it as a game or challenge rather than a chore. Now I know more Spanish than my fiancé, and his family loves me. If your husband actually wanted to learn Spanish, he’d have done it. YTA",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Have a coworker who is the definition of redneck, he learned Spanish in a year using duolingo for know other reason than he wanted to.  Speaks fluent Spanish, now he speaks it with a very southern twang.  But yeah YTA husband needs to either put up or shut up.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I and white and married int a Spanish speaking family. I don’t speak Spanish. I do feel left out, but would never make a thing of it besides joking around with my wife.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "All of this! Bilingual people shouldn’t be expected to accommodate to monolingual people. Anyone who’s insecure about not understanding a language needs to take the initiative to learn it, otherwise they have no right to complain. My dad didn’t understand Tagalog but he didn’t give my mom and her family shit for speaking it around him, and I’m not fluent either but I understand not all conversations have to accommodate to me so it always rubs me the wrong way when people who are insecure about not understanding a language antagonize people who speak it in front of them.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agree with this. I married into a Haitian family. I know zero Haitian Creole. It’s not on them to accommodate me. I love all of them very much. It doesn’t even bother my that I don’t understand everything. (We’ve been together for almost 2 years now. I picked up some things…)",
          "id": 152,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4656,
      "content": "YTA. \n\nAll I’m hearing is that your husband has made no effort in 10 years to learn your families language. He only took a few classes? He has an entire extended family that speaks the language, and he can’t be bothered to learn beyond just a few classes he dropped out of?",
      "id": 153,
      "comments": [
        {
          "score": 643,
          "content": "Exactly. 10 years being with someone who speaks another language, yet he can't be bothered to even try. Ridiculous.",
          "id": 154,
          "comments": [
            {
              "score": 131,
              "content": "¡Feliz veridad! 🤣 OP is TA for enabling her husband to be an A.",
              "id": 155,
              "comments": [
                {
                  "score": 9,
                  "content": "Feliz navidad a todos",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "If the husband reads that, he’s gonna think you’re mocking him…lol",
                  "id": 157,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Escúchame",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "OP and her husband have the emotional iq of a goldfish. Honestly surprised that her and the Hawaii Christmas rich brat aren't regulars on wallstreetbets.",
              "id": 159,
              "comments": [
                {
                  "score": 6,
                  "content": "Bless them. Such hard lives!!",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 285,
          "content": "It's not even the fact that he doesn't want to learn, it's that he cares that they speak another language. \n\nHow fucking lame do you have to be for someone speaking another language to bother you? You can still converse with them in english as they speak it perfectly well. Plus it's the holidays, being stuck inside with in-laws all weekend, I'd love to not participate in 50% of the conversation.",
          "id": 161,
          "comments": [
            {
              "score": 28,
              "content": "That seem to be incredibly common in the anglosphere. At least among both Americans and the English.",
              "id": 162,
              "comments": [
                {
                  "score": 10,
                  "content": "YES! Like the woman here in Dallas or Plano who threatened these middle eastern women for speaking their native language amongst themselves. I don’t see that behavior anywhere else like I see it here at home among white folks. I personally wanted to learn Spanish because of the growing Spanish speaking population. I struggled helping customers in my retail days cause of language barriers, and I wanted to fix that.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "This yes! It’s fine if you don’t learn the language but you cannot demand that people accommodate you in their own home. Learn in, or spend the evening just sitting in the room and appreciating how amazing it is that people can have entire conversations, convey emotions, reminisce… all without a word of English!\n\nReally shows you how much more there is beyond English",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "This is the correct answer. YTA because OP’s husband is behaving like a xenophobe and OP is enabling him. \n\nBeing bad at learning in general (can’t do math *or* languages) is one thing. But to turn around and put the burden of his discomfort on OP’s entire extended family? OP’s husband needs to grow up.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 273,
          "content": "Yup. I say YTA but the fact that the husband hasn't tried at all to learn his wife's language makes me not want to be as harsh on her. Like, it's got to be easier for her to blame her family for not accommodating him than realize her husband doesn't care enough to learn her family's language. Nobody wants to hear from their spouse that immersing themselves in the family culture is \"too difficult\" especially since it seems he is the only non native Spanish speaking spouse that has a problem with this.",
          "id": 166,
          "comments": [
            {
              "score": 160,
              "content": "We can't be too hard on OP, maybe it's one of those marriages where she came on as a caretaker but then fell in love with her mentally challenged client. It's a Hallmark movie from the 1930's with LOUD symphony music.",
              "id": 167,
              "comments": [
                {
                  "score": 32,
                  "content": "No, if it was Hallmark he’d be a secret prince and most members of royalty know multiple languages.",
                  "id": 168,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 122,
          "content": "And they're in Texas... Not like it wouldn't be handy just in general life. Op, YTA.",
          "id": 169,
          "comments": [
            {
              "score": 58,
              "content": "She probably married a White conservative.",
              "id": 170,
              "comments": [
                {
                  "score": 12,
                  "content": "This 100% gives me \"Those people need to learn to speak English in my country\" feels.",
                  "id": 171,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Either the husband is dumber or more selfish than the rest of the spouses of the family",
          "id": 172,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Bet I learned more words and correct pronunciation than he did working in fast food with some Mexicans in the kitchen.\n\nTo be honest I can't spell any of it but I can say the words for trash, hot, cold, excuse me, and thank you clearly enough that Mexicans I never worked with got the message. Other words I could hear but not say - which was enough for me to reply",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I worked at a restaurant in Miami where the bathroom attendant spoke no English. I made more effort to speak with her than this guy has with his wife's family!! I took Spanish in high school so I could understand some of what she said and she could understand some of what I was saying, enough to be polite and friendly. This guy can't even muddle through a little! \n\nYTA OP.",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I agree. I married into an Italian family, and took classes so that I could communicate with my mother and father-in-law (they did speak English, but not well). My husband and I had days where we only spoke Italian to one another, and although I wouldn't say I'm fluent, I picked up enough to get the gist of most conversations and to make myself understood (most of the time).",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I don’t even think it’s crazy that he didn’t learn the language, really. The AH part is that he wants to forbid her family from speaking in their native tongue when he’s around.",
          "id": 176,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2173,
      "content": "YTA. \n\nYour family can't speak their native language because it makes your husband uncomfortable? Well, he had the option to learn Spanish and chose not to. Now he is throwing a fit because he chooses not to be included. \n\nIt also sounds like they accommodated him for some time and he refuses to make a effort with them. He could use a translator app, spend some time on a language app and learn phrases etc.",
      "id": 177,
      "comments": [
        {
          "score": 401,
          "content": "My white father was like this. We weren't allowed to learn Spanish either 🙄. I speak a good amount now but would have done better job wise if I were more fluent. If he can't be bothered to learn, then he needs to stay home or suck it up and feel left out.",
          "id": 178,
          "comments": [
            {
              "score": 151,
              "content": "My ex husband is Mexican and Cuban. His parents speak Spanish and didn't want their kids to learn. He didn't want our kids to learn and in the end, our kids speak a decent amount of Spanish because I decided they should learn it. They have taught some to my younger kids. I speak a little French and some ASL and I am working on Spanish. \n\nMy ex was adamant because he was raised that way and I get that but he dismisses his won culture constantly. I didn't want that for my our kids.",
              "id": 179,
              "comments": [
                {
                  "score": 21,
                  "content": "It opens up a whole new bunch of job opportunities too - being a native (or at least, well learned) speaker in English + another popular language like Spanish can mean pay raises, translator positions, even interpreter jobs. Pretty short sighted of him.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yep!!!! My mother was born in PR and grew up in DR. Never taught my sister or I Spanish, even tho it was her first language. Because my white ass dad didn’t want us to all talk and him not understand. They divorced when I was four. \n\nSo ridiculous. Imagine not bothering to understand your partner’s freaking life and self. Language is so much more than words!!!",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My dad was the opposite. He really wanted my siblings and I to learn my mom's native language. She thought it was a waste of time.",
              "id": 182,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "Also, it's not as if they speak exclusively Spanish! OP said everyone mixes English & Spanish so there should be enough English for him to catch on even if he put the most minor effort into learning Spanish. Even if Spanish was a truly difficult thing for him to learn, if he had a decent attitude and was willing to ask for people to explain what they mean once in a while, he could get along just fine.",
          "id": 183,
          "comments": [
            {
              "score": 12,
              "content": "Context clues can carry you through a  conversation. This dude doesn’t want to do that much thinking. He’s either dense or he just believes “We speak English in America!”",
              "id": 184,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "No one is demanding he speak Spanish. That is what I find confusing. He could always ask them to repeat something in English.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1223,
      "content": "YTA \n\nyou do not get to decide ever, how other people can communicate \n\nyour partner tried to learn, but failed... he doesn't get to dictate how others talk because of his own failures \n\nif your husband is deaf and can't hear, are you expecting the entire family to never speak in your ultimatum? (I know this is an extreme example but it's more for a radical comparison).",
      "id": 186,
      "comments": [
        {
          "score": 349,
          "content": "I wonder if this guy would learn ASL if he had a HOH child or if he would expect mom to translate everything. And yeah extreme, but in ten years of marriage to a bilingual wife, in Texas, he hasn’t managed to learn conversational Spanish? That’s extreme, too.",
          "id": 187,
          "comments": [
            {
              "score": 136,
              "content": "I don’t think he would. I grew up near a school for the deaf and the number of families who don’t bother to learn was mind boggling to me when I was younger.",
              "id": 188,
              "comments": [
                {
                  "score": 37,
                  "content": "The numbers are horrifying. In the US, something like 85% of deaf kids are \"raised\" by parents who don't learn ASL. They have to wait until they're 5 or so when they start school to get any access to language. Not having language during that critical period of development has far reaching and extremely damaging consequences.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "That’s my family. Uncle had a high fever at 3 granny didn’t bother to get treatment for so deaf. Sent him 200 miles away ALONE on a greyhound bus at 5 to a school for deaf kids (1960’s-70’s). They NEVER visited and he got to come home alone on the greyhound for holidays this went on until he was 17. Not one out of the family of 10 learned ASL his whole life, he had to lip read. I learned enough to sign and even though he’s gone my grandchildren are learning ASL. This is for you uncle Eddie!",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Probably not. Most hearing parents with a HoH or deaf kid focus on teaching their kid to speak rather than they themselves learning ASL. It's really sad.",
              "id": 191,
              "comments": [
                {
                  "score": 9,
                  "content": "Oof. I didn’t know that. My son is nonverbal (intellectual disability) and doesn’t know a lot of ASL, but I’m grateful for every word he has.",
                  "id": 192,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Yup. The majority of parents I've seen treat deafness like a communication issue. If they can teach their kids to engage in the hearing world with speaking, lip reading, and hearing aids they'll take that route. I know some of them feel ASL isolates their child because it's not a super common langauge. They just sorta don't get it. Once the kid can engage with the hearing world they seem to think that's good enough. These are people that are otherwise very good parents. They just don't seem to realise that treating their deaf kid like a hearing kid because their deaf kid can act like a hearing kid is detrimental. Hearing parents to a deaf kid who learn ASL are unfortunately in the minority.\n\nI'm HoH and have an audio processing disorder. I never learned ASL as a kid because my hearing and ability to communicate was \"good enough\" that people treated me more as stupid when I missed something than as I didn't recieve the audio from what they said. I'm trying to learn ASL now but it would have been so much easier if I'd taken classes as a child.",
                      "id": 193,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": ".",
              "id": 194,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "He’d force the child to read lips and speak. I’m 100% sure he’d deprive them of ASL.",
              "id": 195,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I speak Spanish too and I can’t stand those people who come with their WE spEaK eNgliSh IN ThIS COunTry bullshit. OP and her husband are bozos.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 969,
      "content": "My 75 year old mom has learned enough Spanish to be somewhat conversational in less than five years. What's your husbands excuse?\n\nYTA",
      "id": 197,
      "comments": [
        {
          "score": 192,
          "content": "I love this. I\nWhen I went to uni there was a man in his 60's doing the same course. Never too old to learn.\n\nOP YTA as is your husband.",
          "id": 198,
          "comments": [
            {
              "score": 10,
              "content": "Amazing. When i was at university i met an older guy who enrolled to learn Russian after he retired because he had always wanted to.",
              "id": 199,
              "comments": [
                {
                  "score": 7,
                  "content": "I was also thinking that hopefully no kids are involved in this marriage. I can imagine him complaining that the kid can speak a language he can't understand",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "My mom is learning Spanish on Duolingo because we're considering buying a place there! She's 65!",
          "id": 201,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Languages can be hard to learn, but it sounds like this guy barely tried. After 10 years, he should at least know enough basic words/phrases to follow a Spanglish conversation.",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "For real my grandpa learned English when he was turning 80 and nobody was even talking English, he just heard ‘the kids did it’ and thought it was valuable. What a champ.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 686,
      "content": "<He took a few classes but he found it too difficult and decided that he can’t learn a language as it’s his thing just like math isn’t his thing and he dropped it.>\n\nSince you're going with this comparison, I will too.  Even folks for whom math \"is not their thing\" learn enough to understand money, measure how big a throw rug needs to be, and follow a recipe.  Your husband needs to work on getting to a \"just getting by\" level of Spanish.  Even if his Spanish always suck and he never gets past the level of a Spanish-speaking kindergartener, I suspect your family will appreciate the effort and be a lot more willing to bend their \"Spanglish\" toward the English side to help him. As a result, his Spanish skills will increase as he uses it.  \n\nMaybe you two can institute a \"Spanish day\" once a week in your home to improve his language ability?",
      "id": 204,
      "comments": [
        {
          "score": 117,
          "content": "As someone who literally, utterly despises maths with my entire being - you're right. Even then, I still get confused with those basics that you mentioned. My bf's family and friends are mostly the opposite - mathematicians and physicists. Literally. \n\nTo me, it's more important to make an effort (even at the risk of looking dumb) and allowing people to explain things (if they choose) or even potentially scoffing at me for not knowing the answer to 9 ÷ 3. \n\nOP, YTA + your husband. People learn in different ways and this person is right - classes may not be how he learns, he may do better from immersion - if he actually wants to. Expecting your family to hinder themselves in their own home because he's unwilling to take part? Not good.",
          "id": 205,
          "comments": [
            {
              "score": 11,
              "content": "Thanks for highlighting the aspect of making an effort!  It's really the biggest thing - and will result in progress, even if it's really slow.  People are amazingly willing to help others, especially when they feel that the person in need of help is making an effort.",
              "id": 206,
              "comments": [
                {
                  "score": 9,
                  "content": "Yup.  Math sufferer here.   I failed math several times in high school and college. Pero me puse las pilas*, and was able to pass with in A in stats.  It wasn’t easy and it took a whole lot of discipline and practice.  \n\n*got my act together",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": ">To me, it's more important to make an effort (even at the risk of looking dumb) and allowing people to explain things (if they choose) or even potentially scoffing at me for not knowing the answer to 9 ÷ 3.\n\nYou're absolutely correct. Props for trying. It's usually enough for people to appreciate!",
              "id": 208,
              "comments": [
                {
                  "score": 4,
                  "content": "Thank you! That's what I find too! Sometimes I make the jokes that I'm bad at maths before others can (though most still underestimate how bad I truly am). \n\nConfidence carries - I'm terrible at maths and I easily admit that, but I'm confident in what I do know and that shows off my intelligence in other ways. Seems OP's husband is letting insecurities about his intelligence get in the way of bonding.",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I resonate with the math point so much. I wasn't a natural at all. It took so much work, so much time, and genuine emotional meltdowns, to get decent at it.\n\nOur school system didn't make it an option to not be okay at math, and I was raised in a family that reeeeally valued academic performance.\n\nBut in the end, I fucking made it, and now I earn some money as a side job tutoring highschoolers in math. I even got to kinda like it.\n\nTen years to hold a conversation in Spanish with natives to practice? Please.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Agree. As an educator I know that different people have different natural talents / natural handicaps, but as a functioning adult I also know that natural handicaps are no excuse for not trying. My wife likes to say that she’s not strong in math (she’s better than she thinks), but she necessarily tries hard at the math she needs to do for about 1.5% of her job. OP’s husband’s language problems affect in my estimation more than 1.5% of his emotional/social life and he apparently puts in zero effort. \n\nStop celebrating stupid, people. Almost anyone can be passably mediocre at almost anything just by being disciplined and working consistently at something.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 505,
      "content": "YTA\n\nI'm assuming Spanish is the first language of at least some of your family. Why should they have to communicate in their second language so that your husband feels included?\n\nLanguages are tough, you have to keep at it! Quitting because it's \"too hard\" shows a lack of value to try and be included in a meaningful way.\n\nI major in ASL Interpreting and if I married a hearing man who didn't want me spending holidays with my Deaf/Hoh friends because they preferred to sign rather than speak or use their hearing aids/implants - I'd be judging my husband, not my friends.\n\nPeople can communicate however they feel comfortable and trying to police other's communication is gross.",
      "id": 212,
      "comments": [
        {
          "score": 60,
          "content": "My fiancé has been learning ASL to communicate with me in loud settings (I am HOH, but it is moderate) I didn’t even ask him. He just started learning because he loves me and cares. Meanwhile OP’s husband can’t be bothered.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "All of this, OP’s family shouldn’t have to accommodate to her husband’s insecurity. He needs to try harder to learn Spanish if he really feels left out.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 359,
      "content": "YTA it may be hard for him to learn a second language (it’s difficult for lots of people) but ten years is plenty of time to at least learn the basics. Especially if they switch between both English and Spanish. \n\nWho are you to police how they speak in their home?? I’m baffled you thought you could do this at all",
      "id": 215,
      "comments": [
        {
          "score": 118,
          "content": "I'm also wondering how OP's parents are supposed to do this? Big sign on front door \"English only\"? Berate those speaking Spanish? Make an announcement?",
          "id": 216,
          "comments": [
            {
              "score": 92,
              "content": "This is hilarious! Imagine OP and her husband arrive to a big \"ENGLISH ONLY\" sign and every few minutes someone saying \"remember everyone, we are only speaking ENGLISH because OP's husband can only speak English....who wants to say grace? But remember only English!...who wants some tres leche? i'm sorry some three milk cake?\" This would be hilarious",
              "id": 217,
              "comments": [
                {
                  "score": 14,
                  "content": "and the wife would have to translate all the english to those who don't speak english as a second language...",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "lmao three milk cake is the whitest shit I've ever heard",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Make a swear jar but label it “Spanish jar” and every time someone speaks Spanish they put money in?",
              "id": 220,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I would make the most condescending announcement and signs I possibly could - in Spanish only. “OP’s husband is lazy and self-centered, so we’re asking that everyone humor his feeeeelings and speak only English, as that’s the only language he’s capable of.”",
              "id": 221,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "My mom lived in the US and Canada for over 25 years and never learned enough English beyond simple conversations, then promptly forgot all of it after moving back home. Some people don’t do well with new languages, nothing wrong about that. \n\nWhat she doesn’t do is force everyone around her to speak her language when she’s around. She understands that there will be situations where she can’t understand everything, because her family speaks more than one language. Unless OP’s family insists on speaking Spanish to her husband knowing that he doesn’t understand, OP is TA.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "They seriously thought this would go over well. I can’t fathom expecting an entire family to change the way they communicate at a time dedicated to connecting with family!",
          "id": 223,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}