{
  "post content": "Throwaway because some of this made local news and I don't want it connecting back to me.\n\nI work in a place where we are not allowed to have personal electronics on us at all. No phones, no smart watches, no pagers. I've been working here for about 6 months so my wife knows this and understands that she should not try to contact me by my cell at work. Phones are dropped off in our lockers and I typically have mine on Do Not Disturb. Before this incident, my phone has never gone off in the locker before.\n\nRecently there was a pretty big fire at a secondary worksite that I do work at occasionally but that day I was working at the main building. Local news covered the fire before I found out about it because again no electronics, plus the work we do isolates us a bit so news travels pretty slowly. There were a few casualties, a lot of seriously injured folk. \n\nMy wife had been watching the news from home and started freaking out, I guess. She called me 20 freaking times, which (and I did not know this was possible) overrode my DND and my phone was ringing for a while in my locker. In the middle of my shift, I got called into my managers office and was chewed out (and written up) for my phone making so much noise. They told me to go take care of whatever it was making my phone go off before I went back to work.\n\nI won't lie...when I saw those 20 missed calls from my wife I was seriously pissed off. Like I said, she knows not to try to contact me directly and a citation hurt my chances of getting a raise or promotion. I called her back and she was sobbing and asking me if I was okay. I said of course I was okay and asked what the f\\*ck was wrong with her to call me so many times. She was still crying and started talking about the fire. After that I started half-yelling at her about all the reasons it was dumb of her to call me.\n\nWhen I got home she was super upset with me. I apologized for yelling but she refused to talk. She's been very chilly the past few days and sleeping in our daughter's room. I know it was not the best decision to yell at her but I still think my anger justified . 1) she knows I don't work in the secondary worksite very often. 2) she knows that I can't be contacted directly and she could have just called the office. 3) 20 calls is absolutely \\*insane\\*. Am I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 71823,
      "content": "YTA, holy fuck she was concerned for your safety. Also, just have your phone on silent and then it won't matter how many times people call or text you.\n\n&#x200B;\n\nEdit: Thanks for the awards!",
      "id": 2,
      "comments": [
        {
          "score": 10762,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 14607,
              "content": "this! clearly if someone you love is calling you a bunch of times, something is wrong.",
              "id": 4,
              "comments": [
                {
                  "score": 18989,
                  "content": "> a while in my locker. In the middle of my shift, I got called into \n\n\\*someone who loves him\n\nReacting like that is not a sign of OP loving their wife or family.\n\n&#x200B;\n\nBut on the otherhand:  what sort of asshole workplace will write someone up because their phone is making noise in their locker \\*because they aren't allowed to have it with them while working\\*?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 13523,
                      "content": "--after a fire in the company's facility where people were injured?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 670,
                      "content": "Especially when said workplace just had casualties and injuries. Surprised if OP’s was the only phone going off like that.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 461,
                      "content": "That's weird, right? You can't control whether other people call you or not.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 339,
                      "content": "It’s giving Triangle Shirtwaist Factory",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 243,
                      "content": "Exactly! Clearly they are following the rules and leaving it away from the job site. I think he’s full of shit about that part. Maybe his boss just write him up for being a prick to his wife",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 239,
                      "content": "It’s pretty common in industrial workplaces. I used to live in a town where lumber/paper etc mills were the largest employer, and that was the policy at all of them. \n\nAny time you heard about an accident or safety issue, it was **almost always** related to some asshole sneaking on their phone instead of paying attention. \n\nNormal people turn their phones off or on silent in the locker.\n\nIf you have some emergency going on like a partner about ready to go into labor, you give them the number for the admin office. They’ll come pull you from whatever your doing safely so you don’t end up chopping the guys hand on the line below you or releasing chemicals into someone’s face. \n\nThough if there was a fire, the employers phone was probably flooded with people calling and OPs wife wouldn’t have gotten through to him anyway. But they may have been able to let her know he was okay and nowhere near the fire.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 231,
                      "content": "I feel like work is the real assholes - I'm sure ops wife wasn't the only one fretted about this, I'm also sure that ops co-workers would care about those injured/directly affected by the fire, I feel like in a sensible workplace there should have been an announcement and tech clemency so that the people at ops site could go check up on their loved ones at the other site/let their loved ones know that they're ok and not to worry",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 186,
                      "content": "I’d find the cell # of whoever gave the write up and have ten friends call that number allllll day long",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 148,
                      "content": "Exactly.  I would add what kind of manager doesn't understand that a worksite that his person sometimes goes to had a major fire and maybe communications were needed.  I would fight the write-up.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 136,
                      "content": "[deleted]",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 336,
                  "content": "[removed]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 175,
                      "content": "Tbf certain jobs ban them for privacy or legal reasons (worked at a juvenile detention center, illegal to have any of those devices on you), HOWEVER, it’s crappy of his boss to write up for something like that, foolish of OP not to just put his phone on silent, and cruel of him to yell at his wife for being concerned about him. She was probably incredibly scared and sometimes when people panic, “common sense” (calling the office instead of his phone) escapes them.\n\nYTA OP.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 117,
                      "content": "My job, for security reasons, has some areas like this, where cells must be in lockers outside the work area. However we have a way to be contacted through the office for emergencies, and it sounds like OP never told her what number to call in an emergency which just makes him even more TA.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Some places ban phones due to security.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "This doesn’t sound like an employer banning cellphones. The guy likely works with classified info and cannot have electronics on him at all, even a car key fob is a no go. HOWEVER, any employer who’s first instinct is to write you up instead of making sure there wasn’t a serious family emergency is an fing idiot! That could have been police trying to find her next of kin for god sake.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 86,
                  "content": "That’s the reaction any sane person would have. It’s really telling that it wasn’t OP’s,",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Dude really prioritizes his boss’s happiness over his wife’s sanity",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "YTA, Look at it the other way. there was a serious accident in your company where you could have been working and nobody bothered to call you. you will be Broken hearted that nobody cared about you. A little bit of nuisance is a small price to pay to learn that somebody loves you, cares about you. The boss is an idiot. You are an idiot for not keeping your phone on silent if that was what you wanted.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 651,
              "content": "I was just scanning the post and that's how I THOUGHT it was going to go. Like she blew up his phone and he got scared and freaked out. Would make it a little more up for debate maybe. As it stands omg is OP TA.\n\nEdit and the company are massive AH too. Maybe they should be a little more worried about the deadly (?) fire that literally just occurred than someone's phone ringing in their locker.",
              "id": 24,
              "comments": [
                {
                  "score": 324,
                  "content": "It wouldn’t surprise me if OP said something in his meeting and was just playing hide the ball with the HR department. I find it hard to believe any company would find issue with someone having a phone in a personal area ring for a while since no one is supposed to be in there. \n\nI feel like if he had said “my Wife knows I work here and saw on the news there was a fire. I thought my phone was on silent. It won’t happen again.” If they wouldn’t have written him up. \n\nUnless the stipulation is that his phone is always meant to be on silent or he’s not supposed to have a personal cell phone on site. Then OP is an even bigger AH because he’s breaking protocols and making it his wife’s problem that he’s not following the rules.\n\n\nHonestly thinking about it now. I think the rule isn’t just that the company is sticklers about devices. But I bet you there’s a clearance situation here where personal devices aren’t allowed at all. OP bringing his phone is likely a violation.  Which makes him a Major AH because he’s blaming his behavior on his wife and pushing his own feelings on to her and making it her responsibility.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 125,
                      "content": "I mean, there’s a reason it sucks to work warehouse for Amazon. At least it did a few years ago and idk that it’s changed. It is the first place I think of because they did have a policy like this. And you could get written up so easily there.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 528,
              "content": "Yeah, I was very surprised at what OP said their response was at seeing so many missed calls.  I would immediately assume someone was in trouble, I would be halfway to my car while calling my wife back to see what is going on.  OP is TA, and their boss is TA if they didn't expect any employee's family to try contacting them when there was a LITERAL FIRE IN THE NEWS at one of their facilities.",
              "id": 27,
              "comments": [
                {
                  "score": 188,
                  "content": "Yep manager is an a massive asshole. Needs to be reported.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "I would have just damn near teleported on the spot and no one is even supposed to know I can teleport!",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 231,
              "content": "If I see someone called me 20 times, my heartbeat drops. Because you know something isn't good at the other end of the call.",
              "id": 30,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 101,
              "content": "Right?? The last time I had more than three missed calls from the same person my stepdad had just passed.",
              "id": 31,
              "comments": [
                {
                  "score": 6,
                  "content": "Yup. The last time I got a call like that, my aunt had passed.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 61,
              "content": "I've pointed out to my mom that it's slightly concerning that my brother will ignore multiple calls/texts when she's babysitting nephew because something could have happened, and she needs to tell him.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "If someone calls me twice I think it's important. If someone calls me 20 times I'd start to wonder if *I* was dead.",
              "id": 34,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "My ex once called me twice while I was at work. I missed them both but saw the second one just as voicemail picked up. My heart dropped and I called her back. She had never called during work before. Yeah, she was in a rollover accident and trapped in her car. She called me from the fucking car in a daze (her car was totaled but she was okay all things considered, just some cuts from broken glass and a seatbelt bruise). If someone calls me twice in quick succession, something is wrong. Let alone 20 times, I might have had a heart attack if I saw 20.",
              "id": 35,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "100% YTA\n\nWell, he'd hate me as a wife. I would drive my happy ass to your workplace, so be thankful she only called.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "That’s what I thought too, idk this man but if my partner called me 20 times I’d  the worse! Someone’s dead, her in an accident, idk but it wouldn’t be anger at them for calling me. If he’s not allowed to have his phone is can be OFF. If he doesn’t want it to make noise he can turn  it off. \n\n\nSorry your wife through you were dead and freaked out. \n\nYTA",
              "id": 37,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2610,
          "content": "While I agree that OP is TA, I am also wondering why the company is sanctioning someone for having their spouse call as they saw news about a serious accident at the plant.  TF kind of soulless company is that.   So, OP's manager is also TA.",
          "id": 38,
          "comments": [
            {
              "score": 1052,
              "content": "Absolutely. Quite a dystopian working environment when colleagues die in a fire and at the next sites people are subjected to the usual drill as if nothing happened.",
              "id": 39,
              "comments": [
                {
                  "score": 454,
                  "content": "See also: Twin Tower employers who told workers not to evacuate, because their particular offices weren't immediately affected.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 115,
                      "content": "In that scenario, I’d be like fuck that noise, I’m outta here!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "I thought that was because of debris falling from the other tower. I watched an interview with a rescue worker saying he saw someone get decapitated from falling debris when he made that call.\n\nIts super tragic, but they didn't know it was a terrorist attack at that point.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 403,
              "content": "Right? I feel like that manager ought to have calmly informed everyone about the fire at the other site and instructed them to call their loved ones to let them know they were ok. OP's wife's reaction is completely understandable, here. Let's have some friggin humanity in the workplace!",
              "id": 43,
              "comments": [
                {
                  "score": 20,
                  "content": "The way OP wrote this, it's possible that when the manager wrote him up, the manager also did not know yet about the fire.  OP says they're all in kind of a news blackout, because of the lack of phones. That might apply to the manager too.  OP didn't know until he called his wife back, and the way it's written, it sounds like that was AFTER being yelled at by the manager.\n\nIf that's true, the company still fucking sucks for having a fire in one facility, and not informing the managers at the other facility of the disaster.\n\nBut man... we don't know what workplace this is.  And I forget whether it was fucking Amazon, or some other company that made people stay in the building with tornado sirens going off, and the building then got hit by the tornado.  Point being: there are a lot of companies out there right now that are failing spectacularly to do the reasonable and HUMAN thing in an actual emergency.  It's not right.  But it seems to be becoming increasingly \"normal\".",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 344,
              "content": "I bet it’s a company that requires security clearances. Meaning no personal devices at all. That way they can track who has access to what information and nothing is leaving the premises. Or the sound or vibration of a phone can affect sensitive equipment. \n\nI think OP is lying and got written up not because his phone was ringing but because he’s not supposed to have it there. \n\nAnd if that’s the case then Op is even worse because he’s breaking protocols and yelling/haranguing/emotionally abusing his wife over it. She was scared. It’s not her fault he wasn’t supposed to have a device like a personal cellphone at all or not making a sound.",
              "id": 45,
              "comments": [
                {
                  "score": 184,
                  "content": "This right here. It goes into a locker, but the phone needs to be completely off. Probably got in trouble because he left it on.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yeah sounds about right. Honestly he should just leave his phone at home or in his car",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "My first thought, too. My husband worked for such a company last year. He even had a work phone without a working camera and he STILL had places he couldn't bring it. \n\nI'm so grateful I never had a situation like OP's wife, but it sounds like OP needs to reassess how much he wants to work for this company. If he's more upset at her concern than at the company's treatment of this, he should move on.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 16,
                      "content": "If he’s a defense contractor, it’s quite the cushy gig. Once one gets clearances, one is quite set for life. Regardless of the terms with the DoD, my wife has pushed me to not leave haha. It provides us with a decent, comfortable living.  We already have contingencies for emergencies.\n\nThe person who was upset with him was most likely a DoD employee or officer. \n\nI have to have my phone off, or show it’s on airplane mode to get near secure areas of DoD facilities.  For the secured areas, that phone goes in a bucket or locker outside of those areas, and we’re instructed to have it on DND mode or turned off.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I worked at a psychiatric hospital and we weren't allowed personal electronic devices inside any of the buildings. We could keep them in the car, but that's it. \n\nThere were a few exceptions: I had an one, because it was connected to my seizure monitor and alert my emergency contact and unit leader if I had a seizure; diabetics with continuous glucose monitors; people with heart monitors. \n\nI'm betting OP wasn't supposed to have it inside. Who uses DND instead of silence or you know, just turning the damn thing off? His poor wife.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Yup completely agree. Both OP and manager are AH.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Manager didn't know about the fire yet either, possibly",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 525,
          "content": "The fact he wrote she knows he don’t work at that secondary site very often. Unless he updates her, her fear of him getting into an accident is very real. WTF is wrong with OP? Dude is a dick and a huge AH.",
          "id": 53,
          "comments": [
            {
              "score": 45,
              "content": "[deleted]",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "“Not very often” still means sometimes. She didn’t know he wasn’t one of the casualties. Of course she was panicking! Any human with the ability to feel love and concern would be! And of course the more times he doesn’t answer the more worried she’s going to get. It feels excessive to OP because HE knew he was fine. SHE DID NOT. \n\nYTA, op\n\nThough the company is also an asshole for writing him up for this.",
              "id": 55,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah! It’s not like she knew what was going on. If she knew, do you think she will blow up his phone? \nOP is nuts.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "My husband does physical work at land we own sometimes, and was once in a pretty dangerous accident there. He also doesn’t always notice his phone because he’s using machinery. I get anxious and have told him this. His normal, caring human response is to occasionally text me updates! Like, if it’s late, he’ll let me know he’s doing X and will be back home at Y.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 384,
          "content": "HOW DARE SHE?  How dare she call him to see if he had been hurt or worse?",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 254,
          "content": "Agree with everything, but we also need to add OP’s boss to the asshole list. Writing someone up because their phone is going off, no matter the reason, is wild. Standing behind said write up after finding out that it was just a concerned family member making sure that the person they love is still alive (after one of YOUR buildings caught on fire) is next level assholery.",
          "id": 59,
          "comments": [
            {
              "score": 11,
              "content": "He even supposedly put it in the designated locker, so the manager is way the fuck out of line especially since people fucking died under his company's watch.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "I will add a TA to the company though too.  Employees should have been told to report in to family on their breaks.",
          "id": 61,
          "comments": [
            {
              "score": 119,
              "content": "It doesn't even sound like employees at the unaffected facility were even *told it happened*.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 159,
          "content": "Damn imagine having someone so concerned about you to blow up your phone to make sure you aren't dead and then being mad about it. Also fuck, OP, turn the phone all the way OFF.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "Not the case, my kids have called my phone when I had it on do not disturb and it still buzzed. I am guessing he has an iPhone and if a favorite contact calls 2 or more times the phone considers it an emergency and starts to buzz after the second time. It's all about timing I think it is if you call within 10 seconds of each other.",
          "id": 64,
          "comments": [
            {
              "score": 131,
              "content": "He could have just flipped the little button on the side that puts it on silent. Nothing overrides that except “Find my iPhone”.",
              "id": 65,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "...so even the phone thinks a call like that is more important than OP did \n\nYikes",
              "id": 66,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 73,
          "content": "The post explains that phones have a “breakthrough” function so that repeated calls ring. That’s a fairly sensible setup.",
          "id": 67,
          "comments": [
            {
              "score": 27,
              "content": "When in \"Do not Disturb\" if you have your phone ALSO in silent mode it still won't go off. OP can turn his sound off and turn on \"Do not Disturb\" and all calls will be completely silent no matter how many calls you get.",
              "id": 68,
              "comments": [
                {
                  "score": 15,
                  "content": "Also if your phone is just turned off",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Why not just turn it off? If it’s in the locker all day why does it need to be on at all?",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "Hopping on the top comment to say YTA. And you need to see this OP, if anything. When I heard about an accident at my spouses workplace, I called them over 30 times that night. They never answered… turns out it’s cause they died. They *also* were in an environment where they only work a few times a year.. \n\nSo, it’s absolutely worrisome to see somewhere that your spouse occasionally works, had a fire w casualties. \n\nYour wife was worried to high hell about you and you *yelled* at her. Your boss is also TA, cause I’m sure he knew about the fire and knew that his staff would have families that tried to contact them. It’s an emergency situation and your boss should have been more understanding.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 32340,
      "content": "YTA. Your wife was worried that you could have been killed and you’re upset that she was *checks notes* concerned about you? Do you not understand human emotions? She was panicking. She wasn’t thinking about your possible promotion, she was thinking that you could be seriously hurt or even dead. All she wanted to do in that moment was hear your voice and hear it tell her that you’re okay and that you love her and you’ll be home safe. But instead, when she finally does, she hears it berate her and call her dumb. \n\nThat being said, your employers are the biggest assholes going. Your place of work is on fire and they don’t say “hey, go let your loved ones know that you’re okay”. Who wants to work for psychopaths?",
      "id": 72,
      "comments": [
        {
          "score": 6336,
          "content": "YTA for sure, how could you not understand your wife's reaction was normal and because she was worried about you? Even if she knew you're rarely at the secondary job site, that's not zero. Yes she might have called the office instead but she was panicking. Plus who knows if she would have gotten an answer, I'm sure lots of people called the office after the news about the fire   \n\n\nAnd your manager (and your company) are major AHs too. First, you didn't break any rule, you had your phone in your locker set on DND, its not on you, so why should this cost you a raise or promotion? And who wouldn't understand that the constant ringing of the phone in your locker was from someone who was worried about you?",
          "id": 73,
          "comments": [
            {
              "score": 4155,
              "content": "Yeah. I’m really disturbed by the “a few casualties” “lots of injured”. If this is a secondary worksite then those are coworkers, even if you don’t know them very well and there is that chance that it could have been you and your family affected, have some empathy. OP seems to be brushing this off which seems weird to me. But management definitely had bigger concerns than a phone ringing in a locker. Maybe the write-up happened before OP knew it was his wife trying to make sure they were ok, but seriously what manager is concerned about a phone when people died?",
              "id": 74,
              "comments": [
                {
                  "score": 3152,
                  "content": "I have a really strong feeling that OP isnt being entirely honest with his retelling of this part.\n\nEither he's exaggerating getting yelled at a written up to justify his reaction to yell at his wife out of his own embarrassment.\n\nOr the workplace rules actually state that the phone must be shut off whole on site for security purposes and his management just found out he was leaving his on but on mode DND all this time leaving the company open to security/data breaches due to an unauthorized device in a secure area.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 1605,
                      "content": "I was thinking the same thing- he probably was supposed to have it turned completely off for security reasons, and got chewed out for breaking a major security rule. Not an uncommon rule in some sectors.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 834,
                      "content": "I’ve worked in secure sites (need a clearance) for my entire career. I’m 99% certain that OP is being deceptive about the facts. Locker doors block a lot of sound. Is his ringer set to 90dB?\n\nI suspect OP had his phone in a pocket or bag, trusting ‘dnd’ to keep the phone silent. If this is true, OP is even more of an AH for yelling at his wife.",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 354,
                      "content": "I’d bet like a 60% chance he didn’t even get in trouble, they just told him that his phone was going off and he needed to check it. Even if he was written up would it really be THAT hard for him to explain to his boss that his wife was worried for his life? This guy sucks.",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Was thinking the same thing. I had an ex that would lie/create false narratives to justify his behavior. Even really inconsequential things. The scary part was that over time, his lies became his reality. I don’t know what that is called, or if that is what is going on here, but OP went to the internet to ask for validation and something is clearly off with that story.\n\nOP just don’t tell at your wife, in any circumstance. Be a mature adult and learn how to process your emotions.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Same feeling. This story reeks like something my dad would say.  And then you'd ask if he really got written up and it's \"No, but I could have!\" then they just get more mad 🙄",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "OP’s concern about being linked to the incident is also somewhat of a red flag…? Perhaps because coworkers or employers connecting the dots would prove that he isn’t being entirely truthful about what happened.\n\nAlthough I may be reading too much into it!",
                      "id": 81,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 119,
                  "content": "A really AH manager, and probably an AH company too that doesn't care about its workers and put people at risk at the other job site",
                  "id": 82,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Unless they handle some sort of sensitive equipment or information. A phone being on DND doesn't disrupt its signal, and a writeup for a phone going off in a locker signals that either the manager doing the writeup is a giant asshole, or it wasn't supposed to be on at all for a very good reason.",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Right??? People DIED and op is screaming at his wife and grumpy about promotion possibilities? How sociopathic is this person",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "Exactly, instead of blaming his wife for being concerned OP should talk to the manager or HR bc it was an emergency.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "The fact he didn't answer probably caused her to panic even worse. In the moment you wouldn't think about work policies, you'd be thinking he had been hurt or worse if he's not able pick up!",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 482,
          "content": "Going to agree that their workplace is the biggest assholes in this case",
          "id": 87,
          "comments": [
            {
              "score": 92,
              "content": "Going to wager money that it's an engineer-focused workplace.",
              "id": 88,
              "comments": [
                {
                  "score": 36,
                  "content": "I’m guessing it’s a warehouse.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yeah this is what I was thinking too",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "Possibly defense too.  I work in the industry and no cellphones is a standard rule in cleared spaces.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I'm an engineer and this doesn't resemble anything I've ever encountered in the civilian workforce. I'm going with some type of manufacturing.",
                  "id": 92,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 396,
          "content": "People died and the boss somehow had time to be concerned about someone’s cell phone making noise???\n\nGuess there’s no one to chew out if a dead employee’s cell phone was noisy? Gotta take it out on our remaining living employees?",
          "id": 93,
          "comments": [
            {
              "score": 49,
              "content": "Also if a phone is making noise in a locker, it's just making noise in an empty locker room! Or else the lockers are somewhere near workers, in which case they could just identify whose locker it is, get the employee and get them to silence it.\n\nThe whole company seems run by idiots, seems like they employ idiots too though",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 369,
          "content": "But it hurt his chances at a promotion!! I mean how freaking dare she!!!???\n\nAlso - what the f kind of place doesn’t have an emergency process to get in touch cos they ban phones otherwise?  What if this had not been his wife, but that his wife had actually been in trouble and this was an EMT!??? WTAF!??",
          "id": 95,
          "comments": [
            {
              "score": 36,
              "content": "My brother works in a secure lab where he can't have a phone inside either. But his solution? He got an old school beeper in case of emergencies from his wife or family, and everyone knows to ONLY page that number if something is seriously wrong so he knows to leave the lab immediately and get in touch. There are always workarounds. Oh and OP, definitely YTA.",
              "id": 96,
              "comments": [
                {
                  "score": 7,
                  "content": "OP said he's not allowed to have a pager.",
                  "id": 97,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 305,
          "content": "[removed]",
          "id": 98,
          "comments": [
            {
              "score": 86,
              "content": "> the reason you got a citation isn’t because of your wife. It’s because your boss is a dick.\n\nYes! Say it louder for the people at the back!",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Also them getting mad at an employee for a phone going off…do none of these people understand that loved ones tend to call a lot when there’s an emergency? Why are they all so pissy about it?",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "i agree, the workplace is def the biggest asshole in this situation. if you know there was a fire at one of your locations that was big enough to make the news, you tell your employees to take 5 minutes to call their loved ones to let them know they're ok. it's basic human decency",
          "id": 101,
          "comments": [
            {
              "score": 12,
              "content": "I remember hearing that one of the most heartbreaking things for first responders arriving after an event with mass casualties is the nonstop ringing of all of the phones belonging to those who were killed. As I understand it they aren't allowed to answer them? So the phone keep going off nonstop while friends and family members try to find out if their loved one is okay.\n\nI can't imagine that OP is the only one who was receiving repeated frantic phone calls.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "My money is that workplace is Amazon….",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Omg. I cried for the wife. I wish someone could have hugged her in that moment. Her heart. 🙏🏽",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "More importantly, why didn't OP tell his manager the situation right away?? It's possible even they didn't know about the fire until later that day (information doesn't always travel from location to location quickly, even when they're next door to each other), and would remove the mark from his record if he told them.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11793,
      "content": "Never seen somebody more YTA.\n\nIt's mindblowing that you even have to come here and ask this question. SHE ~~THOUGHT~~ WAS AFRAID YOU WERE DEAD. IT WAS A REASONABLE CONCERN.\n\nSo what if she overreacted? So what if she made some logical errors in her panic? She cared about you.\n\nDoes any part of you want her to care if you're dead? Also, have you been tested for any kind of mental/emotional issue that may account for your complete lack of empathy here?\n\nAnyway, it may help your situation to tell your manager why you were getting so many calls, and if the manager has a heart in their chest, maybe that will make a difference.\n\n&#x200B;\n\n**ETA:** You didn't even know that lots of calls could override a Do Not Disturb setting, and yet you're holding your wife responsible for knowing it.\n\nIt's your job to put that setting on when you're at work. You did that. And I'm betting that since it's SOOOOOO important that your phone not ring at work, she probably knows you do that.\n\nToo bad you had to learn this way, but if your setting worked the way BOTH of you expected it to, 20 calls would not be a good reason to \"half-yell\" at your loving wife. If she had KNOWN it would happen, that would be different. She did not.",
      "id": 106,
      "comments": [
        {
          "score": 4640,
          "content": "Not only that..his FIRST reaction to seeing so many back to back missed calls was to be annoyed and angry.... even if he didn't know about the situation.. WHY wouldn't his first thought be that SHE may have had an emergency herself..or a loved one? \nEspecially when he stated she knew not to call..any logical person would know.. there must have been a valid reason....",
          "id": 107,
          "comments": [
            {
              "score": 2008,
              "content": "Seriously. I would have been wondering who died.",
              "id": 108,
              "comments": [
                {
                  "score": 1678,
                  "content": "A few co-workers, apparently",
                  "id": 109,
                  "comments": [
                    {
                      "score": 1169,
                      "content": "Why should he care? He’s got a promotion to get! /s",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Pffffffff as if coworkers were people\n\n\n/S",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "No biggie, apparently",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "No no. Just a couple workers at the second building. Couple fatalities, a few injuries here and there. \n\nGosh, you guys are talking about this like it matters. I want my boss to think I'm cool. \n\n\\s (if it's even needed)",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Not that OP gives a shit",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 397,
                  "content": "Especially since they seem to have a child. Wouldn't the first assumption be that something happened to them?",
                  "id": 115,
                  "comments": [
                    {
                      "score": 22,
                      "content": "They have a child!? Good lord. First off as a parent I would NEVER work somewhere that didn't allow phones. Secondly, yes! How tf was that not his first concern?! This guy is a piece of work",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Are you fucking kidding? He has a kid and his first reaction to 20 missed calls wasn't \"holy shit, I hope my wife and kid are ok\"?!?!\n\nThis dude shouldn't be a husband *or* a parent. He's obviously more in love with his job.",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Exactly! That's what I was thinking. Especially since he mentioned they have a daughter, I would've assumed the worst.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Especially since he mentions that they have kids!  My first thought would be my kids (if I had any). Major YTA on this one.",
                  "id": 119,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 704,
              "content": "Yeah, if I got 20 missed calls from my partner and didn't know my workplace was on the news for having employees in the hospital, my first instinct would be, \"Omg who's death or hospitalization is she calling to inform me of?\"",
              "id": 120,
              "comments": [
                {
                  "score": 299,
                  "content": "Even moreso when I did get in contact with my partner and they were crying. 20 missed calls and theyre crying? Id be worried af",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 256,
              "content": "Exactly- she's never done this before so I can't undersrand why his first reaction was to get annoyed instead of worried.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "Yeah, I pointed that out in my comment too. It really shows you what OP's priorities are and how he thinks about things.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Exactly. Hell, if I even get 2 missed calls from family I get concerned. If someone called me TWENTY TIMES I would be beside myself with worry",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And okay maybe he's a little annoyed she's calling so much because he doesn't immediately think it must be an emergency - she answered the phone _distraught_ and even THEN, he didn't ask if she was okay or show any concern that it might have been an emergency on her end? \n\nI cannot think of how he could have been more of an arsehole.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Exactly this.  his kid might have been hurt or dead or something. And he was just mad his wife called him.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "No matter how angry you are or what she did, yelling and swearing at your wife is never ever justified",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah! What if she was calling to tell him his dad was in hospital or their kid had gone missing or his best friend was in a car crash? Like ANY NUMBER OF LEGIT EMERGENCIES!!!!!",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This is why I absolutely panic if I see a missed call while I'm at work. My family knows I'm working, so it must be an emergency.. and if it's not, I'm so relieved that it doesn't matter if they called for some other reason.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 657,
          "content": "Even not knowing about the fire, he said he has a daughter. If i received 20 calls in a row from my spouse, my immediate thought would be there was something wrong with my child, not that the spouse was annoying.",
          "id": 130,
          "comments": [
            {
              "score": 58,
              "content": "Yep, I'd be shaking so bad out of fear if my wife called me that many times while I was at work. Surely there's a very serious emergency and I'm about to get horrible news.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": ">Also, have you been tested for any kind of mental/emotional issue that may account for you completely missing something here?\n\nIt might be the culture he lives in. Look at how uncaring, unforgiving, and unaccepting his bosses are.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Right??? If something serious happens at my workplace and my husband knows about it, he better call me repeatedly and worry/care if I’m okay. I’m concerned about OPs lack of understanding basic human emotions",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "And the most important thing: she DIDN'T overreact",
          "id": 134,
          "comments": [
            {
              "score": 10,
              "content": "Oh. Yeah, good point. I was busy trying to explain in terms OP could understand, but you're exactly right.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Yeah, I’d be that one panicking even if I knew the chance was very small my husband was actually at the secondary site. And on top of that, who knows how the news was reporting. It might have just been a headline with company name with very little in the actual address. She may have thought it was the main building for all we know.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "If I knew it would override the DND I absolutely would have done what she did. That’s the point. Something was wrong and she *needed* to get through to him. Both OP and his managers are assholes.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8941,
      "content": "> There were a few casualties, a lot of seriously injured folk. My wife had been watching the news from home and started freaking out, I guess.\n\nYTA\n\n> which (and I did not know this was possible) overrode my DND and my phone was ringing\n\nYTA\n\n> she was sobbing and asking me if I was okay. I said of course I was okay and asked what the f*ck was wrong with her\n\nand yup, YTA\n\nediting to add this gem from OP downthread: \n\n> Yes, she could have easily googled the companies name and the phone number there would have eventually connected her with my building so she could ask about me if she really felt she needed to\n\ndouble double YTA",
      "id": 138,
      "comments": [
        {
          "score": 2562,
          "content": "Honestly, how was he able to post this and expect any other response...",
          "id": 139,
          "comments": [
            {
              "score": 1274,
              "content": "might be spending too much time on this sub but i am genuinely expecting him to follow up and tell us she’s also pregnant and maybe that’s why she was so emotional.",
              "id": 140,
              "comments": [
                {
                  "score": 603,
                  "content": "“I bought her chocolate, why won’t she calm down?”",
                  "id": 141,
                  "comments": [
                    {
                      "score": 220,
                      "content": "\"I thought you were dead\" is more of a praline occasion. 🙄",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Don’t worry when he gets home he’s gonna take her to ice cream….",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 435,
                  "content": "\"I asked her if she was on her period because she was so unreasonably upset about the possibility that I was dead\"",
                  "id": 144,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I snorted my drink, thanks for that",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 203,
                  "content": "“I told her I was sorry she’s so emotional, but she won’t accept that apology!?!”",
                  "id": 146,
                  "comments": [
                    {
                      "score": 19,
                      "content": "“And when I reminded her that the cute new gal at work doesn’t get all emotional, she even got mad at that!!!”",
                      "id": 147,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Or that she just got a new box of pads/tampons so it was just PMS",
                  "id": 148,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I’m wondering if he has some undiagnosed … something (?) at this point. A psychological issue or something where he can’t process emotions typically. Because his reactions are so strange.",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 435,
          "content": "One time my mom cooked me in a shower because I was sick. The idea was that the hot water would make me feel better or something. I kept telling her it was too hot, but she ignored me. I ended up passing out, and when I woke up I was lying in bed and my mom was sobbing over my body. Not for a moment did I feel resentment or anger towards her, nor did I think she was dumb for feeling that way (even if I wish she hadn’t boiled me like a lobster). I don’t understand how you can be faced with a loved one crying and get mad at them. As soon as OP heard his wife sobbing on the phone, he should’ve been overcome with worry. If not, because you can’t always control your emotions, he should realize that he was wrong in retrospect. But no, he acted like a huge asshole and doesn’t even regret it. What a d canoe. I hope his wife is never in a serious accident, because it doesn’t sound like he would care to check, since she’d be “unavailable”",
          "id": 150,
          "comments": [
            {
              "score": 175,
              "content": "Hold on what! She cooked you",
              "id": 151,
              "comments": [
                {
                  "score": 145,
                  "content": "Yes, alive",
                  "id": 152,
                  "comments": [
                    {
                      "score": 186,
                      "content": "I’m sorry this happened but your telling of it made me laugh",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Woah woah woah, you’re telling me you weren’t dead first??",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I tried to resist, but I couldn’t.. I’m sorry. But you said she boiled you like a lobster soooo…. \n\nOn a scale of 1-10, how tasty do you think you’d be with butter?",
                      "id": 155,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Right? I was all, \"Oh, that's a funny typo for 'called'.\" Then I read the next sentence.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 94,
              "content": "I get the message you are trying to send here but this is so concerning. 😅",
              "id": 157,
              "comments": [
                {
                  "score": 111,
                  "content": "Don’t worry, my mom’s a cardiologist. Clearly she knew what she was doing. Maybe next time she’ll stick me in a boiling cauldron to cure my flu.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I didn’t know other people experienced this too! I’ve done it to myself by accident a few times (also while feeling sick and cold) in the shower and the bath. Though the bath is much easier to overheat in.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I read an article many, many years ago, that recommended at the first sign of a cold or flu to get into a tub of water as hot as you can stand to get your temperature higher. Then to get immediately into bed with a lot of covers to keep your temp up.  Supposedly the induced \"fever\" of this process helps your body fight the virus better.  I never actually do this, but it was interesting and I've always wondered if it really works.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 309,
          "content": "This just completely BAFFLES ME. If my partner were on the phone sobbing, I definitely wouldn't even dream of asking what the f*ck is wrong with them angrily. Obviously something is extremely wrong if someone is that distraught. This guy is a total AH.",
          "id": 161,
          "comments": [
            {
              "score": 8,
              "content": "Hell, i wouldn't even ask what the fuck is wrong with them, even if they weren't my partner.\n\nThere is a time and place to be angry, and it would be the boss who would be at the receiving end of my anger if my coworkers died at the other site, he didn't even inform me and my partner calls me crying.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "For a bit of a time out, am I the only one who wondered why her calling so much overrode his dungeons and dragons game?? No. Ok. I’ll just sit back down now. Maybe take a nap.",
          "id": 163,
          "comments": [
            {
              "score": 20,
              "content": "\"You KNOW not to bother me when me and my friends are fighting a tarrasque! Ugh!\"",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "Holy shit, the thought of me asking my wife what the fuck is wrong her is a monumentally asshole thing to do.\n\nWho the fuck talks to their spouse like that?\n\nIt's work. Unless you're working on a Manhattan Project type of project work, it just isn't that important of a thing in the grand scheme of things.",
          "id": 165,
          "comments": [
            {
              "score": 33,
              "content": "I kinda feel like even if you were working on the Manhattan project and there was an explosion they’d acknowledge your spouse might be worried seeing the mushroom cloud on the horizon",
              "id": 166,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "And I highly expect that the \"half-yelling\" was, in fact, \"yelling\"",
              "id": 167,
              "comments": [
                {
                  "score": 6,
                  "content": "And probably a lot more than \"what the fuck is wrong with you?\"",
                  "id": 168,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Omg I missed the “casualties” part the first time I read it. This makes his reaction even WORSE than I was originally thinking.",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "There are a lot of people out there with relationships and marriages so shitty...",
          "id": 170,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "The entire post just screams sociopathy.",
          "id": 171,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": ">wtf was wrong with her \n\nWhat the fuck is wrong with her????? What the fuck is wrong with you dude to be that fucking callous, impatient and dismissive. \n\nYTA, and you're an asshole of epic proportions. What is it that turned you into such a fucking cold hearted jerk? I'll chalk it up to maybe working in an environment that is also run by other uncaring callous cold hearted jerks, and that you aren't inherently this mean.",
          "id": 172,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Imagine getting mad at your spouse if they called your cell or paged you 25 times on 9/11. This was her personal 9/11 and just wanted to know her spouse was safe.\n\nOther assholes were OPs bosses. What fucking picks to complain about a phone call bypassing DND  (I'm sure OP told them that's the only way it would ring) Ona day that a lot of people got injured in a big fire.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5874,
      "content": "YTA what the hell is wrong with your boss? We have an employee’s spouse, who is legitimately and reasonably concerned that her their husband has been critically injured, and he’s penalizing you? You need to grow a pair and have him remove that citation.",
      "id": 174,
      "comments": [
        {
          "score": 2203,
          "content": "Exactly. OP is taking his frustration out on the wrong person. His wife is NOT the villain here, it’s the heartless management at his company that didn’t even think to let their employees give their loved ones a heads-up that they were ok. There were injuries and casualties, for God’s sake.",
          "id": 175,
          "comments": [
            {
              "score": 933,
              "content": "They didn't even tell their employees that their coworkers at another site were \"seriously injured.\" Several of them.\n\nMy guess is this manufacturing plant (as it sounds like) is so chock full of OSHA and building code violations that if the word got out, they'd be sued into bankruptcy.",
              "id": 176,
              "comments": [
                {
                  "score": 377,
                  "content": "People DIED not just injured wtf",
                  "id": 177,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 107,
                  "content": "It's not like \"oh there was an issue at a site in another town\" it was one that some of them work at on a somewhat regular basis, I'm more impressed it was only OP that had this come up but I'm guessing everyone else just used silence instead of dnd which is just bad luck. Management is really fucked at this place for even treating employees like this, but I'll accept that this is a white collar reaction to what is likely a blue collar problem and it's probably way more common than I'd like to think.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": ">My guess is this manufacturing plant (as it sounds like) is so chock full of OSHA and building code violations that if the word got out, they'd be sued into bankruptcy.\n\nThat's not really a thing that happens.\n\nI worked a short (1 month) job at a site a few months ago in Tennessee where it would literally be easier to list the stuff that wasn't a violation than to list the violations. The plant hands said \"Yeah, OSHA comes out and fines us every year, but it's a lot cheaper than fixing it.\".\n\nAnd  I mean....these weren't little violations. Think 150' structures with the guy-wires hanging loose, staircases that got further and further out of true as they went up until they were sloped 20 degrees (Yes I checked) toward the outside as you neared the top, handrails that had a top 24\"-30\" high and would break if you bumped them because they were too lazy to weld in new handrails so they just used a couple sheet metal screws, catwalks 100+' in the air with unsecured and rusted through sections that fell through if you stepped on them, etc. (Edit: Almost forgot: Ladders up the side of the structure that were loose because they cut them to do work and never welded them back together, and a couple ladders where you'd climb 80' just to find out there was nothing to get off the ladder on, so you just had to climb back down.)\n\nOSHA is largely toothless, especially in the red states.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "The fact that I had to scroll this much for anyone to be pissed about the labor rights in this situation is wild to me.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I think all couples need to watch the conversation between James Baldwin and Nikki Giovanni. There is so much to learn from that discussion regardless of race or class. \n\nOP is definitely YTA. He should look into getting another job. He must be generally unhappy and frustrated with life. He gave his wife no grace, no benefit of the doubt or anything before curssing her out. His anger is misplaced. The way he spoke to her is abusive, actually. Maybe him reaching out here is a sign that he is self reflection. Maybe he can be helped. \n\nYOU NEED TO APOLOGIZE YO YOUR WIFE.. Atone and promise her that you will do the work necessary to make sure what happens doesn't happen again. Go to therapy or whatever you need to do. Find healthy ways to deal with frustration.",
              "id": 181,
              "comments": [
                {
                  "score": 10,
                  "content": "This dude doesn’t need to apologize. He needs to show some gratitude, appreciation and then grovel for forgiveness, and then do a whole lot better :)",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I agree. He got chewed out at work and transferred that abuse to his spouse.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Feels like OP has internalised his workplaces inhuman view of himself.\n\nWhat horrible people to work for.\n\nOP YTA. Please use this as a catalyst to find somewhere to work that will acknowledge you’re a human being and that you matter to other human beings.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 622,
          "content": "Also, what if the emergency had to do with something else, like their child? The reaction to 20 calls should not be anger and annoyance, it should definitely be, holy crap, something happened! Because, you know, things (emergencies) happen when you're at work! And honestly, I don't like places with a no personal devices policy. I get that they don't want people to be playing candy crush all day, but we have lives outside of work. People need to be reachable for situations like this.",
          "id": 185,
          "comments": [
            {
              "score": 267,
              "content": "I'm fine with places having a policy banning personal devices, BUT there should always be a way to notify an employee of an emergency: the company's main phone  number, for instance, or a direct line to a section supervisor.",
              "id": 186,
              "comments": [
                {
                  "score": 264,
                  "content": "The main phone line was probably busy, with spouses and loved ones who couldn’t get ahold of their loved ones calling for information. \n\nThe boss should be in big trouble for not letting the employees know, and telling them to send a quick text or call to their families and let them know they are safe. This would have caused chaos at the main lines, and possibly with hospital phone lines as well. \n\nOP should take his citation higher up the chain, and let the company big bosses know the chaos and panic of employee loved ones this caused. \n\nI’m also unsure if this is real. \n\n1- in the event of a mass casualty incident where many employees were hurt/killed, and many employees spend time at different sites- there should have been multiple family members trying to get ahold of employees. It would not have only been OPs wife. \n\n2- Most companies have emergency plans in place for something like this. With multiple job sites, and employees who work at different sites. If they don’t, then holy crap do they need to hire an Emergency/Disaster Manager. \n\n3- Who has a daughter, and gets 20 phone calls in a row from their spouse and doesn’t immediately jump to panic that their child or spouse has an emergency? \n\n4- even if you keep your phone in your locker, you still get breaks, and would have access to your phone during breaks. Why would it matter to the boss if a phone is ringing in a locker room?",
                  "id": 187,
                  "comments": [
                    {
                      "score": 15,
                      "content": "It reeks of a bait post or something. I refuse to believe this is real life. It reads like an episode of a cartoon.",
                      "id": 188,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": "The reaction should also be:\n\n\"Holy crap, I haven't set up a good contact method with my wife when I'm at work and we need to hammer out a better/more accessible procedure.\"\n\nIf they do have a procedure already, he needs to work with his wife to have better crisis reaction skills (i.e. not panic so much she forgets he doesn't have his phone)\n\nPlaces with no personal devices are usually high security places (sometimes military government contract stuff, prisons) or machinery places where a few seconds of distraction could get someone killed, not just candy crush haters.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I think the idea is that in a real emergency the spouse should know the work phone number and call work and ask to speak with their partner because it's an emergency. It's what people would have done 20 years ago and the system worked then. It's just that people's responses under pressure have changed-- if you've never called your spouse at work before and have another option, why would you think to try the work number? And workplaces don't really realize that.",
              "id": 190,
              "comments": [
                {
                  "score": 18,
                  "content": "The other thing is main lines don't have as many lines as people think, unless you work at a huge place. You could be placed on hold for a really long time before they even get to you. That's pretty nerve wracking in an emergency.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "In my opinion he should go to HR and tell them what happened and ask how can any employee's family find out if the employee is OK if something like this happens again. Then he can ask his boss if they were aware that a site you occasionally work at had a major fire with a lot of people hurt and how can your family verify your safety in that situation? If family can't call your cell then who can they call to check on your safety? \n\nPersonally I would be updating my resume and checking on what other jobs are available, this company is not very employee friendly.",
          "id": 192,
          "comments": [
            {
              "score": 15,
              "content": "In addition, I'd be keeping a detailed log of what was said, what was done, etc. to prepare for my eventual labor suit when they deny you a raise or promotion because your locked phone was ringing while you were hard at work ignoring your wife.\n\nI'm not a labor lawyer. I don't even know what state this is. But there's a case in there somewhere.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I think OP is full of it.  Even on secure sites news of a fire would travel fast.  Plus, his manager would be understanding that spouses/families were calling with news of the fire and deaths getting out.",
          "id": 194,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Yeah totally agree, do I smell redirected behaviour from OP?\n\nIt's so easy to go \"waaa waaa there's something wrong with my wife for this\", when the alternative is to grab a backbone and go after your superiors for actually being wrong for writing you up. It's the chain of screaming, yo.\n\nYour wife is one of the only people in the world who has your back (assuming you have a functional marriage), you are supposed to be a TEAM so maybe work on that when you're free.\n\nAll I wanna do right now is to tell her that most people would have a normal reaction to this and that she can feel acknowledged.\n She deserves better, and one of you will notice it eventually. Your marriage can go completely differently dependant on who notices first.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2726,
      "content": "YTA. She didn't know if you could have been one of those casualties or not. You should be mad at your boss, not her.\n\nShe cared enough to try to reach you but you react to that with anger.",
      "id": 196,
      "comments": [
        {
          "score": 362,
          "content": "Also, what if he’s pinned down or injured by a result of the fire and not accounted for?\n\nSounds like management is horrible, so not trusting them to know he’s unaccounted for. Could literally be life or death if she contacts management after not being able to contact him.",
          "id": 197,
          "comments": [
            {
              "score": 27,
              "content": "Or in an ambulance/at a hospital where staff might end up picking up his ringing phone.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah, OP is definitely the AH on this one but management are a bunch of fucking ghouls. Who writes someone up for their phone going off in the locker room?",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "OP’s that special kind of ass that cares more about what their boss thinks than their spouse",
          "id": 200,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2619,
      "content": "YTA\n\nShe wasn't blowing up your phone for fun,  she was fucking terrified! \n\nYour boss is an AH,  you're an AH, but your wife? She's just a woman who was justifiably panicked about your safety. \n\nApologize,  profusely. \n\n(And turn your phone off instead of DND if your boss is going to be such a prick)",
      "id": 201,
      "comments": [
        {
          "score": 469,
          "content": "And a giant bouquet of flowers for the poor woman. wtf dude",
          "id": 202,
          "comments": [
            {
              "score": 172,
              "content": "Add some chocolates a card, maybe a teddy bear or jewelry",
              "id": 203,
              "comments": [
                {
                  "score": 35,
                  "content": "Every day for a month",
                  "id": 204,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Maybe send her on holiday with someone who actually cares about her too.",
                      "id": 205,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Unfortunately, this dude still thinks his anger is \"justified\". It didn't occur to him that a catastrophic situation, where lives were lost, and where he could have very reasonably been involved, could justify a panicked phone call from, you know, his own concerned wife of all people. \n\nIt wouldn't occur to this jackass to get her flowers. People like him are why I choose to stay single.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1992,
      "content": "Yes YTA and so is your employer\n\nIf something happens to your wife or daughter how the fuck would they reach you ? Would you make your little scene because you got called about it too ?\n\nShe was stressed, and crying, she panicked for a good time but no, instead or reassuring her you took your frustration out on her and think a half felt sorry will change something. She's right to be pissed, she cares about your safety and she might feel like you don't care about hers now.",
      "id": 207,
      "comments": [
        {
          "score": 474,
          "content": "Honestly, OP comes across as the kind of person who also wouldn't see a death as an emergency either, because they'll still be dead *after* their shift.\n\nI hope the write-up doesn't affect their shot at a promotion, because with this attitude, their career will be all they have in a few years.",
          "id": 208,
          "comments": [
            {
              "score": 86,
              "content": "This right here. OP cares more about a promotion than he does about the people who love him. That’s the message you’re sending to your wife OP. I suggest you take a step back and reevaluate what’s actually important to you, and if you don’t want your wife to worry if you’re dead or not then the best thing you could do for her is tell her to find someone else.",
              "id": 209,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "With the way he treats his wife and her sleeping in a different room for this long already, I think his career is going to be all he has by december.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Right, there are so few jobs that are SO critical that an individual simply can’t afford to be distracted by a personal/family emergency…what the heck does this guy do that’s so important but doesn’t warrant some basic respect from the manager?",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "> I hope the write-up doesn't affect their shot at a promotion\n\nI hope it does. Maybe when he's left with no wife and no career, he'll realise where he went wrong.",
              "id": 212,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "And if the employer thinks it's not a situation urgent enough he's a serious ass too.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "OP also doesn’t realize that his job couldn’t care less about him and would’ve had a job listing posted online two seconds after he was confirmed dead in the fire.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "The last time I blew up somebodies phone because we didn't know their whereabouts, they were dead on the road after crashing their motorcycle. \n\nOP is a HUGE AH",
          "id": 215,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1750,
      "content": "YTA.  Good god, your poor wife.  On so many fronts.  \n\nYour employer is also a giant ass.  If one of their worksites was involved in a fire that resulted in casualties, they should have been offering counseling for employees and their families, not writing people up when their families are trying to reach them because they fear they are dead.",
      "id": 216,
      "comments": [
        {
          "score": 337,
          "content": "Any manager worth their salt would refuse to write up in this scenario.",
          "id": 217,
          "comments": [
            {
              "score": 51,
              "content": "[deleted]",
              "id": 218,
              "comments": [
                {
                  "score": 29,
                  "content": "That part feels to me like OP trying to make up a reason why they might be in the right. Seems like a stretch.",
                  "id": 219,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "100% that part is made up to justify his anger. \n\nIt’s like how every other post here ends with “now my friends/family/coworkers are blowing up my phone calling me an AH,” which also rarely happens IRL",
                  "id": 220,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "This 100%. I got in trouble for my parents blowing up my phone at work and when hearing about the emergency situation, they understood and let me off. Why? Because they’re human beings with empathy.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 167,
          "content": "The employer is a massive massive AH in this situation to the point it seems illegal",
          "id": 222,
          "comments": [
            {
              "score": 135,
              "content": "OP should be headed to HR steaming, instead he’s licking his boss’ boots. I can only imagine it’s a psychological defense mechanism to downplay the event because it would be too traumatic for him to confront that he could have died. And that his employer wouldn’t have given a fuck.",
              "id": 223,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 782,
      "content": "Actually, your workplace is the AH here.  So, your phone was ringing in a locker.  Big deal.  \n\nAs for your wife, she needed to be reassured you were okay.  She could have handled it differently, but in her panic of thinking you'd been hurt I suspect she was not thinking clearly.  Forgive her and apologize for yelling at her and not thinking how this affected her.  Work out how she will handle getting information if another such incident should occur.",
      "id": 224,
      "comments": [
        {
          "score": 166,
          "content": "This! It’s not like it was on him, who the hell cares?! Especially under the circumstances! Your employer sucks, OP",
          "id": 225,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "I can't count how many times my phone went off (silently) at my desk during the home-buying process for group calls with my partner, realtor, and in-laws (helping us understand the process). I didn't take them during crucial meetings, but it still vibrated. A couple of days I told my boss \"I normally wouldn't do this, but this is a key moment and I may need to step out for a call.\" His response - \"this is a huge moment in your life, I'd be mad if you didn't\"\n\nAny boss worth their salt can understand context",
          "id": 226,
          "comments": [
            {
              "score": 10,
              "content": "iiiii don't think they have that kinda boss, ngl.",
              "id": 227,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Workplace is the AH for taking it out on him but OP YTA in general and in regard to your wife. Like wtf. Taking it out on her is even more fucked up than them yelling at you and giving a citation grow tf up and appreciate your spouse’s love.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "The only thing I can think of is that the rules are actually that all employee phones must be turned off in order to prevent an unsecured security breach. And his phone ringing alerted management that he was violating policy by leaving his phone on and trusting it to remain silent on DND. \n\nThat would result in a write up. But is far more on him and omitting that little detail.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Workplace is the AH for taking it out on him but OP YTA in general and in regard to your wife. Like wtf. Taking it out on her is even more fucked up than them yelling at you and giving a citation grow tf up and appreciate your spouse’s love.",
          "id": 230,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I'm not sure that I blame the workplace. I've worked in a government facility that requires a security clearance to enter, and personel computing devices (cell phones, laptops, tablets, smart watches, etc.) Were not allowed in the building. There are also research and medical facilities that have equipment that can be thrown off or interrupted by cellular signals. So again, phones can't enter the building. Correctional officers typically can't bring phones into the buildings.\n\nPlus OP said that news gets around slow due to people not having their phones. It's likely that even by that point, his manager (who probably isn't far enough up the chain in their company to be immediately notified about a tragedy) didn't know. At whatever point they found out it would have made a lot of sense to tell employees to leave the building to contact their loved ones though. But honestly, even with his phone in his locker, if he's actually not supposed to have it in the building at all, but brings it in anyway because \"everyone else does it\", he was asking to get written up eventually. Not his wife's fault.",
          "id": 231,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}