{
  "post content": "My wife OCD. She’s on medication, but there are still things that she is extremely particular about, one part of this is where she puts things. She has certain things in specific places, she has the silver ware in a certain drawer, the coffee table pressed to the side of the wall, the coffee maker below the coffee cups she also works from home and is often in meetings. \n\nThis is how she operates and generally get through the day, there’s a specific Place for everything and for a reason and it’s convenient. Frankly I thinks these spots are where most people keep there things. \n\nWhen she’s in meeting or talking to people she’ll keep her ear piece in go make coffee as they are talking and so forth, so she’s usually rushing. Honestly I don’t even know if this is even apart of OCD or just a matter of her every day routine that throws her off when it’s not there. \n\nMom was coming down to NJ where I live visiting me and my siblings. She was staying with us, and usually this isn’t an issue, but mom continues to move things around the house. Like the things I’ve mentioned. She moved the coffee maker and the cups apart so they are hanging where there are hooks on the wall.(the opposite way of the coffee maker) she moved the coffee table to the center of the room, she re arranged all of the plates, cups. She’s putting my wife’s pens,paper,notebooks,laptop(all in *her* office)in different places so my wife  has to rummage around to find them.Mom keeps closing the blinds making it dark and gloomy in the house. This gets my wife overwhelmed and has a bigger impact than how simple it seems and her side tracked from work because now she has to find everything and put it back.  \n\nThis has been happening for the past three days, each time mom does it I tell her to put it back then she gets mad at me saying this is where everything should be and she’s just helping us. I stayed firm and told her to put it back. Which she does, but once I leave, it’s back to where I told her not to put it. \n\nIt’s starting to irritate me and my wife is getting really frustrated with this. I don’t think she or I can handle this for 2 weeks. Today, mom moved my wife’s office desk to the other side of the room (away from all the cabinets she has stored for her work things) \n\nThis was it, I profusely told her to move it back *and* why. I told her that she’s going to have to stay with my sister or find a hotel. \n\nShe got really mad at me and my wife and told me she can’t believe we are so selfish to not appreciate her help then said if she’s not appreciated she’ll leave. \n\nShe left, but now I’m getting blasted from my sister and my brother saying I was an asshole for kicking her out and this is just how she shows affection. \n\nI don’t think I’m an asshole, we opened our hole to her which is already kinda a lot, it’s our home, we should feel comfortable in our home, and our set up was comfortable for both of us.",
  "id": 1,
  "comments": [
    {
      "score": 11006,
      "content": "NTA\n\nEven if your wife didn't have OCD it would be a dick move to do any of that. Like if it were just that she did the washing up and didn't know where something goes and put it in the wrong spot that'd be fine, but she's deliberately rearranging things and that's not on.",
      "id": 2,
      "comments": [
        {
          "score": 4941,
          "content": "The fact that she’s deliberately rearranging things after being explicitly told not to is a huge sign of disrespect, whether OP’s wife has OCD or not. Who tf goes into some else’s house and moves their home office around??? OP’s mum had no reason whatsoever to be IN wife’s office at all, let alone moving wife’s office around - except to either exert control over space that isn’t hers to control, or cause trouble\n\nNTA but OP’s mum sounds like a massive controlling AH",
          "id": 3,
          "comments": [
            {
              "score": 2058,
              "content": "It sounds more like mom is trying to mark OP and OP's wife's territory as if she's top dog. A side affect is if OP and his wife don't have a united front she can make it seem as though the wife is crazy.",
              "id": 4,
              "comments": [
                {
                  "score": 806,
                  "content": "\"this is where everything should be and she’s just helping us\" from OPs mother makes me think that she may have some control issues or OCD herself.\n\nBut definitely trying to be top dog of the household.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 592,
                      "content": "I don't think OP's mother has OCD. If she did, she'd leave things alone because she would understand. This is all about control with a hefty side of \"mental illness isn't real\" thrown in for good measure.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 122,
                      "content": "I don't think it is a good idea to throw a diagnosis like this around so lightly just because mom has some weird control issues or is particular about things. OCD is a lot more than just being particular about where things are.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 32,
                      "content": "I don’t want to Reddit armchair diagnose but it’s at this point I would like to point out that there is a type of ocd that is a personality disorder where you have to rearrange everything in everyone’s lives. So there’s that, or Op’s mom just being a massively controlling ah",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I don't think she has OCD, but it's hard to tell from so little information. Control issues, likely. She may be one of those moms who think the wife took their son away, and she's trying to do anything to force herself back in his life. She could be trying to get a rise out of the wife, so she can tell her son negative things about the wife and maybe try to cause marital problems or a divorce. It seems like jealousy at the root of it.\n\nAlso, no one is gonna tell me how my house \"should\" be. My house should be my house, and your house should be your house. That's just so weird to me.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Her way or the highway!\n\nIt would drive me NUTS!\n\nOP: NTA",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It \\*may\\* also be a very bored woman that genuinely thinks that she is being helpful. My grandfather was like this. He got bored being with his grandkids, and would rearrange the garden shed or paint the garage without asking first. (He was colour blind, so painting was in interesting choice.) I wonder if giving dear old mom a list of chores (wash the curtain, steam clean the rugs, empty and clean out of the cupboards and put everything back where you found it), rotate cans in the pantry, defrost the freezer, etc, is the way to go?",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Mom has to have something not quite right to think that there is only one spot that's appropriate for a coffee maker.\n\nHow does she happen to know exactly where that spot is when every kitchen is different, anyway?\n\nAnd if she truly can't control herself, in the interest of basic politeness, then she does have a serious problem.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "Yup that's what I thought too. She wanted to be top of the food chain. There was no damn reason for her to move wifes desk or any of her things. This was a move she knew would irritate wifey amd took it. She prolly thought OP would see his wife as crazy for getting upset but didn't count on him taking his wife's side.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I think this is the most likely explanation. I would be really angry if someone came into my house and rearranged everything. If my MIL behaved this way, she would be booted out immediately. My MIL stays in a hotel when she visits. We get along much better that way.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "This was literally my exact thought. The human equivalent of lifting her leg and peeing all over wife's property. Some weird dominance bs.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yea with people like this you have to absolutely obliterate them. Like yell at them until they cry and don't talk to them until they come back to you with their tail between their legs, if they never do that's a win too.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "My mil did this in the early years. NTA",
                  "id": 17,
                  "comments": [
                    {
                      "score": 3,
                      "content": "My MIL did it when she came to stay with us the week my son was born. Granted she really wasn’t being malicious, she really was trying to help. Once I mentioned it to her she apologized and stopped. My MIL and myself have clashing personalities, but bless that woman she really does try to do the best for us. OP’s mom on the other hand… she’s purposely trying to mess with the wife. Sounds like “I’m top woman here” power struggle. Good for him for putting his mother in her place and standing up for his wife. OP NTA. You’re doing EXACTLY what a spouse should do",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Thank you! My ex-MIL used to do this and I was told to keep quiet because \"she helps us so much in other ways\". I thought she was a massive AH as well but they tried to convince me otherwise. I feel validated.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "That last sentence right there. Bro and sis are wrong. That's not mom showing affection. That's mom showing control. And they might be used to it, accept it, but OP and his wife shouldn't have to.\n\nOP is NTA, but he should have shown mom the door the second time she pulled that crap.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "It's controlling for someone without OCD. With OCD, this is straight up psychotic.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "My ex-mil that's who. One year, after we had just moved into a new house on base, we had them watch the children while we were gone on a cruise. We had not had time to hang all of our pictures and stuff before we left.\n\nWe get back and found that she rearranged our living room, dining room, kids toy room AND our bedroom. In addition, she had gone shopping and bought a crap ton of decorations that she hung on the walls, a new rug she put on the floor in our living room, and new curtains for the living room. She had also bought new bedding for the kids' rooms and our rooms but hadn't had a chance to get them on before we got home.\n\nI was BEYOND infuriated. She treated MY house as if it was HER house and I was incensed. However, she turned on the waterworks and cried that she just wanted to help us get settled in and she couldn't believe how unappreciative I was being! To make matters worse, my ex-husband (notice the EX there) backed her up and, even after they left he wouldn't let me take anything down or get rid of it.\n\nJoke was on him though. He left for a 6 month TDY and the FIRST thing I did the day after he left was move my furniture back where WE had agreed it should be, and got rid of every single thing she had brought into my home. Then I went shopping. When ex got home and saw the house he flipped out but, I told him that if he wanted to live in a house his mother had decorated, he could go live with her in HER house. This was the worst of her transgressions but, it wasn't her last and my momma's boy husband took her side every time. I finally had enough and we divorced.\n\nNTA OP and good for you for standing up for your wife. I guarantee that your mom knew EXACTLY what she was doing and did it on purpose to mess with your wife. I recommend that you never let her loose in your house again because, she'll keep doing it if she gets the chance.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Funny story.  A few years ago Some people we knew rented a holiday home in Cornwall that belonged to a UK TV show host.  On the last day they thought it would be funny to move all his furniture around before they left as a prank.  Unsurprisingly he didn't find it at all funny and they never got invited back.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Or early signs of senility.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Rearranging furniture in other people's houses is disrespectful **even if** you haven't been explicitly asked not to. OP's mum is a control freak. Send her packing and don't let her come back. Like ever. If your sister doesn't like her controlling behaviour and tries to send her back, refuse.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "So it sounds like OP went from a mother with OCD to a wife with OCD. Like ya know who goes into their kids house and rearranges everything? Mothers with OCD.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "It’s very likely that mom has OCD, herself. Two OCD people in the same house is a recipe for disaster.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 296,
          "content": "I have got into serious fights with my mom about moving my stuff and I dont have ocd. That would drive me just as insane. NTA and if your family continues to harass you about this, have a serious conversation with them about it and if they still harass you maybe go lc",
          "id": 28,
          "comments": [
            {
              "score": 118,
              "content": "Exactly - your stuff is where *you* want it in *your* home. What on earth possesses people to think it's ok to come into your home and move your stuff around?? It's there coz you either a) like it there or b) it's most convenient for you there. \n\nUnbelievable. \n\nNTA",
              "id": 29,
              "comments": [
                {
                  "score": 39,
                  "content": "Yup it would drive me nuts when my mother would visit and either criticize where I kept things in my kitchen or just move them without permission. She was a control freak and only her way was the right way.\n\nShe was 6 inches taller than me, and had a bad back so didn't like to bend.  Do you suppose my kitchen might have more stuff in lower cabinets than hers?/s\n\nNTA, OPs mom was absolutely trying to mark her territory and prove she was the authority.  She was rude.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "He told her not to move things and threatened to put her in a hotel. She didn't listen or even try to understand that she needed to listen. It's not helpful if it wasn't asked for. Putting her at the siblings house maybe they'd appreciate it but she was warned . NTA",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I’ve had fights with family about this too. Had family visit years ago. They completely rearranged the guest room. This wouldn’t have been a big problem except they never moved it back when done because “it’s better this way.”\nThey also rearranged where we had stuff in the kitchen and wanted to rearrange the TV room. \nFinally agreed to guest room only provided they love it back when done. \nStill trying to wrap my head around how people think this behavior is ok!?!?\n\nETA: NTA",
              "id": 32,
              "comments": [
                {
                  "score": 2,
                  "content": "Happy cake day!",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "No kidding!  I don't have OCD, but in my space, I sure as hell want things to be where I put them, even if that is scattered about, as sometimes that is the way I approach problems...a stack here that I need to immediately attend to, a stack there that can wait, and so on.  To have someone come in, esp. in my office, would strike a deep cord of irritation, and I'd probably lose my temper over this to start with.  And the fact that it moves into my home, my safe space that my SO and I are comfortable with, ACKKKKK! Good on OP for taking care of the problem.\n\nNTA, OP.  Too bad mom couldn't leave it to maybe dusting or something if she wanted to be helpful...and only if she could put things back where they were.  This is no way to show affection: It is a way to try to control!",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "People [organize things in different ways](https://clutterbug.me/what-clutterbug-are-you-test), some [need everything visible and in large groups](https://clutterbug.me/what-clutterbug-are-you-test/butterfly) while others [need everything hidden but also in much smaller categorizing](https://clutterbug.me/what-clutterbug-are-you-test/cricket). \n\nAlso, on an IT-side of things, having someone else with access to work information is a no-no. Granted, we all know that is possible because its not like you're going to lock your office when you leave it and you generally trust your partner but MIL in this case could jeopardize OP's wife's job depending on what information is accessible.",
              "id": 35,
              "comments": [
                {
                  "score": 2,
                  "content": "Ah. My mother-in-law and I have different organizing styles. (And neither is either of the ones you linked to.)",
                  "id": 36,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah, I just went for one extreme but that particular website has 2 other styles (everything hidden but large groups and everything visible but smaller categorizing and mine mostly fits that last one).",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Thank you for those organizing links, they may be helpful to a few people here.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "This. I don’t have OCD, but my former MIL used to rearrange my stuff in my home all the time and it was infuriating - and also under the guise of “help”.  It’s not help, it’s being a bad and disrespectful guest.\n\nIf your mother KNOWS your wife have OCD, then her intentions are probably malicious - trying to get your wife to react and then act like she’s mentally unsound for reacting as planned.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "Yep, this has everything to do with the mum hugely overstepping and disrespecting both her child and their wife. The OCD just makes it worse. And maybe that's the real reason for mum to move stuff around, because she thinks that OCD is a made up thing, and that her DIL just needs to get over her \"silliness\" and mum is just helping her. \n\nOnly an AH would start moving people's things around in their own home without their consent. Just such a rude thing to do. \n\nI can't imagine that many people wouldn't have been super upset by that.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "My wife swapped the contents of two kitchen cupboards 6 months ago, and I'm still opening the wrong one 80% of the time.",
          "id": 41,
          "comments": [
            {
              "score": 29,
              "content": "I swapped the contents of two cupboards about the same time and I'm still opening the wrong one a lot. Hang on, are you my husband?",
              "id": 42,
              "comments": [
                {
                  "score": 8,
                  "content": "Can't be. My wife instantly adjusted with no problems.",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My friend sublet my apartment 3 months ago and packed up a bunch of my things and didn't put everything back and I'm still trying to find where she put stuff.",
              "id": 44,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I got hung up on the coffee table being pressed up against the side of the wall, haha; I can't picture that. But even if mom thinks it looks awful she shouldn't move it; it's not her house!",
          "id": 45,
          "comments": [
            {
              "score": 5,
              "content": "I thought, from the context, by \"coffee table\" they possibly mean like a kitchen island or cart or \"station\" where they keep the coffee maker and etc, and the coffee cups would be in the cupboard above there?\n\nYou're right, though, even if they were talking about living room furniture, MIL doesn't get to decide where it belongs.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Exactly! The only acceptable reason to move someone else's furniture is for safety or accessibility, like if you have someone in a wheelchair or walker, or a very young child that is climbing or pulling up on things that aren't secured. And in those cases you'd discuss it with them and help move it back when you left.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "NTA. Make her explain exactly how this is \"helping.\" There is no universe in which this is helpful; it's passive aggressive bullshit.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Blood is not thicker than boundaries. NTA",
          "id": 49,
          "comments": [
            {
              "score": 2,
              "content": "Love that!",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "she may be doing it in an effort to drive a wedge between OP and his wife. \n\nmy ex's mother flat out told me that she would do anything possible to make sure her son wouldn't reproduce with me so my \"issues\" (adhd-i) wouldn't be passed on to her grandchildren. i wonder if OP's mom is trying to do the same",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "What gets me is that beyond refusing to listen to OP and his wife, she seems to potentially be doing it to mess with OP’s wife specifically. She is moving things to places that are obviously inconvenient and out of place. Moving the desk all the way across the room away from the cabinets and the coffee cups all the way across the room from the coffee maker to wall hangers (not even the ones that go under cabinets to have them hang) isn’t where they go.\n\nI feel like she is fucking with OP’s wife on purpose and knows she is making things harder for her rather than easier like she says. I’m curious if she knows about the OCD diagnosis and if she might be trying to mess with OP’s wife because of that.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3235,
      "content": "NTA\n\n>this is just how she shows affection. \n\n\"She shows affection by rearranging furniture after being asked not to 6 different times?\"",
      "id": 53,
      "comments": [
        {
          "score": 2847,
          "content": "Some people's love language is \"trampling boundaries\" apparently.",
          "id": 54,
          "comments": [
            {
              "score": 678,
              "content": "I think OP's mom's love language is \"intentionally fucking around with the OCD lady my son married\"",
              "id": 55,
              "comments": [
                {
                  "score": 264,
                  "content": "She is flexing to OPs wife that she is more important ... Some stupid little mind game",
                  "id": 56,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Exactly this.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 310,
              "content": "This isn't love. This is an attempt to establish dominance. Mom got to have it her way when op still lived at home, now expects to show the wife that she's still in charge.\n\nGood for op on saying there are boundaries she's crossing and protecting the wife. As is natural when you grow up and get married, the mother has to figure out how to keep the relationship loving as equals. It might take some getting used to but clear boundaries help. Doesn't matter what the siblings think and you don't have to hate mom, but crossing boundaries has consequences.\n\n\"Mother, I love you but this behavior is unacceptable.\"",
              "id": 58,
              "comments": [
                {
                  "score": 156,
                  "content": "You’re right, it’s about dominance.\n\nMy Ex-MIL was exactly like this. Comes to stay at your home & will rearrange absolutely anything & everything, then have the audacity to get angry & play victim when you change it back. Total narcissist & control freak who triangulated between me & my sisters-in-law for YEARS before we figured out what she was doing.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 120,
                      "content": "My ex MIL used to rearrange things in the kitchen when I was heavily pregnant, so that I could no longer reach or get common items. Like putting cups and glasses in the lowest cupboard. There was no way me and the belly were getting down there just for a glass of water. Ex MIL would do it under the guise of helping and offering to do dishes so I would be off my feet, and then get angry when confronted about it (after being asked repeatedly not to do it) and play the martyr.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I mean, that's my mom's love language. She shows love by ignoring all boundaries set. And then tells me my boundaries are breaking her boundaries. I don't think she understands what boundaries are.",
              "id": 61,
              "comments": [
                {
                  "score": 14,
                  "content": "Your mom must know my dad. His definition of \"boundaries\" was \"I get to tell everyone what to do bc not being able to tell everyone what to do is a violation of my boundaries\".\n\nAt one point I said I wasn't comfortable discussing a particular topic with him bc of how vicious those arguments always wound up getting. He accused me of controlling what he was allowed to talk about. I said no, I'm just setting a boundary of what *I'm* willing to talk about with you. He literally replied \"well what about my boundaries? Telling me I'm not allowed to talk about this disrespects my boundaries.\"\n\nHe never did understand that \"you must be a captive audience to any debate I want to have with you\" was not, in fact, a normal or reasonable boundary to have.\n\nI haven't talked to him in almost 9 years now, for some reason. 🤔",
                  "id": 62,
                  "comments": [
                    {
                      "score": 2,
                      "content": "There's a whole sub for this, by the way.\n\nhttps://www.reddit.com/r/raisedbynarcissists/",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 171,
          "content": "\"She shows affection by repeatedly bulldozing over clearly stated boundaries because she believes she knows better.\"",
          "id": 64,
          "comments": [
            {
              "score": 15,
              "content": "Hey I know some of these...",
              "id": 65,
              "comments": [
                {
                  "score": 7,
                  "content": "Love your handle.",
                  "id": 66,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 107,
          "content": "She can show affection at the siblings house then. I'd go visit a few days later and ask: \"so did she move anything?\" If the answers no, it's an isolated incident.\n\nOP, NTA. Mom is a huge one though.",
          "id": 67,
          "comments": [
            {
              "score": 110,
              "content": "If she doesn’t move things at her other children’s houses, then she was specifically messing with the daughter in law she knows has OCD.",
              "id": 68,
              "comments": [
                {
                  "score": 14,
                  "content": "Exactly.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "This!",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "While you're visiting the siblings, make sure you move a few desks around, since they think it's not a problem.",
              "id": 71,
              "comments": [
                {
                  "score": 6,
                  "content": "\"well it's how mom shows her love right? Thought I'd give it a try\"",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "\"And I show my love by tossing you out of my home and never letting you in again \"",
          "id": 73,
          "comments": [
            {
              "score": 16,
              "content": "Hey, Tha's how I show my love for this kind of behavior too!  I see it as truly loving as I am giving them the gift of consequences.  A rare gift for many.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Seems more like \"torture the wife\" to me.",
          "id": 75,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "This \\^ right?!\n\nI call BS on mom and the in-laws - intentionally disrupting someone else's house is in no way a sign of affection. Being helpful implies doing something the recipient wants or needs. Mom is an inconsiderate steamroller even without the OCD situation.\n\nNTA",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "“But they’ll change their mind then they’ll say I’m right and it’s because I’m the bestest, most smartest, wonderfulest woman ever. They just don’t appreciate my genius”",
          "id": 77,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1363,
      "content": "NTA.\n\nEven if your wife didn't have OCD your mother doesn't get to decide where things belong in your home. The fact that your wife does have OCD and you repeatedly told your mother to stop moving things makes her 100% TA.\n\nIt would be one thing if she put a coffee cup in the wrong place. She moved a DESK to the other side of the room just because she could. I'd have kicked her out and banned her from ever coming back to my house if she were my mother.",
      "id": 78,
      "comments": [
        {
          "score": 264,
          "content": "I genuinely don’t understand where these power-play people come from. Neither my parents or my partner’s parents would ever dream of just moving our stuff. We redecorated a room recently and his dad helped out massively with the painting and stuff cause he’s out of work and bored otherwise and when we were putting the room back together he made some suggestions of where he would place things for best light/productivity and such… but they were suggestions and he respected what we wanted ultimately.\n\nOP is NTA and his mother needs to get off her damn power-trip or leave. I’m glad to see he ousted her for the disrespect.",
          "id": 79,
          "comments": [
            {
              "score": 63,
              "content": "Same. I have ADHD so while my house isn't a mess, I'm not exactly organized. I know where everything is though... *usually*. My MIL is extremely organized, it's impressive! But she would absolutely never rearrange our home. When she visits she asks me where I want things and she respects it, even if we run our home very different than she runs hers.",
              "id": 80,
              "comments": [
                {
                  "score": 12,
                  "content": "I'm ADHD too, and it's so much MORE important that no one moves my stuff, because if my things were organized, I'd never find anything. Out of sight, out of mind is literal with ADHD, if I can't see it it doesn't exist until I'm actively looking for it, and no matter how logical the organizaiton, it does me no good if I cannot retrace my steps and find everything exactly where I left it. My house has piles of stuff laying around, but that IS organized, just only by ADHD standards, not by NT standards. I know what my piles mean and can see everything laying out everywhere so I know where it is. If I put things away I lose them.\n\nUnfortunately for me, I am also physically disabled and heavily reliant on hired help for basic household cleaning. So my house is stuffed with stuff that doesn't exist in my head and I can never find anything I actually need.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Right. Like my in laws and I don’t always see eye to eye but they would never *rearrange my house*.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I work from home and if someone moved my desk I would be livid. My mom and Aunt rearranged my house, I knew they were going to do this before they came but I told them to stay out of my office. And they did, my living room had a bunch of new decorations but my husband nor I cared. It's about respecting people's boundaries.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 445,
      "content": "NTA\n\nHonestly you didn't need to justify this, your mother's behavior is super rude and bizarre in any situation. No one ever goes around just moving things in someone else's house, I cannot fathom any scenario that's okay to do.\n\nIt does seem particularly cruel to do to someone suffering from OCD.",
      "id": 84,
      "comments": [
        {
          "score": 14,
          "content": "The only reason I think the ocd is relevant is because it stands to reason that the mom is doing this on purpose to antagonize the wife specifically.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 418,
      "content": "Is this normal behavior for your mother? What she’s doing is not okay, obviously. And I would have very likely responded in the same way you did. But I wonder if this is a change that might be a symptom of something medical that might be going on.",
      "id": 86,
      "comments": [
        {
          "score": 320,
          "content": "Yes and no. She can be overbearing because she can have a her way or highway attitude at times but go this extent I haven’t seen her act like this before.",
          "id": 87,
          "comments": [
            {
              "score": 304,
              "content": "I noticed my dad acting in ways I'd never seen him behave before. Turns out it was the onset of dementia. When I read this, I was wondering if that was happening with your mom. Boundary violations and loss of basic manners seems to be some of the first symptoms. With my dad it was subtle at first, like chewing with his mouth open and talking with his mouth full, that sort of thing. It progressed into knocking on my door, at times nearly constantly when he knew I was studying or painting, to ask for the most trivial things like \"can you pick this up next time you're at the store\" or \"can you look for the kitty for me?\" I never minded helping him if he actually needed help with something, but most of the time it was things that were completely unimportant. He also would move my things, throw away my things, and I recently found he hid many of my things (he just went into a nursing home and I've been going through and cleaning up his stuff). It's something to think about",
              "id": 88,
              "comments": [
                {
                  "score": 79,
                  "content": "I was wondering this also. Not to armchair diagnose, but yes - a medical checkup would be a good idea. Not all assholes are sick, of course, and not all sick people are assholes.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "Another tidbit to add to this: some of what she’s doing objectively doesn’t make sense, like moving the coffee cups across the room from the coffee maker.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That's exactly why it made me think of my dad's behavior. At one point, he wanted me to have a bathroom installed in almost every room in my house \"because it increases the value,\" but I'm sure there's a limit to that, lol!",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "This is definitely something I was thinking as I read it. May well be worth getting her checked out, though OP is NTA if this turns out to be true.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This was a great share and food for thought. Ups for that.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I am going through this with my mom right now, so I also wondered if that could be what is happening here. I hope not, but worth looking into.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "How does treat your wife overall. Thanks for having your wife’s back.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I think she just got a first taste of \" or highway\" and didn't like it. Stand firm and she will realize, in your house, it's your way, or the highway.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Whether your mom is having a medical issue or not, talk about her moving things around like it is a concerning medical issue. It will put a spotlight on how inappropriate her actions are. Literally offer to get her examined because you can’t understand why she would do this otherwise.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Lol no problem, there's the highway ma 👋🏻",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Certain people exploit weakness. If your mother did this because your wife has OCD then brace yourself for more attempts to cause trouble in the future if anybody gets laid up with a serious accident.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 187,
      "content": "NTA, but Stop letting your mom over and tell your relatives to back off. Your mother is doing this on purpose, for whatever reason, maybe to stress your wife out. If this is a sudden change, she needs help.",
      "id": 100,
      "comments": [
        {
          "score": 61,
          "content": "The relatives are just mad because now they have to deal with mom instead of leaving her to OP.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah - it's obvious she doesn't like OP's wife because his mom moved his wife's stuff and not his.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 168,
      "content": "NTA \n\nAnd who wants to bet that the biggest reason your siblings are upset with you is because they’re having to deal with her in their house now?!",
      "id": 103,
      "comments": [
        {
          "score": 13,
          "content": "This was my initial thought!",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 141,
      "content": "I just want to scream.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nOk, I am calm now.\n\n&#x200B;\n\nYour mother is not \"helping\" anybody, because not only you did not ask for her to re-organise your house but also you are deeply uncomfortable with what she is doing. She is being utterly disrespectful and consistently violating your boundaries, not to speak of the shameful attemps at guilt-tripping she tried (and failed, I hope) to pull off. \n\n\"This is how she shows affection\" is not an excuse and it's not even true: what she is showing is not affection, it's something else entirely and if you go to a psychologist he/she will be able to tell you the right name. \n\n&#x200B;\n\nNTA, *ça va sans dire*.",
      "id": 105,
      "comments": [
        {
          "score": 28,
          "content": "I think it's a power play or something, especially after being told not to move stuff around.",
          "id": 106,
          "comments": [
            {
              "score": 24,
              "content": "Has to be either a power play or she's deliberately trying to set off OP's wife",
              "id": 107,
              "comments": [
                {
                  "score": 20,
                  "content": "Why not both? Yeah, it's a power play, coming into OP and his wife's home and rearranging things. She gets to assert her dominance over both of them, be in control, whatever. On top of that, if she manages to set OP's wife off, now that's an even bigger power play. \n\n\n\"Oh my God, look how crazy/unstable she is! I mean, all I did was move a cup!! I told you she's no good for you. Get a divorce and move back in with mommy so I can control even more of your life...I mean 'help' you\"",
                  "id": 108,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Moving other people's furniture is a form of OCD. I know people who have been treated by mental health experts for such behavior. The mother has learned to con people by saying she's only helping, but it's of course bullshit.",
          "id": 109,
          "comments": [
            {
              "score": 3,
              "content": "It can be a form of many things (including OCD of course, as you know very well), and on top of that there is a tendency towards emotional blackmailing and manipulation... this is why I am recommending a talk with a psychologist: this is something that you must learn to really know in all its aspects in order to understand how to react.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 94,
      "content": "NTA \n\nI don’t have OCD yet I would never ever, not even in my dreams, consider going to a friend’s house or a relative’s house and “show my afection” by rearranging things. Sorry, but this is just plain rude. This is your house, you choose how to organise it. She has no say in this. She can recommend and give advice, but at no point should she have the liberty to reorganise. \n\nStand your ground. You were completely right. And your first asked her not to move things around. It was her choice to disrespect that. Ergo, she’s out.",
      "id": 111,
      "comments": [
        {
          "score": 6,
          "content": ">I don’t have OCD yet I would never ever, not even in my dreams, consider going to a friend’s house or a relative’s house and “show my afection” by rearranging things.\n\nShe would've been gone after the second time. This would drive me nuts.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 78,
      "content": "Point out that you didn't \"kick her out\" you just gave her the choice.. quit treating YOUR home as if it's hers or depart..  she couldn't manage the former so chose the latter.\n\nNTA .  \nbtw.. that's pretty damn rude to visit someones house and rearrange the furniture.. I'm not even OCD and I'd be telling them to fuck off on day one.",
      "id": 113,
      "comments": [],
      "relation": "Support"
    }
  ]
}