{
  "post content": "My boyfriend \"Kyle\" and I have only been official for the past couple of months. Usually we hang at my place but last night, he thought it would be nice for me to come over to his apartment as his roommate was out of town visiting his parents. He wanted to cook for me, which I thought was super sweet until it actually happened.\n\nSo I went over and watched some TV while he cooked. He didn't want my help at all, which is fine with me because I'm admittedly a pretty shitty cook. Sometimes i'll make pasta but I do a lot of takeout. He made pork chops and sauteed some spinach. When we ate, he kept asking if I liked the food. The pork chops were great so I told him that. The spinach wasn't good, he used way too much oil but I didn't really care because it was really not that big of a deal to me. \n\nBut he just kept asking if I liked the dinner. Like we were talking about work and then he would just bring it back to if I really liked the food. I don't know how many times I had to compliment his fucking pork chops. I was kind of picking at the spinach and he specifically asked me if I liked the spinach. I said it was good because I honestly didn't want to get into a whole thing about it because again, I really appreciated that he cooked in the first place and some oily spinach didn't matter and it was edible.\n\nThen he was like \"You're lying, why are you lying?\" I then basically said I was eating it and I asked him why he was getting so fucking pissed about it. I was pissed off because he was getting so angry when I was trying to be polite and appreciative of his nice dinner. He told me that he didn't want a LIAR for a girlfriend. This REALLY pissed me off and I told him something like \"Fine, your spinach is fucking trash. It's garbage. ARE YOU FUCKING HAPPY NOW?\" I don't think thats exactly what I said but I was like beyond angry. He  got smug and smiled and was like \"I knew it. Was that so hard?\" \n\nKyle can be stubborn and obsessed with being right sometimes but on the other hand, so can I. I told him that he can enjoy the rest of his shitty spinach alone and I bounced out of the apartment. We've both texted that last night was \"crazy\" but neither of us apologized lol. But anyway, AITA?\n\nupdate: I showed Kyle this post and both of us are very amused that the final verdict is we both suck. We agree! All is well now and he wants you to know that the spinach wasn’t that oily lmao",
  "id": 1,
  "comments": [
    {
      "score": 1123,
      "content": "ESH\n\nHave either of you ever been in a relationship before? Like, one where you had to know how to communicate with other people?",
      "id": 2,
      "comments": [
        {
          "score": 297,
          "content": "ESH. \n\nRight? Like he needs to learn to back off but at the same time if her reaction was noticeably luke warm then he may have been concerned with her lack of real communication. \n\nI know for myself, I would rather a person be completely honest then polite. It took my bf a while to get used to but I really do prefer a “this spinach is straight up nasty” to a luke warm “it’s fine :)”.\n\nOP, if your relationship is gonna work both y’all need to talk and adapt. Or realize your not a good match...whatever just do something more than “politeness” and your bf do more than just pushing (is it so hard to say, “if you don’t like it it’s okay to just say so”?)",
          "id": 3,
          "comments": [
            {
              "score": 127,
              "content": "I agree that how the spinach comment was said was not necessarily nice, but it seemed like the guy was berating her to a breaking point - yelling at her and calling her a liar? I’d be pretty pissed if someone were treating me that way because I refused to negatively comment on their cooking..",
              "id": 4,
              "comments": [
                {
                  "score": 14,
                  "content": "Oh totally. I’m not condoning berating anyone. Just saying that they both have something to learn from this. Berating is not okay.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I wouldn't say he berated her, and he didn't yell. I would say he pestered her to her breaking point",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "It's not like she had to choose between saying it's fine and saying it's terrible. She could have said \"it's really good, the spinach is a bit too oily, but hey I'm not a cook so who am I to judge? Thank you for cooking!\"\n\n\nI know it's early in the relationship and they might not be comfy with each other, but my fiance and I will give each other constructive feedback on each other's cooking. \"The spaghetti sauce is good, just a little spicy. Maybe dial it back on the pepper next time.\" \"The asparagus is a little too hard, maybe we can try cooking it longer next time?\" It's really that simple.\n\n\nNot that he isn't in the wrong as well, just adding my two cents about how this could have gone down a little better. Communication people, communication!",
              "id": 7,
              "comments": [
                {
                  "score": 10,
                  "content": "And they might really, really value honesty. He's being a jerk about it, but especially when it comes to cooking, my husband knows that I like feedback so I can do better next time.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yep, exactly! Cooking yummy meals is a labor of love. I don't want him to quietly eat food he doesn't like when he could let me know ways to make it better.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "ESH for sure. \n\nKyle is asking for feedback on his cooking and is reading the situation and StAlvis reactions and realizes they aren't being up front. \n\nThe real question remaining to me is, has Kyle previously given them a reason not to be up front with constructive feedback? If you can't tell your SO when you don't like something (whether because of fear of confrontation on your part or fear of reaction on theirs) you probably aren't setting yourself up for relationship success",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 540,
      "content": "[deleted]",
      "id": 11,
      "comments": [
        {
          "score": 123,
          "content": "“Mr Right” is one of the abuser archetypes in the “why does he do that” book. I’m not saying that’s what is going on here, but to your point about this being an issue in their future, the need to be right can absolutely manifest as abuse under the wrong circumstances. They BOTH need to introspect and curb those impulses.",
          "id": 12,
          "comments": [
            {
              "score": 12,
              "content": "Yeah, why couldn’t he consider that 1, being angry doesn’t facilitate honestly, it makes people scared to tell the truth, 2, sometimes offering criticism makes people uncomfortable? It’s not like a requirement of him cooking was that she give him feedback. He forced her to be uncomfortable when she just wanted to eat dinner.\n\nPlus being weirdly smug about forcing someone to answer your question using anger at them, well, it’s fucking weird. He sounded legitimately happy she was uncomfortable...",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Wait what? Am...am I an abuser? My wife says sometimes I have issues with being right. I, uh don't know what to do with this information. Thank you?",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 212,
      "content": "ESH y’all sound 12 fr",
      "id": 15,
      "comments": [
        {
          "score": 7,
          "content": "Fr, read op’s comments",
          "id": 16,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 202,
      "content": "NTA.  You were being polite, and that is the correct polite way of being appreciative of somebody cooking for you when you don't like something.  He was an asshole for calling you a liar.  It is good to note in the future, that you should never sugar coat anything when he is doing something that you don't like.  But that was totally uncalled for.",
      "id": 17,
      "comments": [
        {
          "score": 23,
          "content": "Yeah, I don’t think she owes him a completely honest answer, this isn’t top chef or something. Usually when my SO makes something I don’t care for I will say, this is good, but it’s a little salty. Or, this is really nice, but I don’t like beets, sorry. The boyfriend has to be mature enough to accept the feedback, the gf also needs to chill tf out and learn how to give criticism without bursting into a rage over it. I would be frustrated in the same scenario, but yelling at someone isn’t how you vent your frustrations, even if they’re being rude.",
          "id": 18,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -71,
          "content": "Screw that noise. It is not polite to lie about whether things are good or not to a partner or family. They aren't stupid and all you are doing is planting seeds of doubt for anything they make in the future.",
          "id": 19,
          "comments": [
            {
              "score": 77,
              "content": "You absolutely shouldn't lie about whether you like something.  OP did not lie.  She was appreciative of his effort of cooking, and she emphasized the parts that she liked, and ignored the parts that she didn't.  That is a rational, way of showing appreciation to the cook.  If the cook didn't have a chip on his shoulder, he would have understood that the spinach wasn't that good to her.  But instead he behaved like an asshole, and called her uncalled for names.",
              "id": 20,
              "comments": [
                {
                  "score": -13,
                  "content": "He's a tool, we all agree on that. But Op did lie\n\n&#x200B;\n\n> he specifically asked me if I liked the spinach. I said it was good \n\nIt wasn't good. He asked what she thought. She said it was good.\n\n&#x200B;\n\nThen we have you coming in and saying it's the polite thing to do. It's not. Just come out and say the spinach isn't to your taste so that they learn and don't make it that way again.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Every family has different ways in which they were brought up.  Within many American families, it is polite to be respectful of the person who went to the trouble of cooking.  If something is really wonderful, you tell the cook it is really wonderful.  If something is good, you tell them it is good with enthusiasm.  If something is tolerable, you tell them it is \"good\", but without enthusiasm.  If something is inedible, you tell them gently that it isn't to your tastes, and you don't eat it.  Those are well within the norms of politeness, and I would not consider any of those things a lie.  They show respect towards the cook, that you appreciate their efforts.  It all depends on the customs of your family.  I do not consider OP to have lied.  I understand why you do feel that way.  Let's agree to disagree.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": "You said he has an obsession of being right all the time. So there's a slight probability that he might have cooked the spinach with extra oil to see your reaction. Because you did mention he being smug about it and saying that wasn't hard, was it?\n\n\nJust a possibility.\nNTA",
      "id": 23,
      "comments": [
        {
          "score": 44,
          "content": "I was also wondering if it was some sort of weird test; he deliberately messed up the side dish to prove....what? Very strange.",
          "id": 24,
          "comments": [
            {
              "score": 7,
              "content": "Maybe to see if she tells him the truth that the dish is messed up or if she lies.... But why? I don't know. It's messed up.\n\nAgain just a possibility.",
              "id": 25,
              "comments": [
                {
                  "score": 19,
                  "content": "I just think that he knew it wasn't good when he tasted it while eating, and the he asked her and knew she was lying.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 62,
      "content": "ESH. While I understand that Kyle hounded you for a response, you could’ve also been way more constructive. “I think you may have overdone it on the oil” would’ve sufficed, y’all could chuckle about it and move on. He could’ve been nervous, and it’s clear that he might not be a confident cook, probably wanted to impress you and knew the spinach was bad himself. It was nice of you to try to save his feelings, but it doesn’t seem like that’s what Kyle wants or needs. He could’ve been far more respectful in encouraging criticism on his cooking, and should’ve respected the fact that you didn’t want to say anything. \n\nCommunication is of the utmost importance in a relationship, and it seems like you both have issues w/ swallowing your pride and overall stubbornness. Use your “I feel” statements and tell him that it frustrated you when he wouldn’t let up about the food. Let him tell you what upset him. Discuss what you can both do better to avoid that kind of conflict in a constructive manner. \n\nY’all need to respect each other and the way you’re both acting is not how you do it.",
      "id": 27,
      "comments": [
        {
          "score": 41,
          "content": "He seemed smug that he got an angry reaction out of her, and honestly that's toxic. They both need to work on their communication",
          "id": 28,
          "comments": [
            {
              "score": 8,
              "content": "He also got angry at her for not being comfortable asking. The fact that he escalated to getting angry at her is disturbing. Being uncomfortable giving criticism isn’t a reason to get angry and force someone to answer. I’d be extremely creeped out if a guy cooked me food and then screamed at me to tell him the truth about how it tasted. It sounds insane.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 37,
      "content": "NTA. You tried to be polite; he wouldn't take yes for an answer. There are so many red flags with this guy that it looks like the surface of Mars.",
      "id": 30,
      "comments": [
        {
          "score": -21,
          "content": "I mean, she did lie though. Her behavior is full of red flags too. Like, even with your partner, when prompted for an honest opinion, you are still going to lie? \n\nI can kinda get the first reaction. As much as I dont like it, I understand some people avoid confrontation for whatever reasons, or misconstrue ass kissing for respect or politeness. Whatever the reason may be, that goes out the window when he then asks for an honest answer and then she continues to lie about it. \n\nI couldn't imagine trusting someone after they lie over something so petty and small. If you will lie over that, you will certainly be much more likely to lie about other things. \n\nOn top of that, when people actually want to get better at something it is important they get feed back. It's also important to me that my partner be able to give that feedback as they know me better than most, or presumably will at some point. \n\nClearly this wasnt communicated well by the BF. But OP isn't communicating well either. \n\nQuite frankly, they are both assholes. They both need to apologize. Then they both need to have a long, mature, frank talk about communication expectations that they have for their relationship.",
          "id": 31,
          "comments": [
            {
              "score": 12,
              "content": "Jesus, have you never heard of being polite? Women are in fact trained to be “nice” about shit like this. If you can’t tell the difference between a “polite glossing over of an imperfection” and a “breach of trust” level lie then you should not date.",
              "id": 32,
              "comments": [
                {
                  "score": 2,
                  "content": "I have and I explained. My issue isnt the initial white lie. My issue is when the bf communicates that he doesn't want that and wants genuine feed back and she doubles down on it. \n\nIf you can't tell the difference between me not preferring a certain communication style and me not understanding a basic concept you have no room to talk.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "[removed]",
              "id": 34,
              "comments": [
                {
                  "score": 2,
                  "content": "I am familiar with them. I just prefer not to have them as part of my relationship dynamic. \n\nI clearly explained that I understood as well. But then she continues to do it after bf clarifies that isn't what he wanted and he doesnt appreciate it.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "> I mean, she did lie though\n\nOh for God's sake! Telling someone their cooking is nice when it's not is just being polite.",
              "id": 36,
              "comments": [
                {
                  "score": 4,
                  "content": "Not when he communicates that he doesnt want her to just be polite and wants genuine feed back. Then she continues to insist it was good. At that point she is being disrespectful.\n\nthey both need to talk about communication. Maybe this is an impass and they can't communicate effectively and shouldn't be together. \n\nBut this certainly isn't as cut and dry as people are presenting it.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 36,
      "content": "[deleted]",
      "id": 38,
      "comments": [
        {
          "score": 4,
          "content": "probably very young kids",
          "id": 39,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 31,
      "content": "NTA.\n\nUnless he intends to be a professional cook and he needs your honest judgement - I don’t see the reason to potentially dispirit someone over excessively oiled spinach. It’s called being polite.\n\nI get if the meat was undercooked, or something that should be brought up for health concerns, but not spinach.\n\nThe fact that he harassed you about his food is unusual behavior that should be monitored. It could be nothing, but since this relationship is new - it would be best to keep note of it in case things turn more serious.",
      "id": 40,
      "comments": [
        {
          "score": -15,
          "content": "I disagree, I specifically hate being lied to about people liking my food because then I can't improve on it or trust that I will get their honest opinion. I have had actual arguments about this happen because I was blindsided by someone telling me they secretly hated something I had been making for a while- although it was nothing like this, more of a \"this hurt my feelings, I would rather honesty\" \"oh sorry\" type of thing. \nThis blew up up because OP didn't tell the truth even when she saw him getting specifically upset about the lie- when he was asking specifically about the spinach and asking \"why are you lying\"- and he didn't just explain why he wanted the truth, and that a white lie was more upsetting.\nIt comes down to communicating and knowing your partner. Some people like a white lie, and some people hate them, but if either op or her bf had better communication this would have been an easier solve. \nBoth of them seem to recognize that this got out of hand, which is good, but honestly this should never have needed to blow up in the first place.",
          "id": 41,
          "comments": [
            {
              "score": 16,
              "content": "From what op wrote it didn't seem like bf recognized any wrongdoing on his part. He wasn't looking for constructive feedback on the dish or trying to have meaningful conversation (as much as conversation about   spinach can be). He could have approached the conversation like \" I'm glad you enjoyed the pork chop but I found the spinach a little off. What do you think op?\" Instead he started a fight that led to a blow up and then he was smug about it. NTA",
              "id": 42,
              "comments": [
                {
                  "score": -15,
                  "content": ">From what op wrote it didn't seem \n\nGreat, now read it again, and imagine the conversation actually happening.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 30,
      "content": "This sounds toxic af😬",
      "id": 44,
      "comments": [
        {
          "score": 5,
          "content": "This whole relationship *is* toxic\n\n\nEdit: wording",
          "id": 45,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}