{
  "post content": "Longtime lurker here. Hoping some of you guys can weigh in on what has become a really frustrating situation with a close friend and his partner.\n\nSo my wife (29F) and I (29M) have been hosting dinner parties a few times a year for as long as we’ve lived in our current city. We like to go all out and cook elaborate multi-course meals, so we limit our invitations to just a few close friends, since cooking such a complex dinner is an all-day affair and the food costs add up quickly. We have about four to six people we invite to these events, depending on their availability, and it’s become a great tradition in our social circle. \n\nOur friend James started dating his girlfriend Sarah about a year and a half ago, and when we first extended her an invitation, we were informed that Sarah was vegan. I thanked James for letting us know and said she was more than welcome to bring her own food so she would have something to eat. He agreed, and the two of them have been attending our parties regularly for the past year. Everything was fine, until now.\n\nDuring our most recent dinner this past week, we noticed that Sarah was very quiet and looked like she was about to cry. My wife asked her what was wrong, but she told us not to worry about it and kept dodging the question, so we didn’t push the issue. \n\nHowever, after the meal, James took us aside privately and told us that Sarah felt hurt because we never provided any dishes she could eat at our dinners and it seemed like we were deliberately excluding her. He added that he thought we were being rude and inconsiderate by not accommodating her, which really pissed me off, and we got into a huge argument over it. \n\nMy wife feels terrible that Sarah was so upset and apologized to her and James profusely, but I don’t agree that we did anything wrong. I like Sarah very much as a person and I don’t have anything against her dietary choices, but I don’t believe it’s fair to expect us to change our entire menu or make an entire separate meal for one person, especially when so much time and effort goes into creating these dinners. For the record, nobody else has any dietary restrictions. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 28652,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 19630,
          "content": "I could actually understand OP's side for maybe the first dinner if they were caught a little off-guard by being told she's vegan.  But to exclude her for over a fucking year without making a single vegan-friendly dish is absolutely huge asshole territory.",
          "id": 3,
          "comments": [
            {
              "score": 3579,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 5486,
                  "content": "I agree.  The lack of a willingness to make a single dish for over a year is ridiculous.  And the lack of self-awareness to recognize that this would be an issue is stunning.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4687,
                      "content": "I don't understand how they're having multi course meals and literally nothing is vegan friendly for a YEAR. Wtf are they cooking that there are animal products in everything??",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Alright, I gotta butt in here with my \"remedy\". Super slick move here, so pay attention. OP needs to swallow his pride (I get it, in his mind, he's treating his friends with a special meal, nobody chips in, nobody helps, he wants to cook what he wants to cook, and Sarah chooses this lifestyle). It doesn't matter who is right and who is wrong. In relationships, either everybody wins or everybody loses. Apologize to the girl and your friend, suggest that they plan a vegan meal with you and \"teach you\" how to cook vegan. It'll be a fun couples cooking thing, allow Sarah and your friend to pass off the past as \"they didn't know how to cook vegan food good (I'll show them)(vegans tend to love this in my experience). Wounds healed, bonds stronger than ever, and if the meal isn't any good, at least they'll have been around to help cook, buy groceries, and clean up.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Exactly. As someone who also enjoys cooking for dinner parties, I’d see having a vegan guest as an exciting challenge, not an impossible obstacle.\n\nHell, I’d happily prepare an entirely vegan meal for all the guests every so often, too. It’s not like you’re limited to tofu and kale.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 221,
                  "content": "Dude, 6 hours notice would be enough. Chick pea curry over rice, 45 minute make time. Boom vegan food.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 81,
                      "content": "And both of those are pretty cheap, curry isn't too hard to make, its also something non-vegans might also enjoy!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "We're eating gourmet tonight. Here's some mediocrity to eat while you watch us enjoy ourselves.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 144,
                  "content": "[deleted]",
                  "id": 12,
                  "comments": [
                    {
                      "score": 10,
                      "content": "but a whole year? It's crazy.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "You don’t have to change the whole menu and it is not at all difficult to cook one dish that’s vegan if you are cooking the whole day for 6 people. You can even make something the day before since they don’t care about her that much lol.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Even if (for that first dinner) you just got some heat and eat from Whole Foods and said, \"I know it's nothing fancy, but I didn't want you to feel unwelcome,\" it would have been fine.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 605,
              "content": "Tbf, if the dinners are so elaborate with so many courses, I'm kind of surprised they managed to make literary every single thing non-vegan. I mean, potato wedges, rice, pasta, and even just a simple salad? They never had that on their menu?   \n\nI highly doubt it, which means they probably went ahead and added dairy, cheese or meat to literary everything, even though that once in a while they could have just made a little salad/potato/rice/pasta bowl on the side for the new friend.   \n\nOn the other hand, I don't understand Sarah. After a few meals it should have been pretty obvious that the hosts are not going to offer anything vegan. Then you can either decide to keep going, bringing your own food and have a good time. Or you don't go to their dinners anymore. What you don't do, is keep thinking that people will change and then cry when you realize they won't.",
              "id": 16,
              "comments": [
                {
                  "score": 262,
                  "content": "It's actually really easy to do that. Cream sauces, butter, cheeses, etc make many 'fancier' dishes non-vegan really quick.\n\nThat said, that they haven't served *any* vegan dishes in over a year is pretty telling. As easy as it is for everything to not be vegan, it's super easy to look up recipes for vegan alternatives that can be just as fancy.\n\nIt certainly looks deliberate to me from this side. YTA OP.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 19,
                      "content": "She probably came hoping even once they'd say \"Oh Sarah this is vegan!\"",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "> Cream sauces, butter, cheeses, etc make many 'fancier' dishes non-vegan really quick.\n\nbut even that would come across as being \"deliberate\" after several times. like, even if you cook this elaborate great sauce for something, it wouldn't be hard to serve it in a saucière (and isn't that the most common thing for \"fancy\" dinners anyway?).",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "It definitely would have made things easier, but i's very possible that Sarah is a non-confrontational person and didn't know how to bring it up. She probably enjoyed the company and atmosphere of the party, but just felt excluded. As an emotional person, I fully understand how quickly your tear ducts can deceive you - I spent many years learning to stop the waterworks before they start lol! It's also plausible that she felt it wasn't her place to request something just for her. Some people just aren't good at speaking up",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "> Then you can either decide to keep going, bringing your own food and have a good time. Or you don't go to their dinners anymore. \n\nYou don't want to excluded from your boyfriend's social circle because you are vegan. She tried her best by bringing her own food. Finally it would have been more about her boyfriend's friends not giving a single fuck about her for an entire year in spite of her trying to fit in with them. I wouldn't blame her at all. It is easy to say do or don't but under those circumstances it is tough to actually follow through on that. Some people can, most can't.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Would need to know if this is the only context in which they hang out. If this is just an occasional thing and they see each other all the time then it's kinda whatever if she misses out IMO",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "ngl, I've thought people would change but got hurt anyway\n\nEdit: maybe this was too personal but I guess it contributes\nI'm not vegan",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "YTA\n\n\"I really like Sarah\" and yet I dont think she is worth making even a tiny bit of effort for.  I am not suggesting that you roll out a full vegan menu but it wouldnt be hard to compromise and just embrace it slightly.  If you enjoy cooking so much, I struggle to grasp that you wouldnt want to at least have a go at a single dish to make Sarah feel welcome.  Personally I would have taken it as a challenge\n\nWhats even more astonishing is that you seemed shocked that Sarah felt left out and also shocked that Sarah had the patience to stick it out for a year before it finally got to her in a big way.",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Exactly. They've been together for a year and a half and usually at that point you start including people in your meals. It isn't that hard to make some small changes so she feels like she is welcome.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah for the first meal I kinda assumed the menu was planned. After that though they should have thought about it.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I could also understand if they didnt cook her such an elaborate full course thing but made sure at least a dish or two was vegan, maybe recommending she bring her own protein if cooking fancy meat AND a vegan substitute is too much. I've been vegetarian for years and I'm incredibly fine with usually only being able to eat some sides. They apparently make many dishes for these things, yet in a year never even made a salad? Some roast veggies? Fucking potatoes?",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1025,
          "content": "[deleted]",
          "id": 28,
          "comments": [
            {
              "score": 464,
              "content": "Steamed veggies with toasted almonds, baked potato (even microwaved), and grill up a freaking vegan sausage.\n\nThat meal would take 10 mins total.",
              "id": 29,
              "comments": [
                {
                  "score": 631,
                  "content": "Especially since their \"complex meal\" is an \"all-day affair\".  They spend an entire day working on this but can't spend 10 minutes on an easy vegan meal?  OP comes off as a snob looking for attention by showing off his culinary expertise.  Oh, the horror of being seen serving a vegan sausage and a potato.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 199,
                      "content": "I mean, to be fair, if I had spent all day preparing an elaborate multi-course meal, I would absolutely feel embarrassed to feed a vegan guest food that I didn't see as being up to par with what I was serving the other guests. I still think OP is the asshole for not even making an *attempt* to accommodate Sarah, don't get me wrong, but I do understand the feeling of \"if I can't go all in for this guest, what's the point?\" I just would then proceed to figure out something for the vegan guest anyway because that's the non-asshole thing to do.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 102,
                  "content": "Toss some broccoli in a bowl with olive oil, kosher salt, garlic salt, and a splash of vinegar. Put it on a baking sheet and roast it at 400F for 30 minutes. Takes 2 minutes to prep and you just set a timer and move on. And it's delicious.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Came to call OP an asshole, stayed for the delicious recipes",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I cook something like this but instead of vinegar and salt I use a bit of soy sauce. It's tasty but in my book it's more of a side than a main course.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "We do 450 for about 18min, but same general idea.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "Pasta drizzled with olive oil, toasted pine nuts, sauteed vegetables and garlic. Boom. Tasty.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 150,
              "content": "Do they even have to cook? I'm sure they could buy a nice vegan option at whole foods.",
              "id": 37,
              "comments": [
                {
                  "score": 89,
                  "content": "[deleted]",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 815,
          "content": "“Where are Mark and Alison?”\n\n“Mark developed a nut allergy, so they both had to go. Please welcome the newest members of our elite dinner party, Bob and Claire, who I just met on the street, but they have no food allergies or preferences, so I already like them better than Mark and Alison.”\n\n“But Mark’s your brother...”\n\n“I do not change my menu for anyone. Remember the *vegan*? I. Don’t. Think. So.”",
          "id": 39,
          "comments": [
            {
              "score": 48,
              "content": "This is actually a perfect illustration of what's happening here.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Hahahahahahaha omg. Spot on. The menu changes for **no-one**.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 745,
          "content": "Seriously, she was a good guest, bringing food without complaint. As we do being the parents of a vegetarian. But for an entire year they couldn't be bothered to make a single vegan dish for her. Imagine how amazing she would have felt if they'd made an occasional vegan dish to go with their menus, for everyone to have? Instead they were terrible hosts, who excluded one of their guests at every single dinner. And when James finally says something, its we shouldn't have to change the entire meal to accommodate her! She wasn't asking for an entire vegan meal asshole. Just one damn dish here and there. YTA",
          "id": 42,
          "comments": [
            {
              "score": 50,
              "content": "She didn't even ask for anything. She just said how she *felt*",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I agree. Op, YTA here. \n\nTo make up for this appalling lack of etiquette you have shown at your “fancy” dinners, you should absolutely ask actual vegans for wonderful dishes that you can make/bake and take as an apology to her.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Seriously, one dish a meal out of their many courses that the guest could try is just common sense and minimum hosting etiquette. \n\nImagine wanting to have people over and not wanting to feed them all?",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "> Seriously, she was a good guest, bringing food without complaint\n\nYes, when I read the title, I expected that she was one of *those* vegans and was ready to support OP. Instead, now I'm thinking that her BF's actually kind of asshole-ish for not saying anything earlier.\n\nAs an \"everything is better with some extra butter in it\" kind of person who enjoys to spend whole days in the kitchen to cook for friends or family on occasion, it would have made me seriously uncomfortable if I were one of the regular guest and I'd have to watch as time went by without there ever being something vegan. Even if you disregard common courtesy, how could OP even resist the challenge of experimenting with some vegan courses? Hell, there are enough great inherently vegan food options that I'm not surprised that it must seem intentional to her that there wasn't even a side dish during all this time.\n\nIt's bad enough that this had to be pointed out to him, and now OP is embarrassing his wife by acting like this on top of it.\n\nSo, you're the asshole, OP, YTA.",
              "id": 46,
              "comments": [
                {
                  "score": 12,
                  "content": "[deleted]",
                  "id": 47,
                  "comments": [
                    {
                      "score": 6,
                      "content": "> After a year and a half, you'd think at least a couple of dishes would have been vegan purely by chance.\n\nAnd others could have easily been adapted, or split into a vegan version without too much effort (e.g., you can make a great potato soup where butter is only added as the last step, because it needs to cool down a bit for butter to work as a thickening agent. Chia seeds with water can replace egg-white, and so on.)",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Exactly or just make her some sides she could have the same as everybody else!  Instead she is sitting there eating a packed lunch WTF",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 282,
          "content": "Other option: just don’t invite her or James every time. Just invite them to a few instances where it’s easy to have vegan options. I have oft not been invited to events that are all shellfish because guess what, I’m allergic. I’m totally ok with that.",
          "id": 50,
          "comments": [
            {
              "score": 198,
              "content": "*\"I excluded my friend and his SO to dinner parties because she's vegan... AITA?\"*\n\nYea, that's not really going to work if you think about it...",
              "id": 51,
              "comments": [
                {
                  "score": 17,
                  "content": "I mean it depends on if it's all the same people every time or not",
                  "id": 52,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "I suspect you'll find that Sarah is less 'another friend' and more 'that accessory James, my meat loving buddy, insists on bringing along, ugh'. \n\nI mean, if he doesn't have the care or compassion even NOW to understand what a rude fuck one would be inviting someone to an event and never making them able to access even a little of it, then Sarah clearly isn't seen as one of their friend-friends. So I imagine they're inviting old Jimmy-Jim here along whenever he can stuff his face, and neither Jimbo nor the hosts seem to see anything wrong with the 'weird freak' being left to eat out a Tupperware at their 'exclusive fancy dinner party' til she actually bursts into tears.",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 257,
          "content": "Right? Even just making a few sides and ask her to bring an entree would be nice. Or make like, a pasta dish. You can find vegan pasta pretty easily, especially now. A ton of sources can be/are vegan. [vegan gnocchi ](https://www.thecuriouschickpea.com/homemade-vegan-gnocchi-recipe/) is pretty easy to make and you get to brag and say you made your own pasta. Mix it up and make an Indian meal, which have tons of vegan options. And plenty of things are either vegan or can easily be made vegan. There are even vegan desserts that are pretty simple and so good - and everyone can eat them.\n\nThey make a multi course meal and NONE of it is? Even just on accident? Do they not eat vegetables?\n\nEdit: added some entree ideas because why not",
          "id": 54,
          "comments": [
            {
              "score": 206,
              "content": "[deleted]",
              "id": 55,
              "comments": [
                {
                  "score": 18,
                  "content": "So like do people realize that olive oil can be better to cook some veggies in than butter??? Butter contains water which creates steam, whereas olive oil doesn’t and you can get better browning (for example, I prefer to roast broccoli and potatoes in olive oil bc I want them browned/to have crunchy tips without overcooking). Omitting butter doesn’t ruin the flavor. If I desperately wanted butter I would probably add it after cooking, in which case it wouldn’t be hard to take a small portion out before I added the butter.\n(Edit: typos)",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 173,
          "content": "They don’t even have to be mains, it’s easy to have a side of roast vegetables or salad that doesn’t incorporate animal products, a simple pasta dish that doesn’t have cheese or butter in it.\n\nVegan people aren’t asking for the meal to be vegan, and they’re quite used to piecing a meal together from the things on the menu they can eat",
          "id": 57,
          "comments": [
            {
              "score": 22,
              "content": "Vegan here who eats at other people's houses fairly often. I always give ample warning and offer to bring my own food but never has someone not had a single thing I can eat. I can always piece together a meal and most of the time people didn't even have to go out of their way to make separate food for me.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I'm not vegan but damn do I like roasted vegetables. Olive oil, salt, pepper, some spices,boom! How hard would that have been for this dude with his elaborately planned meals? It's so easy. I think he doesn't like her. :/",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 110,
          "content": "As some one who is related to a ton of vegans, not fucking hard at all. And it’s kind of fun too!! \nYTA OP. Such an asshole.",
          "id": 60,
          "comments": [
            {
              "score": 13,
              "content": "I know this is going to be a controversial point possibly- as I know a lot of people on Reddit have *some* distain for the vegan/vegetarian lifestyle for whatever reason... or at least a lot of people aren’t engaged in it (I know I certainly am not)- \n\nBut just for being a dope human making another human feel good- imagine if you’d have done this in the opposite way. Like OP, imagine how loved, happy and included you could have made her had you been a little less of an asshole.\n\nImagine if you and your girlfriend gradually (maybe even after the first few dinners, if you want to be cautious- after getting to know her and whether she was going to be with your buddy for a while) started introducing small vegan options. \n\nImagine if you went above and beyond- if at first you said “hey; we’re trying to slowly learn how to incorporate a vegan option for you, but we’re still learning so it might suck! Could you make sure you bring something you’ll for sure enjoy while we learn?” I’m so positive she would have happily obliged and been even likely really happy you’re putting in an effort for her. \n\nImagine how included she would have felt the day you said, “hey- don’t bring anything! We made a few dishes for you” and you had a nice little side meal for her. Sure, putting some more thought, money and time into this- but really is it that much more? If you can’t afford a few vegan dishes then why are you even hosting a consistent dinner. You should be saving money. (But I have a sneaking suspicion it isn’t about money) \n\nIMAGINE- if fuck...  once you were sure she was here to stay after like a fucking year... you cooked vegan for everyone every now and then? God she would have probably felt so incredibly loved, cared for and accepted. Wow, what a way to reaffirm someone. You claim to like her, imagine how happy she would have been if you’d done that, “wow *my friends* (note; not my boyfriends) are making this concentrated effort for me.” \n\nMy friend makes the fucking best vegan fried “chicken” sandwiches. Like I mean INCREDIBLE, and so filling. Imagine if you cooked that? Or even something like it? Like- there are decent vegan options. I guarantee nobody would have minded, and I say that as a dude who probably eats way more fucking non-vegan shit than I should. Hell I suspect a lot of us do- like why not just have vegan every now and then to reset the system? \n\nThere’s a vegan Thai place by my apartment and it’s so god damn good. Man you could have just got a to-go dish from a vegan place if you didn’t want to spend any time on it... at least every now and then.\n\nBut you didn’t do any of this. A year and a HALF and you didn’t bother to do any of that, even once? Yeah **YTA**. A big one at that.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Add to the fact that she’s been coming FOR AN ENTIRE YEAR and they still aren’t even trying to make ONE dish for poor Sarah. I’d be heartbroken too. \n\nYTA OP.",
          "id": 62,
          "comments": [
            {
              "score": 5,
              "content": "And that she didn't even openly complain.\n\nShe just seemed sad and they kept badgering her about it. She didn't want to make a scene or seem annoying but apparently she wasn't cheerful enough to their standards.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I like they way op phrases it like eating vegan food would kill a non vegan. \n\nI'm not a vegan but I'll be damned of my 3 favourite places to eat are not largely vegan, like seriously even some herbed and roasted veggies would solve this issue and every one enjoys that.",
          "id": 64,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15816,
      "content": "INFO: Do you mean to say you have been cooking for this woman for more than a year and have never once prepared even a single course she could eat?",
      "id": 65,
      "comments": [
        {
          "score": 7951,
          "content": "This is the question at the heart of it. The first time sure. Years into it? Jesus I’m a bacon loving asshole but YTA if you’ve been doing this to her for all the time she’s come over.",
          "id": 66,
          "comments": [
            {
              "score": 2832,
              "content": "Yeah, I cook a lot and I'd have to make a REAL fucking effort to make even a single a meal that included absolutely no vegan options.  ~~I can see not cooking a vegan meal for a new girlfriend the first time she attends (who knows if the gf is gonna stick around), but a year?~~  JFC.\n\nEDIT: Actually, no.  I might say something like \"the protein will be meat so you're welcome to bring  a vegan protein if you like\", but I would a million percent have side dishes and a dessert the gal could eat.  It's not hard.  It's really not, and it's a considerate way to treat a fellow human.",
              "id": 67,
              "comments": [
                {
                  "score": 943,
                  "content": ">  I can see not cooking a vegan meal for a new girlfriend the first time she attends (who knows if the gf is gonna stick around)\n\nEven if she doesn't stick around, it doesn't exactly *hurt* anyone to be a decent human being. First time on short notice? Yeah, no biggie, tell her to bring her own and be done with it, sure. Second time, eeeh, this time around you kinda knew she'd be coming, didn't you? By the third time I'd feel fucking awkward as a host if I didn't serve something vegan.\n\nEven if my friend's partner doesn't stick around, I can still treat her like a human being in the meanwhile. She's not some kind of accessoire to him, so if I invite her over, I'll at least try to accomodate her somehow.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 409,
                      "content": "[deleted]",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Especially because OP said they invited only a couple close friends. So the friend is close enough to make the cut and OP still doesn't give a funk.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I love to cook, and I love to cook vegan food that is amazing for my vegan and veg friends since they always have to make do. They are so appreciative! Plus it is just plants....like not that hard to make delicious for real.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I wonder anyways how you think you make elaborate multi-course meals, but literally everything you prepared includes meat, milk and/or eggs.\n\nI love to cook and I love meat, and I would consider it an extreme lack of variety if every single thing includes meat. I mean, this is probably the adult version of \"I add ketchup to all my food\". Maybe the more hurtful truth is that they are indeed no assholes, but not such great cooks as they think.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 480,
                  "content": "Right? Not even a salad or veggie side? Half of my meals are vegan BY ACCIDENT.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 168,
                      "content": "[deleted]",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 284,
                  "content": "Plus, that would be a fun challenge! \"Hey guys, we've made a full vegan meal, minus the roast chicken cause most guests like meat, hope you like it!\" \n\nAs a foodie, nothing's more exciting than trying new recipes. It's all about balance. The umami taste can be brought by other things than meat! Mushrooms, roasted nuts, spicy hot tofu...\n\nYTA, I'd be ashamed to not offer at least a side to her, *in over a year time!!!...*",
                  "id": 75,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I did exactly this at a party I threw last weekend. My friend has a new girlfriend we met only a week before the party. She was vegan, so I made two vegan casseroles and a roast. Everyone loved the vegan stuff, and the meat eaters could turn to the roast if they needed to get their protein on. My vegan pumpkin pie vanished--every guest ate their whole piece, some came back for more. Everyone was happy. My friend and her boyfriend were thrilled. It didn't even occur to me not to accommodate her. Not bragging, it's just... weird. To invite someone over for dinner and not have something they can eat.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Yeah, challenges are so fun and interesting!  I've done vegan meals, gluten free meals, VGF meals, low carb meals, low FODMAPS meals, no tree or peanuts meals, local foods only meals, seasonal foods only meals- it's so fun to stretch your cooking muscles!\n\nWhen I'm cooking for a group with veggies and vegans, my go to main dish is stuffed portobello mushrooms.  (wild rice, veggies, cannelini beans, marinara sauce for the stuffing, brief marinade for the mushrooms, delicious.)  Ironically, I hate mushrooms and also roast a chicken so I'll have something to eat.  I make double when I need for the vegans when cooking for a crew because the meat eaters ALWAYS go \"that looks so tasty, can I have that?\"\n\nI agree, I'd be ashamed.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "This all reminds me of the year I hosted Passover (which is basically a weeklong carb-free diet) and invited a non-Jewish friend who was practicing veganism for Lent. I can't say it was the most *fun* meal to figure out, but it was definitely a hell of a challenge.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "this! long before i went vegan, i decided to make thanksgiving dinner (while my dad cooked the turkey) and i made a totally vegan meal except for the bird, just for fun! it was a cool experiment and i got to have so much fun in the kitchen, and i hadn’t even considered being vegetarian yet, let alone vegan and the meal was just for my immediate family, which had no vegans or vegetarians at the time.\n\npart of enjoying cooking and being a foodie is taking on new challenges and enjoying them!",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 192,
                  "content": "Not only that, but if you're SOO into cooking that you host these elaborate affairs, you'd think flexing your culinary muscle just the tiniest bit by finding a  vegan dish to compliment the menu would be a welcome challenge.\n\nTwo members of my extended family are vegan. We don't plan meals around them, but I always have 1-2 items available and often use it opportunity to try a new vegan recipe. \n\nOP is TA.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Right! No one is suggesting the entire meal be vegan. Just a side or two and/or a dessert or the like. Bread not buttered while cooking. I mean unless all the vegetables are cooked in chicken broth it’s not hard. But also the bf could have said something months ago like, “hey guys, it would mean a lot to me if you could have a side that gf can enjoy. She doesn’t mind bringing something, but I could shoot you some ideas of a dish she can eat with everyone else.” Once you’re already there, not much they can do. I’m not suggesting it’s cool that they never once seemed to have managed this, just that he could also have set the expectation as well.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah, James (bf) is not innocent here, IMO he should have either stopped attending or said something months ago.  I cannot imagine inviting my long-term sweetie to an event with this dynamic month after month, and just acting like it's normal.  I get that it's a tasty dinner, but I just couldn't stomach it.  I'd rather stay home and cook a nice meal with my sweetie than engage in this dynamic month after month after month.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "It’s also the point of dinners... hospitality, friends, love. The point is not to show off your meaty food.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yeah, this seems weird. I legitimately can't remember the last completely vegan meal I ate, but pretty much every meal I eat involves at least something like steamed or roasted vegetables, salad, cut fruit, etc. All you have to do is include some kind of bean (black beans, pinto beans, hummus, roasted chickpeas, etc) and you're basically done.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1173,
          "content": "It’s not like it’s even that hard to make sure at least a couple of things are vegan, people who aren’t vegan can still enjoy side dishes without animal products. At this point it probably feels like a deliberate snub.",
          "id": 85,
          "comments": [
            {
              "score": 367,
              "content": "Right? Like damn roast ot steam your veggies dry and have butter on the table to put in then if you think they need it",
              "id": 86,
              "comments": [
                {
                  "score": 448,
                  "content": "Or use olive oil, it's delicious. Substitute milk for almond milk, butter with oil or vegetable one. They could make a ratatouille, it's just a lot of vegetables cooked in olive oil, really good, eat it with rice and you have your meal. How can someone love to cook like OP but can't make a salad or a dessert without animal product? It's really not hard if you try... It's 2019, the internet is filled with vegan recipes.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 172,
                      "content": "People can love to cook and still suck at it. I know lots of people that \"love to cook\", and that basically means they're good at steak and homemade potato wedges or something like that.\n\nAlthough yeah, it doesn't exactly sound like OP falls into this category when talking about \"elaborate multi-course meals\".",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": ">It’s not like it’s even that hard \n\nNot only is it not hard, but for people who love to cook, it should be an exciting challenge. I love meat but have been trying to cut back on it, and have found some very interesting vegan recipes that make me excited about buying new-to-me ingredients and trying different techniques. They should be viewing this as an opportunity to challenge themselves and bond with a new person in their friend group through their hobby.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 873,
          "content": "As an omnivore who loves to cook, OP is a huge mega asshole. I would be thrilled at a reason to try out and research some vegan recipes. There are so many fantastic amazing things you can cook that happen to be vegan. Isn't that half the joy of cooking? Trying out *new* things.\n\nThey absolutely don't need to make an entire vegan meal, but not once in a single year have they ever cooked a single vegan dish?\n\nYikes. What shitty inconsiderate people. (And also, probably not very good cooks if they're that afraid to cook outside of their comfort zone.)",
          "id": 90,
          "comments": [
            {
              "score": 301,
              "content": "Sometimes I wonder if I'm overly solicitous toward vegetarians and vegans because I grew up in a region where half the population seemed to follow those diets, but this feels like such a failure of hospitality here. How hard is it to at least come up with an appetizer and dessert she can eat? They can't have one main course where they swap out the meat for a meat substitute for her dish? This is so mean. We cook a lot and love to host, and my husband would absolutely bitch and moan about having to cook vegan, but he wouldn't dream of NOT providing a vegan option and telling a guest in our home to bring her own food. So, so mean.",
              "id": 91,
              "comments": [
                {
                  "score": 341,
                  "content": "ETA: Thanks for the silver and the \"Diamond in the poo\" awards!  I'm especially delighted by the diamond, glad to know I made your read worth it :)\n\nSame.  I have friend who are vegan by choice and some that can't eat mammals because of allergies.  It is not hard to come up with at least a nice range of sides that are vegan, or just leave the cheese and bacon off one serving of green salad.  It's just really rude to leave someone out this completely.\n\nI am so so petty, but if someone did that to me I would bring the most amazing, beautiful, delicious vegan meal for myself.  (I'm not a vegan, I'm just petty.)  Like, full on 4-5 course meal with some lovely finger foods for before dinner, an amazing salad (spinach and strawberries with candied pecans and balsamic vinaigrette probably), lovely carrot ginger soup or something more seasonally appropriate , awesome plate of mushrooms stuffed with wild rice and vegetables and other tasty treats, perfect vegan chocolate chip cookies that I warm up in my host's microwave so they're warm and gooey and so so delicious.\n\nWhen other guests asked me about it (and they will, people are nosy) I'd cheerfully tell all the other guests how nice it was that OP permitted me to bring my own food, as they knew ahead of time that absolutely nothing they were planning on preparing would be vegan.  Not a single solitary dish.  How sweet of them to warn me so I didn't arrive empty-handed for this lovely relaxing meal with friends that I wouldn't be able to eat a bit of!\n\nI would not share a single morsel, and I would never, ever visit their home for a meal again unless they really apologized.  OP is just an inhospitable boor. And I am SO petty.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 26,
                      "content": "You are my hero and I love you!",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "You're god damn fucking right",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Nailed it! Lmao",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "ily",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I live in the 'good old red blooded' Midwest US where \"if there ain't meat it ain't a dinner\" types of viewpoints are relatively common, basically the closest to a \"carnivorous\" lifestyle humanity has to offer, and even then I can say without a doubt any party/cookout/dinner, hell even when people get together to smoke meat there's honestly *always* side options on the table that are veg/vegan, even if its usually incidentally. Even then, everyone I know that likes to host cookouts and stuff will bare minimum keep some black bean burgers or something in the freezer as \"emergency rations,\" or ask them to bring/recommend something to throw on for them. Plus I would say a great number of dishes can be easily set up to easily divide out a vegan portion from the main affair if its too much of a bother. Plenty of things add the meat or dairy at the very end, oils can replace butter in a number of applications, veg stock instead of meat stock is perfectly viable. As an easy example I just made gumbo for a mixed preference crowd, I just reserved portions when the meat went in and simmered it separately, nbd. Or just make two batches in parallel, the prep is shared so its not a big change in hassle. Even if it takes a little longer, not doing that is blatantly telling your friend \"you're not worth mere minutes of my time.\" If you love cooking big dinners, wouldn't this just be a welcome opportunity to be more creative? That's how I see it, at least.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 249,
              "content": "Man, after a while of her coming over for these events, I'd probably make an entire course and / or plan a dinner AS vegan. Indian food is bomb and a lot of it is vegan, or can be made that way, just for one example. I'd do a GF meal if a friend was GF, or an <insert heritage> meal for someone missing their home country, too. I don't just love cooking, I love it when people ENJOY my cooking. It's the whole point imo.\n\nIncluding everyone should be an obvious thing for a dinner party even if you're not the way I am, though. Like damn.",
              "id": 98,
              "comments": [
                {
                  "score": 57,
                  "content": "Me too! I love to bake and I love baking for my vegan friends - it's like a challenge almost, can I make something tasty that's outside of my normal comfort zone? The whole point of cooking for other people is that feeding people tasty stuff they can actually eat brings joy!",
                  "id": 99,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Same!  Also, some vegan baking is awesome because often it uses shelf-stable pantry basics!  [Like, if you don't have butter then make these vegan chocolate chip cookies](https://www.kingarthurflour.com/recipes/vegan-salted-chocolate-chip-cookies-recipe).  If you're totally out of eggs and milk, you could still make a vegan [vanilla cakepan cake](https://www.kingarthurflour.com/recipes/vanilla-cake-pan-cake-recipe) or [chocolate cakepan cake.](https://www.kingarthurflour.com/recipes/king-arthur-flours-original-cake-pan-cake-recipe)  It's great to have those recipes around when you're snowed in (or just too broke to afford eggs this week).  Yum!",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "See, I *hate* cooking but if I were having somebody over with a restriction, I'd make sure they could eat something because I'd just be embarrassed not to!\n\nWhat a terrible host.",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": ">I would be thrilled at a reason to try out and research some vegan recipes. There are so many fantastic amazing things you can cook that happen to be vegan. Isn't that half the joy of cooking? Trying out new things.\n\nExactly. He makes out like he and his wife are accomplished cooks and they not only don't relish the opportunity to try something different but they can't think of *anything* they could throw together for her? You can make a veggie stir fry in 10 minutes for crying out loud.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "> As an omnivore who loves to cook,\n\nSame.  Heck, I'm thinking you should be able to make a pretty awesome vegan gumbo without much effort.  And if you don't want the whole meal to be vegan, make a batch and just before you add shrimp and sausage, split some out to add tofu or something to hers.",
              "id": 103,
              "comments": [
                {
                  "score": 15,
                  "content": "Key point. You make good vegan food by splitting off dishes halfway through cooking. You don't even have to make something from the ground up. Which kind of shows OP is a little mean and under-the-radar spiteful. Why would anyone want to hang out with people like that?",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Also an omnivore, but I love a good vegan dish. There’s this awesome blog with drool-worthy photos and some of the most impressive vegan dishes I’ve ever made. The blogger missed lox and bagels, so she figured out how to make carrots have a lox-ish texture. I made it myself and it’s incredible!",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 576,
          "content": "This is the thing that baffles me. Like, how have they never even *accidentally* made a vegan dish? There are plenty of appetizers, main courses, and desserts than are vegan. They can't manage to make even one of these something she can eat? Not even at every meal, just every other meal? Just to be *nice*?",
          "id": 106,
          "comments": [
            {
              "score": 49,
              "content": "In the words of Adam Rageusa, not every meal needs an animal in it! I'm eating a vegatable soup right now. Its vegan. I didn't intend to make a vegan meal, i just made a recipe that I like which happens to not have meat in it.",
              "id": 107,
              "comments": [
                {
                  "score": 15,
                  "content": "Vegan is harder than vegetarian though. Although really that means olive oil instead of butter.",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I once made a really nice dish after seeing the recipe somewhere and being interested, it turned out delicious and only afterwards did I realise it was vegan. (Maghmour, so tasty, I sometimes make it with Lamb if I’m feeling like meat but it’s no worse without)\n\nIt sounds like OP went out of his way to exclude this poor woman.",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "I'm thinking maybe they have accidentally made vegan dishes but never thought to present it as such, and the girl was too embarrassed to ask because she didn't want to be, \"That vegan\" who asks what is in everything and makes a big stink. Especially if she already felt unwelcomed. If I'm cooking for people with dietary restrictions, medical or voluntary, I always make a point to tell people what they can and can't have, and am transparent with what is in the dishes so they know for sure.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Lard. Lard in everything. Lard hep us.",
              "id": 111,
              "comments": [
                {
                  "score": 19,
                  "content": "I'm thinking these people might even be spiking the wine with bacon grease.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Mmm mmm, great mouth feel ^GAG",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Seriously. I ate at a 10 course Michelin star restaurant last month and looking back at the menu, at least 4 of the courses were vegan or could be easily adapted to a vegan palate. Tomato vanilla consomme (just sub the caviar), fairground onions, bread and drippings (avoid the lard and drippings and just use the celery sauce), and the lemon sorbet.\n\nIs he just slathering everything with butter and cheese?",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "that’s my problem. if it’s been a year or longer, that is MORE than enough time to learn how to cook at least one vegan meal. it’s not hard to learn vegan cooking, and there are a LOT of dishes that are easy to learn and easy to make. OP is definitely TA. if understand if he didn’t make something the first time and was caught off guard, but this long ... are you kidding.",
          "id": 115,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 93,
          "content": "Seriously OP. I cook a lot of fancy shit, and there are so many good things that are effortlessly vegan. Especially sides. I’m eating leftover fennel, apple, and walnut salad RIGHT NOW that’s vegan. It’s not even that disruptive to choose dishes that everyone can eat.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Honestly, I don't understand how they haven't made a vegan dish by accident. Is everything cooked in bacon fat or something? NOTHING didn't have animal products?",
          "id": 117,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "This INFO comment sounds much more damning than the top-voted YTA. I love it.",
          "id": 118,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Riiiiight? How did he not *accidentally* make a vegan dish?!",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This is what it seems like. Massive a-hole if that's the case. If he wants to argue cost then it would've been cheaper to do a vegan meal every now and again over the course of over a year.",
          "id": 120,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10106,
      "content": "I... I mean I get it, I suppose. But dude she's been coming over a year and a half and it's not that hard to make vegan food, it does seem like you guys are deliberately excluding her. You don't have to make a full meal, you can make at least one dish she can eat though. \n\n&#x200B;\n\nYTA",
      "id": 121,
      "comments": [
        {
          "score": 1111,
          "content": "Just a mash potato or coleslaw wouldn't cost much in my opinion ... or even like some other people said, they could have get Sarah to help them with some preparation..",
          "id": 122,
          "comments": [
            {
              "score": 495,
              "content": "Non-vegan mashed potato has milk or butter, Cole slaw has mayo which has eggs. They would have to cook vegan versions of those beyond the default.",
              "id": 123,
              "comments": [
                {
                  "score": 595,
                  "content": "Theres vegan mayo, it tatses the exact same. (Not vegan, but have hosted people allergic to eggs.)",
                  "id": 124,
                  "comments": [
                    {
                      "score": 267,
                      "content": "Yes, there is and you can use soy milk. I am just pointing it out as a lot of people in this thread are acting as though it is unlikely that he would unintentionally make no vegan dishes, whereas unless you intentionally make vegan it likely won't be.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Allergic to eggs here, what is the brand? I haven’t been able to find a mayo replacement since I found out. Not one I like anyway.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "[deleted]",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "There are vinegar slaws",
                  "id": 128,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I was gonna say. Vinegar slaws are my jam.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Coconut and squash cream soup. Veggie stir fry with jasmine rice. Exotic fruit platter. Tomato bruschetta. \nFour course meal that looks fancy if you arrange it nice and it's easier that pie. Literally, literally!\n\nThey could have made chinese food, lebanese food, italian food etc all original recipes that didn't have to be altered in any way to be turned vegan. It's like they did it on purpose...",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 232,
          "content": "I can't cook for shit and even I could throw together some potato wedges roasted/sauteed with some olive oil, rosemary, and garlic. You don't have to be vegan to love some freaking garlic potatos. \n\nI'm amazed that through the entire course of the year with OP supposedly making these elaborate meals - he didn't even accidentally make a single vegan dish. No grilled asparagus with a little bit of salt, no cabbage wedge salads, not even a freaking salad in general.\n\nHow. HOW. Unless they were intentionally doing it to exclude her.",
          "id": 131,
          "comments": [
            {
              "score": 32,
              "content": "OP forgot to include he slathers bacon grease on all his elaborate dishes as a base. /s",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I agree with you. There’s many super simple vegan dishes you could make that wouldn’t “add up to the cost” at all.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "[deleted]",
          "id": 134,
          "comments": [
            {
              "score": 13,
              "content": "You mean...just have some vegetables with dinner?? Are you crazy? /s",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "I generally believe in letting folk do whatever they like, but this bizarre separation between \"good/normal\" food and \"vegan\" food is baffling. Lots of dishes are naturally vegan?? Roast some vegetables. Make a hearty soup. Can't even do two extra steps and make a bitch a bowl of rice?? Damn. \n\nSo she shows up to their amazing dinner party with multiple courses and her... tupperware... which she microwaves before sitting down, like she's on break at work? That shit is *ice cold*.\n\nYTA",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "do a fucking stir fry and put the meat in at the end. not hard.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7800,
      "content": "YTA. Really? You can’t even make one dish vegan? They’ve been dating over a year and a half, and you continued to invite them over knowing she’s vegan. It does seem like deliberate exclusion. You don’t have to redo your entire menu, but Jesus, at least have something there for her to eat. It’s not that difficult, and it shows respect for your friend and his girlfriend.",
      "id": 138,
      "comments": [
        {
          "score": 1782,
          "content": "They could have made so many things right... They can eat vegetables and potatoes ?? No one in my family is even close to vegan but I can name a few dishes they've made that were coincidentally vegan",
          "id": 139,
          "comments": [
            {
              "score": 1353,
              "content": "That's the part that amazed me, and is likely why Sarah felt excluded. I probably have a couple of vegan meals a month, not out of any conscious decision to eat vegan, but just because sometimes I want to make tomato/butternut squash soup for dinner or something like that.\n\nAnd sure, maybe your personal recipe for those things would normally contain say meat stock or something, but if you \\*know\\* a vegan is coming, would you not think to ever try experiment with a vegan meal on occasion?\n\nLike, OP clearly loves cooking if they're happy to regularly host for dinners, but they don't want to branch out and try new things?",
              "id": 140,
              "comments": [
                {
                  "score": 918,
                  "content": "That is what’s weird. It’s like they are saying “I love to cook and try new recipes, but I refuse to consider any recipe that doesn’t include animal products.” I would think someone who loves to cook would see it as a fun challenge.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 275,
                      "content": "Omnivore who loves to cook here. I would love the challenge.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 69,
                      "content": "For real.  I wouldn't even say that I \"love to cook\" - like, it's fun sometimes but sometimes it's annoying?  But I hosted christmas dinner one year while my sister in law was breastfeeding and trying to figure out what was giving her baby a rash, so she couldn't have dairy or a big long list of other things.  It was exactly that - a fun challenge to find dishes that would be yummy for everyone and also work for her diet.  I've done FODMAPS before and that was less fun but also doable.  What the hell kind of asshole can't find a single thing that doesn't have animal products in it to serve to guests?  The internet exists and there's a vegan version of damn near everything out there.  There's a goddamn Beet Wellington recipe.  Inviting someone to your house and saying \"oh, hey, but bring your own sandwich or whatever since you're so picky\" is straight asshole territory.  I guess I get her coming the second time in the hopes OP was willing to branch out a bit on more notice, but I'd have stayed home for the third invitation.  Fuck that noise.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Right? It would be such a great feeling to throw down an absolute banger of a meal and be able to say, \"And guess what? It's vegan!\" and break the stereotype that all vegan food is boring.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "Years later I still prefer some of the vegetarian options over their meat alternatives. I've been back to eating meat for years, but some of the vegetarian/vegan options are honestly just BETTER.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This! There are so many vegan substitutes to things that don't compromise the flavor at all. \n\nA dish needs chicken bouillon? Use vegetable bouillon! \n\nNeed to try something? Use olive oil! \n\nI really didn't think they were TA until it hit me that they really didn't make one vegan friendly dish in the year and a half this woman was coming over.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I generally agree, but that said, it's also very easy to accidentally make things that aren't vegan. Whenever I have dinner with my mom, she'll make things she thinks are vegan, but it's just how she's always done them, so she forgets things like butter or milk aren't vegan products.\n\nThat said, if OP was really a conscientious host, they would have gone out of their way to at least provide a few vegan dishes. If not a protein, at least some sides.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Hell I looked down at my dinner and realized it was accidentally vegan",
              "id": 148,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 184,
          "content": "When ever i see posts like this i wonder if they ever eat vegetables (atleast without being smothered in butter, cheese, etc). Its not hard to make some side dishes that are vegan, and it probably would be good for them to eat more veggies anyway.",
          "id": 149,
          "comments": [
            {
              "score": 22,
              "content": "I swear some people think veggies are only good with butter or ranch. Like, hes telling me he can’t throw some chopped veggies on a tray with olive oil and some seasoning and toss it in the oven? \n\nI have friends with allergies and every dinner, every birthday party, I make sure there’s egg- gluten- soy- and dairy- free options so they and their kids can all eat. It’s not that hard to be considerate.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I eat meat, I’m not remotely vegan, and yet somehow I manage to eat meat way less than anyone else I know (that doesn’t deliberately try to cut out meat or is vegan). \n\nI manage to have meat in my meals maybe once a week. People look at me like I’m crazy. It’s like people can’t fathom not having some form of meat as your main meal (or as a major part of it). \n\nAs for animals products in general... well I do eat a probably average amount of eggs/butter/cheese etc. \n\nBut it I wanted to it wouldn’t be at all hard to substitute them with vegan alternatives or cut them out entirely (though cutting them entirely may be somewhat challenging). \n\nPeople in general just can’t fathom not eating meat every day or so. Much less eating raw veggies (or just steamed etc). I know a large amount of people that would gag at the thought of having a meat/sausage/roast free vegetable soup for dinner. Which I personally find crazy.",
              "id": 151,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Exactly. I mean sure, maybe ask her to bring her own main protein course (since likely everyone else is eating a meat dish of some variety), but having sides, hor d'oeuvres, or desserts at least. There are hundreds (probably thousands) of vegan recipes that can be sufficiently fancy for this multi-course dinner.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": ">It does seem like deliberate exclusion.\n\nNo kidding, an all-day affair to prepare. Imagine being a fly on the wall while they prepare. When they consider maybe one or two things that can be adjusted, but they're just like eh it's just for Sara let's just add in the cheese instead of leaving it on the side. \n\nThe fact that it's a smaller 4-6 person dinner, which I think makes it even worse because one would have to CONSCIOUSLY consider that you don't want to make a dish suitable for a guest.",
          "id": 153,
          "comments": [
            {
              "score": 6,
              "content": "Yes much worse!",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Seriously, I will go out of my way to make sure people have things to eat if they come to my house. One friend is allergic to shellfish, several are vegetarian, one vegan. Fuck if I care if I have to make special meals for individuals, that just shows them how much you care.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Right I can think of 3 meals off of the top of my head that I make OFTEN that are vegan/can easily be vegan- butternut squash soup (dollop of sour cream at the end for non vegans), lentil dal, spinach black bean and coconut curry (made that shit for dinner tonight coincidentally bc it’s DELICIOUS). Like how do you not even make roasted potatoes with olive oil??? Coconut ginger carrot soup? Wtf so many things I cook are vegan without even trying",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": ">and it shows respect for your friend and his girlfriend.\n\nThis is the big one. It shows that you want her there, that you appreciate that -- out of all the things she *could* be doing tonight -- she's spending the evening with you.\n\nMy dad is the biggest ball-buster in the world. Talks endless shit about everything he doesn't understand, including vegetarianism, veganism, whatever. When my brother brought over a vegetarian girl for dinner, he made her eggplant parmesan while we all had chicken cutlets.\n\nIt took him maybe 10 minutes of actual effort, and it made her feel included and comfortable the rest of the night.\n\nIf my dad -- whose history in discrimination is too long to include in a reddit comment -- could make a vegetarian feel at home, so can you. Just give a bit of a shit.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It’s not even that hard, one pasta dish that’s vegan. That’s all it takes.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "If people think it's hard cooking vegan they're fucking lazy.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5983,
      "content": "YTA. Your brilliant hosting consists of providing a chair.",
      "id": 160,
      "comments": [
        {
          "score": 1877,
          "content": "Please sit here and watch while all of us eat an elaborate multi course meal and discuss how good it is.",
          "id": 161,
          "comments": [
            {
              "score": 1118,
              "content": "I'm imagining the host deliberately putting butter and cheese on every side just to spite the vegan. Seriously, you have to **try** to go this long without any vegan options. \n\n\"Because I'm not changing the *entire recipe* for one person!\"",
              "id": 162,
              "comments": [
                {
                  "score": 265,
                  "content": "Right, either this or I’m imagining really...large people who think you need to cook everything in lard or butter...",
                  "id": 163,
                  "comments": [
                    {
                      "score": 230,
                      "content": "I'm imagining his \"big, elaborate courses\" consisting of just grilling random shit and refusing to clean the barbecue to do some vegetables. Every meal. For a year. \n\nBecause that's the only way you can think you're good at cooking and not accidentally make something vegan.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Honestly sounds like my sister's house. I was vegan for a while (now vegetarian) and they laughed at everything I ate. We went out to dinner and I got a huge salad while I watched my sister pick the tomato off of her burger. She loves to cook but her idea of \"fancy\" is cheese-covered x or meat soaked in y.\n\nAnd then these people have the nerve to say that it's \"genetics\"...",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 537,
              "content": "What actually baffles me is that everyone ELSE just kind of went along with it.  \n\nI'd be fucking outraged if someone treated my girlfriend or even someone I only saw once a month at dinner parties like this.  \n\nI'd be bringing vegan foods and treats for them by the third month and would quite attending entirely by the 6th or 7th.  The whole situation is just so toxic and mean.  How did so many grown-ass adults exist in this dynamic for over a YEAR?!?!?!",
              "id": 166,
              "comments": [
                {
                  "score": 158,
                  "content": "Exactly! After like the second time I would suggest to turn it into potluck just so I could make something vegan for her.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 101,
                  "content": "I am also wondering why the boyfriend never called ahead to say “Hey can we please make sure there’s at least one dish tonight she can enjoy with everyone else?” Christ.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 134,
                      "content": "I can only imagine what it's like when Sarah and James discuss their weekend plans when this dinner party in approaching.  He reassures her that certainly THIS month OP will have something for her to eat, although she should probably something with her to supplement the main course.  Certainly none of his friends would be so boorish and rude as to continue inviting her to their massive complex feasts that doesn't have a single dish she can eat.  Every month he is wrong.  Every month, for 12 or more months in a row.\n\nSarah has cooked and package her own dinner to bring to a party, eat microwaved leftovers while everyone else eats a gourmet meal prepared by their hosts, every month for a YEAR.  This poor woman.  I'd have said \"fuck it\" and stayed home and read a book after month 3.  \n\nI just... a year and a half.  They've been dating for a year and a half, that's a long time.  I really really want to believe this a shit-post, because JFC this OP is such an asshole.",
                      "id": 169,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "To be fair, if I were sitting at that table without knowing the whole backstory, I might assume she wanted to bring her own food for some reason.  It's weird, but it's not \"invite someone to a dinner party and don't even feed them\" weird.",
                  "id": 170,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 96,
              "content": "Enjoy your night of relaxation at our place oh and make sure you make your own food, package it, and bring it for you and only you.",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I can imagine the poor lass sitting there with her plastic container of vegan food while everyone else gets a starter, main course and dessert.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "[deleted]",
          "id": 173,
          "comments": [
            {
              "score": 8,
              "content": "Yeah before I was vegan, when I would invite vegan friends over even *without* the promise of dinner I would run out to get some vegan snacks for them in case they got hungry. I would die of embarrassment before I asked somebody to bring their own food to a dinner party. What a shitty host.",
              "id": 174,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "I’m surprised she keeps coming to these dinners. I wouldn’t feel welcome after a couple times of just sitting there and watching people enjoy food that I can’t eat with no effort to include me.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5470,
      "content": "YTA\n\n>I don’t believe it’s fair to expect us to change our entire menu or make an entire separate meal for one person.\n\nNo one is expecting you to do that.\n\n>we never provided **any dishes** she could eat at our dinners and it seemed like we were deliberately excluding her. \n\nYou don't make any dishes or side dishes that just happened to be vegan or could easily be altered?  Like a salad with roasted pine nuts, dried fruit, basic vinaigrette, but hold the cheese for her? Potatoes roasted with olive oil and herbs?",
      "id": 176,
      "comments": [
        {
          "score": 2623,
          "content": "A vegetable even??",
          "id": 177,
          "comments": [
            {
              "score": 2253,
              "content": "Im picturing them cooking vegetables and smothering them in butter and then going “what am I suppose to change the whole recipe for one person?” You would think that someone who loves to cook as much as OP would find it a fun challenge to find vegan friendly recipes they would all like. I love cooking and I would have fun looking for recipes we could all enjoy together.",
              "id": 178,
              "comments": [
                {
                  "score": 662,
                  "content": "> Im picturing them cooking vegetables and smothering them in butter\n\nI was a grown ass adult moved out of my parents home before I entertained the idea that this was not the only way to cook veggies. I live in the south and the majority of people do this. It's honestly so much tastier, and I feel so much better, cooking them with spices and whatnot. Butter is not a spice.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 737,
                      "content": ">Butter is not a spice.\n\n*Paula Deen has entered the chat*",
                      "id": 180,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 158,
                      "content": "I feel like butter ruins a lot of things for me. I prefer olive oil in most savory dishes in place of butter. OP really should try making vegetables a different way if slathering them in butter is the only way he knows how to make them.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This is valid but like even if you REALLY don't know how to cook veggies without butter, you could literally just pick up some Earth Balance and use that instead. It's not difficult or expensive and no one would tell the difference.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 250,
                  "content": "Is it an American thing to smother vegetables in butter? Is roasting veggies in olive oil or some other oil not enough?\n\nEdit: Thread is locked so I can't reply to the many comments I received but a lot seemed to think my comment was explicitly about *olive* oil. It wasn't. My question was why isn't cooking in oil, generally, more common than in butter? I called out olive oil because that's what I use.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 162,
                      "content": "It's very much an american thing (ETA to cook food in ways that don't incorporate much if any olive oil).  In my experience, it's largely because recipes and food traditions are passed down through families and olive oil like, wasn't really available (or affordable) in the US in most small towns until a few decades ago.  Especially if your family was like german or russian and olive oil wasn't a big part of your traditional foods, it just wasn't very common until the recent \"olive oil is so good for you!!!!\" health push of the last few decades.\n\nMy grandpa was born in 1912 and I learned most of my cooking from him as a kid (in Pennsylvania).  There had never been a bottle of olive oil in his house ever, and he died in '02.  It was butter, bacon fat, beef tallow, or crisco in terms of cooking fats, maybe schmalz if you came from an area with a large Jewish population.  You might see olive oil in the vinegar and oil shakers at a restaurant, but for the home cook it wasn't common especially in the 80s and 90s in a small town.\n\ntl;dr- America is weird.",
                      "id": 184,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I’m Australian and grew up with veggies roasted in olive oil, but then I started working at a restaurant where we roast them in butter and fuck, my life changed. It’s seriously unhealthy but sooooo fkn good.",
                      "id": 185,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 70,
                  "content": "Personally my first thought was that they were probably roasting them in like duck fat or making things like bacon/pancetta brussels sprouts(/green beans/whatever) considering the emphasis added to how ~fancy~ this event is. But to include animal products in *literally everything*? Is it not super heavy??? Even before I went veggie that kind of overuse of animal products is just overdoing it.",
                  "id": 186,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yep. I love me some collard greens cooked in bacon but I knew a guest was veggie I would modify it. There are other savory things, like certain mushrooms, you can use if you still want to be fancy.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "Hey maybe they live in the south? But really, anything with butter or eggs or beef/chicken stock can easily be changed slightly to accommodate a vegan.",
                  "id": 188,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Sub olive oil. Perfect.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "Honestly... an entire year and there was never even a hint of a salad, or vegetable without butter?? \nBake some asparagus after you finish cooking the other meals for 15 minutes in olive oil and add some salt and garlic. Cooking an entire meal for a vegan is probably easier than cooking One of the other dishes they make.",
              "id": 190,
              "comments": [
                {
                  "score": 14,
                  "content": "How am uh supposed to cook potatoes without butttter? \n\nAsked the morbidly obese southerner.",
                  "id": 191,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Roasted potatoes, beets, artichoke hearts, stuffed mushrooms, tomato soup, salad. It's so confusing that in over a year of dinner parties nothing has even been accidently vegan. It has to be intentional.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Quick!  Throw some chicken stock in that steamed broccoli!",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "That makes me question OP'S *own* diet. How many dishes are you making that aren't solely vegetable. Not even cooked broccoli? Or roasted carrots?",
              "id": 194,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 182,
          "content": "> we never provided **any dishes** she could eat at our dinners and it **seemed like** we were deliberately excluding her. \n\nNo no no. You were deliberately excluding her. You told her you were deliberately excluding her. You told her to bring her own food. That's literally deliberately excluding her. She's clearly tried to be as nice as she could about the whole thing for 1.5 years but she's hit a breaking point. Maybe her boyfriend is a bit of an asshole, maybe she should have said something earlier, I guess (but it doesn't seem like that would have phased OP!), but she's been deliberately excluded this whole time.\n\nJudge how you will about someone who chooses to be vegan, but if it were a scenario where I invited someone over to my house who had a food allergy I would absolutely accommodate them because that is the point of being a host. I don't know her reasons for being vegan but IMHO even if I'm too weak to do it there are a lot of noble reasons to do so and I respect it.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": ">I don’t believe it’s fair to expect us to change our entire menu or make an entire separate meal for one person.\n\n>No one is expecting you to do that.\n\nOf course no one is expecting them to do that. That’s just an excuse that OP is pulling in order to make himself out to he right. \n\nOP is in r/iamatotalpieceofshit territory according to this post. Goes well beyond typical asshole-ishness.",
          "id": 196,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "You invited someone over AS YOUR PERSONAL FUCKING GUEST and then had nothing to offer them?!? I hate Chardonnay, but you better believe when I invite Becky over I have Chardonnay because I’m not a sociopath narcissist asshole and she’s my guest.\n\nYTA and you deserve dinner parties for 1 forever, since they are so obviously for you only, and NOT your guests.  You suck.",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Its even more embarrassing that he got heated over this lmao",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Mmmm. I regularly make potatoes roasted with olive oil and herbs.  One of my favorite dishes and it's so easy!  Not a vegan, btw.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I was thinking that same thing! Does ALL of the dishes have meat/animal product in it? That’s kind of odd. Especially with the fact that they do multi course dinner parties. My bf and I aren’t vegan, but we have made a few pretty great vegan recipes. Pretty easy, and super yummy. Wtf op ..",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I think they should change the menu or make an entire separate meal for that one person. It is so inconsiderate to knowingly invite a vegan to an intimate dinner party and not be accommodating. Why entertain guests if you don’t care about their enjoyment? She should not be relegated to grazing on sides while everyone else dines on an extravagant, multi course meal. I would be so embarrassed if I was OP.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "We’re making a salad ima toss a steak on anyways",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Right?  I bet OP smells like cheese",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3887,
      "content": "YTA why invite someone for a dinner party if you can't be bothered to cook for them",
      "id": 204,
      "comments": [
        {
          "score": 1613,
          "content": "**ESH except the vegan**. I'm going to assume that they are only inviting her because they want to invite her boyfriend. I actually think that if they didn't want to make vegan dishes they should have quit inviting the boyfriend. I also think that the boyfriend should have said something to the hosts before this last party, at a point where the gf wasn't around.",
          "id": 205,
          "comments": [
            {
              "score": 376,
              "content": "It very well could be that the boyfriend didn't know that his girlfriend was feeling this way, until he noticed her acting more recluse at the dinner. \n\nShe might not have expressed to him she was feeling this way, because they're his friends and she doesn't want to intrude. When he saw how she was acting at dinner, he took her aside privately, found out what was bothering her, and went and told his friend. \n\nEither way, op is definitely TA here. His wife less so, because she showed remorse. And with the boyfriend, it could honestly go either way depending on when he found out about it.",
              "id": 206,
              "comments": [
                {
                  "score": 29,
                  "content": ">During our most recent dinner this past week, we noticed that Sarah was very quiet and looked like she was about to cry.\n\nThis is an \"elaborate, multi-course meal\" prepared by a couple who is clearly making a big event out of it. Think about how the conversation plays out. As each course comes out everyone is going to talk about the food. She's not just sitting there eating different food that she brought herself. She has also been sitting through conversations she couldn't participate in for the same length of time. How, in a group that small, could it possibly take that long to notice?",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This dinner was probably the last straw so boyfriend might not have noticed. She'd come once as an unknown plus one, again and didn't mind bringing her own, again and was really starting to enjoy everyone's company and felt like part of the group, so boyfriend's sure everything's all good... then she's sitting there thinking: \"I've only been invited to keep my boyfriend happy. If literally anyone else here was vegan, they would have cooked for them.\"",
                  "id": 208,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "ESH so much that I think this story might be bait. The lack of responses by OP makes that even more likely.",
              "id": 209,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "This tho. The boyfriend had to know about this. Why not bring it up until now? (And to be honest, if they see each other frequently, the girlfriend could have brought it up as well not in the middle of dinner.) ESH",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2875,
      "content": "YTA if you have never even had ONE vegan dish in this entire time she has been coming.",
      "id": 211,
      "comments": [
        {
          "score": 1145,
          "content": "This! Like... Not even a potato salad*? Fries? Pasta? Oftentimes I accidentally cook vegan\n\nYTA\n\nEdit: * Sorry, I forgot most of the world uses mayonnaise in potato salad. In Southern Germany it's made with (in this case vegetable) broth, oil, vinegar, onions and spices\n\nEdit 2: Here's the recipe because some people asked. Had to convert the measurements so I hope it still makes sense.\n\n`xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx`\n\n`- Around 2 lbs/1 kg of waxy potatoes`\n\n`- 2 or 3 onions`\n\n`- 8.4 fl oz/250 ml of vegetable broth`\n\n`- 6 table spoons of white wine vinegar`\n\n`- 4 table spoons of oil`\n\n`- Parsley`\n\n`- Salt and pepper`\n\n`- Diced pickles if you like them`\n\n`xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx`\n\n`1. Cook the potatoes in salt water. I know in the US potatoes are usually peeled before cooking whereas in Germany we peel them after cooking. I don't know if it makes a difference.`\n\n`2. Make the broth. Bullion works just fine.`\n\n`3. Dice the onions.`\n\n`4. When the potatoes are ready peel them and cut them into pieces (this is my last resort)`\n\n`5. Mix everything except the oil, give the potatoes in a bowl and mix in the vinaigrette in gulps while you stir. The potatoes should still be warm. Otherwise they won't take in the liquid as well. Wait between the sips that they have taken in the liquid. After the final sip give in the oil and mix well.`\n\n`6. Wait at least half an hour before serving. Season with salt and pepper before you do so.`\n\n`xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx`",
          "id": 212,
          "comments": [
            {
              "score": 440,
              "content": "German style potato salad is the BEST potato salad.  SO SO tasty, and vegan!  And gluten free if you use the right vinegar!  (some vinegars, like malt, can contain gluten.)  Fun for the whole group!",
              "id": 213,
              "comments": [
                {
                  "score": 18,
                  "content": "> German style potato salad is the BEST potato salad. SO SO tasty, and vegan\n\nNot the way my grandpa passed it down, it's got a pound of bacon in it.",
                  "id": 214,
                  "comments": [
                    {
                      "score": 12,
                      "content": "We had both in my family, bacony and non.  LPT- the non bacon is cheaper, that's why we had two recipes.\n\nMy family also ate a hot bacon salad dressing (like on top of lettuce) at Christmas.  It's a PA German thing and it's TERRIBLE for you but fucking delicious.",
                      "id": 215,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 187,
              "content": "Even if they use mayonnaise in the potato salad they could just buy an eggless version... my family told me the eggless mayo I eat tastes the same as the normal mayo from the same brand so now they buy that for themselves too to make me feel more included...  \n\nit's really not hard to accomodate a vegan if you give the slightest fuck about it..  like they could just cook plain old rice as a side dish and make some boiled veggies or something, both of which would pair well with meat too... and he and his wife are surprised Sarah feels terrible",
              "id": 216,
              "comments": [
                {
                  "score": 15,
                  "content": "> \n> it's really not hard to accomodate a vegan if you give the slightest fuck about it..\n\nEspecially when they seem to be ok with not having a full course every time.",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Plus it’s squash season! Fresh butternut squash soup is delicious and can be made with veggie broth and coconut or soy milk. There’s tons of autumn seasonal veggies that would fit right into a dinner part setting and make a wonderful side or starter course for the other, non-vegan guests too. So you’re not making an “extra dish”, you’re just happening to make one vegan dish that she can eat! Even some yummy stir fried veggies or a salad or something. Maybe they’re the type to just put bacon and cheese on everything to make it taste good, idk",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I used to be vegan and got lots of shit from my family every god damn time I visited for a holiday, lots of \"mmm doesn't this turkey smell gooooood\" shit. One year my BIL who was a seat next to me as they passed the plate of turkey to me and were giving me shit for not taking it I passed to him and he passed it down. My family who really respects this guy were like what gives? \"Oh I'm not eating Turkey this meal\" that was it. Simple, no big scene, he just joined me in eating only sides. Seriously meant a lot to me at the time.",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Ein Schwabe 😍\n\nLiving in another state, I sorrowly miss my potato salad without mayo.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2758,
      "content": "Did she seriously had to bring her own food this whole time? \nThe first time is pretty normal, but after that you just were horrible hosts.\nWhile unintentionally your behavior obviously gave her the impression you didn’t care enough to make an effort and incorporate a vegan dish.\nSorry, YTA if you provide food for all your guests except her.",
      "id": 221,
      "comments": [
        {
          "score": 716,
          "content": "This. You really have to think of how extensive the exclusion was. We’re talking a whole year of multi course meals. That’s a lot of dishes that not once did OP think “let’s make something vegan.” I’d feel so unwanted if I was her.",
          "id": 222,
          "comments": [
            {
              "score": 216,
              "content": "Does it even require a deliberate effort to make a dish a vegan can eat?  I would’ve been on OP’s side if they tried to change most of the menu to cater to one person, but damn there wasn’t one dish for her?",
              "id": 223,
              "comments": [
                {
                  "score": 141,
                  "content": "Right?? Do they use butter or chicken broth in EVERYTHING? I know zilch about being a vegan really but I’m pretty damn sure a salad and vegetable would be easy for me to whip up. Seems to me it’s harder to cook that many multicourse meals and none be vegan just by coincidence!",
                  "id": 224,
                  "comments": [
                    {
                      "score": 27,
                      "content": "But even that’s not a good excuse because you can swap out veggie broth and vegan margarine easily!",
                      "id": 225,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "It's really not hard. Shit, I've done it on accident.",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 301,
          "content": "Honestly Sarah was so nice to have showed up everytime and patiently watched everyone else eating\n\n- Thank you so much kind stranger!",
          "id": 227,
          "comments": [
            {
              "score": 95,
              "content": "> Honestly Sarah was so nice to have showed up everytime and patiently watched everyone else eating\n\nThe possibility that every single time she was hoping they might have something for her too and just increasingly being disappointed and hurt.",
              "id": 228,
              "comments": [
                {
                  "score": 38,
                  "content": "She's a fucking saint for sticking around so long. If my SO was bringing me to dinner parties for a whole year where I couldn't eat anything and even had to bring my own food, I'd have probably left them.",
                  "id": 229,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yeah I'm pissed at the boyfriend too. A year before he said anything? I going with pretty much ESH. She should have left the BF for repeatedly taking her to events where he knew she would be awkwardly excluded.",
                      "id": 230,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I’m crying just imagining that",
                  "id": 231,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I'm impressed she apparently held up for a whole fucking year of that!",
                      "id": 232,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "seriously, i misread the post at first and thought it was a yearly dinner, and she was fine the first time and upset the second time, and already that was pretty bad. Then after realizing that it was multiple dinners over the course of a year, yeah, god damn that's just mean.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "OP literally didn't care about her.",
          "id": 234,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1747,
      "content": "INFO: Why do you hate Sarah?",
      "id": 235,
      "comments": [
        {
          "score": 368,
          "content": "At work reading this, laughed obnoxiously loud. Real talk though.",
          "id": 236,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 279,
          "content": "This is the question I'm dying to know the answer to! This is such a hilariously brazen example of being an asshole, there HAS to be a story behind it...",
          "id": 237,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 156,
          "content": "It honestly just could be because she's vegan. Some people get surprisingly up in arms about that lifestyle choice even when it's never actually been. 'Shoved down their throats.'",
          "id": 238,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 120,
          "content": "She’s vegan, duh. (Not speaking for myself, but it seems clear that’s why they don’t like her.)",
          "id": 239,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 46,
          "content": "But he likes her as a person!",
          "id": 240,
          "comments": [
            {
              "score": 52,
              "content": "Just not as a vegan!",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "[deleted]",
          "id": 242,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "Because she's vegan. Duh.",
          "id": 243,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "Amen. I feel like this has all been a passive aggressive jab at this woman for some other reason.",
          "id": 244,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "YES. Thank you. I agree they hate Sarah because I cant imagine why someone would do this to a guest and think nothing is wrong. And just to add, even if they did have some kind of legitimate reason to dislike her I think it's completely trashy to intentionally treat someone poorly in your own home.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This is the question that truly needs to be answered.",
          "id": 246,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}