{
  "post content": "Throwaway because my friends know my main account.\n\nI (28F) was having lunch with a friend (28F) of mine over the weekend. We live in an area with warm weather, so we are able to eat outside socially distant. We were both chatting about how this pandemic sucks and that it has made our dating lives a lot harder than before. While we were chatting I came up with the great idea that my friend should date a colleague of mine (30M). I told her that he is a really great guy and that I would give him her number so he could FaceTime her. She asked me more about him and I kept singing his praises. She then asked me why I had not ever considered dating him if he was as great as I made him out to be. I explained to her that he is a teacher like me and that his potential earnings are not high enough. She got very offended by this statement and asked me why I would try and set her up with someone who I myself was not willing to go out with. I tried explain to her that since she works in Finance and makes more than double what I make that she can date some who does not make a lot of money because she can afford to pay for a nice lifestyle. She got even more offended by this and said that she normally dates men in a profession similar to her and that coincidentally men who work in that field tend to make the same amount of money as her. She said my statement about paying for a nice lifestyle made her sound like someone's cash cow. After this went down she asked the waitress for her half of the bill and left me with half of the bill. I am very hurt by this as I was only trying to help my friend. I think she is being shallow and is the AH for saying she normally dates men who are in her profession who make a lot of money, but she thinks I am the AH for trying to set her up with someone who I would not date myself without good reason, so reddit, who's TA here?",
  "id": 1,
  "comments": [
    {
      "score": 15,
      "content": "ESH. You BOTH are being shallow. She doesnt have to date anyone she doesnt want to, but her not wanting to date him cause he makes less money than her does come off as very shallow and money focused\n\nYou, however, are also shallow. You're criticizing her for not dating him cause he doesnt make enough money, but you wont date him cause he doesnt make enough money. How is that any different? And god forbid you have to pay for your own lunch",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "I suggest you reread the comments in light of being top comment: OP keeps revealing more that makes it more...yeah.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "My friend always treats me to lunch because she recognizes that I don't make as much money as she does and she can afford to treat me. She recognizes her privilege, so I don't understand her logic.",
          "id": 4,
          "comments": [
            {
              "score": 8,
              "content": "Eww, you sound so entitled and greedy",
              "id": 5,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "[removed]",
              "id": 6,
              "comments": [
                {
                  "score": 1,
                  "content": "Please leave the \"accept your judgement\" admonishing to the mods and just report it - you're not in trouble or anything, we're just trying to cut down on the backseat moderating due to others using that rule as a weapon against OPs, and often the admonishment from users comes after we've already addressed the issue with the OP (or in some cases, it didn't come because no one reported it). Thanks! :)",
                  "id": 7,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12,
      "content": "YTA. Why should any man date you since you don't make very much money?  You're just as shallow as she is.",
      "id": 8,
      "comments": [
        {
          "score": -5,
          "content": "I am very nice and I have a good job, it just doesn't pay as much as other jobs.",
          "id": 9,
          "comments": [
            {
              "score": 6,
              "content": "You have the same job as your guy friend, but you won't date him because he doesn't have a good enough job even though he's very nice. You're being a hypocrite for expecting someone else to date you even though you have the same \"flaw\" as your guy friend that you refuse to date.",
              "id": 10,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "YTA just for complaining about this\n\n\"After this went down she asked the waitress for her half of the bill and left me with half of the bill.\"",
      "id": 11,
      "comments": [
        {
          "score": -5,
          "content": "Said friend always pays for lunch. She says that since I am a teacher and don't make as much as her, she can afford to treat me.",
          "id": 12,
          "comments": [
            {
              "score": 6,
              "content": "Ah, so you use her as well",
              "id": 13,
              "comments": [
                {
                  "score": 0,
                  "content": "I do not use her, she always offers to treat me. She's recognizes her privilege which is why I don't understand her logic.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 9,
                      "content": "You are arrogant, and ignorant, if you can't see why she is upset.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "She isn't privileged since she works for her money",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "YTA, and more shallow than you claim your friend is. You decided to teach, probably knowing teachers make horrible money, and instead of seeking a job to pay more, you expect a man to do it for you. You are a shallow golddigger",
      "id": 17,
      "comments": [
        {
          "score": -2,
          "content": "Teaching is a very noble profession. I can't help it if we don't make as much as people in the corporate world. I can't seek a job that pays more because I'm limited by my profession.",
          "id": 18,
          "comments": [
            {
              "score": 5,
              "content": "You chose your profession, knowing it pays poorly. That's on you, and only you. Do I think teachers should be paid more? Absolutely. Does not being paid well give them the right to be shallow? Absolutely not. Accept the judgement, stop fighting the comments. YTA",
              "id": 19,
              "comments": [
                {
                  "score": 5,
                  "content": "I think she literally just chose teaching as a job because she thinks it would make her look good? Every comment she says she picked it because it's the \"best\" and \"hardest\" and says nothing that implies she would be a good teacher.",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "YTA, based on the post and comments. You seem to be mad that your friend got mad for you introducing her to a guy you wouldn't date  and then insisted she couldn't also want to date someone for that same reason because when *she* does it, it's a bad thing...because she makes more money?\n\nI think you sound super jealous of your friend.",
      "id": 21,
      "comments": [
        {
          "score": -1,
          "content": "I am not jealous of her in any way.",
          "id": 22,
          "comments": [
            {
              "score": 6,
              "content": "You clearly are, you talk about all her vacations and nice clothes and literally said you want those things\n\nYou’re jealous and shallow and in denial of it.",
              "id": 23,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Everyone knows you're seething with jealousy. I bet your friend can tell too.",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "I would advise you to reread everything you've written and reconsider that statement.",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "YTA, \n\nyes I would never set up a friend with someone I wouldn’t date, also your reasoning for it. So he’s broke which keeps you from dating him but sure she’s better off and should? Nah that’s not how things work, she probably works hard for her money and wants to enjoy without having to worry about paying for two unless it’s her choice. \n\nJust overall the way you went about it is terrible, if he’s such a catch money shouldn’t be an issue regardless of your or her income but the way you phrase it sounds like you want a sugar daddy and she should be a sugar momma",
      "id": 26,
      "comments": [
        {
          "score": -1,
          "content": "I work hard too, but I don't make nearly as much as she does. What has she done to deserve all the vacations and clothes she can afford? I want all of those things too.",
          "id": 27,
          "comments": [
            {
              "score": 8,
              "content": "How can you say you aren't jealous? You clearly are. You're also a horrible friend. She deserves everything she has because she worked for it. You worked for what you have, and you got what you deserve. You aren't a special princess that's entitled to other people's money.",
              "id": 28,
              "comments": [
                {
                  "score": -4,
                  "content": "I work just as hard as she does, ergo I deserve all the things she has, but I do not have them. Explain to me why that is fair.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You are so entitled",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Life isn't fair. Go get a better paying job. You aren't entitled to anything she has. If she makes more money than you, that's on you to fix. You are acting shallow and entitled, and at this rate, you'll probably die alone.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Firstly, what you deserve is debatable. Secondly, grow up and stop comparing yourself to others. There are plenty of people who work harder than you and make less. Be grateful for what you have. Thirdly, life isn't fair and you get what you get. In your case you get what you chose. You put yourself in this position because you chose your career. And you already admitted she works more than you (longer hours, no summer break) and you wouldn't want her job. So either be happy you get more free time or buck up and switch careers. You don't deserve anything you don't work for, and as a teacher you aren't working for a big salary.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Umm, she has \"worked\"! is you real?",
              "id": 33,
              "comments": [
                {
                  "score": -1,
                  "content": "I work too",
                  "id": 34,
                  "comments": [
                    {
                      "score": 7,
                      "content": "You sound really immature and just downright jealous of your friend! why are you friends with her? not to mention double standards!! wow YTA",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "She chose a career that gives her those things and worked towards them.  Then go back to school and get a degree in something else. Sorry, life isn't fair, lots of people want those things and will never have them. YTA",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Thats on you and your choices not her, and you “deserve” anything that’s your entitlement showing. \n\nWe all can afford different things, I would love to travel to every month but I can only maybe once a quarter that doesn’t mean I hope my friends who come from rich families don’t go either...\n\nYou’re just spoiled rotten",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "YTA.  If you wouldn't date a man who makes the same (low) salary you make, then you need to work on yourself and your income potential.  You're holding others to a standard you don't hold yourself to.",
      "id": 38,
      "comments": [
        {
          "score": 1,
          "content": "I have a good job, it just doesn't pay as well as the corporate world. My income potential is limited, but I have one of the most difficult professions in the world.",
          "id": 39,
          "comments": [
            {
              "score": 2,
              "content": "It's funny how you think your profession puts you on a pedestal. Teachers are important but it doesn't make you special. You're not entitled to things you haven't worked for just because you exist and you're a teacher. It sounds like you regret choosing a career based on the moral high ground you thought it'd give you.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "ESH  you called her shallow but you won't date someone who doesn't make a lot of money ok...",
      "id": 41,
      "comments": [
        {
          "score": -4,
          "content": "She is shallow. She makes a lot of money and can afford to do almost anything she wants. Why does she need to date someone else like herself?",
          "id": 42,
          "comments": [
            {
              "score": 6,
              "content": "I'm saying you are shallow also, you think she's an asshole for doing exactly what you are doing",
              "id": 43,
              "comments": [
                {
                  "score": -6,
                  "content": "She can afford to since she makes a ton of money, I can't afford that.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Doesn't matter how much you both earn, you are shallow.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Just because she has more money, does not mean she’s obliged to spend it on you. It’s HER money",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "Here this girl is claiming she wants a man to pay for everything but has nothing to offer herself this chick is something else! I'm not even gonna blaze her!",
      "id": 47,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "You won't date him because he doesn't earn enough, but you think she's shallow because she also doesn't think he earns enough?",
      "id": 48,
      "comments": [],
      "relation": "Attack"
    }
  ]
}