{
  "post content": "I am 30. Since I was a child he has always said he would pay for my wedding. \n\nAbout 5 years ago he started a relationship with lady with quite extreme views. She is a vegan, which is fine but she is very judgemental to how I live. She doesn’t agree with cancer scans (like smear tests, mammograms etc) because vegans “don’t get cancer”, when I had my daughter she said I should be feeding her almond milk. She once came to my house for dinner and I cooked a chicken for me and my family and a nut roast for my father and her. She later dug a hole in my garden to give the chicken bones a proper funeral because she was so “heartbroken to see us eating it’s blood and flesh”.I wish I was joking.  \n\nShe has also accused me of trying to steal her fathers house. I have never met her father, I have never set foot in her fathers house. All I know is he died recently. I had communicated some cost of living worries to my dad (not asking for money) and she ran with it and said I was trying to manipulate her into giving me her inheritance. I do not want her inheritance. \n\nLong story short, my father will only pay for my wedding if it’s vegan. This not only includes food, but shoes, alcohol, what other people wear (E.g. leather) and anything else you can think of. I might have been ok with vegan food, but I’m not ok with policing what others wear or food they may bring for their babies (even formula) etc. \n\nThis has upset me. It’s not really about the money, we are having a very small and cheap do anyway. In the run up to the wedding this woman has also been extremely rude to my mother. On reflection I have now decided it’s best all round that they do not attend. \n\nShe’s now telling my dad’s side of the family that it’s just about the money and that I am bitter because I didn’t get her dad’s house (Why on Earth would I be given her dads house?!) and that my dad isn’t paying for my wedding, but to be honest it’s not really about the money. I don’t want to be controlled over what I can and can’t do on my wedding day, I’m sick of her judgement (and his, now she’s gotten her claws into him) and I just think it will be better for me, my siblings and my mother if they do not come. I also don’t want to be lectured over milk, dairy, honey, palm oil you name it, on my wedding day and I don’t want to put my guests through it either. \n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 10035,
      "content": "NTA.\n\nHe broke a promise, tries to make everything about him and his new partner causes tension, which is definitely not what a wedding is for.\n\nIt‘s your wedding and your decision. They dug their own grave and basically uninvited themselves.",
      "id": 2,
      "comments": [
        {
          "score": 5450,
          "content": "And the chicken's grave too\n\nEdit: over a decade on Reddit and this is what it took to get my first comment with over 1k upvotes. One really never can tell when something like this will occur.",
          "id": 3,
          "comments": [
            {
              "score": 4470,
              "content": "This woman makes everything a cluckerfuck",
              "id": 4,
              "comments": [
                {
                  "score": 1276,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 687,
                      "content": "Eggcellent!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 134,
                      "content": "cluckerfuck",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 83,
                      "content": "I like cluckerfuck better hahah but they're both funny.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 35,
                      "content": "Cluckerfuck?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "Clucksterfuck",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Fustercluck?",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 93,
                  "content": "She just doesn’t want your dad (her husband) to spend a dime of his money on anyone but her. If you jumped through every single hoop, she’d find more.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Damn you! Take my expensive award!",
                  "id": 13,
                  "comments": [
                    {
                      "score": 67,
                      "content": "I bow in thanks. Cockadoodledoo",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I have a question. I have bought coins, but can’t find or use them. HELP!!!",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Absolutely agree 1000%",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Poultry in motion",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "fustercluck!",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "And a clustercluck too!",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "😹😹😹😹😹😹😹😹😹😹",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1015,
              "content": "That was amazing. Anytime anyone asks OP how her relationship with her stepmom is, all she has to say it, “Let me put it this way. I made a chicken roast for dinner, and she held a funeral for the chicken bones and buried them in the yard.”\n\nThat is so wacko. I’m dying of laughter.",
              "id": 21,
              "comments": [
                {
                  "score": 522,
                  "content": "What kills me is burying the bones is a WASTE. When I buy a chicken, you can BET that those bones are going to make stock. If something died so I can eat it, I'm going to get every bit out of it (especially when I pay for humanely raised, local chickens).",
                  "id": 22,
                  "comments": [
                    {
                      "score": 306,
                      "content": "Almond milk isn’t all that environmentally friendly or even best the best for nutrition, in comparison to other plant milks available now \n\nI’m vegan and this lady sounds daft",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 143,
                      "content": "Amen. My freezer is full of stocks that I've made from bones and bags of bones/veggie cuttings waiting to be turned into stock. Never waste an animal.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 68,
                      "content": "But do you hold a ceremony for the bones once you're done with your broth?",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 47,
                      "content": "I keep chickens. Don't eat meat but I like to see this. Never waste what can be used. And with chickens, every part can be used! Bones make a great stock.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "You can also dry them to make bone meal for your garden!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "take it home, throw it in a pot with some broth, add a potato...\n\nbaby you got a stew goin'!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Thank you! I have a ton of delicious stock in my freezer because that what I make with chicken bones.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "If you hadn't posted about stock and the waste of bones I would have.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Absolutely, and start it IMMEDIATELY, before the guest leave if they stay long.  \nThey stayed long enough for the funeral....",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "yeah, mom always makes soup with the chicken or turkey carcass.\nUsually I'm frugal with food, but I really don't care for hot liquids, at least somebody's doing something with it.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "Seriously, what a nutjob.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 140,
                      "content": "*nutroast job",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "As long as the nuts are organic...",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "That is almond nutjob sir",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "With vegans this militant, I always wonder, exactly at what point does an animal become worth saving. Because even organic farmers use pesticides, it just has to be a certain class of pesticide, so billions of bugs have been killed for their food. And if they eat anything that was gathered with a harvester or threshing machine, a bunch of ground animals like mice, rats, moles etc, had some very nasty deaths. Would she have a funeral for the memory of all the mice that died so that she could eat some wholewheat bread.",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "The sex must be really good for the dad to still be with her...",
                  "id": 38,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It is vegan sex so yeah",
                      "id": 39,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "The funeral: And now, a few words from u/gooseheadgoose, who'd like to share some fond memories at this time.\n\nu/gooseheadgoose: Thanks Reverend. And yes, I'll always fondly remember the late chicken for how fucking delicious it was. Especially paired with those duck fat roast potatoes. Nom nom nom, Amen 🙏🏻",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 218,
              "content": "Thank you, I snorted! RIP 🐔⚰",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "You know a better way to plant a chicken tree?",
              "id": 42,
              "comments": [
                {
                  "score": 85,
                  "content": "OK, I'm a strength athlete, so I eat a lot of meat (a lot of chicken 🐔) - a \"chicken tree\" sounds absolutely amazing. 😂😂\n\n\"let me just go pluck a chicken off the tree in the garden.\" 🤣😍🐔🍗.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I think most of us would love that.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "There is a scene in one of the Vorkosigan Saga novels (Sci-Fi, recommend) with a cat tree with little kittens ripening on the branches. One of the characters plucks a kitten off the tree and it promptly dies. Apparently it wasn't ripe yet.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "You can keep your old plain Jane chicken tree.They should have gotten fried chicken instead. Everybody loves a fried chicken tree.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "Are there varieties of chicken trees? Like fried, roasted, baked?",
                  "id": 47,
                  "comments": [
                    {
                      "score": 55,
                      "content": "The different branches have to be grafted on, like an apple tree.  Start with a plain, raw chicken tree, then as it grows you can start adding the other types (branches) to make whatever kind of chicken tree you like. \n\nI've started working on a turducken tree.  It's the most difficult kind, but it saves a lot of work because each of the parts, chicken and duck, are already inside the turkey.  Can't wait for Thanksgiving this year!",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I freaking squawked laughing at this.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I have trouble growing chickens, I don't know if I'm planting them too deep or too close together",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 65,
              "content": "I’d dig up those bones and display them as a centerpiece if they were to come over again for dinner",
              "id": 51,
              "comments": [
                {
                  "score": 12,
                  "content": "I like the way you think! Bravo!",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "🤣 Thank you for that. Though my recent rib injury is decidedly not pleased...",
              "id": 53,
              "comments": [
                {
                  "score": 39,
                  "content": "Bury your rib in the backyard.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Will we grow more Katressl?",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I was thinking that I would want those bones to boil for soup stock. Also, it seems she is projecting her concerns i.e. about money, on OP. She is probably after your father's money.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Ding! Ding! Ding! \nWinner\nWinner \nchicken diner \nYou win for best comment and OP is NTA",
              "id": 57,
              "comments": [
                {
                  "score": 2,
                  "content": "Chicken dinner\\*\n\n\\*in which the bones are later buried in the back garden",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "The next thing she will complain about is *cock*tails being served at the wedding (and parents bringing animals crackers for their kids).",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Apparently she was also looking forward to digging OP’s daughter’s grave, too. Everyone is on about the chicken bones, but this woman wanted OP to be giving her infant daughter almond milk!",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 901,
          "content": "NTA. Just invite your dad without a plus one. Mention that a vegan option will be available just to show you're taking the fist step. Of course he will refuse to come alone and then, you just say how sorry your are he can't make it. Checkmate in one move. Problem solved.",
          "id": 61,
          "comments": [
            {
              "score": 459,
              "content": "There’s no way they’d actually honor the no plus one thing. She’d show up anyway.",
              "id": 62,
              "comments": [
                {
                  "score": 199,
                  "content": "They would need to get bouncers to keep her out.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 168,
                      "content": "I'm laughing thinking of Opposite World where OP allows Dad's partner to make her restrictions.\n\nYou'd be hiring bouncers to kick out anyone wearing leather shoes or belts. Moms bringing in formula?  Out.  Aunt Maude with the giant feather on her hat? Inspected to make sure they're fake feathers.\n\nMuch easier to just keep out dad and partner in advance.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": "It’s probably a good idea to have bouncers anyhow.  I could see this sort of person trying to get involved just to make a point.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 59,
                      "content": "And make sure the bouncers are wearing leather jackets",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "And the bouncers should be dressed from head to toe in leather.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Do militant vegans bounce?",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Nah.  Just put a grill by the doors with some good meat roasting and she won’t be able to pass",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "Nah all they would have to do is give her a leather chair, she will remove herself.. \n\nMaybe the rest of the guests will get a show when she has to bury the chair.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Just have two kids as bouncers. If they show, kids have free reign to chase them off wielding chicken drumsticks",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "I'm afraid if they know the date, time and location that they are going to show up anyway just to complain the day wasn't catered to the wife's chosen lifestyle.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "She seems the type, yes.  And make it all about her.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Don't, though. This women is an attention-seeking nutjob and she will spoil the day if she comes. NTA, needless to add",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 233,
          "content": "I’m going to add that the father’s partner might have some issues with narcissism or personality disorders. Everything is about catering to her worldview and controlling everything around her,  with some serious paranoia, too. That stuff about the house and her inheritance is wild.",
          "id": 75,
          "comments": [
            {
              "score": 125,
              "content": "Hate to say this and I'm probably going to get nailed with the negatives but, every single vegan I've ever come across has been like this. They say how do you know if someone is vegan .... wait 15 seconds and they will tell you, the wall and everyone and everything else that they are . I've found this to be true.",
              "id": 76,
              "comments": [
                {
                  "score": 262,
                  "content": "Every single vegan you know who has told you they are vegan within fifteen seconds has been like this.  You might know dozens of people who are vegetarian or vegan and you just haven't noticed.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 306,
                      "content": "There are vegans, and there are vegangelicals.",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 81,
                      "content": "My vegan friend is absolutely not like this at all, she never says a word about anyone else’s lifestyle or diet.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Yeah, my sister is a very laid back vegan. I took a trip with her, and I kept trying to find restaurants with vegan food, and she kept being like, \"Relax. If they have beer and fries, I'll be fine.\"",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I've only known one like this, and I've known lots. Most vegans are lovely people, it's just the obnoxious ones are really freaking loud.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Thank you. My boyfriend's sister told me last month that she didn't know I was a vegetarian. I've been vegetarian the entire year and a half I've been with my boyfriend. Not all of us make productions of it.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -6,
                      "content": "Most tend to tell you they are immediately it's like those who are Trump supporters.. they just can't not tell you.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 121,
                  "content": "My ex is a vegan and absolutely NOT like this. Due to an illness I had to eat animal protein (preferably beef) but was too weak to make it, *so he cooked it for me.* We have friends who are vegans who don't bring it up unless it's relevant. (You invite them to a dinner party, and they specify their dietary needs, though they always offer to bring their own food because...Wisconsin. I moved here from the Bay Area, so asking for people's dietary requirements is just a normal step in having a party, and you end up making a whole bunch of different dishes to make it work. I'm fine with that since I have a ton of restrictions for my health, so it's the least I can do to accommodate others.)\n\nThe type of vegan you're referring to certainly exists, but they're not the majority, in my experience.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 56,
                      "content": "Hard agree. I am holding a small dinner party and asked my guests about dietary restrictions. Two couples are vegan, but were careful to say that they don't mind what others eat (and it's a potluck-style thing, with me doing the main dish and organizing the menu, so they would be happy to bring something appropriate). \n\nOne couple sent a rude message to the group saying they wanted REAL protein, MEAT, not beans or anything like that. They used the phrase \"forced to eat vegan\" somewhere in their email, like it was an incredible imposition. Seemingly no awareness of how many things are naturally vegan, like salads. (My husband and I are not vegan, but many times a meal we are having just ends up being vegan or vegetarian by chance...)\n\nI figured out a menu, but honestly, I'm totally annoyed with the non-vegans here.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Yeah you don't hear about the quiet vegans because they stay in their lanes. The militant ones ruin it for everyone. \n\nOne of my best friends is vegan, and she'll still buy and serve meat at cookouts and parties. She has zero problems with other people eating meat, she just chooses not to.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "As a vegetarian in Wisconsin I agree. I have met some \"Vegangelicals\" (totally stealing that word from an earlier response for my day to day use!) but they suck and most people who don't eat meat/dairy/both aren't like this.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I think/hope they are not the majority.  But they are the LOUDEST!",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 48,
                  "content": "I hear this trope way more than I do vegans preach.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 23,
                      "content": "There are vegans and then there are AH’s who happen to be vegan.",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Yeah, I have a very close vegan friend and colleague who I frequently eat with at both work and social events. She’s always talking about being a vegan because the poor woman can sit down to a plate of food without someone commenting on what she is or isn’t having",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "Agreeing with the person below who says there are many vegans who can actually shut up about it. Sadly, they've let the orthorexic loons be the public face of their lifestyle.  It's sad because I mean the basic message of mindful eating and being aware of what we eat and how it ends up on our plate is a really good thing, but...that's not the message that gets out, thanks to the loud loonies.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 2,
                      "content": "An example of a good vegan is Apu, ironically he was the one who told Lisa that nagging people and pointing fingers at them to become vegetarian is wrong and that she should learn to tolerate people who eat meat. Unfortunately now it is the other way around, vegetarians beg vegans to stop making a fool of themselves in public.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "True but unfortunately these are the kind of people in all groups that get the attention. There are plenty of pro LGBTQ+ churches out there that do lots of good work, which religious people do we end up hearing about? Oh right the loud loonies that think abortion is murder even if it's to save the mother's life and the ones that don't want anyone to marry someone of the same gender. Which gun rights activists do we hear about, the ones that believe in basic gun laws? Nope, instead we hear from the ones that think even background checks are just the government preparing to burst into your house and take all your guns.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "My oldest son is vegan and sits with us while we eat meat.  He respects our ideas and we respect his.",
                  "id": 95,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I’m much more likely to tell you that steak smells delicious \n(But I’m not going to ask for a bite)",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "They are so fixated on saaaaaaaving the plaaaaaanet that they cause untold harm to the people living on the planet - and they don't fucking care.",
                  "id": 97,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Dude, speaking as a vegetarian who eats mostly vegan at home, I respect other people's dietary choices precisely because I expect them to respect mine. I also know that you can't berate someone into giving up meat. \n\nYour anecdote/generalization is unhelpful and not really relevant here.",
                  "id": 98,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "[removed]",
              "id": 99,
              "comments": [
                {
                  "score": 1,
                  "content": "OMG! More treatable?!! In training we were told we could never have more than 2 BPDs in our practice, because they will burn you out so quickly.\n\nthen there’s my DIL who specializes in them, she’s also a doctoral level clinical psychologist.",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "We don’t know nearly enough to be armchair diagnosing in any detail, but yeah, *something* is clearly wrong here. \n\nNTA OP and I hope your dad gets out of what is clearly a pretty toxic situation!",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "I wonder if he is dating Vegan Teacher from youtube...\n\nNTA. With all the crap this crazy lady has been spewing, I would at this point actually tell my Dad it's either her or me, because she is a bully and you deserve better then that. The fact he is letting her bully you like that to begin with is messed up. We can all have our views, but they don't need to be shoved into our faces and the fact that she is trying to destroy your character... OP, you really don't need that in your life.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "NTA Tell vegan wife to go dig two graves in the back yard for themselves as she appears to like digging graves.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "From the title, I was going with YTA, but after reading her post it's definitely NTA. Tell your father you really want him there at your wedding, but don't want the drama involved.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "[removed]",
          "id": 105,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "OP should inform people that she tried to force them to eat vegan food and dictate what they could wear at OP wedding. They will side with OP very fast.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "OP should put on the invitations, sponsored by Tyson Foods.",
          "id": 107,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Bingo....your step mother sounds nuts. Nta keep them both away...but video you burying a carrot in the ground as its a shame to harm a vegetable....",
          "id": 108,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3104,
      "content": "NTA. I think you’re right that it will be better if they don’t come since they can’t keep themselves from trying to control everything and everyone around them. It’s insufferable and you don’t need that headache on your wedding day.",
      "id": 109,
      "comments": [
        {
          "score": 2315,
          "content": "This is the thing - the guilting and controlling behaviour that they engage in. The food being vegan could have been fun, it could even have been a conversation point but they will use all the day to push their vegan agenda and I’m just exhausted by it.",
          "id": 110,
          "comments": [
            {
              "score": 1916,
              "content": "You are not the asshole. I am vegetarian and extreme vegans piss me off. They give the rest of us a bad name.\n\nLifestyle choices should never ever be imposed on others.\n\nAlso, just message everyone (dads family) the demands of father regarding vegan. Let them know in order to enjoy your day and avoid constantly being criticized on your day, you thought it was best if they didn’t attend. Let them know the chicken situation. Let them know of her crazy-ness. They will realize it’s not about the money rather her crazy behavior that you don’t want around you.",
              "id": 111,
              "comments": [
                {
                  "score": 477,
                  "content": "I am not disagreeing with anything you are saying, just as a further note or something. I don't really think this is an \"extreme vegan\" issue as much as it is just a crazy person who happened to attach themselves to veganism. You could switch out the \"vegan\" stuff for a religion, for example, and get almost the same results, because it's just the kind of person she is rather than her being vegan.\n\nMaybe irrelevant for OP's situation, but it might actually be helpful if he wants to try to talk to his dad and get him to see reason. Detaching the values from the behavior will make it easier to see that is not actually the veganism itself that is an issue, but rather how she is as a person (denying science, crossing way over social boundaries, outlandish accusations and paranoia, imposing on other people etc.). Even if OP's dad agrees with veganism, it's her and her behavior that is the issue and that won't change even if she one day changes veganism for some other -ism. Might make it easier for his dad to recognize the issues with his GF and not feel like he or her is being attacked simply for being vegan.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 100,
                      "content": "It’s not a vegan thing exclusively, but it is an extreme vegan thing. I think a lot of moderate Republicans are disgusted by being associated with the extreme far right. I am religious and hate the bad name extreme intolerant Christians give us. And let’s not even start on the damage Muslims have dealt with from the behavior of Islamic Extremists. \n\nMy point is just that “extreme _____” is a common and well understood statement. I don’t think there’s a need to change the term. If that makes any sense. I don’t think I explained my thoughts very well.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "I know a few vegans and none of them was EVER as extreme as the meat eaters. I eat meat, but I love vegetarian lasagna, so I made it for my birthday a few years back. Knowing that spinach isn't for everyone I made a meat version as well. I was asked several times why I catered to the vegetarians when vegetarians/ vegans never include meat to \"please\" us meat eaters. Thing is, most people aren't going to serve what they themselves don't eat.\n\nI feel there are extremes on both sides and since there are more non-vegans we get to hear more about the \"annoying vegans\" than the other way around.",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 35,
                      "content": "“We realized isms are great for those who are rational, but in the hands of irrational people, isms always lead to violence.”",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Yeah, I try not to judge but this person just seems a little bit off the rails. Burying chicken bones? Come on. I love animals and abhor factory farming just as much as the next person (I’m not fully vegan, but I do my best), but that’s just weird",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I agree.  Her belief that you want her father's house is frankly insane, and founded on nothing.  You might want to suggest to your father that she talk to a counselor about that.  Even he has to see that this is strange.  And yes, don't invite them.  Who knows what else she'll accuse you of doing.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Expecting to inspect your guests shoes is extreme veganism. NTA",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "Yes, these are the ones that make the whole world hate us. :(\n\nSomeone introduced me as a vegan to a friend and when I saw the look on her face, I quickly replied - \"lovely to meet you and I promise I am not one of THOSE vegans\". \n\nShe burst out laughing and we were good 👍 \n\nNTA and so very sorry you are navigating this. Congratulations on your upcoming wedding!",
                  "id": 119,
                  "comments": [
                    {
                      "score": 54,
                      "content": "Curious, did your 'friend' get the message that being vegan is not your defining characteristic?  Perhaps not the single most interesting thing about you as a person? :)",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "Vegetarian too and completely agree with this. \n\nBut taking all the crazy vegan stuff away, the thing with the house is so weird. She clearly has issues and is a toxic person. OP, you do not want her around, not for the wedding, not for the rest of your life. I would avoid her as much as possible. As for the father, keep minimum contact with him. Too bad he's fallen deep in her bs, but hopefully he'll realise he could lose his relationship with you because of her...",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "I'm a vegan, I agree with you 100%. I would never behave like this because my choices are just that, my choices. I'd never force my views on other's because it's about autonomy. But let's be real. At this point, this woman's behaviour is less about her commitment to veganism and more about control, superiority and attention seeking. She needs therapy. NTA OP",
                  "id": 122,
                  "comments": [
                    {
                      "score": 2,
                      "content": "So you're convinced that it's the wife who is the reason for all of this? And that the father didn't just made the decision to pay only for vegan things because of his own beliefs?\n\nWhy would the father pay for non vegan products though? He is not forcing anything upon others by limiting his payment to vegan products. He is just consistent to his own beliefs. \n\nYou said you're vegan. Would you pay for other people's meals or clothes if they aren't vegan? Knowing that you'd increase the demand for animal products, which then results in more suffering and death of animals?",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Totally agree! This is one of the reasons why I don’t tell anyone that I don’t eat meat, people will always ask why and think I’m one of these crazy people.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 6,
                      "content": "And now we all know you are one of those crazy people. :)",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Extremists of any kind are bad. They are also not the norm.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This. Also text them she tries to enforce on them (the guest) about the leather/clothes etc too",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Exactly! My sister is vegan, yet when my parents and I stay at her house, she messages us days before what kind of deli meat we like and what kind of milk for coffee because she won't force it on us. It's a lifestyle choice for that person, but don't make others do it as well.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 199,
              "content": "Do they know that \"vegan leather\" aka plastic is a petroleum product, the manufacture of which results in massive environmental degradation, so that it is much more harmful to life than true leather? And that most vegan leather products are made in sweat shops?\n\nSo not only overbearing and judgmental but also wrong.\n\nPay for your own wedding. Invite them or not. NTA.",
              "id": 129,
              "comments": [
                {
                  "score": 114,
                  "content": "I don't understand the whole \"vegan leather\" thing. Call it what it is, plastic, and plastic is one of the things that's really destroying the world and messing up our oceans. Personally, I care about that.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 44,
                      "content": "[deleted]",
                      "id": 131,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Naked wedding it is then!",
                  "id": 132,
                  "comments": [
                    {
                      "score": 24,
                      "content": "DoomsdaySpud, I read a Miss Manners letter about that! Daughter wanted to have a naked wedding and mother was asking if she should give guests the heads up or hope that her daughter would change her mind. All I could think about was how creepy the father-daughter dance would be...",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": ">And that most vegan leather products are made in sweat shops?\n\n But no animals are abused so there less bones for her to bury. This woman seems a little......off so I am not sure she'd believe this.",
                  "id": 134,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Pleather is also much less durable than true leather.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Oh my god I mentioned this in one of the yoga teacher trainings I was in, where a bunch of my fellow students were like 'yoga demands veganism!' (it literally does not) and....I got banned from the facebook group.  \n\nPeople should absolutely eat what their conscience directs, but fully aware of it.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "You should write a letter to you father explaining that while you’re disappointed that he’s reneging on a promise of 20+ years the reason they are not invited is because new GF is insufferable and unhinged- then go on to calmly explicate all the examples of how. Tell him you love him and make sure and CC his entire side of the family so there is no confusion.",
              "id": 137,
              "comments": [
                {
                  "score": 1,
                  "content": "This is the way",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Be sure to either hire security or ask for volunteers to keep them away from your wedding because they will probably show up anyway and make a scene. NTA",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "NTA. As someone who was vegan for a while (mostly vegetarian with the occasional meat product now), her pushing her agenda on people is what gives vegans a bad name. I did it for health reasons, but guess what. I still got cancer. \n\nAs for her missing out on her health screenings, well, ignorance will only get her so far. And she won't get very far at all if she misses getting diagnosed early for cancer. My cousins mother in law was married to a chiropractor (the crazy kind that believes a back adjustment will cure anything). She had pelvic pain for a while, and he just kept adjusting her back. She died of cervical cancer. \n\nAnyhow, it's your wedding. Don't invite them. Block all the haters, and enjoy your day.\n\nCongratulations!\n\nEdit: I accidentally thought dad was married to the nut.",
              "id": 140,
              "comments": [
                {
                  "score": 22,
                  "content": "Yes! I cannot handle people who believe a certain diet can prevent cancer. It makes it seem that people who get cancer deserve it due to their lifestyle. Outrageous. Problematic. Hurtful. \n\nI hope you are doing well.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You know what your problem is? You don't drink pomegranate juice.",
                      "id": 142,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Thank you!",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Anyone who pushes almond milk isn't worried about their environmental impact as much as they say they are anyway. Almond milk is the second highest for water consumption behind dairy, and all the other alternatives are waaaay behind that.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Wanting to control what the guests wear is a really pushing boundaries into nope territory. Will only pay for vegan food? Eh, a little pushy and overly restrictive, but liveable. \"Guests have to buy vegan shoes and switch up baby formula for the day\", nope.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Feeding a newborn almond milk will kill them (not one serving but it's inadequate and will lead to death by malnourishment) - so this woman tried to make you kill your baby.  That alone should make your blood boil. \n\nAnyone who tries to bully you into abusing your child should be treated with extreme prejudice.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Vegans proselytizing their veganism are exactly 0% different from any other member of a religious sect or cult proselytizing their religion to all and sundry.  Missionaries are a killjoy.  You are not damned for not subscribing to their beliefs.  Freedom of religion means she can be as vegan as she wants but you don't have to listen to her evangelize her faith or be converted to her one true faith.  🙄",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "NTA\n\nDad's friends veganism has stopped being about health and well-being and has become her way to control people around. \n\nAny sort of extremism can turn into this.  Some people use religion, and others use social constructs.  \n\nIf the family on your dad's side don't see it already, they will. \n\nBe clear to them that they are not invited and you will be having the food and clothing you want there.  Feel good about your day, and don't let them ruin it.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 860,
      "content": ">She is a vegan, which is fine but she is very judgemental to how I live.\n\nOh boi, I knew where this was going after I kept reading.\n\nOP how strong is your relationship with your father? Because his gf seems to have him quite tight in her grip. If he tells her everything you speak about in private, then I don't really see any reconciliation at the moment.\n\nAnything you ask of him, tell him, share with him - jesus even the happiness of having your daughter was tainted by her.\n\nPersonally, I'd be upset how he let her ruin the relationship between you. Because yes, she sounds like a person who does not like you and you have suffered under her comments, but he continues to let it happen.\n\nI think the only strong signal that can be set, is to not ask him about any money, but ask of him that he doesn't come to your wedding. She neither, but I would have not invited her in the first place.\n\nWe can't chose our family, sometimes it's a loving relationship, sometimes... not so much. But having a family is a privilege - one that your father doesn't seem to care about much if he lets her trample all over you like this.\n\nYou don't have to put up with that. You don't have to force him to choose, you can simply not participate in this mess.\n\nHave a nice wedding!\n\n&#x200B;\n\nNTA",
      "id": 149,
      "comments": [
        {
          "score": 855,
          "content": "Oh he tells her everything, I know this because she posts cryptic Facebook statuses. \n\nIt’s probably time I considered low or no contact. It just breaks my heart though. \n\nI tried to speak to him about it but he just made excuses and said it “all comes from a good place”",
          "id": 150,
          "comments": [
            {
              "score": 355,
              "content": "\"I know dad, the road to hell is paved with good intentions!\"\n\nBut for real, a grown woman, who supposedly is of the age where she has grown children (in your case step children) who still posts cryptic status, instead of having a conversation?\n\nNothing of value will be lost here.\n\nBut you are taking this very well, considering you have a young child, are getting married and being harrassed by this woman.\n\n&#x200B;\n\nYou can have a conversation with your father - but be aware that anything you will say will be weaponised and twisted against you. Maybe even things you don't say. I hope your father will wake up some day. But at age 29 I notice myself, not all adults change for the better. It's all our choice, but also our responsibility to do better. And people like her certainly don't make the right choice easier.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "Your dad needs an info diet. Try to get ahead of the story by going on the offensive, instead of letting her control the narrative.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "> I know this because she posts cryptic Facebook statuses.\n\nVaguebookers are so goddamn annoying.",
              "id": 153,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 61,
              "content": "Tbh, if I had to choose between feeding my baby and going to a wedding, no matter whose it was, I’d be a pretty shit mother if I opted for the wedding. \n\nYou might consider bringing the following fact up to your father: this woman is going to make it impossible for him to have a relationship with his grandchildren. She sounds unhinged, and I wouldn’t want my kids around that.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "It doesn't come from a good place, it comes from a desire to exercise control over people. There is absolutely nothing good about that, no matter how she tries to spin it.\n\nNo contact would be the best idea, it would be a lot better for your sanity. A broken heart from accepting who your father has become would be a much easier thing to deal with in the long term than the slow death by a thousand controling cuts from his wife.\n\nHead off the flying monkies who try to drag you back into the circus by giving them the cliff notes version of what's happened. If they still choose to disrespect your wishes then you can block them too with a clean concience. They've had all the info needed to make their own choices, you owe them no more than that.\n\nWe become like the people we choose to surround ourselves with, cultivate your circle of friends and family with care.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Maybe, if you send him a message about why he’s uninvited and why you may be in less contact moving forward, you can find a way to illustrate that it’s not his beliefs, it’s his behaviors. \n\nLiving a vegan lifestyle is fine. It’s his choice. You don’t have a problem with that. You have other loved ones who are also vegan. You get it.\n\nBut the manipulating, breaking promises, guilting, rumor mongering - those are the things you find unacceptable. You’ve been more than patient.\n\nYou don’t miss you dad who wasn’t vegan. You miss your dad who cared about you. And didn’t actively try to hurt you.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I’m sorry, OP. Your dad is being a poor parent. My dad’s wife is a great lady, but my dad and I have had our issues outside of that so I can empathize. I didn’t speak to him for a while and when I finally started to again, he acted much better. Sometimes a little space can be good.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "NTA. You're not uninviting him because of the money situation; you're uninviting him because he's clearly chosen a nutbar over his own child.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Piggybacking to say, you should consider hiring security. They most likely will attempt to crash the wedding so its in your best interest to hire security to vet the participants. Make sure to give them a mugshot of your father and his wife and strongly reiterate they are not to even so much as take a step into the venue.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "NTA, obvs.   \nDo you have a group email thread/group text/chat with your dad's family? I think it's worth sending folks a group message (or separately/tell the aunt who usually relays info to everyone, etc) that because you didn't want to have a vegan wedding (including attire and breastfeeding, ffs), you declined your dad's strings-attached offer to contribute financially to the party.  \nAs for your dad and his partner, as sad as it is, they're a wholly lost cause right now. If you're not prepared to have dad/his partner berate guests at your wedding for feeding milk to babies, \"ARE THOSE \\*\\*\\*\\*LEATHER\\*\\*\\*\\* SHOES!?!??!\" - let them know that they're not on the guest list. If you're willing to face that inevitability, then invite them. Just because it's family doesn't mean they get to have a reign of terror on your wedding guests (and you!).",
              "id": 160,
              "comments": [
                {
                  "score": 5,
                  "content": "Using fuel isn't vwgan either they should point that out. The woman sounds insane on the face of it but is probably slready having dad sign assets over to her.",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "All this but I would also have a conversation with your dad. That you love him very much and would have wanted him at the wedding but that policing what other people wear is not okay.  etc. NTA",
          "id": 162,
          "comments": [
            {
              "score": 34,
              "content": "His gf will likely say that she is being manipulative and \"pulling the daughter card\"\n\nPeople at that age who still judge others for their lifestyle choices and make claims like \"op trying to steal her dad's house\", those are some strong narcissistic traits.\n\nI doubt it will be successful, dad will end up more isolated either way. Unless he snaps out of it.",
              "id": 163,
              "comments": [
                {
                  "score": 15,
                  "content": "I'm gonna sound unpopular, but I think daughters should, occasionally, pull the daughter card.  Girlfriends (loopy or no) come and go, but your kid is forever. Your kid is the one who is able to visit you, god forbid, in the hospital.  A random girlfriend...is not (though I strongly suspect she's made him sign over a lot of stuff to her).",
                  "id": 164,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I'm not saying that she shouldn't pull the daughter card, I just don't think it will be successful",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This makes me so sad. My stepmother trash talked me at any opportunity and my father *never* stood up for me. I think that’s the part that hurts the worst. State your case and if your father continues to be her flying monkey keep your distance from them both.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 756,
      "content": "“Hi Dad, \n\nI understand that us having an all vegan wedding  is important to you and ____.  Being that we are not vegan and will not lay requirements on our guests like the ones you and ____ are requiring, we understand that you no longer want to contribute to our wedding which is surely your prerogative.  We are going in our own direction and will pay for our own wedding.  Just as it is important to you to live by your values, we choose to live by our own which includes celebrating our marriage with our loved ones free from judgement or pressure to embrace someone else’s values.  I hope you choose to join us to celebrate our wedding but I understand if you choose not to since it will not be appropriate or accepted for our guests to be harassed for any reason, including your family’s choice to be vegan. \nBest,\nDaughter”\n\nEff him.  Lay it out honestly and directly.  Screenshot it and send it to anyone who gives you beef (ha).",
      "id": 167,
      "comments": [
        {
          "score": 276,
          "content": "I absolutely agree, but I'd add in about the money as well and a couple of other bits. I'd also be slightly passive-aggressive. \n\n\"I hope you understand that this is not about money. I have not, do not, and will never want any of the money from your gf's father's house, nor is it about you not paying. Your veganism is clearly very important to you, and it would be unfair of me to put you in a position where you and your gf have to choose between your values and me, especially when you have made it clear that your gf, your new family and your veganism come first, second and third in your priorities. \n\nTherefore, it is best that you, your gf and your new family not come to the wedding. This way, you do not have to compromise your values, and future husband and I do not have to compromise on our wedding and can have a day that we want and have dreamed of, one that we and our guests can enjoy without being harassed or lectured about our life choices. \n\nI wish that things could be different. So many little girls dream of being walked down the aisle by their father, but I understand that your gf comes first for you. Just as you have prioritised your happiness over the rest of us, I must prioritise the happiness of future husband and I, as well as our guests. \n\nFor privacy reasons, due to gf posting things on Facebook, from now on I will be limiting communication, as it would be unfair of me to ask you not to share with your partner and your gf enjoys posting about the family, even when what she's saying is not correct.\"\n\nYou know gf will post about it on Facebook. Let her put that up and try to paint OP as anything other than reasonable; it's respecting their values, honouring their relationship and gf's place as top priority, and has OP sacrificing the chance to have her father wall her down the aisle so that the two of them can be comfortable.",
          "id": 168,
          "comments": [
            {
              "score": 21,
              "content": "Oh snap! 👍👍👍",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Brilliant! Absolutely frigging brilliant!\n\nOp NTA. Hope like heck they see this!",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This and the one above are perfect.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "I second this. A few additions - Just make sure at every chance to say \"you\", you instead say \"since you, dad, and gf have decided you're only willing to contribute to my wedding if i XYZ\" and lay it on thicker than cream cheese. Add in a - \"when i was little, i always dreamed we would X together...\"  And how gf has already had her chosen wedding ideas for her kids, and taking his own daughter's wedding away from him for her own personal tastes is breaking your heart, and remember when i was little and we....(happy memories or routines before gf came along) Let it marinate, let her blow up a few times, and then post it all on facebook. Beat her at her own game, get one last shot at appealing to your dad for your relationship with him, and humiliating gf by outing her with her own words.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "I hope OP will see this, cause that's the way. NTA of course.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "This is the right strategy OP, esp screenshotting and sending to anyone who hassles you. NTA.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Dear god, I was linked to this post from a site where I also saw your reply. I had to scroll through so many damn comments on the actual post to get here, but needed to just to give you the upvote and say that this is such a good response and idea. Personally, someone replied saying they'd add in some passive aggressive parts. I kinda agree with them cause the main point of their add-on makes it so that the father has to confront the fact that he really did decide his gf and his gf's desire for him and everyone around to be vegan are more important to him than his own daughter's wedding or a relationship with her AND his granddaughter. That being said, your reply is to the point and very gracious (probably more gracious than he deserves), but it's absolutely perfect.\n\nAs far as OP goes, I think you should ask your brother to walk you down the aisle (if you haven't already come to another solution). If you two have a strong relationship, I think this solidifies it even more by showing that your family means more to you than a newer individual who is seemingly just trying to keep your father in her pocket instead of letting him live. And it sounds like you've tried to put up with her far more than your brother (not to discredit him at all, I'm sure he tried at first, just saying it sounds like you went above and beyond an extra chance or two or seven), so if you were brought to this point, it's probably very evident to those in your family that this lady's a loon. Good luck with everything, hope it goes well!",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Why don’t I have coins… I would give this an award 🥇",
          "id": 176,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 383,
      "content": "NTA. Honestly, she sounds tiring and it's pretty apparent she's going to cause some drama so better they stay home and enjoy their tofu.",
      "id": 177,
      "comments": [
        {
          "score": 317,
          "content": "Honestly she’s exhausting. Even without the house thing she’s exhausting.",
          "id": 178,
          "comments": [
            {
              "score": 139,
              "content": "She sounds delusional.  The house thing makes absolutely no sense.  Maybe she's not getting the proper nutrients due to her diet and it's effecting her mentally?\n\nIDK, but after reading your post I would love to eat a bacon cheeseburger in front of her.",
              "id": 179,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 51,
              "content": "I'm most concerned about her manipulating your dad's side of the family. It might be embarrassing, but you really need to get ahead on the information game to your family members about what she has been putting you through. You don't want to lose half of your family because of a manipulative girlfriend",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Please update us as to how things go! Congratulations on your upcoming nuptials and best wishes for your marriage!",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 231,
      "content": "NTA  and while it may have worked with your Dad. What she did does not work. It turns people away from veganism. It actually makes them order bigger steaks just to show....",
      "id": 182,
      "comments": [
        {
          "score": 402,
          "content": "I have some really close friends who are vegan and I love them. If you ever ask them about their diet choice they will absolutely point you in the direction of resources and information and they love cooking delicious vegan food for us meat eaters to try but they ONLY talk about it when it comes up in conversation and when it’s relevant. They are passionate about it yes, but never would want to pressure or alienate someone for their choices.\n\nThis woman is the opposite and like you say, makes you just want to order the biggest steak.",
          "id": 183,
          "comments": [
            {
              "score": 96,
              "content": "These are the kind of vegans I know. But be warned, a monthly vegan potluck can turn into a total arms race.\n\nI have never met the \"meat is murder\" vegan in real life, just here on reddit.",
              "id": 184,
              "comments": [
                {
                  "score": 105,
                  "content": "I have seen a real life meat is murder vegan.  She was in the ER and the ER nurses made sure she got a vegan meal but, you see, the person in the next bed got a turkey sandwich.  She was SCREAMING like a girl in a slasher flick that she could see the meat! When the ER nurse drew the curtain barrier between them it didn't help because \"I know what he's doing with that sandwich!\"  \n\n(The pt I was bringing in had ODd on cannabis edibles and watched this all go down from the stretcher and was like...hey, do you think I can get one of those sammies?)",
                  "id": 185,
                  "comments": [
                    {
                      "score": 26,
                      "content": "This whole scene is almost like it's from an ER sitcom, lol.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "Make it clear that your dad and his girlfriend aren't invited because she's rude and delusional, but since you have vegan friends you can send a message by having a (mostly?) vegan menu anyway. 😋   \n  \nNTA at all.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I have vegan friends and I actually love the challenge of cooking for them. I've had some delicious vegan food, and we've had some really interesting discussions and they're not sanctimonious at all. I've also been lectured by vegans, and all its made me want to do is eat a big, rare sirloin. \n\nYour Dad's GF just sounds vile.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I know vegans like both of your examples. Two are dating. She lets you live your life, knows if you have questions youll ask, never judges. HE on the other hand never misses an opportunity to tell you why you're a terrible human for consuming animal\nProducts. My partner and i stopped hanging out with them because of it.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This.  My best friend is vegan, I’m absolutely carnivorous, and we get along just fine because we respect each other and don’t try to force our lifestyles on each other.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 144,
      "content": "Sounds a bit like this woman has to have everything be about her.\n\nOr she has some possible mental issues.  Or both.\n\nI'm assuming dad wouldn't attend the wedding without her? Otherwise just invite him if he doesn't want to pay.\n\nNTA",
      "id": 191,
      "comments": [
        {
          "score": 314,
          "content": "He’s made it quite clear that they come as a package now. My brother doesn’t speak to him because of it, so he’s clearly ok with his children going NC.",
          "id": 192,
          "comments": [
            {
              "score": 128,
              "content": "Unfortunately this doesn’t seem to be uncommon among parents who are struggling with their mortality. They start to deprioritize their adult children and prioritize literally any romantic partner who will have them, no matter how much it damages their other relationships, because they are *terrified* of growing old alone. Their kids have their own lives and aren’t always available, but their partner is always around. So they’re going to invest in the person they’re sure they can count on for steady company. \n\nThis often goes double for older divorced/widowed men, who tend not to have very strong friend networks.",
              "id": 193,
              "comments": [
                {
                  "score": 10,
                  "content": "Yep. My moms in a partnership/not relationship but relationship with a friend of hers who grabbed my neck and squeezed it to try kissing me in front of her. She doesn’t understand why I dislike him so much and stay away from her as a result. And he’s around a ton more since I’ve distanced myself and they feed into each others fears about their kids. It’s maddening",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "You said in formal way what my first thought was. In my words, it's all about her p***y. Once parents, specially fathers, see that their children are doing their lives and they start feeling loneliness, once they get a partner they do everything to keep them. New diet, new religion, new lifestyle, whatever the partner ask or says is right as long as they don't go away.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Have you and your brother straight up told him its her, not the money, not that the veganism, just her?   \n  \nLike explained it's not an ultimatum but that being with her creates the direct consequence of having no contact with his own children because her being in your life is just that terrible?",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "[deleted]",
              "id": 197,
              "comments": [
                {
                  "score": 7,
                  "content": "if he's trying to get out of paying, is it maybe because his gf is golddigging? the house paranoia could be projection.",
                  "id": 198,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Thats so sad. Hope we get an Update.",
              "id": 199,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I hate to say this, but some people care more about having a partner to keep their bed warm than they care about their family. Even if their partner is combative and pushing their family away, they will stick by and stay with their partner. It really is sad. NTA.",
              "id": 200,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Dam my vegan gf is going to be super happy about that whole no cancer thing. But on a serious note sorry your dad's a bit of an asshole. Maybe drawing a clear boundary for him might help, but from what you described it sounds like he doesn't care, sorry man. Lay all this crazy shit out in front of him and phrase it one final time. Like he can either start analyzing his life and his partner objectively or he will loose his family. I don't want to loose you dad, but I will not be manipulated by your GF and I refuse to deal with her narcissism during the wedding. Maybe you can both come to the wedding but if she creates 1 problem I will literally kick you out on the spot. Leave it on her to explode as she is likely to do considering all this narcissism and then kick both their asses out. If she makes a public fuss just have the mc do a joke and move on. Nothing drives narcissists insane like being ignored. Joke ideas \"don't worry guys not all vegans are narcissists\". Good luck!",
              "id": 201,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He might be OK with no contact, but I read about near fanatical fathers and stepfathers on this sub all the time, when the subject is walking their little girl down the aisle and giving her away.  Is he expecting to do that?",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "NTA by any means. low or no contact may be the path. To the well-intentioned people giving you sample messages or telling you to notify family, that’s just going to perpetuate the negative energy of this situation. No in-depth explanation is needed for your dad or for anyone else. \n\nA simple “We feel it’s best to go our own way with the wedding and without you and X there. Thank you for respecting our wishes” - to your dad. \nAND\n“Unfortunately things didn’t worked out as we had hoped. We are so happy you made it to celebrate!” - to any guests that ask about it. \n\nOf course you can explain more to people you are closer with before or after the wedding - don’t let the issue steal the happiness of the day for you! \n\nOn a side note - how good is this woman in the sack that she has your dad wrapped up in her crazy like this?",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Then they can have their own vegan wedding. You do you. Sorry you have to deal with her.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 68,
      "content": "NTA. The title sounds bad but it's more about setting appropriate boundaries around what can and cannot be expected of one another in relationships than money. I'm sorry this is wearing on you at a time that should be joyful.",
      "id": 205,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 59,
      "content": "NTA. This controlling woman is taking over your family and your dad enables it. Of your dad wants to choose a radical vegan dogma in his life is his choice but putting conditions on yours is not right by any means. \nNo one needs that drama at a wedding.",
      "id": 206,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 49,
      "content": "NTA - when it comes to weddings, money is power (trust me, I've been married over 30 years, and paying for 90% of it ourselves was best thing wife and I could have done!).  Have the wedding you can afford, make 100% of choices yourself, and do what is right for yourself and those you love. If your father has chosen this person over you, it is time to break contact - you don't need that in your life.\n\nDon't EVER believe those who try to guilt you with 'he's your father'. You didn't ask for that, and very often 'blood bonds' are used to excuse toxic nonsense. They are just people, and very often the family we choose is MUCH healthier than those we are 'related to'.",
      "id": 207,
      "comments": [],
      "relation": "Support"
    }
  ]
}