{
  "post content": "I just want to preface by saying that my father-in-law is a very sweet man with a good heart and he does a lot for my husband and I....\n\nThis year my husband and I are hosting Thanksgiving at our house for 17 people.  My father in law (who does not live with us) got a very large free Turkey and decided to that he will be cooking the Turkey for our gathering. I work full time and have a toddler so I am grateful for this.  And while I think this is a nice gesture on his part, I am a little worried because he wants to cook the Turkey the day before Thanksgiving (to get it out of the way), and then reheat it in the oven Thanksgiving day. He can cook but does not salt his food very much. This is an incredibly nice thing of him to do for us but I feel slightly insulted as the hostess that he didn't even ask if I was ok with it. But then again  I also FEEL like an a-hole because it will take a great burden/stress off of me to not have to deal with the Turkey and only the sides. I am trying to persuade my husband to get FIL to cook the bird on actual a Thanksgiving (we are eating in the evening so he has a lot of time to do so) but he's pretty set in his ways about it... \n\nAm I the a-hole here?",
  "id": 1,
  "comments": [
    {
      "score": 6,
      "content": "NAH. He means well, and your concerns are valid. Just talk to him about it. Why does your husband have to be the middleman?",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "I don't know how to approach the matter without hurting his feelings :( my husband and toddler will be hanging out with FIL tommorow so I figure he could bring it up.",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "He is family and will continue to be for the foreseeable future--learn to be honest about stuff...  I can guarantee that he will survive it.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH. He just wanted to do you a favor. There’s no problem with that. You are still going to cook everything else for Thanksgiving.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH.  Turkey already has issues with drying out and now he wants to feed everyone day old turkey?  That's gross!",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "I mean...NAH - it’s so kind of him to cook the turkey! If you’re concerned it may not come out well, you could get a spiral ham, or something “extra” just in case.",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH. If he really insists on making it the day before, maybe you can make a glaze to put on time while it reheats. Also, make some killer gravy. To be honest, I think turkey is dry and bland no matter what so I’m also probably not the best person to comment",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NAH Here but I really don't think it's something worth causing hurt feelings over so Ibwould just drop it.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NAH. You’re not an asshole, necessarily, but you are being a little controlling. Let it go. It will work out fine and it was a lovely gesture.",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "Not to mention if it’s not very good then it’s not her fault, he will get credit for the bland turkey. Most people I know prefer all the sides over the turkey anyway. I agree with you that OP is being a twitch controlling but probably because she’s hosting and it is a lot of pressure.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI just want to preface by saying that my father-in-law is a very sweet man with a good heart and he does a lot for my husband and I....\n\nThis year my husband and I are hosting Thanksgiving at our house for 17 people.  My father in law (who does not live with us) got a very large free Turkey and decided to that he will be cooking the Turkey for our gathering. I work full time and have a toddler so I am grateful for this.  And while I think this is a nice gesture on his part, I am a little worried because he wants to cook the Turkey the day before Thanksgiving (to get it out of the way), and then reheat it in the oven Thanksgiving day. He can cook but does not salt his food very much. This is an incredibly nice thing of him to do for us but I feel slightly insulted as the hostess that he didn't even ask if I was ok with it. But then again  I also FEEL like an a-hole because it will take a great burden/stress off of me to not have to deal with the Turkey and only the sides. I am trying to persuade my husband to get FIL to cook the bird on actual a Thanksgiving (we are eating in the evening so he has a lot of time to do so) but he's pretty set in his ways about it... \n\nAm I the a-hole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "So, he wants to cook the bird a day early so he can actually spend time with the family instead of minding the bird.  \n\nYou feel like his cooking is not to your taste and are bothered by cooking it a day ahead.  \n\nCooking the turkey a day ahead is really common and frees up oven space.  No loss of quality. \n\nYou need to talk to him about seasoning or recipe.  Not a big deal.  Just start with \"ive always wanted to try\" or I really think you'd love my family recipe\"  you should be the one to talk to him, not your husband (unless he is the one cooking the majority of the meal.  \n\nNAH, just a little social awkwardness and preferances.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    }
  ]
}