{
  "post content": "I have a son thats entering 8th grade and a daughter thats entering 9th grade.  Both of them have always been bookworms.  Very studious and cerebral, just like their Dad.  I also played sports all through school and I value the experience that brings.  I've always tried to push them to join sports, but neither one of my kids wanted to.  I tried to insist...maybe they would have fun?  We dont know til we try?  Even just to make them exercise and meet new friends.   My wife insisted I back off.  Fair enough.  \n\n&#x200B;\n\nNow my daughter is entering High School and wants to become a cheerleader.  She has never wanted to do anything even remotely close to cheerleading at any point in her life.  She actively made fun of cheerleaders 3 months ago.  But one of the popular girls moved in down the street last month and she has become a mainstay around my house.  She's convinced my daughter that she has to become a cheerleader in High School because she was \"a loser in middle school and you don't want that to happen in high school.\"\n\n&#x200B;\n\nI said no.  I dont appreciate that reasoning.  My wife explained that I dont \"know what its like to be a girl in high school\" and I say OK?  Hows that relevant?  I also dont appreciate cheerleading.  Its too dangerous.  Girls get severely injured doing that, and for what reason?  We don't have the insurance to cover it.  Lastly, I dont like the sexualization of the whole thing.  Those outfits are a bit skimpy, and we're talking about high school girls.  My wife says I'm focusing on the bad and not the good.  Most girls dont get injured.  I'm the pervert because I'm making it sexual.  I pushed for her to join a sport.  I let my son play sports.  She'll have a much better high school experience.  \n\n&#x200B;\n\nI'm still like...fuck that shit.  My reasoning is sound.  She's not in it for the right reasons, and the benefits are lame.",
  "id": 1,
  "comments": [
    {
      "score": 22727,
      "content": "YTA. You've spent years pushing her and now that she is finally going to give a sport a chance you say her reasoning for wanting to try isn't good enough? That's an asshole move\n\nEdit: the \"cheerleading is not a sport\" response is tired and adds nothing to the conversation. Cool it with that. We disagree on this point, I get it. Because it isn't legally defined as a sport by courts doesn't mean that it doesn't require athleticism and socialization, both things OP claimed are reasons he was pushing his children to become involved in sports.\n\n[I just want to add this link that contradicts what some people were telling me and thereby part of my previous edit.](https://www.edurisksolutions.org/treating-cheerleading-as-a-sport/) 29 states HSAAs do recognize cheerleading as a sport and treat it as such. So depending upon where you live, it isn't necessarily as dangerous as it was when the 2008 article that was thrown at me twice at least came out.",
      "id": 2,
      "comments": [
        {
          "score": 8837,
          "content": "But being pressured into playing a sport she didn’t like to appease him would have been perfectly fine reasoning.\n\nEdit: thank you whomever for my first silver!\n\nEdit: and thank you for the gold!",
          "id": 3,
          "comments": [
            {
              "score": 3449,
              "content": "> But being pressured into playing a sport she didn’t like to appease him would have been perfectly fine reasoning.\n\nThank you! OP has some bullshit logic here. \n\n\"No, you cannot do this activity because you previously did not want to do any at all\".",
              "id": 4,
              "comments": [
                {
                  "score": 3442,
                  "content": "\"Changing your mind? Not in my house.\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 999,
                      "content": "> \"Changing your mind? Not in my house.\"\n\nThis could just be me, but this is the vibe I am getting from OP. And that's just crazy talk.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 328,
                      "content": "My mom did that exact same thing when i was in high school. She wanted me to play basketball which i sucked at so i didn't do it but then when i wanted to play tennis she wouldn't let me cause i didn't wanna play basketball.  It made no sense to me then or now smh",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "More like \"Peer pressure? Oh hell no, we only allow parent pressure in this household.\"",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "No, it's because someone *else* convinced her that OP has a problem. The girl down the street convinced her and OP says he doesn't think that's a good enough reason... but clearly *him* pushing her to do so would have been fine. \n\nOP YTA. You bring up lame reasons like that she could get hurt and you don't have the insurance to cover it, as if playing soccer, basketball, lacrosse, field hockey, tennis **never** results in student athletes getting hurt; and that her friend pushing her to do it makes it not a good reason, but when **you** were pushing her to do it it was a *great* reason... mad that she didn't pick Daddy's Sport of Choice? Get over yourself. \n\nI saw kids like yours, with overly controlling parents, when they hit the college campus for the first time without Mummy and Daddy breathing down their necks... the drug and alcohol fueled results weren't pretty.  Lighten up.",
                  "id": 9,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I do agree. But I'm still not liking the fact that her daughter is being \"forced\" to join cheerleading by her friend with a stupid as reasoning as \"you weren't cool duh\". That's crap for me, toxic mentality.\n\nI hope she'll have fun though, it might be an awesome experience. Yet I'm still a bit unsure about that girl telling her that.. What if this results on her shaming OP's daughter with the other girls? I don't know, high school is drama, and sometimes popular girls (anyone popular, in reality) can double down a smaller fish..",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 787,
              "content": "This guy is such a hypocrite and asshole. Also he has only responded to like one comment because he doesn’t like the fact that he now knows he’s extremely in the wrong. What a piece of work. YTA dad and should be ashamed.",
              "id": 11,
              "comments": [
                {
                  "score": 248,
                  "content": "I'm kinda getting a fake shit-post vibe from this guy. Anyone else?",
                  "id": 12,
                  "comments": [
                    {
                      "score": 194,
                      "content": "Yep. He sounds like he's in high school himself.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Yep. It's a pretty perfect asshole setup. I do appreciate that at least it's entertaining and sparked some discussion though.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Not totally. I feel like this guy may have wanted to be in the \"cool kid\" crowd in school and wasn't, and now is afraid his daughter will become the kids he hated in school.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "Came here to say this! Doesn't like the answer to his question, and is arguing and being an asshole to everyone he does respond to!",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "He's definitely the asshole. \nOP, YTA big time. Also, I think you're pretty damn petty. Some girl convinced your daughter to join a sport and you are just mad that it wasn't you. Who cares what the reason is? If she ends up loving it then great. If she ends up hating it then she can drop it. But you're not a good parent at this point and she will resent you. Honestly, your wife should just join her up anyway. Nobody needs your permission. Your ego isn't worth your kids happiness over something so trivial.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "He responded to a few, but most of his responses got deleted because he is arguing his judgment rather than accepting it.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 201,
              "content": "It’s OK if he pressures her, but not if a popular girl does.",
              "id": 19,
              "comments": [
                {
                  "score": 33,
                  "content": "He is a parent so he should be pressuring her to do physical activities for health reasons.\n\n&#x200B;\n\nThat said, he is TA because of his reasons for opposing cheer leading for the reasons he gave.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I mean, cheerleading has a higher injury rate than american football. That one is kind of legit",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Cheerleading = unsupervised gymnastics without the padding.  \"It ranks #2 in severity of injuries out of all high school sports\" journal of pediatrics.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 192,
              "content": "THIS is what has me voting YTA. Sure, parenting involves some necessary hypocrisy. But that has to diminish as the kids get older. Your daughter is going to end up assuming that you don’t want her ruining your sexual fantasies about cheerleaders instead of any valid criticism about her choices. \n\nTrust your kid. If she tries it and hates it, then everyone ‘wins.’",
              "id": 23,
              "comments": [
                {
                  "score": 14,
                  "content": "Excellent,excellent, common sense advice!",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Ooooooo this comment🤣🤣🤣 totally agree. Dad probably loves a good cheerleader porno.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Personally, I don't see his opinion as being motivated by his sexual fantasies, though. Right or wrong, there's a significant portion of the population who consider cheer-leading to be similar in experience or value to child modeling or child pageantry. While I don't agree with that particular sentiment since cheer-leading is obviously a sport given that it isn’t much different from gymnastics or figure skating and that objectification isn’t integral to any sport, but is integral to something like modeling, I can  somewhat understand the hesitance of this possibly prudish person. \n \nThat said, there’s really only two reasons why I’d be against having my daughter be in cheerleading and those are the extreme athleticism and time commitment involved. I played tennis in high school and my level of training for tennis was abysmally low in comparison to what I saw daily for the cheerleaders. They work as hard as or harder than other athletes and that extreme level of strenuous activity might be dangerous for someone who’s still growing. Sure, jumping can lead to the building of strong bones, but my fear is more on the long-term impact on joints.\n\nThis level of training then leads to an incredible amount of time commitment that might take away from study necessary in school to build a solid foundation for a college or academic career. My friend who was a cheerleading fanatic spent 3 hours every day after school to prepare. Tennis, on the other hand, only required maybe an hour and a half a day of practice.\n\nAgain, I don’t agree with this guy’s understanding of sexual objectification. Men can sexually objectify everything. I’ve seen some old perverts harass female tennis players before. If this is something that might possibly make her happy and active, that should take precedence over someone else’s warped viewpoint.\n\nTLDR - Let her try it a couple of times, OP. YTA if you don't.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "TBF any activity for teens is going to be massively sexualized. It's not cheerleading itself, it's the disgusting way in which our society objectifies adolescent girls. Dad should lay off the porn for a while.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 176,
              "content": "> But being pressured into playing a sport she didn’t like to appease him would have been perfectly fine reasoning.\n\nThank you! OP has some bullshit logic here. \n\n\"No, you cannot do this activity because you previously did not want to do any at all\".",
              "id": 28,
              "comments": [
                {
                  "score": 100,
                  "content": "Seems to me he has an issue with his daughter doing things differently then he did as a kid. \n\nNot like anything has changed about the school system in the last 30+ years /s",
                  "id": 29,
                  "comments": [
                    {
                      "score": 109,
                      "content": "> Seems to me he has an issue with his daughter doing things differently then he did as a kid. \n\nAgreed. This is probably just me, but I find that completely bizarre. I am probably roughly the same age as OP, and I would want my children to have their *own* experiences. Not replicate my own as if life were one gigantic Xerox machine. \n\nI also love OP's \" I also dont appreciate cheerleading.\"  I'm sure his daughter doesn't appreciate him attempting to force her into \"approved\" sporting activities, and yet here we all are. *smh",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Kids are more accepting of different people now. When I was in high school even over a decade ago, punks hung with jocks, hung with nerds. There was only one weird kid group, and it was mostly because they didn't believe in hygiene. And this was in rural area, in which the adults were pretty racist.\n\nBut also\n\n>Very studious and cerebral, just like their Dad.\n\nDude's so far up his own ass he's re-eating breakfast",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This is the same as asking your kid who hides out in the basement to join you for dinner and when they finally do you say things like \"Oh you finally chose to grace us with your presence\" Therefore removing any future desire for that person to try. Damned if you do, damned if you don't.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1087,
          "content": "I am surprised he doesn't understand this as a very cerebral person...",
          "id": 33,
          "comments": [
            {
              "score": 839,
              "content": "[deleted]",
              "id": 34,
              "comments": [
                {
                  "score": 262,
                  "content": "\"Any man who must say 'I am king' is no king\"",
                  "id": 35,
                  "comments": [
                    {
                      "score": 78,
                      "content": "I. AM NOT. TIRED!",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 129,
                  "content": "The second I read that in the post, I had a good idea it would end with OP being the asshole",
                  "id": 37,
                  "comments": [
                    {
                      "score": 231,
                      "content": "When I read \"cerebral just like their dad\", I assumed it was the other parent writing the post.\n\nWhen it became clear that sentence was referring to OP, instant AH.",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 74,
                  "content": "He's a very stable genius.  Or so people tell me.  A lot of people tell me that.  Believe me.",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "It's the kind of thing you say if you're not smart enough to realize that you're actually not that smart, in the larger scheme of things.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "What if hes professor X, though?",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 183,
              "content": "Lmao, I was so confused when he brought up the wife, then I realized that he had the audacity to call *himself* fucking cerebral. Calm down, Shakespeare.",
              "id": 42,
              "comments": [
                {
                  "score": 19,
                  "content": "And in the third person no less 🙄",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That confused the hell out of me, too.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 52,
              "content": "When I got to that line, I was desperately hoping \"their Dad\" wasn't the one writing this post. Oh well.",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Decided YTA right after reading that",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Cheerleading = Bad\n\nr/iamverysmart",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 340,
          "content": "One of the smartest people I know was a cheerleader for MIT. She now has a PhD in neuroscience.\n\nLet your kid cheer.",
          "id": 48,
          "comments": [
            {
              "score": 34,
              "content": "I used to be a cheerleader and now I have a degree in neuroscience",
              "id": 49,
              "comments": [
                {
                  "score": 61,
                  "content": "I never cheered, and now I am dumb as rocks.\n\nI should have become a cheerleader",
                  "id": 50,
                  "comments": [
                    {
                      "score": 12,
                      "content": "these two comments are the only proof we need.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I have a degree in neuroscience and I was a gymnast. Between the sport and my academics, I met a ton of girls that were brilliant and did cheerleading. It's very sad when I see other guys make a girl feel like she can't do STEM while also being \"feminine\" or doing things they deem cliche, like cheerleading. I know an ex NFL cheerleader that is a doctor now, and plenty of HS/College ones that are now career women as engineers, lawyers, consultants, and so on.  \n\nI think OP is disregarding how important his daughter's social life is in terms of forming her mental health and view on life into adulthood. I know plenty of people that are book smart but didn't go very far due to a severe lack of social skills.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I was a cheerleader. I have a Ph.D in strategic management. Cheerleading taught me discipline and grace.  It taught me to focus on the details of things and always try to improve. And to have fun doing it.  Do you know how handy these life skills are when writing a dissertation?  I am so fucking grateful for my amazing life.  I second this: let your kid cheer.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 266,
          "content": "YTA OP. And if I were your wife I would go over your head on this and let her try out. While I agree her reasons seem lame, and I don't like encouraging young girls to try and do things to fit in and be popular, the alternative is that you alienate her from possibly making a solid friend group and branching out. You were ready to push your kids into activities you approved of, as a parent you have to stop being so selfish and think of them and not you. This makes me glad I have sons and not daughters.",
          "id": 54,
          "comments": [
            {
              "score": 14,
              "content": "He also doesn’t seem to care that other sports are equally as dangerous. Why is this specific sport too dangerous?",
              "id": 55,
              "comments": [
                {
                  "score": 9,
                  "content": "It isn't. It is an offhand excuse he is using to justify his opinion.",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "[deleted]",
              "id": 57,
              "comments": [
                {
                  "score": 3,
                  "content": "As a father of three girls, I'm right there with you.",
                  "id": 58,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "I BACK THIS UP. YTA.\n\nYou really shouldn't control what sport she can play when she finally decides on one. Let her do it. Would you stop your son from playing football/basketball/baseball/golf because it's too dangerous???? \n\nWHAT IF YOUR SON WANTED TO DO CHEERLEADING TOO? WOULD YOU STOP HIM?",
          "id": 59,
          "comments": [
            {
              "score": 63,
              "content": "Louder for OP and the people in the back!\n\n>I *pushed* for her to do something I wanted her to do and won't support something *she* wants to do\n\nor\n\n>I *let* my son do something I wanted him to do because he wanted to do it too\n\n\nOP needs to pick one.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "Exactly, keep moving the goalposts on her OP, I’m sure she won’t resent you at all.",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 132,
          "content": "Also everyone and everything is sexualized in high school...sounds like OP is having a hard time accepting his daughter is growing up",
          "id": 62,
          "comments": [
            {
              "score": 7,
              "content": "“The outfits are a bit skimpy”...like, what? Not more than anything else, lol. Your daughter is just growing up...come to grips with it normally and all things will turn out better! Anyways, let the girl cheer if for no reason other than, if it wasn’t her original idea, she likely won’t be sticking with it for too long anyways, ya know?",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "C’mon you have to try a sport something, anything. Get out of those house, join an activity. You’ll make friends and have some new experiences. It’s good for you.  ——ok  I want to do this.....   NO\n\nProbably the asshole.",
          "id": 64,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Anyone who says cheerleading isn’t a sport has no fucking clue what they are talking about.\n\nThis is an example of what actual cheerleading is like. I know several people, male and female, who do cheerleading, and most of their social media of them training is very similar to this.\n\nhttps://youtu.be/NTbH76BcU4c\n\nCheerleading is actually a legit tough sport that requires strength and coordination. The stunts performed also means that the serious injury rate is ridiculously high.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "No, it's worse that this. \n\nHis reason is *she might get hurt* and *its too dangerous*. \n\nHow is cheerleading any worse than any of other sport in that regard?? \n\nOP clearly not even being honest with himself.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14860,
      "content": "YTA.\n\n> Girls get severely injured doing that\n\nAnd contact sports are well known for concussions issues that last a lifetime, more than say, a broken arm would. \n\n> Those outfits are a bit skimpy, and we're talking about high school girls\n\nStop sexualising kids, I agree with your wife here. \n\n> My wife says I'm focusing on the bad and not the good\n\nYou are. Cheerleading is, IMO, a sport as well, given what the body goes through (which, before you get into 'too dangerous' is just as bad as a kid playing contact sports.)\n\n> I've always tried to push them to join sports, but neither one of my kids wanted to\n\n.\n\n> I let my son play sports\n\n.\n\n> She's not in it for the right reasons\n\nAnd playing sports because your dad can't get off your back is the 'right' reason?\n\n> We don't have the insurance to cover it\n\nAnd yet you have the insurance to cover your son's injuries while playing \"conventional\" sports?\n\n> Very studious and cerebral, just like their Dad. I also played sports all through school and I value the experience that brings\n\nBasically, you want your kids to be just like you were in school - 'I'm cerebral and studious' 'I played sports' - but when they want to try something different, it's 'the benefits are lame.'\n\n> She'll have a much better high school experience.\n\nNo, she'll resent you. She's, what, 13-15 rn? The closer she gets to 15+, the more she'll rebel (it's human nature) and the more you try and prevent her from doing inoffensive things, the worse it'll be.\n\n> I also dont appreciate cheerleading.\n\nOh boo-hoo. No one's asking you to become a cheerleader. Your kids aren't little mini-mes that can only like the stuff you like/'appreciate'/'respect'\n\n> My wife explained that I dont \"know what its like to be a girl in high school\" and I say OK? Hows that relevant? \n\nBecause wanting to fit in/be in the same activities as friends is a perfectly reasonable desire that - lbr - is often stronger in high school girls than boys. She wants to fit in, but you don't want her to try for no reason at all.\n\n> My reasoning is sound\n\nNo it's not.\n\n> Its too dangerous\n\nplaying a contact sport like your son likely is and you're trying to push her into is more dangerous - again, concussions can affect the rest of your life, and as a lot of tragic incidents have shown, even kill kids if severe enough. when that's a reason to turn them towards TT/chess instead of regular sports, *maybe* you have a leg to stand on there.\n\nYTA. Let your kid live her own life.\n\n**EDIT:** Oh, this is also not considering the fact that your kid might not make the team - so you're currently preventing her even trying out. Like I said, cheerleading's as strenuous as a sport, and you kind of need to be good at it to make a team.\n\n**EDIT 2:** A lot of people are pointing out that cheer uniforms are sexualised by nature, and OP isn't out of line by pointing that out. It's a valid point, but there are two issues there: based on OP's other comments, his kid is 13, so I doubt said cheer uniforms are showing ass and cleavage. It's not an NFL level set up where there's more skin on display than not and it's a legitimate concern - it's not even 16-18 year old girls pushing the dress code and uniforms to the limit. It's 13 year old kids. Also, OP has also said that he'd be okay with volleyball and swim - both sports that are played in swimsuits, which undoubtedly cover less than whatever the cheer uniform is for 13 year olds at OP's kids' school. So, OP's *is* sexualising kids here - his issue is with *cheer uniforms in particular,* not skimpy clothing in general, and 13 year olds in any uniforms should never be sexualised, I don't care what your porn searches filled with consenting adult performers are about. Cheer uniforms do not automatically make a child a sexual object.\n\n**EDIT 3:** Another issue that's been brought up is injuries and cheerleading. I acknowledge that I was not as informed on it as I should have been, but as several other commentators have pointed out, injuries are a side-effect of any sports. Even e-sports carry the risk of carpal tunnel. OP's kid is 13, so to start, I doubt they are doing any showy stunts like the ones one TV and film - it's probably a couple of jumps and flailing arms, and at most a couple of high kicks. *Even if I'm wrong about this,* there are ways to minimise risk without banning the kid from being on the team - again, as others have pointed out, let her be a part of it as long as she's not a flier, for one. If the concern is lack of adequate first aid/trained coaches *at the school* (because that's where OP should focus, not national level estimates), then that's a different matter and a logical reason to have her not compete, as opposed to OP's current reasoning.\n\n**EDIT 4:** On the friend issue - based on the rest of OP's post, I'm very hesitant to take the 'she said my kid would be a loser if she wasn't cheerleading' part at face value. It's simply thrown in there, to try and provide an additional argument on his side, and he doesn't seem to have any concern that if it is true, that the friendship itself is toxic. It's cheerleading that's the issue, and he's willing to throw anyone under the bus for a favorable response. My guess? The friend said something on the lines of 'everyone thought you were a loser in middle school, maybe this will help you become more popular like you want to.' Not the nicest thing to say either, but a far cry from the way OP portrayed it, and essentially a frank conversation between friends versus bullying from the resident \"mean girl.\"\n\nMy ultimate issue with OP is his reasoning seems to be simply 'I don't like it and don't think it's a sport' - none of his arguments are well-reasoned, and the holes are large and varied. The most honest he is about his position in his post, I think, is when he says:\n\n> I'm still like...fuck that shit. My reasoning is sound.\n\nTo him, he's right, and the story ends there, regardless of what his kid(s) or wife have to say.",
      "id": 67,
      "comments": [
        {
          "score": 3509,
          "content": "This detailed response is a mic drop moment.",
          "id": 68,
          "comments": [
            {
              "score": 808,
              "content": "No other comments needed really. Completely nailed it",
              "id": 69,
              "comments": [
                {
                  "score": 410,
                  "content": "r/threadkillers",
                  "id": 70,
                  "comments": [
                    {
                      "score": 74,
                      "content": "Welp! I'll see myself out as my comment would be irrelevant since that initial comment cleared up the air perfectly.",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "Yes. Not only all that, but also: when I was in 8th grade, I decided to join cheerleading, because a friend did, and told me I’d probably like it. Also, our school was small and was actively recruiting— so I joined! And then, since it wasn’t really my steez, quit after a few months.\n\nSexualized— there are lots of skimpy outfits in sports: tennis, ice skating, gymnastics, and dance, to name a few. Would dad be against these, too?",
              "id": 72,
              "comments": [
                {
                  "score": 20,
                  "content": "YTA Yes, studious dad would be against those too. The \"Daddy's little girl can't grow up\" is strong with this one. \n\nHey bud, instead of fighting to shape your daughter into who you think she needs to be, how about you love and support her into the person she wants to be.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I was about to say, practically every female sport available to her in high school has \"skimpy\" outfits. The only ones that dont (that I could think of at least) are hockey, softball,and basketball.\n\nLike what? Just because she's wearing a skirt over her spandex shorts she's suddenly a whore? I dont get it.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Our cheerleaders outfits covered more than our volleyball uniforms. Especially fall cheer.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "YTA\n\nyoure all humouring OP too much. if he was being honest his argument would be \"i think shes going to blow the whole football team if she becomes a cheerleader\". its that simple",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "\"Boom, you looking for this?\" \n\nLet your high school kid do high school stuff. Anyone can get hurt doing the simplest of things. \n\nDon't go outside, you might get hit by a meteor! \n\nSaid no one ever.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 648,
          "content": "Give it up everyone, we can go home. This is it.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 583,
          "content": "This.  I did equestrian sport all through high school, college and as an adult.  A bunch of relatives were really shitty to me and my parents because it was \"too dangerous\" and I was obviously going to get killed or paralyzed.  \n\nSpoiler:  I didn't get killed, I never got a concussion or broke a limb and I wore more protective gear than most bike commuters wear.  \n\nThat sport was the best thing to have happened to me as a shy, out of shape and introverted kid.  I can't imagine a world where my mom and dad wouldn't have encouraged me to try it.",
          "id": 79,
          "comments": [
            {
              "score": 111,
              "content": "Same here! I rode for about 11 years and stopped once I left for college. I actually did break my arm, but it was the stupid squirrels who spooked my horse.. Still no regrets though.",
              "id": 80,
              "comments": [
                {
                  "score": 3,
                  "content": "I broke my arm falling of a slide when I was like 6 years old. Literally no one ever said I shouldn't go on other slides though. Because accidents happen. If you had broken more than one bone, that might be another thing, but once? Come on.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I wasn’t discouraging horseback. I also didn’t say it wasn’t an accident; I was just sharing a personal story.",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "Are you me?? My parents got flak for getting me into riding as well.  But honestly, it taught me all of the adult skills I have and shaped the person I am, not to mention keeping me out of LOADS of trouble as a teen.  It also shaped my financial situation but hey, that’s horses for ya.",
              "id": 83,
              "comments": [
                {
                  "score": 41,
                  "content": "Fellow rider here! My parents sent me to a horse summer camp called Little Hope Ranch for several summers. Later, I would volunteer at a stable in exchange for riding privileges in high school. After high school though I drifted away from horses and I really wish I hadn't. Very rewarding experience either way!",
                  "id": 84,
                  "comments": [
                    {
                      "score": 25,
                      "content": "You can always go back! I was the same after high school and started taking weekly lessons again this spring. I'm so glad I did, it's great exercise and a lot of fun.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I had the same experience. I did Hunter/jumper all through high school. I got knocked off, bucked, sprinted away with and injured more times than I can count. But did my parents tell me that I should stop?\n\n*Hell no*!\n\nSports that have some level of “risk” are great learning experiences. You get hurt? You learn what you did wrong and what you need to differently to prevent that a second time. You have to do something that caused you to get hurt in the past? Great opportunity to learn how to deal with and overcome your fears. \n\nBut let’s be honest, the dad doesn’t give a shit about his daughter getting hurt or not. He’s just trying to control her life because he has a vendata against cheerleading for shitty reasons.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Cheerleading is waaaay more dangerous than equestrian sports, isn't it?",
              "id": 87,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 129,
          "content": "This is such a well reasoned response - I really hope OP reads and actually takes in on board. And btw OP, YTA",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "His reasonings for not letting her play are pretty stupid. However, she probably shouldn't try any competitive cheer if she has no athletic experience, especially with the sport. Many people who tryout cheered in Popwarner or have gymnastics/dance backgrounds. That doesn't mean she can't tryout for sideline cheer, as that's less of stunting and more of hyping the crowd, and remembering moves and chants. If she doesn't make it in, she could try a sport where a lot of freshmen are newcomers, or where she can learn quickly, like volleyball or soccer. She should be practicing before the tryouts, though. Make sure she's got the flexibility and the stamina to keep up.",
          "id": 89,
          "comments": [
            {
              "score": 235,
              "content": ">That doesn't mean she can't tryout for sideline cheer, as that's less of stunting and more of hyping the crowd, and remembering moves and chants.\n\nI doubt she'd be put into heavy stunts right off the bat. I think OP is using that to justify stopping his daughter from joining.",
              "id": 90,
              "comments": [
                {
                  "score": 90,
                  "content": "Also, she'd most likely be placed on the JV team rather than varsity if they're in the U.S.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "Hopefully things have changed, but when my sister did cheer in high school it was *crazy* how hard they pushed these kids to do stunts they weren't ready for. I remember going to a cheer meet - every team had every member do a back handspring, and every team had several kids fall awkwardly. That's not a safe move if you can't nail it. I think my parents would've pulled my sister out themselves if tearing her ACL at that same meet didn't take care of it for them, and they were super supportive up until seeing how dangerous it was. \n\nNot saying it makes OP's reasons right, but I am wary of my kids doing cheerleading after my sister's experience.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 8,
                      "content": "That's the polar opposite of my experience. Very few schools around me even did competitions, and if they did the only girls on them had long cheer/gymnastics backgrounds. If you walked into cheer with tumbling skills you'd learned elsewhere you could show them off at games, but if you didn't know how to tumble they weren't teaching you at school cheer. As far as I remember, my school did no stunting at all.",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I was a cheerleader but graduated in 2008 and we were very much pushed into doing crazy stuff and completely skipping over basics at times. Thankfully I had the foundation already but a lot of the girls didn’t and we straight skipped over the important details. My friend ended up breaking her neck because she ran under a girl who was falling to try to catch her by herself even though we could have caught her together easily between us.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "I doubt she’ll make the team. anyway. The cheerleading team at my high school was entirely made up of girls who had been doing either dance, gymnastics, or competitive cheer for years. Maybe it’s not like that everywhere but high school cheer wasn’t something you could just decide to do one day with no experience, you’d get cut immediately.",
              "id": 95,
              "comments": [
                {
                  "score": 15,
                  "content": "I was thinking the same thing. Competitive high school cheerleading isn’t something you can get into without experience, unless maybe your school is very small and there aren’t many girls trying out.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yeah, in middle school basically everyone got on because the girls who did competitive cheer, dance, or gymnastics weren’t trying out. But in high school those girls were hoping to get recruited for college cheer, dance team, or gymnastics so they were the ones trying out.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yeah, that was my thought too.  I sincerely hope cheerleader girl isn't setting this poor kid up to make a fool of herself at tryouts.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Came here to say the same thing. It's sad, but it's almost that way with most HS sports. If you haven't been playing for years by the time you get into HS, it can be very hard to make any team (football, basketball, etc.). Not impossible, but very hard.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "I don't know where you went to school but the schools I went to, freshmen were not newcomers in soccer or volleyball. Speaking from experience most of us played in middle school, off season club teams and summer camps.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "She would most likely get placed in junior varsity cheerleading if in the U.S.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OMG. If she has potential, she can totally start out in cheerleading as a freshman easily. There is no harm in trying out.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "You are so right. If dad doesn’t let her try, he will never hear the end of it. Ten years from now OP’s daughter will still bring it up.",
          "id": 103,
          "comments": [
            {
              "score": 92,
              "content": "My dad wouldn't let me join. Its been over 20years, and I still resent him for it.\n\nIt's like my dad wrote this post.",
              "id": 104,
              "comments": [
                {
                  "score": 4,
                  "content": "Same. I’m 30, my parents still hear about it. I wasn’t allowed to cheer for the same reason about the uniforms.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Probably. My mom didn't let me join the swim team. I was invited to join by the head coach after he watched me swim. That was a long time ago and there's a part of me that is still bitter. I wasn't in any extra-curricular activities, really, until I joined choir in grade 11. I was never athletic but swimming was my thing. It would have been good for me to participate in one sport but, no, that didn't happen.",
              "id": 106,
              "comments": [
                {
                  "score": 6,
                  "content": "My husband is nearly 50 and he still complains about how his mom pulled him out of swim when he was 8.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yep. At some point you have to let the baby birds fly out of the nest. How else do you expect them to learn and grow??",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "This is completely true.  My parents (mainly, my dad) refused to let me participate in \\*any\\* extracurricular activities in elementary school.  There was even an incident (when I was 9) where my dad refused to drive me to an evening music performance (where I had a role) at school because he did not want to drive A HALF MILE in the rain.  \n\nI'm 35 now and I have never let him forget it.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "I totally missed that he assumes she will make the team.  You are right, cheerleading is strenuous and the tryouts are tough.  I hope if he allows her to try out and she doesn't make it, that he is kind and supporting and not condescending or saying things like \"well, it isn't a real sport anyway.  Go do soccer.\"",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "You know if he did let her play, I hope he doesn't do what my parents did and bully her out of the sport. Any after school activities that I had an interested they would ridicule me about at home, hardly show up for events and if they did, they would embarrass me. \"Waste of their time\". Now my little sister is being actively supported by my parents for her interest in sports. They even bought her a bow, which stung because they made me get rid of the my bow. I ended up misdirecting my anger for the blatant favoritism towards my little sister rather than my parents. Needless to say, my family and I don't talk a whole lot.\n\nSo, if OP really loves his kid he should support her in her activities or there will be a fallout when she gets older and realized that her dad is an asshole.",
          "id": 111,
          "comments": [
            {
              "score": 12,
              "content": "Sorry, bro. Sending you virtual hugs. Do you still have a good relationship with your sister?",
              "id": 112,
              "comments": [
                {
                  "score": 12,
                  "content": "Yeah! Thankful I grew out of the hate and just accepted that my parents were twats to me, but that doesn't mean I can't make sure they aren't twats to her.\n\nI don't know why people do these things, but I like to assume it's out of ignorance because at least I know how to fix that. And letting other people know, that playing favoritism and not letting your kid enjoy their life can have consequences. Also, therapy is fucking expensive, if I can save a future adult from that price tag then I will!",
                  "id": 113,
                  "comments": [
                    {
                      "score": 8,
                      "content": "👍. Anyways, is she favored because she’s like a ”mini-me” of her parents?         Tbh, I’ve always hated the word. Kids are human beings, not just some vessels to carry on the family name and/or honor.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I’m sorry that happened to you, it really sucks when parents treat your sibling differently. \n\nFor me it was friends, my parents had nothing good to say about my friends, it was always that they were ‘manipulating’ or ‘controlling’ me. I wasn’t really allowed round their houses and my parents resented when I’d invite them round ours. So I decided to drop all my friends (other reasons led me to this too), but now guess who’s friends are loved and welcomed in like family. That’s right, my little sister.\n\nHer friends pictures are in the family mantelpiece, along with my sisters prom, my mums graduation pictures etc. And my parents tell me that I’m just not sociable and that I struggle with people (not true). It’s frustrating to say the least.",
              "id": 115,
              "comments": [
                {
                  "score": 5,
                  "content": "That was a constant in my life too. Then the parents are like \"oh man, why don't you like to talk to us. Why don't you have your friends over, you must be embarrassed of us\". \n\nLike??????\n\nHonestly I hope you have a good relationship with your littler sister. It's not her fault, but I don't blame you for not going full no contact either. It takes a long time to find a happy place in this world, and toxic people won't make it any easier!",
                  "id": 116,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Luckily my sister can see it from my point of view so we get on pretty well. She has her own problems with our parents too, so the grass isn’t always greener!",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I'm sorry your parents suck so much ass :/",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "> Stop sexualising kids, I agree with your wife here.\n\nIt's not his fault, those girls threw themselves at him! What was he supposed to do?!",
          "id": 119,
          "comments": [
            {
              "score": 76,
              "content": "Let's be real about just this point. Cheerleader outfits are disturbing attempts to sexualize children. It's really not that far off of children's beauty pageants.",
              "id": 120,
              "comments": [
                {
                  "score": 40,
                  "content": "I'm genuinely surprised that I had to scroll so far to see this comment.\n\nI'm all for people taking steps to increase their body confidence, even from a young age. I think people should be allowed to learn how to appreciate themselves and their body image, and I see that as an important part of growing up.\n\nBut when I see the way cheerleaders have been sexualized by popular culture and society in general, it gives me the willies. It's just as unethical as the way Japanese schoolgirls are, in my opinion.\n\nMaybe I'd be more okay with it if cheerleaders were given more options for uniforms. If they could choose to wear something less revealing that still gave full range of movement, it wouldn't feel so forced, so objectifying. If a teenage girl chooses to wear something that happens to be sexualized by society, I suppose it's her decision. But that should be her _choice._ Cheerleaders should be allowed to practice their impressive routines in ways that don't require revealing clothing.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I was scrolling specifically for this comment and the one you replied to. The parent comment brushes it off like he’s the pervert. Fuck that. If there’s one good reason in this whole thing, it’s that. He’s still the asshole, but people need to stop chastising him for that part. It’s literally the opposite reasoning from what everyone is saying. He’s the sexualizing creep because he doesn’t want his daughter to wear a skimpy outfit? Foh.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "These \"cHeErLeAdErS aReNt SeXuAl YoU pErV\" comments are ridiculous. Are we just going to pretend there isn't a MASSIVE amount of cheerleader porn out there? Cheerleaders are obviously sexualized. OP is an asshole but a broken clock is right twice a day.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Completely agree. OP isn’t the one sexualizing children, the creeps who design and purchase the uniforms are.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "What was annoying in high school was that I got a detention because my shirt rode up when I was walking in the hall and showed my stomach a tiny bit, probably not even an inch of skin. You'd also get a detention if your shorts weren't long enough to reach your fingertips with your arms by your sides. Meanwhile, cheerleaders' uniforms showed almost their entire stomach and their skirts barely covered their butts, and they're supposed to represent the school. That made no sense to me, even as a teenager.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Ban cheerleading below 16? That could help. Alternatively, more conservative outfits. Tho I doubt doing the cheerleading routine in an ankle-length skirt would work. (´・_・`)",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Sexualization is half the point of cheerleaders\n\nLiterally every guy reading this has watched a porno with pornstars dressed as high school cheerleaders.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Love your response however cheerleading is the most dangerous high school sport (on mobile so can’t link a source sorry). Cheerleaders get concussions very often due to 100+ lbs girls falling out of stunts. I was a backspot for one season and got one concussion and the wind knocked out of my multiple times. I also have back problems stemming from an incident where the flyer fell at a weird angle and I had to twist in a weird way to catch her while also breaking my own fall. It’s a very, very dangerous sport. Then when you add tumbling to it, cheerleaders can get lifelong knee and ankle injuries. At least football players have helmets and pads lol.",
          "id": 128,
          "comments": [
            {
              "score": 11,
              "content": "Cheerleading is incredibly dangerous. How people aren't aware of this is beyond me.",
              "id": 129,
              "comments": [
                {
                  "score": 5,
                  "content": "And they don't really get compensated for it either. I've heard the pay is pretty meh",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I'll never forget the cheerleader in my high school who was a flyer, and was tossed but not caught. \n\nShe was very \"lucky\" that she didn't hit her head when she fell, but caught herself with both arms.\n\nHer wrists dislocated severely. The radius and ulna slid under the bones in her hands and nearly exited her palms. When she straightened her wrists, the hand and the arm bones overlapped by at least an inch.\n\nI think it's called Perilunate dislocation. Great way to incur permanent nerve damage in the hand.\n\nI don't know how she did long term, I think she healed well, but I remember months where she had no use of her hands.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5328,
      "content": "[deleted]",
      "id": 132,
      "comments": [
        {
          "score": 2853,
          "content": "YTA\n\nYeah I chuckled at that. At that point I thought the mom was narrating until I saw \"my wife\" then doubled back.\n\nDad sure is the bee's knees.\n\n\"Fuck that shit. My reasoning is sound.\" Yeah buddy, people who are convinced they are the smartest person in the room usually aren't.\n\nLet your kid \"go out, exercise and meet new friends\" There are tons of things parents should be worried about, your kid cheer leading isn't one of them.",
          "id": 133,
          "comments": [
            {
              "score": 641,
              "content": "[deleted]",
              "id": 134,
              "comments": [
                {
                  "score": 238,
                  "content": "A narcissist talks like that.  He is basically trying to make mini versions of himself (he clearly considers himself amazing) and gets pissy when people don't do exactly what he wants and expects from them.  Those kids are going to be on that raised by narccisists sub Reddit at some point, if they aren't already.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I don't know if it's narcissism or ego. Maybe both.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "Smart people call themselves smart. Narcissistic assholes call themselves cerebral because they think it makes them sound smart",
                  "id": 137,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Smart people don't have to say that they are smart. They just go about their business. It is usually other people who identify them as smart. \n\nI would be wary of any individual who told people he/she was smart. This is exactly like someone saying they are \"cool.\" If you have to say it, you aren't.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "I thought the Mom remarried a woman that was now her wife, but then I realized OP is self-obsessed",
                  "id": 139,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I did the exact same thing LMAO. I started off thinking it was the wife writing the post and then had to scroll back up and read it again to figure out it was the dad. \n\nI would guess that almost everyone did the same thing. \n\nOP seems to think very highly of his brain. Which is funny to me, because if he was half as smart as he thinks he is, he wouldn't have needed to come here to find out he is being an asshole. He would have realized it on his own, and let his daughter try out for cheerleading.\n\nThe fact that he felt the need to let the world know how cerebral he is, while trying to get justification from strangers for being an overbearing douche bag to his kid, is absolutely hilarious to me.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 74,
              "content": "Count me in as another one who thought it was the mom when I read that until I got down later into the post.",
              "id": 141,
              "comments": [
                {
                  "score": 3,
                  "content": "Same. I thought she was sweet and did a double take when I realized he was talking about himself.",
                  "id": 142,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "The fact that he capitalized ‘Dad’ says a lot too.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "He sounds like my dad. He'll never admit to being in the wrong and will perform mental gymnastics to always be correct.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "\"The only true wisdom is knowing you know nothing\" \n\nJust like you said the person who labels themself the smartest and always acts like it is never the smartest. They act like they know something to be fact when they really dont know about it at all. Whereas a true intelligent person would state that they dont know anything about that topic and go and educate themselves on it to see it from the other person's perspective",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "“ people who are convinced they are the smartest person in the room usually aren’t” \n\nOmg I was literally here to post that.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah, this dad is full of himself and sounds slightly misogynistic.  It’s gross.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 375,
          "content": "Yep.  He likes and approves of his daughter when he sees himself in her.  Otherwise, he refuses to recognize her.  I think he’s confused about the fact that his daughter is actually a separate person who is allowed to figure out who she is on her own.",
          "id": 148,
          "comments": [
            {
              "score": 69,
              "content": "We’ll be seeing his kids post on r/raisedbynarcissists in a few years!",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "r/iamverysmart",
          "id": 150,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 138,
          "content": "When I heard that part I assumed OP was the mom at first. Surely nobody would talk about themselves like that, right???",
          "id": 151,
          "comments": [
            {
              "score": 3,
              "content": "Someone else's kid",
              "id": 152,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 125,
          "content": "That was when I knew he was the asshole. Is your wife neither studious nor *cerebral*? Jesus, get the fuck over yourself. Also, did you *really* need to capitalize “dad?”",
          "id": 153,
          "comments": [
            {
              "score": 5,
              "content": "No, possessive preceding of mom and dad should not be capitalized.",
              "id": 154,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 56,
          "content": "I was hoping the wife wrote this post when I read that. Instead, it was the husband jerking himself off.",
          "id": 155,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 43,
          "content": "YTA.  At this point i assumed the wife was posting, not the dad referring to himself in the third person.  Please stop doing everything you are doing including this.",
          "id": 156,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 42,
          "content": "r/iamverysmart <-- I probably didn't do that right, but I that's where this dude belongs",
          "id": 157,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 38,
          "content": "[deleted]",
          "id": 158,
          "comments": [
            {
              "score": 24,
              "content": "Yeah, he's worried about insurance yet he's been pushing his kids to play sports. So the insurance is only a problem if the kids want to play a sport he doesn't personally approve of, otherwise it's fine!",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "On a serious note though, is OP implying that his daughter can’t be a cheerleader and have an intellect at the same time?",
          "id": 160,
          "comments": [
            {
              "score": 11,
              "content": "Yes.",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "According to OP,  her intellect cannot compute how a sports bra is more sexual than a bathing suit.",
              "id": 162,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2502,
      "content": "YTA. \n\n> she's not in it for the right reasons\n\nkids are dumb and easily influenced by their peers.  It's part of the whole process of growing up.  You say neither of them has been interested in sports at all and she is finally interested in something physical and you're saying no?  that's shitty.  This could be the something physical that opens the door to other sports that she may like (and that you may like more).\n\nAdditionally, kids are supposed to try new things.  Maybe she will hate it? Or maybe she loves it and ends up doing it because it makes her happy.  Either way, you should take an interest in what your kids take interest in.\n\nAs for the \"sexualization of the whole thing\" maybe that's something you need to rethink about how you view others.",
      "id": 163,
      "comments": [
        {
          "score": 1288,
          "content": "[deleted]",
          "id": 164,
          "comments": [
            {
              "score": 618,
              "content": "Thank you for this rational comment. It blows my mind that people think that cheerleaders aren't supposed/going to be sexualized",
              "id": 165,
              "comments": [
                {
                  "score": 299,
                  "content": "This was the one thing in the post I agreed with and to pretend that he’s the pervert is ridiculous",
                  "id": 166,
                  "comments": [
                    {
                      "score": 9,
                      "content": "It’s pretty easy to accuse some random dude of being overly sexual for some reason. I don’t fully agree with the reasons he doesn’t want her to cheerlead, but anyone accusing OP of being the pervert is being disingenuous and misleading. \n\nEveryone knows cheerleaders are sexualized. Everyone knows this. OP also knows this, and he doesn’t want his daughter to participate. This is not perverted behavior, so people need to calm their little outraged minds for a minute.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 195,
                  "content": "Most women’s sports are sexualized, sadly enough. Look at female tennis players requirements to wear skirts or women’s volleyball requiring short shorts when the men’s don’t.\n\nIt’s a sad reality. OP’s daughter will be sexualized throughout her life whether she’s in cheerleading or not.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Not sure exactly where it is or isn't a requirement, but I played on the women's volleyball team in high school and the short shorts were not required. I was uncomfortable with the spandex shorts, so I wore longer basketball shorts and was fine. One or two other girls on my team did the same. It may be more common to wear the shorter shorts, and possibly even recommended, but at least in my experience, it's not a requirement (at high school level, anyway). In the case of volleyball, the spandex may even be advantageous because it's less likely to hit the net and get the ref to call you on it. Women often wear much shorter shorts anyway - it mirrors the fashion trends outside of sports. It's more of a societal thing than a women's sports thing.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Or is it sad that men don’t wear short shorts because they think it makes them gay/less masculine/whatever ? I say don’t take the short shorts away from the girls take the long shorts away from the guys",
                      "id": 170,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I used to play tennis in highschool (I'm a guy, helped with the girls team sometimes though). Skirts aren't mandatory. And there was a minimum length at my school.",
                      "id": 171,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "But the important thing is we're demonizing the right people which OP isn't doing. If someone is being sexualized, it's the fault of the person who is sexualizing them, not the person being sexualized under any circumstances.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Even in water polo, where your boobs are essentially flattened into a board (I went from a DD to probably what looked like a B), some of the girls would purposefully tuck the suit up to make their asses more noticeable.  When I was a freshman, most of the junior and senior varsity girls did, and a lot of the younger freshman girls copied them.  While you’re playing it’s a bit more convenient because if you get kicked, it’s annoying when you get a wedgie on just one side and have to fix it, but it was just weird to see other high school girls walking around the pool deck in essentially a thong swim suit.  I mean, there was nobody around to be weird about it during practices, but during games, anyone could be in the audience.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "Thank you, I thought I'd entered a different dimension. Not saying it justifies the dad's choice to disallow cheerleading but it's EXTREMELY disingenuous and ridiculous to suggest cheerleading is not already sexualized by like literally all of society. Being sexy showgirls is THE POINT of cheerleading.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Yea I felt the same. The dad is TA for the other reasons. But the point of sexualization is completely valid",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Right. At the minimum in every high school ever they’re the “hot ones.” Or “slutty” cheerleaders for Halloween. Cmon now",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "You notice that young girls are obviously being sexualized for the entertainment of much older men, and noticing that means you're sexualizing children. How stupid. That's like telling people that child porn is fine and if you have a problem with it, you're a pedophile.\n\nThe people sexualizing children are schools and cheerleading coaches, not concerned parents.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 305,
              "content": "She isnt cheering for the NFL, she is in high school. High schools have higher standards for the attire, choreography, and treatment of kids. When I was a cheerleader if the coach felt like the captain put \"provocative\" moves in our routine she would run the routine through the dean. Dean would approve or disapprove \n\nUniforms - if anything when I was playing volleyball or running track the outfits were far more revealing than the cheerleaders. The uniforms were literal bikinis in track lol.",
              "id": 178,
              "comments": [
                {
                  "score": 130,
                  "content": "Agreed! High school uniforms are nothing like NFL! They don’t show the stomach and modesty is always protected. As for “provocative” moves, most routines are choreographed by professionals that don’t include inappropriate material for high schoolers",
                  "id": 179,
                  "comments": [
                    {
                      "score": 99,
                      "content": "While I do agree with the overall point here, I must say it really depends on the high school. At my hs, cheerleaders showed stomach, with short skirts or yoga pants. The dances were pretty provocative as well. \n\nBut, just wanted to share my experience. Still think YTA OP if you say no to your daughter. Being on a team gives you a group to fit into, which is big in HS.",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "I am sorry we must live in very different parts of the world. I was shocked with how provocative my high schools cheer leaders were. Girls got in trouble for wearing skirts to class but they had tiny ones.",
                      "id": 181,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "We went to wildly different schools. The skirts were short and the leg kicks were high. It seemed like the entire point was to be sexualized because as far as I could tell they had no impact on whatever game they were cheering for.",
                      "id": 182,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "> They don’t show the stomach and modesty is always protected.\n\nat my high school, over 10 years ago, they had short skirts and stomachs out",
                      "id": 183,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "All I know is that when the cheerleaders did pep rallies at my high school, several moves were obviously very sexual. Like turning around bending over and shaking their asses like they're in a club. I certainly wouldn't want my daughter doing that if I had one.",
                      "id": 184,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Thank you! I guess they shouldn’t do gymnastics because of the leotards? Swimming because of the swimsuits? Field hockey or soccer, because of the short shorts? Softball because of the tight pants?",
                  "id": 185,
                  "comments": [
                    {
                      "score": 8,
                      "content": "To be completely fair the whole point of cheerleading is to be sexualized while the other things you listed the tight pants are just the outfit to play the game. \n\nCheerleaders are literally there to be ogled by the male sports fans between plays. It’s turned into more of a “sport” as time has gone on, but to think otherwise is just naive.",
                      "id": 186,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Seriously, the cheerleaders at my high school wore more revealing clothes to class everyday. I get there is an element of sexualization to it, but if that is what OP is focusing on, it's a little weird.",
                  "id": 187,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "To be fair, unless things have changed since I was in high school (which was in the past decade), high school cheerleading uniforms are often significantly less revealing than, say, college or pro cheerleading uniforms. Like the most scandalous things about my school’s cheer uniforms was that the skirts were *slightly* shorter than those that were allowed for normal students to wear at school. But even still, not that short.\n\nMy point is, even as a dude in high school, I never really thought our cheerleaders were that sexualized.",
              "id": 188,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 86,
              "content": "I feel like we live in a parallel universe all of a sudden where sexualization is *always* in the eye of the beholder. Certain outfits are sexier than others and everyone knows it. There's nothing wrong with trying to steer kids towards age-appropriate levels of that.\n\nNot that cheerleading exceeds that level, but there was a post on here not too long ago about an aunt feeling uncomfortable that her 14 year old niece was wearing a literal *thong* bathing suit at the swimming pool of an elderly community, and she was accused of being the one inappropriately sexualizing her.",
              "id": 189,
              "comments": [
                {
                  "score": 21,
                  "content": "I mean, sexualization is kind of subject. Where I grew up, it was normal for girls and women to wear short shorts and tank tops. Too hot and humid to object!",
                  "id": 190,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yeah of course, but that just means it's about context. In the modern US, I don't think many people consider short shorts and tank tops in the heat to be sexual clothing.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 61,
              "content": "Right. The sexualization of young girls vis-a-vis cheerleading is not in your head op, and you're not a bad parent nor TA for being uncomfortable with that. But your daughter is in highschool now. She needs to learn how to choose her friends and hobbies. She needs to learn how to dress in a way that makes herself comfortable and happy. And unfortunately she needs to learn how to deal with being sexualized, because that's going to happen whether she joins cheerleading or not. I think the best you can do as a parent is to support her and let her know she can talk with you. And judging her choices does not accomplish either of those things.",
              "id": 192,
              "comments": [
                {
                  "score": 6,
                  "content": "Right...  The concerns are valid but the approach should probably be to talk about the concerns and make sure she is informed.  Serious injuries are possible, so do some research about what is most dangerous and make sure she is informed.  Sexualization of cheerleaders is a thing, do reinforce the (hopefully) previous conversations that have been had about her body, her body image and the objectification of women.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah. My kid's school is famous for volleyball we get state championships often. But when I think of girls volleyball I'm reminded of a post I saw here on reddit that was just basically a jerk off fest to the short shorts the high school girls were wearing in the photo.\n\nI don't want grown men talking about my child like that because some perv took a creep shot of her playing at school.\n\nWe can't deny the sexualization that happens imo, But I also know that's not a decent reason to stop her from playing if she decides she wants to.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I also agree with OP here that cheerleading is sexualized. But more importantly, that's something his daughter has to learn, process, and confront for herself. If she wants her parents' opinions or advice on dealing with the sexualization of her hobby, she'll ask for it. I agree with you, that this is a reality she was inevitably going to face, and that she needs to be supported, not controlled.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "There is a HUGE difference between NFL cheerleading (which is mostly dancing) and high school cheerleading (which is more skills based).",
              "id": 196,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "The thing about sexualization got me wondering what the male version of “Karen” would be. Cause that’s what OP is",
          "id": 197,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "I think making friends is a perfectly good reason to start a new hobby. She found a new friend and wants to hang out with them, it's kind of a good reason",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I don’t get it. Why is everyone saying it’s not at all? We’re sexual beings. When we see a little extra skin or something......ah nvm",
          "id": 199,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "> she's not in it for the right reasons\n\nIt's funny how peer pressure isn't a good reason, but being forced to by your Dad *is* a good reason. Seems like it's more about control than anything else.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1543,
      "content": "YTA. Women and girls are sexualized everywhere. We can't do jack shit without someone trying to put some sort of sexy spin on it. It's tiresome. Highschool sucks for everyone but being a woman who survived highschool, I'd never want to relive that period of my life ever again. My dad forbade me from participating in certain activities as a kid because he didn't agree with how I'd be presented or because he didn't think it was proper of a young Christian girl to do. I'm 43, an atheist, and I have  harbored resentment ever since I was a kid because of the things he wouldn't let me do because I was a girl. \n\nOh and I rebelled so bad when I got out of the house and 18 and struck off on my own. Why? Because of being told \"No. No daughter of mine ...\" Too much as a kid. \n\nYou had your chance to live your life and make stupid decisions. She's asking to be a cheerleader. There are tons of things she could be doing that are way worst.",
      "id": 201,
      "comments": [
        {
          "score": 199,
          "content": ">Women and girls are sexualized everywhere. We can't do jack shit without someone trying to put some sort of sexy spin on it.\n\nThis is the main thing. OP no matter what sport your daughter chooses shes going to be sexualized. Take it out on the system not what she wants to do.",
          "id": 202,
          "comments": [
            {
              "score": 21,
              "content": "One time I was traveling with a friend and a guy walked up to us and asked us “English?” We said yeah, thinking he was asking for directions or something, but he just tells my friend “nice ass.”",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1023,
      "content": "YTA. However, I suggest you proceed with caution.\n\nThe risk of injury is indeed very rare, and the school athletics program will set reasonable requirements for insurance (if you already have it, then your claim is moot; if you don’t have it, your daughter can’t participate due to insurance requirements).\n\nYes, the outfits are skimpy, but the vast majority of people who’ll be watching are high schoolers. Those outfits are being worn in the context of the sport, and news flash: she could be covered head to toe and her peers will still look at her and get horny. That’s just teenage psychology at work.\n\nThe only real concern at hand is the other girl’s influence on “not being a loser.” Being intelligent and well-read is a winner’s trait. Cheer and studiousness aren’t mutually exclusive.\n\nAllow your daughter to cheer, but make sure her self-esteem isn’t getting warped and that her academic performance doesn’t falter. This could be a great opportunity to build social skills as you wished, while retaining the aspects of her personality that are positive.",
      "id": 204,
      "comments": [
        {
          "score": 281,
          "content": "[deleted]",
          "id": 205,
          "comments": [
            {
              "score": 42,
              "content": "[deleted]",
              "id": 206,
              "comments": [
                {
                  "score": 13,
                  "content": "Dad surely went through this when he was a kid? Looking at any girl and getting horny, that is",
                  "id": 207,
                  "comments": [
                    {
                      "score": 7,
                      "content": "No way. Not a studious and cerebral individual like OP.",
                      "id": 208,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "That's not a negative.  It applies to everyone, and especially parents.  You should always keep learning and be open to growth.  Being a certain age doesn't grant magical powers of intelligence and understanding.  Too few people realize that, and that's how you end up with generations like Baby Boomers(Or really, most generations).  They reach a certain age and just stop being open to further mental growth or maturation.",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Agree. Maybe Dad should refocus on respecting the girl and not her clothing.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Extracurriculars are a great way to teach kids about taking care of your work before you get to play. Set a GPA minimum or other requirements and help them learn to manage multiple responsibilities and activities.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "\n>The only real concern at hand is the other girl’s influence on “not being a loser.” Being intelligent and well-read is a winner’s trait. Cheer and studiousness aren’t mutually exclusive.\n\n\nOP has bad logic with his other reasons, but this is the real problem. This is straight up anxiety, and it doesn't sound like the daughter is secure in what she actually wants. There is presumably more info than just this statement, but if that's her actual reason for doing cheerleading then that's an issue.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 840,
      "content": "[deleted]",
      "id": 213,
      "comments": [
        {
          "score": 20,
          "content": "Indeed, it sounds like she's doing this because her new friend wants to do cheerleading together.",
          "id": 214,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 429,
      "content": "YTA - so she picked a sport but now it’s not the right kind of sport?! It sounds like she wants do something that her friend are doing and your denying he that . Her being a ‘bookworm’ -it seems to me you have an idea of who she is in your head and that cheerleading doesn’t fit with that but you need to let her make her own choices and try things out so she can find out who she is as a person. Otherwise she’s just going to resent you for stopping her. What is the harm? You said your son does sport so the injury stuff  doesn’t really wash as he can inured easily too and I think the sexual stuff is in some ways a stereotype of what cheerleading is.",
      "id": 215,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 363,
      "content": "YTA. If you were worried about “not being able to afford injuries” you wouldn’t have pushed your kids into sports - that is an excuse you came up with after you already decided you didn’t approve of her cheerleading, because you don’t like the idea of your baby wearing a short skirt and you think her friend’s a mean girl. \n\nWanting to be popular isn’t a great reason to try an activity. Wanting to please your dad isn’t a great reason either. But regardless of a kid’s reasoning for joining a sport, they are still keeping physically fit and getting an opportunity to learn about teamwork and commitment.",
      "id": 216,
      "comments": [
        {
          "score": 5,
          "content": "The not being able to afford injuries thing kills me. I get it, health care is expensive as shit in the US. But if she was doing soccor he would need to buy cleats and shin guards. If she was doing football he would need to buy pads/cleats/ect. If she was doing basketball he would need to buy basketball shoes. If she wanted to play a musical instrument he may need to rent or buy an instrument. There are so many possibilities for injury & costs for different activities kids do and I doubt she's going to be doing advanced flying and tricks as a beginner cheerleader on (I'm assuming) a JV team. They're going to have the girls that have been doing this their whole life doing the dangerous shit.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 282,
      "content": "YTA. You don't care that \"Girls get severely injured doing that\" because that reasoning came after the fact that \"she actively made fun of cheerleaders 3 months ago\". Sounds like you need to get over your own experience of cheerleaders and let your teenage daughter make her own decisions.",
      "id": 218,
      "comments": [
        {
          "score": 59,
          "content": "Right, sounds like maybe the kid made fun of cheerleaders before because she knew DAD hates them and she wanted approval. I wouldn't be shocked at all if this goes back to dad's high school experiences, like he particularly dislikes the sport because he associates it with a girl/girls who he feels did him wrong or some lame shit like that.",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "To add to this, is OP really ok with his daughter being the type of kid who makes fun of other kids? Let’s leave power dynamics aside for a bit, because that’s going to end in a lot of people projecting their own high school experiences into these girls. Daughter sees a kid who lives a vastly different lifestyle than she does. Daughter makes fun of her, perhaps even overtly. Daughter (for whatever reason) starts to see that there are benefits to living that kind of lifestyle. Isn’t curiosity about different people a good thing?\n\nThe nerds/jocks division is largely artificial. But it gives the kids an opportunity to learn empathy in a low-stakes setting, before they need to bridge bigger gaps like race and religion.",
          "id": 220,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}