{
  "post content": "I (20) am a mother of triplets whom are only 2 months old. I never expected ever in my life that I'd be a mother to triplets so when I first became pregnant it was definitely the last thing in my mind. \n\nI'm home with my babies all day long and had to even transfer my education to online. \n\nSometimes I just need some fresh air especially when I can't get them to stop crying and I find myself getting super frustrated to the point of tears, it's honestly soo hard and the dad isn't here to help as he's ether at work or at school.\nMy fiance's (24) parents rented us a main floor apartment so when I step outside I'm literally just sitting on the chair right beside the door plus I have a baby monitor step up in their room and it has a camera on it I can literally see them and hear them so if anything happened I'd be able to quickly get to them. \n\nBeing able to step outside for a few minutes to take a breather is really important to me because I start to have mini panic attacks when I can't get them to stop crying and I get really frustrated because I just feel super overwhelmed, Being able to go outside just gives me a chance to clam down. \n\nMy fiance came home to me sitting outside while the babies were crying and freaked out on me calling me a horrible mom and a bunch of other names that I'm not gonna list here. He thinks that I was being super neglectful and putting the babies in harm way and even told his parents and now everyone seem to be really against me. \n\nI grow up in the system my fiance's family is the only family I have and ever known so it breaks my hurt that they are so upset with me but I really don't think I was doing anything wrong or putting my babies in harm way but they seems to think otherwise.\n\nSo here I am wondering if I should apologize for my actions or if I am the A-hole in this situation.\n\n~~~~~~~~~ Update ~~~~~~~~~\n\nI decided to show my fiance this thread at first he was really upset with me for sharing our personal problems with strangers on the internet even though it's anonymous. \n\nBut in the end when he had a chance to clam down and hear me and all of you guys out he actually apologized and promised me he'd be more involved with parenting and even is willing to take parenting classes which I'll hold him to that. \n\nI just wanna thank everyone for the support that you all give me it brought tears to my eyes (happy tears) seeing how supportive you all were to a stranger on the internet I don't think I ever received this much support before. \n\nI can't believe how much attention this post even got plus the award again thank you so much.",
  "id": 1,
  "comments": [
    {
      "score": 70538,
      "content": "NTA. When I had my baby one of the things the nurses told me repetitively while in hospital and during the home visits is that if she is  crying and I know she has been fed, she has a clean nappy on and she isn't sick and I am getting stressed out its ok to go outside for a few minutes to just recollect myself. \n\nTheir exact words were \"a crying baby is an alive baby\".\n\nThey tell you this because it is better for a baby to be left to cry for a little while and the parents to get a breather, than for parents to wig out and hurt their babies in frustration.\n\nThis advice was so important. It allowed me to do what I needed to do without feeling guilty. And those few minutes really do help in those times when they won't settle. And I had one, let alone if I had three.\n\nEdit: thanks for the awards and votes. I really hope OP sees she has nothing to feel guilty about and is doing a great job! ❤",
      "id": 2,
      "comments": [
        {
          "score": 22740,
          "content": "This is the way. Dad came home to three crying *alive* babies. You were with them all day and kept them fed and clean, and you had a monitor on them while just feet away from them.\n\nYou are a tired, amazing, NTA mom of these babies. Carry on, momma.",
          "id": 3,
          "comments": [
            {
              "score": 9134,
              "content": "Mom is amazing and is doing the exact right thing to ensure she keeps functioning.  Tattletale dad on the other hand...",
              "id": 4,
              "comments": [
                {
                  "score": 21741,
                  "content": "Maybe Dad needs to stay home.with the babies by himself for about 12 hours just to see what it's like for OP. And see how long it takes for him to need a break.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 6726,
                      "content": "This. He wants to call you names and make you feel horrible, he can walk in your shoes first.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1819,
                      "content": "Yes, AND any other family members giving her grief.  Even an hour, three newborns, they'd be freaking out.  OP, please tell anyone who is giving you a hard time to come on over and help.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 547,
                      "content": "Ya OP. Next day off he has. Go to a spa or just sit and relax with friends. While he deals with them",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 320,
                      "content": ">Maybe Dad needs to stay home.with the babies by himself for about 12 hours just to see what it's like for OP. And see how long it takes for him to need a break.\n\n12 *days,* more like. Or even just 2 days. Enough to see how relentless it is.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "It wouldn’t take 12 hours for him to be overwhelmed. I would give it 3 hours tops.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "12? Bet he couldn’t do one!\n\nNTA momma and you do what you need for you. It will help you care for them. It’s insanely difficult with one but 3?!?! Take your breathers.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I was wondering the same.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Screw that, momma has been doing it 24/7, he can at least do a full 24 once in a while.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1141,
                  "content": "...is TA. \n\nName calling in particular? And public shaming to friends and family? That's horrible.\n\nHumans need *breaks* or one can just snap. This is how shaken baby syndrome happens. Especially in sleep deprived parents. And it's literally proven [in some bizarre study](https://www.mentalfloss.com/article/13065/11-worst-sounds-world) that baby wailing is one of the most painful to hear sounds in the world. \n\nI can't imagine having to deal with three wailing babies all by myself *and* have husband show up and call me horrible names.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 460,
                      "content": "I can verify that baby-induced sleep deprivation does things to your mind and overall well-being.  It's just like living in deep fog.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": ">Name calling in particular? And public shaming to friends and family? That's horrible.\n\nEven worse, it doesn't sound like \\*any\\* of the people trashing OP are stepping up to say they'll watch the babies for 30 minutes at a time to let her just go get a shower and breathe....",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "That is making me nervous. He potentially is isolating her by telling his version of what is happening if they are coming after OP once they hear. \n\nOP no matter what, please continue with school. Do not drop out. Your education is something no one can take from you. I'm not saying your fiancé is a bad person, I just have friends who married young and divorced already. Some are people I thought would be together forever. It happens. It's important to talk about how you will mitigate tough times with your partner anyway, and your ability to earn an income (should you ever split) should be a part of that.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 259,
              "content": "Babies cry, sometimes you have to let them.  Wait till they learn no lol",
              "id": 18,
              "comments": [
                {
                  "score": 24,
                  "content": "I feel like there’s a whole culture around “if a baby ever cries, or even one moment, you’re a horrible mother and they baby will grow up to have severe emotional issues because you didn’t meet everyone of their needs at every moment!” shaming and mongering in mommy communities. When I was expecting my first, I swear to god, people (especially perfect Santomommies who are obviously superior and flawless) made it seem like a baby crying is an earth-shattering emergency. And if you don’t mystically have “instincts” (there is zero evidence that human mothers have “instincts” and that harmful myth needs to kick rocks), obviously you’re just a horrible mom and how dare you even speak it into existence. \n\nI developed severe postpartum depression that border on postpartum psychosis because ever time she cried I was absolutely convinced I was ruining her ENTIRE life. \n\nWe need to speak up more about this. Babies cry. IT IS OKAY.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Right?  One baby is hard, three?!?!? And she’s only 20!  Time to leave them all for 24 hours with dad so he gets some appreciation for all she does (and she goes to school online). You’re doing great OP",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I don’t understand how anyone whose ever cared for a newborn could judge a mother of TRIPLETS (one is hard enough!) for taking a breather. \n\nI felt frustrated to tears often. I HAD to walk the fuck away before things flew off the handle sometimes.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "When dad came home his immediate reaction should have been to (1) see what OP needed if anything then (2) gone and tended to the babies himself. Because I see nothing that says his arms and legs are broken and he cannot function.\n\nNTA to infinity and beyond. Husband needs to step up and support, not denigrate.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1786,
          "content": "Just wanted to add that babies can sense anxiety/stress and it makes them stressed and then they cry more. Trying to calm them down when you are super stressed and upset is counter intuitive and unhelpful for everyone. \n\nMight be a good idea for dad to go to some baby classes. They may even do dad and baby classes that can be super helpful.",
          "id": 23,
          "comments": [
            {
              "score": 1605,
              "content": "There was a post here last year about a woman with twins. Dad always had the magic to calm them down, until she went away for a few days. When she came home it was the opposite, they immediately calmed with her and not the dad. It wasn’t that dad was magic, it was that dad was calm.",
              "id": 24,
              "comments": [
                {
                  "score": 504,
                  "content": "My 6 year old granddaughter calms her 5 month old brother just by sitting and looking at him. I will be in the bathroom or getting dressed or making his bottle and he will start fussing (which I ignore until I am finished with what I am doing if it’s shirt term). She will walk over and quite literally just sits or stands and looks at him and boom, no more crying. It never fails. Sometimes I will walk out of the bathroom to him giggling instead. I would love to know that explanation. I have recorded her just standing next to his bouncer and he’s looking at her laughing, not little giggles but full blown laughter. He doesn’t laugh like that for anyone else!",
                  "id": 25,
                  "comments": [
                    {
                      "score": 203,
                      "content": "My son was that way with my daughter, too! I always used to say that he smiled a lot as a baby, but she laughed a lot as a baby, because she had her brother to make her laugh.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I did that same thing with my son. When he was freaking out (and we already went through the tool bag of soothing techniques. Fed, changed, rocked, erc…) then I would just slow my breathing down as much as I could. And just… stare. Directly in the eyes, don’t even blink. \n\nAmazing how frequently it worked.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "It's a process known as [co-regulation](https://en.wikipedia.org/wiki/Co-regulation). It basically works the same way as all \"contagious\" emotions do, except instead of spreading more manic emotions your kid is spreading calmer emotions.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Telepathy.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "This was the main reason my partner and I played handoff. \n\n&#x200B;\n\nThe cooler head dealt with the babes.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "This is such an important fact.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 304,
              "content": "Might be helpful for dad to be in charge of calming them down on his day off, too… bets that he’s being super judgy because he’s never been alone with them for 12 hours straight?",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 147,
              "content": "[deleted]",
              "id": 33,
              "comments": [
                {
                  "score": 13,
                  "content": "Same. Had zero help from ex husband from basically the second he came until the second we divorced. I gave up on pumping milk after six weeks. I was barely eating, barely sleeping, baby was always crying, husband was always upset. It took me years of reading subreddits to understand that moms who produce a ton of milk are eating super healthy home cooked meals of 2x the calorie intake and — shock — most of the time, their husbands ask if they’ve eaten! Or even might cook! \n\nOP is trapped in a bad spot. The “bad mother” and yelling at her when she’s doing the healthy thing for her children really resonates with me, as someone who divorced a useless piece of shit a few years ago.\n\nMy heart goes out to OP. This will be tough if he has all the support and she doesn’t, as well. She needs a support system close by. Three babies isn’t for the faint of heart.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 15,
                      "content": "[deleted]",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "Might be a good idea to take a mental health day and leave dad alone for a few hours with triplets.  He might start understanding the need for a short break in a way that simply can't be explained!\n\nIf they're breastfeeding and can't have expressed milk so can't be away from mom for a whole day, even leaving them with him for a few hours to go for a walk, a quiet grilled cheese sandwich or whatever will give mom a break and dad a new perspective!!",
              "id": 36,
              "comments": [
                {
                  "score": 10,
                  "content": "And make sure dad doesn’t pawn them off with his “family” that he brought into this squabble.  That makes him the TA for that alone.  \n\nOP should take those breaks when they are fed, dry and in a safe space.  You have to take moments for yourself, OP, being stressed and anxious will not help your babies, you are NTA.  Ten or fifteen minutes is not going hurt them.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1014,
          "content": "As a mom who struggled with severe PPD and PPA, I cannot stress enough how important this information is. I’m currently pregnant with my second and I have a lot more support systems in place in preparation for another round of depression and anxiety, but all that aside, by far the most important piece of info here is taking a step away when you need it. \n\nYou are doing what every professional would ask you to do. If your fiancé doesn’t know that, he can step tf up and learn. Based on your responses, he’s severely lacking in taking care of his own children. Once he’s stepped up, you may need to take these safety breaks less often (or not, cause damn mama - being alone with 3 babies all day is HERO work, I can’t even imagine). NTA at allllll.",
          "id": 38,
          "comments": [
            {
              "score": 17,
              "content": "So much this. I had severe PPD/PPA after my first’s traumatic pregnancy and birth and had little support being provinces away from dh’s parents and in another country from mine. We moved to the same city as my in laws and I made some amazing mom friends between my first and second pregnancies and had so much support after my second and third babies and it made a huge difference for my mental health. One baby at a time is hard enough let alone three. I hope this mum has support although it sounds like that may be lacking. It’s no wonder she’s struggling. NTA.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I dealt with the same struggle with PPD and was also told to walk away when I'm overwhelmed, as long as baby was fed, clothed, clean, etc. I'm soooo ashamed of this father and his family for villainizing a 20 year old mother of TRIPLETS, just trying to do her best. Having 3 babies would have absolutely broke me, I would have went off on anyone trying to judge me for coping with that.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 578,
          "content": "I’ve heard that more than once “a crying baby is an alive baby” \n\nIt’s hard to not be able to soothe your baby but you can’t soothe your baby when you are unable to soothe yourself. \n\nStepping outside for a moment of peace is not going to hurt anybody. \n\nGive yourself more breaks mama. Also you’re doing a great job!! \n\nNTA",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "Perfect answer",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Yeah when I was pregnant (didn't carry to term) I bought earplugs. I don't care about this stupid crunchy shit. Your job is to keep them alive. Both my mom and my boyfriend's mom told us horror stories about how they thought about killing us or our siblings when we were infants because of this shit. A baby crying by itself for a few minutes is not going to destroy its development--but you not sleeping or having a break or treating yourself like a person with needs when you're also a caregiver might. \nYou need to take care of yourself to take care of your kids. If OP's husband thinks her taking a minute to herself to better care for her kids (ie, making sure she can do her job, which it is) is neglect, then HE can quit his job and come home to make sure it's being done to his standards. Maybe he'll change his tune once he has to do it.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Perfect answer. Plenty of parents don't take breathers and end up lashing out on the children or their partner just because of overloading on stress.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "THIS THIS THIS THIS THIS OMG YESSS!! \n\nPlease please take care of yourself and take a break when you feel overwhelmed. \nI went to hs with a girl who grew up in the system and wanted to have a baby her whole life to treat right only to grow up and have severe PPD and injured her baby ending up in prison and her daughter getting a brain injury causing her to be disabled. \nThis being said your babies are safe and you are taking care of yourself. Perhaps hide in the bathroom so no one can “see” you taking your breaks.\nThey are VERY deserved! Please continue to take care of yourself as you care for your babies.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "100% and I heard the same thing. \n\nMy mother was also told this when she had newborn twins and a 2y old. She’s told us she was glad she was able to step away without feeling guilty, in order to de-stress, particularly when my siblings and I were crying and not calming down.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "NTA. Exactly this. When I had my baby so many people told me this. You did the exact right thing.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 19513,
      "content": "NTA - What you’re doing is preventing shaken baby syndrome. When the caregiver is overwhelmed, you need to step away for a few minutes to collect yourself and *breathe.* Center yourself, calm down, do what you need to do. You’d only be an AH if you left them alone for long stretches of time, but it sounds like you only do it for short periods and monitor them when you do so. Nothing wrong with that.\n\nWhat does your fiancé do to help with the babies?",
      "id": 48,
      "comments": [
        {
          "score": 11903,
          "content": "Not really as when he comes home he's really tired I do over 90% of the child care since they were born. \n\nHe maybe will change a diaper once in while",
          "id": 49,
          "comments": [
            {
              "score": 14358,
              "content": "That isn’t enough on his part. You’re really tired too, and also in school. He needs to step up.",
              "id": 50,
              "comments": [
                {
                  "score": 4877,
                  "content": "This. Actually it's harder looking after kids than going to work. The time he is home needs to be equally shared looking after the kids or household (cooking, cleaning, etc).\n\nEdit: to the commentors disagreeing. Let me clarify, mainly **kids below 2 can be challenging**, and three at the one time, even more so! Reason being is 1) They don't talk, so you miss out on having adult conversations like at work 2) you can not dictate/schedule your break time 3) They cry and crying is an evolutionary trait designed to make mothers guilty / put in 110%. 4) The days are the same, with little variety 5) All of this together, is a mental toll that can manifest as physical tiredness.... and yes there are jobs out there that can be very challenging so don't take this as a  blanket statement as your situation may be different, I'm just speaking generally.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 2491,
                      "content": "> Actually it's harder looking after kids than going to work.\n\n\nI'm not even a parent and I understand parenting isn't a 9 to 5. It's a 24/7 until they're off on their own. And even then it's a \"call every now and then to check in\" lol\n\n\n\nI get being tired after work. But you have a parenting responsibility too",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 913,
                      "content": "My husband use to argue with me that my job as a SAHM was so much easier than his job which requires him to go to lunch meetings and play golf with customers. Then covid hit and he had time at home. He apologized and started helping more with the kiddos.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "[deleted]",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2848,
              "content": "Ah I see, one of those watching his kids is “babysitting” dads. Men like that are always shocked pikachu face when their overwhelmed partner either breaks down or decides to take off and leave them with all the kids and no forwarding address.",
              "id": 55,
              "comments": [
                {
                  "score": 499,
                  "content": "My husband watched me turn into a blob of nothing but snot and tears begging for help. He walked away and went to work out of town. When he got home, I left. And I left the kids. It took that for the asshole to understand that this isn't easy. I'm worth taking care of too damnit. And I didn't make these kids alone.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 86,
                      "content": "Are you in touch with the kids now? \n\nI’m so sorry this was your situation.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 294,
                  "content": "Or keeps running them over with the car - \"What did I do?\"",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 199,
                  "content": "Right? \n\nAnd everyone says \"Oh what a good dad you are\" the one time a month he takes them to the park to \"give mom a little vacation.\"",
                  "id": 59,
                  "comments": [
                    {
                      "score": 95,
                      "content": "I hate that as much as I hate the “helping around the house”. When the fuck did I sign up to be the sole adult in the home? I work more hours, make more money, AND raised these kids while working because we couldn’t afford a sitter or daycare. But yeah, you’re “helping me out” by doing the dishes. GTFO with that. I’m not the only person creating dishes and laundry, so why should I be the responsible party? Gah!!! \n\nSorry for the rant.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "People always tell my husband stuff like this and he’ll ask “Why are you complimenting me and not any of the moms here? What’s so special about a dad being a parent?”",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Shocked pikachu face is my new fave thing.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My Reddit feed had an article about why Millenials aren’t haven’t kids right before this one and I swear part of is that women are getting better and better at sorting out of being with jerks like this.  You have to make sure your partner is ACTUALLY a partner before you throw a baby (let alone three!) into the mix, full stop.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2089,
              "content": "You care for THREE babies 90% of the time?! OP you're phenomenal and doing everything you can and way more than you should have to. You do you, and if that looks like you taking a sanity break in fresh air (aka one of the best grounding and coping skills) then I applaude you. NTA.",
              "id": 64,
              "comments": [
                {
                  "score": 433,
                  "content": "You really are amazing, OP. You’re so young and have obviously had some difficult life experiences and are in school while basically single handedly keeping 3 tiny babies alive! You are absolutely NTA and are doing a great job. You deserve far more support than you have. Do everything you can to meet your own needs.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Not to mention she grew them in the first place!",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "One baby was hard enough. I cannot imagine the pressure of caring for three without support.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "The sad part is that she's caring for FOUR babies. Her fiance does nothing after he gets home apparently.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "not to mention she said she’s taking online classes! school alone is a lot, one baby alone is also a lot, she has triple the baby and is still doing both.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1288,
              "content": "Guess who is really tired? A mom with 3 newborns and no support. Yall need to figure something out to get you a break that you can count on each day. He needs to step it up.",
              "id": 70,
              "comments": [
                {
                  "score": 716,
                  "content": "Where are these family members who are calling mom and AH? Are they able to/have they even offered to come help? I would think with 2 month triplets my mom would be at my house until I forced her out, but all fiance's family has time for is to call mom an AH?",
                  "id": 71,
                  "comments": [
                    {
                      "score": 250,
                      "content": "Right? Let me propose a new rule for your household: no one gets a fucking opinion unless they help out. They wanna be judging you, they can come rock a baby for a while instead. Put up or shut up, aunties.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Yeah holy shit if this were my family member or friend I'd be helping as often as I could, even for one baby. How ridiculous to be judging but not helping.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 227,
                  "content": "Right??? She just grew three entire humans and has 90% caretaker duties when she hasn't fully recovered. That's tired, right there. OP and babies are the only people in this situation who are NTA.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 972,
              "content": "I can’t believe you haven’t killed him yet. Aren’t you tired too? You need to leave him with the babies and make him step up",
              "id": 75,
              "comments": [
                {
                  "score": 1439,
                  "content": "I just thought it was normal, so I didn't get mad at him I just thought I was failing at the whole parenting thing. I was put in the system when I was 3 so I don't remember how family dynamics are supposed to be \n\nI think I'd be pretty anxious to leave him alone with all the babies because I don't think he'd be able to handle it. Maybe I should get him to take parenting classes or something",
                  "id": 76,
                  "comments": [
                    {
                      "score": 1841,
                      "content": "The fact that you dont trust him alone with his own children means he is failing. He needs to step up BIG TIME. When he gets home, you guys split things 50/50, even at night.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 409,
                      "content": "He is a failure as a father then.",
                      "id": 78,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 389,
                      "content": "For someone raised in the system, who doesn't remember how family dynamics is supposed to be, you are a doing an awesome job.  You are keeping 3 tiny humans alive and well through the hardest stage - and you are taking your calm down breaks outside, with a monitor after seeing to their needs.\n\nYou need help.  You need a partner.  I had one high needs baby, and you do you know how things worked?  While husband was at work, I was the one who looked after kiddo.  He needed sleep to keep his job (he functions less well on lack of sleep than I do, and he was doing a complicated job that he had grown into and didn't have formal training in) so when he came home, I handed kiddo off to him and slept. He was the main parent on deck.  When she was nursing every 1 to 2 hours at night, I took over when he went to bed.  When she slept more, when I woke up we were both the parent on deck, and once he went to bed, I was the main parent again.  \n\nBecause sleep deprivation is torture - literally it's against the Geneva convention to subject prisoners to it, but we expect first time moms to be able to raise tiny humans while sleep deprived to an extend that would be illegal if done to a prisoner.  \n\nWe celebrated the day free time was something that could happen during the week and not just during the weekend.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 139,
                      "content": "Did either of you read any parenting books in the run up? There's classes, books, YouTube channels, subreddits. Resources exist to help you learn how to do this, but having triplets is going to be incredibly hard even with both parents pulling their weight, which your partner is not doing. Him being tired when he gets home should only grant him a break if you later get your own break of an equivalent time, because you don't get to leave work and take downtime when he is failing to be an active parent. You are doing amazingly to be managing this by yourself. I truly hope your partner steps up, you do not deserve to be left so alone in this.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 118,
                      "content": "Out of curiosity, how long have you been together?",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 43,
                      "content": "If he gets to eat a meal during his workday with both hands while seated, his day was easier than yours. He needs to learn how to take care of his children. You did it, he can too.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "You need to be mad at him. You need to reach out to your support and make sure you can get some good sleep\n\n&#x200B;\n\nHe needs to be able to parent his children.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Honey, you’re 20?? I’m not trying to sound condescending. But oh my GOD. I had my son when I was 22 and I was honestly still a baby. *You’re* still a baby. You need SO much help that you’re not getting! Your fiancé must step up or he can ship out. One child is overwhelming, let alone THREE. I’m honestly upset on your behalf.\n\nShow him these comments. Demand help. You deserve it. Not only that you *need* it or you’ll crack under all that pressure. If his family can’t be bothered to help, then they can keep their opinions to themselves if they want any sort of access to your children.\n\nSeriously this post has me heated.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Your partner, the father of your children, should absolutely be as capable and willing to care for your children as you are. He should be motivated to learn how to care for them. What if you’re sick? What if you have to leave town for whatever reason? He is their father.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "The fact you don’t trust him alone with the babies speaks volumes because you don’t think he could handle it is exactly why he should be helping you. You are both parents and you should be splitting this labour. Not doing that is not acceptable.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 866,
              "content": "You work 24/7 dude. He can totally do more than change a diaper once in a while. He’s a parent too.",
              "id": 87,
              "comments": [
                {
                  "score": 566,
                  "content": "[deleted]",
                  "id": 88,
                  "comments": [
                    {
                      "score": 85,
                      "content": "And school!",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Yeah, seriously fuck him.  Let me guess most of the family complaining are some who probably coddled him…",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "She just got done growing THREE human beings! Everyone around here is an AH. SMH",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 451,
              "content": "You have triplets, and it's just you, he doesn't get a choice here he needs to step up and or hire someone to help.",
              "id": 92,
              "comments": [
                {
                  "score": 280,
                  "content": "Or have the future inlaws step up since they're commenting on your parenting........OP should tell them she needs them to watch the babies for a time for a doctor appointment.  I think the inlaws can have some empathy as a result",
                  "id": 93,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I agree - but I don't expect him to grow a pair and be a man because that was what he was taught by those very same whiny grandparents, so I really don't expect them to step up and help.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 367,
              "content": "OP, I’m a triplet. My mom stayed at home and my dad worked. \n\nHe absolutely helped out at home with care, babies. I feel bad comparing because I’m lucky to have a great dad. But it might help to give you perspective: my mom had help. Nannies, aunts, babysitters. Lots of them over the years, plus dad. I realize that’s a super privileged place to be and I’m sorry it can’t always be that way. But my point is you are being SUPERWOMAN and incredible and you deserve all the rest you can get. The father needs to get his act together, that’s not a normal level of help at ALL",
              "id": 95,
              "comments": [
                {
                  "score": 28,
                  "content": "Dont feel bad for comparing other fathers against your dad. Parenting the children you make is literally the standard. Im glad your father parented you well and you have a good and loving relationship. That's how it should be. It's the bare minimum. I'm not trying to say your dad is bare minimum, he obviously went above and beyond in your eyes. I'm just saying that being a parent involved in the childcare is the bare minimum and it's disgusting that so many men fail to reach it that it somehow feels unfair to judge others against the standard.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Thank you! I appreciate that. And you’re totally right, it is the literal bare minimum. I just don’t want to make OP feel bad for her partner’s actions or being stuck in a bad spot (but FWIW, I hope OP can muster the energy and means to move her relationship, or even better, herself and her kids to a better situation)",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "One of the women I work with is the mother of trips. (We work with high needs kids). She is the most awesome person I know and I am sure OP is as well.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 334,
              "content": "You are avoiding going into post partum depression and a host of stuff because you are taking mini breaks. Your fiancé is an a*^ for not understanding that, esp when he is literally doing just 0.05% of chores. NTA",
              "id": 99,
              "comments": [
                {
                  "score": 17,
                  "content": "It's putting the oxygen mask on first before doing the same for the children, if OP isn't able to look after herself she's in no place to look after her children. Her fiancé needs to make sure she's able to do this since everything in her life at this point revolves around the three children constantly. He played a key part in making them happen, he has a responsibility to OP and them he's not meeting.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 216,
              "content": "Yeah well, you’re really tired *all the time,* so he doesn’t get an excuse just because he works outside of the home. He gets breaks and when he comes home, he rests. You aren't getting that, you're working 24/7 with no breaks and no support. He needs to step up, and *not* verbally abuse you.",
              "id": 101,
              "comments": [
                {
                  "score": 21,
                  "content": "Can you imagine her nights. I’m stressed just reading this. I remember feeling so emotional bc someone watched my baby so I could shower for longer than 3 minutes. OP you need to get your fiancé to help. Please. One good night sleep and a reprieve ever so often can reenergize you so much. You’ll think clearer and cope better. Please ask for help since it isn’t forthcoming.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "This comment is literally on the website dedicated to preventing shaking baby syndrome. \nIt is perfectly ok to put the baby in safe place and walk out and collect yourself for a few minuets.",
          "id": 103,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8374,
      "content": "Nta. They teach in parenting classes to step away if it's overwhelming as long as baby ain't gonna be harmed. Is the significant other just ignorant or just doesn't care to step up his/her game to help?",
      "id": 104,
      "comments": [
        {
          "score": 1608,
          "content": "This. As long as the babies are safe and cannot get hurt, and you’re not leaving them for a ridiculous amount of time, it’s okay to take a quick moment for yourself and step away. Being a stay at home parent is so hard, especially when they’re that little and there are no breaks.",
          "id": 105,
          "comments": [
            {
              "score": 943,
              "content": "I also just want to point out... She has triplets.\n\nA new parent gets overwhelmed with 1 baby. Imagine **2 more** newborns!\n\nI can't imagine that. It's almost miraculous she's not had a mental breakdown",
              "id": 106,
              "comments": [
                {
                  "score": 448,
                  "content": "Also only 20 years old…",
                  "id": 107,
                  "comments": [
                    {
                      "score": 132,
                      "content": "And her partner doesn't help much with chores or childcare when he is home.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 74,
                      "content": "I’m 20 and I panic just being left alone with a child for 30 minutes. I could NEVER imagine single-handedly caring for THREE infants. And on top of school? Dear lord, mamma is some sort of superhuman",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "And it sounds like she has little to no support system.  Hang in there, OP.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 57,
                  "content": "I'm a new dad that's been home with my preemie baby for a week and 2 days. I've had an average of 3 mental breakdowns per day since we brought her home. \n\nI can not imagine what 3 of these would be like at once. OP is a saint if their only \"crime\" is walking away for a few minutes.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Imagine them all crying at once, and making each other cry again, even after she soothes one. That’s a mess and no wonder she gets frustrated from time to time.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Wait til he learns that babies are alone for hours on end every night when parents go to sleep.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 992,
          "content": "It's one of the few bits of parenting advice my mom gave me before I had my first: \"Just lay him down in his crib and walk away for a few minutes if you need to.\" This really isn't new or groundbreaking advice.  I'm so confused why the in-laws find it strange.",
          "id": 114,
          "comments": [
            {
              "score": 343,
              "content": "No seriously! I had to set my baby down multiple times because I would get so frustrated, I couldn’t imagine how OP is feeling with 3. If my In-Laws ever tried to get into the middle of an argument concerning my parenting I’d say so what time are you going to be here tomorrow to come and help?? Dad and in-laws are AH’s!",
              "id": 115,
              "comments": [
                {
                  "score": 16,
                  "content": "There's parents out there with 4, 5, 6 and even 9 babies! I don't know how parents of multiples do it",
                  "id": 116,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Not on their own.   With help.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "> I'm so confused why the in-laws find it strange.\n\nBecause the in-laws are TA (and probably the fiancé, too, from the sounds of it).",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Because the story they got was from him, so probably some version of \"she ignores the kids all day while she sits outside!\"",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I think it’s the fact she was outside instead of another room, so technically not even in the house, but it sounds like she was functionally on the deck or something and watching the monitor the whole time so like, who cares?\n\nNTA.",
              "id": 120,
              "comments": [
                {
                  "score": 22,
                  "content": "I've lived in apartments and lived in houses and depending on the set-up, she's could be closer to the babies sitting outside the apartment than some people would be going to a different area in a house",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yup. Have a 16 month old who is a great child. But that makes tough days tougher and sometimes if I don’t step away when he’s being overly challenging I will either have thoughts I feel guilty about (“why’d I have a kid”, etc) or say something I regret, like being way too stern and yelling at him. \n\n\nIt’s so much healthier to feel the tension rise, say you love them, give a kiss, and go take a small break to regroup. A baby isn’t going to die from crying for 10-15 mins. Unless they are at risk of hurting themselves or throwing up, going hoarse from crying, they are gonna be fine. \n\n\nTake the time to get yourself in the right headspace to be a positive, loving parent. The kid will never remember/blame you that you let them cry, but they may permanently show fear of you for your direct actions.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8335,
      "content": "NTA. This fiance should be looking for ways to support you, not blame you.",
      "id": 123,
      "comments": [
        {
          "score": 2131,
          "content": "I came for this one. If your partner is outside with crying kids inside, you don’t berate her. You get your ass inside to help. She’s hit her exhaustion point.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 404,
          "content": "THIS. It is ABSOLUTELY ok to take some moments to yourself especially when you have taken the time to make sure your babies are safe. (As many others have mentioned professionals teach this for a very good reason) Your fiance should see a tired and stressed mama and should be looking out for YOU too. NTA",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Exactly!! He should of recognised she was over whelmed instead of making her feel worse for no reason",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yup. Fiance came home, saw a snapshot of a moment and assumed OP just sits out all day while the babies cry. \n\nI was expecting it to be op going to the store, but nope. Literally with a monitor on the porch.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Yes he sounds like a real asshole",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Agreed. The fiance needs a reality check. Leave him alone with the kids for an entire weekend. See how he likes it being in your shoes for more than 20 minutes and just how hard childcare is. 1 kid is tough enough, I can't imagine triplets.\n\nAfterwards, they need to figure out a better support structure for her. If the in-laws have such strong opinions on her parenting, then they can lend a hand for a few afternoons each week to give her a break.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5319,
      "content": "NTA. In fact, they are wrong. You're seconds away from them. You have a monitor on them. They are as safe as if you were inside the house. Experts recommend taking a break when you're at your wits end with a baby that won't stop crying for no immediate reason. It won't cause any long term harm & shaken baby syndrome often occurs when a parent can't or won't walk away from a crying baby when they're frustrated & exhausted. Many babies need to cry themselves to sleep. They learn to self soothe after a few months.\n\n&#x200B;\n\nThis is from the Mayo Clinic, but there's mountains of data that support this: \n\nhttps://www.mayoclinic.org/healthy-lifestyle/infant-and-toddler-health/in-depth/healthy-baby/art-20043859#:\\~:text=It's%20OK%20to%20let%20your,you%20leave%20them%20to%20cry.",
      "id": 130,
      "comments": [
        {
          "score": 3254,
          "content": "Thank you so much I'll definitely share this article with my fiance",
          "id": 131,
          "comments": [
            {
              "score": 2223,
              "content": "Please share this entire post with your fiancé! It sounds like he’s just unaware. I also think some parenting classes for him or even a book or audiobook would be useful!",
              "id": 132,
              "comments": [
                {
                  "score": 1587,
                  "content": "He's not unaware, he's willfully ignorant and an absolute shit father. Per OP, fiance \"sometimes changes a diaper.\" A father of three triplets! Completely absent and has the fucking gall to criticize OP. He should be fucking ashamed.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 461,
                      "content": "Yeah honestly the way OP describes it he is contributing nothing but money and it seems like she does his chores as well so OP is basically a single parent with a roommate \n\nNTA",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yeah I have ONE baby and the first thing my partner does when he comes home from work is take him and tell me to go get a shower and grab something to eat, and he works almost 60 hours a week. Changing a nappy now and then when you have triplets, wtf",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "could you imagine sometimes changing a diaper and having triplets? The mom is literally working three full time jobs meanwhile the husband is the one who is “too tired”. Crazy talk",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 963,
                  "content": "I think a 12 hour audio of screaming babies is what he needs, tbh.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 166,
                      "content": "he needs a looped recording that's following him all day",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "She says he barely changes a diaper. So I think he is actually just hugely entitled and completely uninterested in parenting.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 286,
              "content": "OP do you have postpartum care?  I'm SURE that your doctors, nurses etc. will provide info that parents of multiples NEED HELP.   I hope fiance can come with you to your next checkup and please ask the health provider.  They will not only support that you did the right thing, but that you need hands on assistance AND breaks.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "H9nestly, he is incompetent ad lazy and abusive. An article cannoy fix a man who was raused poorly. His family sounds horrible.",
              "id": 141,
              "comments": [
                {
                  "score": 51,
                  "content": "It really says a lot that his immediate inclination is to yell at and demean his partner (that's probably visibly exhausted in some capacity), then to tattle to his mommy and daddy that his baby momma isn't working every second of every day. \n\nLike, this goes way beyond a misunderstanding. This guy is straight-up wired bad. And he works in security...",
                  "id": 142,
                  "comments": [
                    {
                      "score": 12,
                      "content": "To add on to that he was 21 and she was 17 when they started dating. She had no support system and is dependent on him.\n\nIf his first thing to do is yell instead of channeling that energy to solve the problem himself, then I worry what other toxic behaviors he does to OP.\n\n He's immature *and* takes advantage of her.",
                      "id": 143,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "You are absolutely NTA, and you did nothing wrong. \nSending love and light to you",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "You should ask the fiancés or his family to pay for a nanny or night nurse if they want to critics you so much tell them u need extra help! Most ppl can’t handle one newborn but 3! You’re a badass mom doing a great job 🥰",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Would you like more articles to share with your husband?\n\nThey're titled: \"How not to be a useless husband\" also \"Help out once in a while for f\\*cks sake\" and then there's \"How to lose 200 lbs in husband weight.\"\n\nOh, yeah. NTA. But your husband sure is.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Please update this post after your talk with fiance. Make sure he knows that the namecalling and berating was unacceptable and does nothing to help the situation. He should have talked to you and asked questions not jump to verbally abusing you. He wasn't there to see everything you did for your children. If nothing else works maybe family/couples therapy?",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Apparently one of the reasons they cry themselves to sleep is because they don’t understand what being tired is or that sleeping fixes it. Being tired is uncomfortable, which makes them cry. Which makes them more exhausted and uncomfortable. So they just keep crying till they pass out until they figure it out.\n\n Please don’t ever feel bad for stepping away when you need to. Our brains are hard wired for babies crying to be the worst sound in the world to us. We’re not _supposed_ to be able to tune it out. You’re doing great.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 149,
          "content": "Thank you for sharing an article, it’s a bit wild his whole family is ignorant and think 24/7 hovering in the same room is needed to raise a baby",
          "id": 149,
          "comments": [
            {
              "score": 99,
              "content": "Yeah, I felt like since she's so young & doesn't have a family on her side to support her, pointing her to actual experts on this would be helpful in getting her fiance & his family to back off to a reasonable position. If they really wanted to help here, they'd be driving the 2 hours once or twice a week to give her some down time.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I want to know how she's supposed to even go to the bathroom if she can't leave the triplets alone in a safe space for five minutes. Are the fiance and his family expecting her to hold it in until he gets home?",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3021,
      "content": "NTA- you are being a GOOD parent by recognising when you are reaching a breaking point and taking a moment to yourself.\n\nYour partner and their family are being ridiculous. Everyone needs a moment alone away from their babies, 5-10 mins alone is nothing. Once the babies are in a safe environment, fed and cleaned there is absolutely no harm in walking away for a few moments breathing space.",
      "id": 152,
      "comments": [
        {
          "score": 1566,
          "content": "I'm concerned that none of them seem to be helping, just criticising. Three babies and one person is not ok.",
          "id": 153,
          "comments": [
            {
              "score": 545,
              "content": "It’s easy for those looking from the outside to criticize.  Her fiancé should be ashamed of himself. Zero support for his fiancé.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 409,
              "content": "[deleted]",
              "id": 155,
              "comments": [
                {
                  "score": 204,
                  "content": "I have no idea how she manages to fit school in with three babies and a unsupportive spouse. OP is amazing and doesn’t deserve all this criticism (especially when those criticizing are doing fuck all to actually support her).",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Exactly, even if they don't know that he's not helping, the fact that his parents are willing to talk down to the poster, but aren't helping at all, is a fucking problem",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Triplets at 20 years old is just bad luck. I could never.",
              "id": 158,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "The partner and family sound more than \"ridiculous\" - they sound abusive. This is unbelievable! Dang, I was a pediatric nurse, and at least I got paid for it and could punch out at the end of a shift, take a shower and crawl into bed.\n\nDon't let them yell at you or diminish what you are doing, OP. If I thought you had the time and bandwidth for it, I'd recommend counseling, because it sounds like you're being ganged up on and bullied. Your stepping outside for a break is NOT neglectful in any way!!!",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2792,
      "content": "The whole purpose of the baby monitor is so that you can leave the babies in a room on their own. Being just outside the apartment door is no big deal (says a grandmother)\n\nIt sounds like you are overwhelmed. You need some help with the babies from time to time. Either the father needs to be home more or his family should help out. One baby is a lot, three have you completely outnumbered.\n\nNTA",
      "id": 160,
      "comments": [
        {
          "score": 615,
          "content": "Exactly. How is her stepping out just outside the apartment door any different from someone who  is on the other side of their house that is like 2500 square foot with a baby monitor. \n\nNTA\n\nAnd OP maybe there is a church or school program who would offer volunteers to come over and help out a few times a week to help give you some relief. I don’t know, just a thought. Good luck mama, you’re getting it done and doing what you need to do.",
          "id": 161,
          "comments": [
            {
              "score": 92,
              "content": "There was a family with multiples in my neighborhood, and exactly this. They had family living with them, along with church and friends coming in regularly—like multiple times a day regularly. It’s hard if you don’t have that network already established, so her husband and in-laws need to recognize this is exponentially more difficult than one baby and step up. \n\nAlso, there are support groups (e.g., Mothers of Multiples) out there that may have additional resources.\n\nEdit: r/parentsofmultiples",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 388,
          "content": "Baby monitor with mum in the living room is perfectly fine but mum standing a few more feet away is somehow neglect to op's fiance.\n\nIt's baffling.",
          "id": 163,
          "comments": [
            {
              "score": 111,
              "content": "I'm guessing it's that the babies were crying. Some people with no experience raising kids or people with absolutely no common sense think that a crying baby must be attended to at all times. \n\nSometimes babies cry. Sometimes for no reason, or at least no reason that can be helped. This is something OPs inlaws should definitely know and the fiance needs to learn.",
              "id": 164,
              "comments": [
                {
                  "score": 14,
                  "content": "I'm not even a parent and I know babies crying doesn't always mean they need something. op's in laws and fiance definitely need to do better.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I agree. It really is insane. I can't imagine berating a 20 year old mom of 2 month old triplets about anything. \n\nI did get a laugh and then broke out in a cold sweat thinking about if my mom or I ever did anything like this to my wife. \n\nNo one would ever find our bodies.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 217,
          "content": "NTA. Guilting new moms that are overwhelmed for stepping away before they lose it  is how you end up with dead or injured babies. \n\nOP self care is caring for your children. I'm a pediatric RN and only have one child. I left him in his crib while I sat outside and cried one evening because I just couldn't get him settled and it had been hours. My husband felt bad I got to that point and didn't shame me at all.",
          "id": 167,
          "comments": [
            {
              "score": 28,
              "content": "My daughter was an absolute angel as a baby, after she hit that first growth spurt at 6 weeks. But let me say, that growth spurt was the worst. She was already in the 99th percentile for length (height), and I could see it hurt her. But for an entire week, she barely slept. I made it fine, nursing and changing, rocking and swaddling, for 5 days. By day 6 of less than an hours sleep per day, I was ready to scream. I remember calling my mom at 3am and just sobbing. Cause even going outside couldn't get me away from her tormented cries and I was freaking out. The next day, my dad came and just walked her back and forth through the house while I slept and that put me back to my sanity again. The day after that, she finally slept through the night. \n\nIt was the lack of sleep and feeling like I was alone. And I only had one at the same age as OP. It's been years since that, but I read what she wrote and can feel the stress and lack of sleep. The feeling of being alone. And then having three helpless, tiny humans needing you instead of just one and I cannot imagine the stress this poor woman is under. Definitely NTA",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Dad of 3 (not all at once) checking in. \n\nBabies cry. As long as they are fed, clean,  appropriately clothed (for the temp & age) and safe, crying is fine. \n\nHonestly if the dad wants to pin this on OP, then the dad needs to spend the weekends with the kids and let mom get away from the house.\n\nOne baby can be frustrating, never mind three. Add in a mom whose mind & body is still recovering from the craziness that is pregnancy and childbirth and the dad is way out of line.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "> The whole purpose of the baby monitor is so that you can leave the babies in a room on their own. Being just outside the apartment door is no big deal (says a grandmother)\n\nRight? Is she not allowed to get up to go to the bathroom, or make something to eat, or leave the room for any of a myriad of reasons whatsoever? What's the difference between that and stepping right outside the front door? Literally nothing.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1783,
      "content": "NTA. \n\nHonestly, you are REALLY young and having one newborn for anyone, let alone at your age is hard, without being 3. \n\nI think it is time to enlist help. Reach out to your doctor. Often health insurance offers newborn care, particularly in the case of multiples.\n\nEven if it's just for a couple of hours per day, you need a break. Reach out to friends and family. Reach out to your local college with an early childhood education program. Many colleges with early childhood programs offer sitting, parents as teachers programs, etc for a discount. Or they can at least refer you to a part time nanny. \n\nBeing constantly overwhelmed is not healthy for you and could be dangerous for those babies. You might want to ask your doctor to refer you to a physiologist to evaluate you for port parts depression. \n\nYour fiance needs to get a grip and realize that at some point, 3 crying infants is too much for one person to handle alone. And with multiples, who tend to be born early, they are going to be behind slightly on milestones. \n\nJust know that 8 weeks is about \"breaking point\" for most new parents. It's about the time when colic hits its peak, appetite increases and babies start becoming a little more aware of their surroundings...but just when you think you can't take it anymore....it's about the time they start sleeping through the night. \n\nHang in there, mama.",
      "id": 171,
      "comments": [
        {
          "score": 290,
          "content": "8 weeks is the worst and best time, they suck, you’re tired, it gets easier mama!",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "OP please listen to this advice. I had a friend have spontaneous triplets and it was hard enough for her to handle and she had a lot of help! You are doing a great job but also do not need to do this alone. Your mental health is just as important as the babies’ physical needs. And in the moment, they were fine. It wouldn’t be any different than if you lived in a large house and were on the opposite end as then. \n\nAlso, is there any reason your fiancé isn’t stepping up? You’re also a student. Can he switch to online too? Or cut back on his class work to be more present? I’m angry on your behalf that this has mostly fallen to you, just because you’re the one with a uterus.",
          "id": 173,
          "comments": [
            {
              "score": 38,
              "content": "This is what I find concerning, as well. How come she's had to change her studies to home, but he's still going to school?\n\nWith infant triplets, I would be advising both of them to put their studies on hold for a year or two. Three infants being looked after by young parents who are both studying and one who is working full time is not tenable.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "She’s studying too her fiancé needs to grow a fucking spine.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "100% this. It’s an untenable situation and OP needs help. The fiancé should be switching his education online at a minimum. \n\nOP says she grew up in the system - she should connect with her social worker to see if there are supports available. A few hours a week of respite would make a huge difference.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1316,
      "content": "NTA, you aren't neglecting them, you're taking a breather when you're overwhelmed.  That's actually keeping you from being a \"bad mom\".  You need help, though. One baby is a lot to deal with, three is too much solo all the time.  Sometimes people have expectations on women that the moment we give birth we automatically become Super Mom and will be perfect at it.  That's not reality. We're human, we have our limits and need help.  You're doing good, you're taking breaks before you hit breakdown.  Hugs to you!",
      "id": 177,
      "comments": [
        {
          "score": 202,
          "content": "I've never gotten that mentality of women should know how to be perfect parents the moment they give birth. It's absolutely ridiculous.\n\nOne of the toughest jobs in the world that doesn't really have a definitive manual.\n\nIt's like saying guys should know how to build houses the minute tthey turn 18. Like you just get some matrix style download of info.",
          "id": 178,
          "comments": [
            {
              "score": 11,
              "content": "When our twins were babies my husband would ask me if something they did was normal all the time.\n\n\"I don't know, dude. I, like you, have never done this before.\"",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 855,
      "content": "\"baby monitor step up in their room and it has a camera on it\"\n\nNTA you are being responsible by monitoring them but also doing the right thing for your mental health. Don't let anyone make you feel bad for this.",
      "id": 180,
      "comments": [
        {
          "score": 29,
          "content": "I know this isn’t about me, but reading these responses alleviates a lot of guilt I have from when my nephew was a baby. When I was 15 I had to watch him anywhere from 3-5 hours by myself every day M-F and sometimes he would just NOT STOP CRYING. \n\nSometimes I could not take it, so I’d line the floor around* his crib with pillows and turn on the baby monitor to go play a 10 minute game of halo to chill myself out. Often he’d fall asleep in those 10 minutes or I’d be more relaxed when I’d go back, and I think he could sense I wasn’t so tense and he’d stop crying.\n\nHearing that this is ok makes me feel a lot less guilty about the times I’d leave him alone for those few minutes. \n\nNTA OP, I don’t have kids of my own, but I totally get it.",
          "id": 181,
          "comments": [
            {
              "score": 14,
              "content": "Just so you know, lining a crib with pillows is incredibly dangerous and could easily have killed him",
              "id": 182,
              "comments": [
                {
                  "score": 11,
                  "content": "Yeah, I learned that when I first took care of him(parents gave me a list of do nots, this and leaving him alone were on there, hence the guilt lol). His crib was in a corner canopy thing and I’d line the floor with pillows since his crib wasn’t too high, he couldn’t even sit up, I was just paranoid",
                  "id": 183,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}