{
  "post content": "Using a throwaway for privacy. Not giving real ages, but we're both in our 20s.\n\nI married my husband a year ago. Even though I've always had it drilled into me that anyone wanting to wait until marriage for sex is hiding something, I stupidly agreed to wait until marriage because I never learn from a single mistake.\n\nAs it turns out, my spouse is essentially impotent from childhood medications (ADHD). I didn't know the full extent of this until the honeymoon. Suffice to say that that honeymoon was one of the most depressing weeks of my life. We tried to seek medical care for it, but Viagra and other ED drugs wouldn't be safe for him to take due to some heart issues, which I completely understand.\n\nI was at first trying to hide the issues from family/friends but as things declined, I had to be more honest. He slowly stopped trying to show any affection to me, and we haven't slept in the same room for over a year now.\n\nMy mental state has been on a slow decline, so a friend of mine offered to have me come out to her state for the weekend to get away. I wasn't planning it, but while there, I ended up having sex with someone at a club. Sounds gross, but it was GREAT.\n\nOf course the aftermath has been very harsh. Most of my family understands that I'm extremely sexually frustrated and have been put in an impossible situation, but obviously a good deal of my \"social network\" thinks I'm a *slur*. They hold that with the exception of severe abuse, marriage is forever. \n\nI'd like to try to be okay with an asexual relationship, but honestly it's incredibly hard. I didn't marry to stay a virgin and sleep alone. I don't know if I have a high sex drive, or just A sex drive. I had a pregnancy scare from it and realize that I deeply want children one day, which obviously can't happen in this situation. \n\nI'd like to try sex again, but obviously that's not happening. I'd also love to have a sexual high without a crash of guilt afterwards. Everyone else gets that, why am I held to an unachievable standard?\n\nMy spouse doesn't want to accept an open relationship, not that we're talking much these days. In my state lack of consummation isn't reason for an annulment, so I'd have to prepare for a full divorce. I make more than he does and our condo is in my name, so he could take a great deal away from me.\n\nAm I really in the wrong here?\n\nEdit: \n\nI've gotten some preliminary advice that I should offer him a flat settlement to sign no fault divorce papers (say 10k plus I pay his moving costs, or even just a flat 15k). It sucks, but it would get him out of my condo quickly, prevent further legal battles, and end this quickly and quietly. With a ~2 year marriage, no kids, and the fact that 10k would about cover every financial contribution he made in the marriage, that actually looks like an amazing deal for him in front of any judge.",
  "id": 1,
  "comments": [
    {
      "score": 2583,
      "content": "ESH. You cheated and obviously didn't practice safe sex. He didn't disclose a medical condition until the honeymoon. Get a divorce and pick up the pieces, it might be hard but not as bad as this \"marriage\".",
      "id": 2,
      "comments": [
        {
          "score": 445,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 126,
              "content": "Just want to note for the audience, in some places this would be grounds for a legal annulment as well as a church annulment.  Legal and church annulments are separate things.",
              "id": 4,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 205,
          "content": "Took the words right out of my mouth and ESH. I would be so angered and hurt if my new wife waited until the honeymoon to tell me that she was unable to have sex or babies. That is some serious information you need to know before you commit to spending your life with someone. Regardless, cheating isn't cool.",
          "id": 5,
          "comments": [
            {
              "score": 204,
              "content": "He did it on purpose, too. He trapped her and that’s bull shit.\n\nIt in no way justifies her cheating, but it justifies her leaving him and never looking back.",
              "id": 6,
              "comments": [
                {
                  "score": 45,
                  "content": "I’m not saying she should have cheated, but she was a *little* justified. Husband is a bigger cheater than her by a long shot.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 75,
                      "content": "Husband isn't a cheater, he's a manipulator. He intentionally withheld game-changing info until it was too late and OP was locked in. That's despicable.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Ugh this is just like the woman who found out her husband hid his micropenis from her until they were married and tried to consummate. So manipulative and fucked up. I'd honestly say her husband is TA.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "The thing that really pushes the husband over the line is that being physically impotent in no way means you don't have to have a sex life. It sounds like he basically just has no interest in sex, and was content with letting them lapse into mutual celibacy. If he had tried really hard to make sure OP was sexually satisfied, but she cheated because she missed having sex with big ol' cocks, I'd be less sympathetic.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I think it does justify it. She deserves some happiness",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yep- this, 100% ESH.   He should have disclosed that info up front initially- to which you would have had a good reason to annul- marriage under false impressions is a viable reason for annulment. Additionally, cheating is garbage.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Yeah, time to bite the bullet and lose half of your assets OP, it sucks but that is the consequence of a failed marriage. You would be a much bigger asshole for staying just to hold onto your money. Next marriage be more sure. Sounds like you were only dating a year before marriage.",
          "id": 13,
          "comments": [
            {
              "score": 66,
              "content": "No need to scare OP with \"losing half her assets.\" That's not what happens in most cases especially if it was a very short marriage with no children.",
              "id": 14,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 54,
              "content": "Nobody loses half their assets to a 1-year marriage.",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -158,
          "content": "Who cares if she didn’t practice safe sex. First of all you don’t know that, maybe the pregnancy scare was due to a broken condom or just her being paranoid her period was late. And anyway, it’s not like she was putting her husband at risk, since the guy barely talks to her, let alone touches her!",
          "id": 16,
          "comments": [
            {
              "score": 72,
              "content": "Sure. I don't know that. Not like I went on a tirade about safe sex or anything, but if you're cheating on someone it's the least you can do. The impression I got is that she didn't use protection.",
              "id": 17,
              "comments": [
                {
                  "score": 32,
                  "content": "Yeah because usually if you’re cheating and don’t practice safe sex you’re putting your partner at risk of STI’s, but since she doesn’t sleep with her so-called husband, that’s not the case. So it’s not any worse or better as far as the cheating is concerned whether she practiced safe sex. Her husband is a deceptive asshole who knew exactly what he was doing when he tricked and deceived her into marriage. I have no sympathy for him.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Have you been tricked by an impotent dude before or something because you seem extra extra mad at this guy",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1220,
      "content": "ESH\n\nYou would be fine if you told him, \"Look, I need sexual satisfaction that you cannot provide. I am ok with being in an open relationship with you, but if that won't work for you, we should get divorced.\"\n\nBut you didn't do that. Instead, you cheated on him. Divorce is tough. \\]Your situation is incredibly hard and I feel for you, but it's no reason to become a cheater.\n\nHe's the asshole for not telling you that he was impotent or at the very least being ok with an open relationship. You have needs!",
      "id": 20,
      "comments": [
        {
          "score": 105,
          "content": "I completely agree ESH. She could have talked to him about her lack of intimacy and that she has needs. If she did this and there was no resolution she should have moved for divorce. Not gone to visit a friend and had a one night stand. Whether you still love the person or not, it's a crappy thing to do. But he sucks for not disclosing the full extent of his impotence. He might not have had a full understanding of it (you cant learn a lot about stuff you never have the urge to do) but he could have talked it through with her.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Even putting a partner before a choice of an open relationship isn't really a healthy move - there's ways to have sex without penile penetration and tons of stuff available for this. It takes two loving partners to do this though - so a more fair proposition would have been \"Do you want to try out things with the two of us involving the horizontal mambo?\" \n\nOP threw a lot of things out the window with their behavior, although her spouse shouldn't have stayed quiet about it.",
          "id": 22,
          "comments": [
            {
              "score": 63,
              "content": "The partner intentionally tricked op into marrrying an impotent man. Op doesnt owe any consideration toward him",
              "id": 23,
              "comments": [
                {
                  "score": 20,
                  "content": "True, but cheating on the partner she married still makes her an asshole.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -4,
                  "content": "...that same partner DID go to doctor appointments to see what their  options were. Both of them suck.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 13,
                      "content": "No, op was willing to make the marriage work even after her husband tricked her into marrying him. Her husband doesnt get points for going to the doctor after decieving op about a potential deal breaker. He lied and break her trust when he didnt tell her about his problem, op doesnt owe anything to him after that. So in my opinion NTA",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "I've been in a situation with a low libido partner who could technically \"do things other than penetrative sex\" but it was always out of obligation and never out of desire. So that didn't work for me. Felt wrong.",
              "id": 27,
              "comments": [
                {
                  "score": 3,
                  "content": "Well, yeah. It has to be out of want to do it. I can understand your aversion of said sex =\\ I hope you're in a healthier situation now.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I'm single as fuck right now.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Ok, but ask yourself if you really are ok with being fingered the rest of your life, till death do you part, when you had every desire and intention to do so?? Sorry, but you and I both know that wouldn’t cut it and would drive you crazy. i get there are lots of ways to spice this up..but who are we kidding here..OP wants to explore her sexuality for the first time and is being asked to limit that to a small sliver of what’s out there on behalf of someone else.\n\nCheating is shitty. She should have communicated her needs prior, had more conversations about sex before marriage, etc., but that ship has sailed already. My guess is she has been shamed about this plenty, so now its time to look at next steps.\n\nNot telling a spouse you are impotent and letting them discover that on your wedding night is also a shitbag move too. Plenty of blame could be dished around, but the end result is:\n\nget divorced > get laid (consider condoms this time) > eventually find someone you marry that has the same mindset on sex\n\nOnly thing OP shouldn’t do is pretend she doesn’t have needs and continue being in a situation where those can’t be fulfilled.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "> there's ways to have sex without penile penetration and tons of stuff available for this.\n\nAnd for many people that’s not enough, and that’s a legitimate boundary to have.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "She did not consent to a relationship without penetration. She didn’t consent to a relationship without biological children. This wasn’t a marriage.",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": ">there's ways to have sex without penile penetration\n\nCan we stop pretending that's even remotely an adequate substitute? OP had no obligation to even consider settling for that. Yes, *ideally* she should have talked to him before stepping out, but their entire relationship is based on a lie and that pretty much voids any obligations she has towards him. What he did was a hundred times worse than what she did.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "ESH agreed",
          "id": 34,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -9,
          "content": "I don't even know if I would consider this cheating... since she wasn't ever made aware of the rules of the game until it was too late.   \n\n\nHe can't have sex with her, so is her seeking sex elsewhere cheating?",
          "id": 35,
          "comments": [
            {
              "score": 6,
              "content": "When you get married, exclusivity is the norm. She’s reasonable for seeking sex elsewhere, but should have discussed it first",
              "id": 36,
              "comments": [
                {
                  "score": -4,
                  "content": "Sure, she should have... but I'd like to think openness is a norm to, especially with a dealbreaker like impotence. \n\nI mean, maybe they're both wrong, but I place a lot more blame on him than her.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Openness can be a norm but, as it is not the standard, it must be previously agreed to.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "I think yes, but it’s more of a question of was she valid for wanting to.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -31,
          "content": "He wouldn't accept an open relationship, and besides they barely talk anymore and they haven't slept in the same room in a year. They're not husband and wife anymore, they're roommates.",
          "id": 40,
          "comments": [
            {
              "score": 79,
              "content": "Cheating is still never acceptable if she wanted out of the relationship that's exactly what divorce is for",
              "id": 41,
              "comments": [
                {
                  "score": 36,
                  "content": "It's never acceptable to trick someone into marrying you under false pretense.  OP's husband literally never gave her the opportunity to choose not to be in this situation.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 21,
                      "content": "She stated she \"didn't know it to this extent\" implying she at least knew about it she just didn't know it wasn't fixable and since her husband didn't have sex he likely didn't either\n\nUnless she had super poor wording nothing was under false pretenses\n\nAnd again say it with me\n\nDivorce exists",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "[deleted]",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Cheating isn't acceptable because it's essentially an important promise/agreement you're breaking with someone, but in this case OP's husband had already nullified that agreement by deceiving her into a marriage under false pretense. So I would say this is probably the one time cheating is acceptable, she's disrespecting someone who has already shown that he doesn't respect her",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -5,
                  "content": "I think this is one of the very rare situations that cheating is excusable. Sure, it would have been better if they talked about it but still...",
                  "id": 46,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Again divorce exists for a reason there is no excuse when divorce is as easy as it is cheating is NEVER excusable",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I don't know that cheating is ever excusable. Understandable yes, forgivable even, but not excusable. If her marriage was so unfulfilling she had available ways out rather than keep up this sham of a relationship for two years until she did cheat.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 454,
      "content": "A lot of comments here are about how “cheating is NEVER acceptable”.\n\nNow i’m not arguing that cheating isn’t bad. but what makes cheating so awful and traumatic is the betrayal and deception by the person who’s supposed to be your partner, closest friend and confidante.\n\nthis is clearly not the case here. they barely even TALK anymore! of course cheating sucks - but OP has already experienced that betrayal and deception when she was tricked into a marriage that her husband seemingly never intended to consummate. to add insult to injury, he then withdrew all affection, intimacy, and seemingly even any kind of friendship or partnership.\n\n“just file for divorce!” - the OP didn’t plan to cheat, according to her. it’s not like she set up a dating profile with the intention of carrying on an affair. she was living in this pseudo-marriage and trying to make it work, and she made a drunken mistake.\n\ni don’t really have a judgment, i suppose, but OP - you deserve better. you deserve a relationship that fulfils you, at the very LEAST emotionally, but ideally in every way. you’re still in your 20s - i know it feels like you have a lot to lose, but you are so young. you have plenty of time to rebuild your life into one that makes you happy. fuck the condo. and your husband deserves the same! you two aren’t right for eachother. that doesn’t mean there’s not someone out there for him - for one, there are tonnes of asexual women out there who could happily be in a loving relationship without sex. it’s just not you, and that’s okay. you both deserve to be happy, and it doesn’t sound like you can be that together.\n\nESH? NAH? i don’t really know. but you both deserve better.",
      "id": 49,
      "comments": [
        {
          "score": 173,
          "content": "THIS THIS THIS THIS\n\n>what makes cheating so awful and traumatic is the betrayal and deception  by the person who’s supposed to be your partner, closest friend and  confidante \n\n&#x200B;\n\nWhich is apparently what OP's husband put OP through, so the actual judgments are bizarre to me.",
          "id": 50,
          "comments": [
            {
              "score": 80,
              "content": "In cheating you always have the option to a) not do it and break up or b) try counseling first, or c) suggest a different set of rules. That's the way to do it right.\n\n2 wrongs don't make a right, so I think there is no situation in which it's ok to cheat. I'm sorry, but I'm a mature person who certainly 'gets it': relations can be tough, and in some situations keeping your pants on can almost feel more wrong than cheating. But that doesn't make it ok, imho.",
              "id": 51,
              "comments": [
                {
                  "score": 75,
                  "content": "Communication is only possible when all parties are willing to communicate, and OP’s husband withdrew physically and emotionally.\n\nOP’s husband seemingly withheld info that’s a potential dealbreaker (affecting OP’s ability to consent), then withdrew from the marriage.  Do I think OP’s behavior was ideal?  No.  Can I in good conscience call her an asshole based on the info provided?   Not really.  Can I in good conscience call him an asshole?  Yes.\n\nDo two wrongs make a right?  No.  But sometimes a wrong in reaction to being *wronged* can be justifiable.  For instance, it’a wrong to punch someone in the nose, it can lead in death, but if someone walking home alone in the dark is grabbed from behind by a friend as a joke punches them in the nose out of self-preservation it’s justifiable.\n\nContext matters.  Someone who cheats on their spouse because their spouse prioritizes caring for their sick child over dates is not equal to someone who cheats when they get a bit of freedom from their severely abusive spouse who threatens to gain sole custody of their children then drown them.  Context matters.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Then she should have divorced her husband, not cheated on him.\n\nIt's not rocket science. Stop trying to defend the cheater.\n\nESH.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "Her husband can't have sex and lied to her about it until the honeymoon! It's so easy for us to say \"you should always be the best version of yourself possible\" but this... It wasn't a premeditated thing. She didn't plan to cheat. Life has gray areas.\n\nBut please, OP, get a divorce. Idk if you're an asshole but you are DEFINITELY married to one.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Thats why its ESH and not YTA. Him being asshole doesn't give her a get-out-of-jail-free card for cheating.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "What he did based their entire relationship on a lie. In my book, that pretty much voids the relationship and any obligations OP has on that basis. This doesn't really even count as cheating, in my opinion, be cause she doesn't owe him fuck-all after what he pulled.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Why are they bizarre. the one I see the most is ESH and that seems accurate and they both betrayed each other's trust",
              "id": 57,
              "comments": [
                {
                  "score": 2,
                  "content": "She had no obligation to his trust after he based their entire relationship (and therefore OP's obligation to monogamy) on a lie.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "An adult, educated response. I don't think they're allowed on sexual matters on this sub. Generally, on most matters, they're on point, but on sexual matters mostly the commenters are ones who landed at Mayflower.",
          "id": 59,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "[deleted]",
          "id": 60,
          "comments": [
            {
              "score": 9,
              "content": "This wasn't really a relationship. He based the whole thing on a lie, which pretty much voids OP's obligations, making it not really even cheating at all.",
              "id": 61,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "She probably shouldn't have had sex without a condom(assuming since there was a pregnany scare). And She probably should have a conversation about sex before hand with him, but given possible cultures, that's really hard.\n\nBut its clear that he left the relationship before she did. He built this relationship on a foundation of lies. He started withholding affection.\n\nIt sucks he cant do PIV sex, but there are other things he could have given a go of.",
          "id": 62,
          "comments": [
            {
              "score": 7,
              "content": "Eh, I've had pregnancy scares and I always use condoms.",
              "id": 63,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I think no matter the scenario cheating is unacceptable. Yeah she didn't plan it , that's also what my ex-girlfriend told me after she cheated (btw not the same scenario). It's a lame excuse  because she could have delayed her sex for 2.5 seconds , called her husband and told him were done then fuck her brains out.\n\nI apply the exact same standard to men in dead bedrooms who cheat, once you start giving a pass for one scenario you give a pass to all of them because cheaters will use mental gymnastics to justify cheating because there \"not happy\" or \"unfulfilled\" ect; \n\nDon't get me wrong the husband is a pos here too, so **ESH** she should have gotten here marriage annulled instead of comprising her integrity.",
          "id": 64,
          "comments": [
            {
              "score": 34,
              "content": "“AITA: I called my husband from the bathroom of a club, told him we’re done, hung up and fucked a stranger”\n\ncome on, man. that’s worse! you see how that’s worse, right? \n\nof course this situation isn’t ideal - for either of them. but holy shit, it is so much better to make a mistake, reflect on it, and then end your relationship in a mature and genuine conversation. this is like the whole “we were on a break” debacle from Friends, as though relationships are based on technicalities and loopholes. it doesn’t matter! what matters is open and healthy communication. she definitely, in no way, absolutely should not have called her husband from the club to dump him before she fucked someone else. you’re letting your personal experiences colour the way you view this situation, and i don’t think you would honestly have preferred a 2 second phone call from your ex saying “about to fuck someone else, we’re over”.\n\ni didn’t make any statements implying it would be different for a man, so i’m not sure where that came from.\n\nrelationships are not about technicalities or standards, they’re more nuanced than that. this is what she needed to do to realise how desperately she needed to get out of this marriage.",
              "id": 65,
              "comments": [
                {
                  "score": 0,
                  "content": "Nope getting that phone call isn't worse, she would at least be honest to her husband in that situation. She still would be a dick but if getting her jollys off was that important in that moment she would have been less of dick by calling him and telling him its over.\n\nShe didn't need to cheat on her husband to find out she wanted out of the marriage, the not the asshole thing to do would have been to realize that she wanted to fuck some other guy on her trip, control herself by keeping her pants on and going home to sit her husband down and tell him she needs a divorce. \n\nImo someones integrity and the way they act during a breakup 100 percent matter,  if she can justify this to herself she can justify  cheating in her next relationship when some of other \"needs\" are being unmet.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 13,
                      "content": "you seem to be of the opinion that everyone WANTS to cheat, and are simply looking for an excuse or justification.\n\npeople want to be happy. do you think she wouldn’t rather be happy with her husband? once again, i think your own experiences cloud your judgment.\n\n“once a cheater, always a cheater” flatly ignores that people are multifaceted and situational context matters.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I totally agree with you, pal.\nIf you're about to cheat, BREAK UP!\nIt won't be as bad as cheating.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Yeah, I could *totally* see a comment ponder NAH if this were an OP who cheated on his wife who couldn’t physically have sex, lmfao. \n\n“Cheating is NEVER acceptable, but...” then proceeds to try and justify why the wife cheated. Sorry, but it’s never justified. Doesn’t matter if the cheating \"wasn't planned\" or whatever. Sex doesn’t just fucking happen; there usually IS some sort of plan to get there or else it'd be assault/rape",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Thank you for this brilliant answer. This situation is complicated, but you've managed to sum it up and lay it out in a great way",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "You deserve cock girl! Follow your feelings! Let emotions guide you. The world was built just for you, and you are entitled to a perfect life!",
          "id": 71,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Dang.... I don't know how to feel anymore. Well said.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 354,
      "content": "ESH, you need to sit down and discuss this. Instead, he's sulking and you're cheating. Grow up and deal with this like adults, even if it means divorce.",
      "id": 73,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 317,
      "content": "ESH. He lied (or didn't tell the whole truth) about his medical condition before getting married. You cheated (though I completely understand why).\n\n>not that we're talking much these days\n\nSounds like sex isn't the only issue in the relationship. \n\nHonestly, if you don't see a way for  this marriage to work, cut your losses while you are still young - it will be easier for both of you in the long run.",
      "id": 74,
      "comments": [
        {
          "score": 33,
          "content": "It’s a lie by omission, but yeah, ESH.",
          "id": 75,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 112,
      "content": "Look, I don't know you or your husband, but I wanna call ESH. Simply because you cheated. You know you cheated. You know that you shouldn't have cheated.\n\nI know that this must be hard for you, being in an unfulfilling relationship in this way. You have hit a roadblock where you have needs that he's not meeting. Something has to give. I understand that. I get that not everyone is perfect, and that things like this can and do happen. But from what you've said, a healthy relationship for you is one where you can have sex with your partner, and while there are other ways to have kids you probably want to give birth yourself.\n\nI don't know your full story, but you cheated. You're an asshole. But this is a good time to reevaluate your relationship. You have to determine what's best for you. And being in a relationship where you get to a point where you're cheating is not best for you or your husband. It's time to take a look at things. It's time to make a decision. You know what that decision is.\n\nEdit: Changed to ESH because I missed the part where he knew he was impotent.",
      "id": 76,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 63,
      "content": "ESH, but you're an asshole, big time.\n\nGoing against the grain on this one. He should have disclosed his sexual situation to you before getting married and he's a major asshole for that but there is absolutely nothing in the world that makes it okay to cheat. Period. To want sex is perfectly normal, to basically completely deny your partner sex is awful, but it still does make it okay to cheat. If you don't want to be with him, leave.\n\nYou're so worried about him taking \"a great deal away\" from you that you won't divorce him? If your mental health is truly suffering then none of that matters. It's just money. Convince him to settle in a fair agreement or suck it up, take the loss, and walk away. Maybe next time around you'll be wiser, get a prenup and don't \"wait until marriage.\" (That shit is stupidity at its finest.)",
      "id": 77,
      "comments": [
        {
          "score": 57,
          "content": "I disagree. Cheating is terrible, but the reason it's terrible is essentially because you're breaking a promise you made with someone who put a lot of trust/emotional reliance in you. In this case OP's husband has already broken that trust (in a much worse way IMO) by essentially tricking her into getting married with him knowing they could never have sex, if I'm reading the account correctly. So while there are better ways for OP to handle this than cheating, she doesn't have any obligation to someone who clearly doesn't respect her himself",
          "id": 78,
          "comments": [
            {
              "score": 14,
              "content": "Okay, you have the right to disagree :)\n\n\nShe still has an obligation. When you marry someone, traditionally, you make a vow to be faithful and honourable to that person. His wrong doesn't make her wrong a right. He absolutely wronged her but she chose to stay married, meaning her actions where wrong. She should have divorced him or separated from him if she was unhappy.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I think the cheesy \"Two wrongs don't make a right\" apply in this scenario, and hence ESH applies.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I agree with the judgment, but OP's husband is the bigger A. He didn't disclose this prior to their marriage, and while she tried to make things work, he completely gave up. I understand her reasons behind it, and I agree she should've annulled/divorced him when she realized it wasn't working for her prior to her cheating on him.\n\nAlso waiting until marriage isn't necessarily stupid, but it is a risk.",
          "id": 81,
          "comments": [
            {
              "score": 1,
              "content": "Oh he's definitely an asshole for doing that to her. 100%. I am just saying that nothing justifies cheating.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "You're not going against the grain. God I wish people would stop staying that.",
          "id": 83,
          "comments": [
            {
              "score": -1,
              "content": "[deleted]",
              "id": 84,
              "comments": [
                {
                  "score": 2,
                  "content": "Really? Cause that's what I said too. So he's not alone",
                  "id": 85,
                  "comments": [
                    {
                      "score": 1,
                      "content": "When most people are saying one thing a a few are saying the opposite, those few saying the opposite are going against the grain. Therefore you're also going against the grain if had a similar opinion to mine.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 50,
      "content": "ESH - but non-consummation wouldn’t be the reason I would use for requesting an annulment. I’d use him hiding material information about his impotency. \n\nEither way, I’d talk to a lawyer and be completely upfront with them about the fact that you did cheat because it will definitely be brought up by your husband.",
      "id": 87,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 46,
      "content": "NTA. Yes you cheated but you were put in an impossible position. He lied and then withdrew all affection and care (even non sexual). What you’re in now is not a relationship. You barely talk. Yes, it might be hard and scary, but get the divorce. Whatever money you lose isn’t worth 20, 30, 40 years of misery and the loss of an opportunity to build and life and a family with a person who actually loves you. The longer you wait, the more financial risk you’re at. And eventually this will lead to divorce anyway because it’s unsustainable. You may as well rip off the bandaid. You can earn money back, but not time.",
      "id": 88,
      "comments": [
        {
          "score": 59,
          "content": "She's TA too. If you're not happy then leave the marriage. Cheating is an asshole move regardless of the dead bedroom.",
          "id": 89,
          "comments": [
            {
              "score": 27,
              "content": "While I do not condone cheating, it seems like OP ‘s l husband couldn’t give two rats ass about what she does. He withdrew all affection and attention from her and they both barely talk. They sound like roommates to me lol. So who is is she an asshole to? This man really doesn’t care, it seems like, or else he would have made some type of effort to talk about their conflict.",
              "id": 90,
              "comments": [
                {
                  "score": 2,
                  "content": "> it seems like OP ‘s l husband couldn’t give two rats ass about what she does.\n\nYou really think someone who is recently married doesn’t give a rats ass if his new wife cheats on him?\n\nIt seems to me like this is a terrible situation for all. I feel like husband must be going through some tough mental issues (this kind of stuff takes a toll on your mental state) and isn’t handling it the right way.  \n\nThat doesn’t mean he doesn’t care if his new bride has sex with other men.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "She's also TA, but way less than him. She handled the bad situation poorly, but he's the one that created the bad situation in the first place. It's far more his fault than hers.",
              "id": 92,
              "comments": [
                {
                  "score": 0,
                  "content": "So women have no agency. Gotcha.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 0,
                      "content": "How the fuck did you extricate that bit of bullshit from what I said?",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "I had an ex-gf who had gone through a very similar situation. The husband she was married to before she met me never wanted to have sex with her the entire length of her seven year marriage. She said they didn't even have sex on her honeymoon. She said they only had sex every 3 months or so only because she would get into a fight with him about it. If it was up to him, they would have never had sex.\n\nThis really destroyed her self-esteem to the point she was considering suicide. Instead, she eventually met up with someone from online and cheated. After doing so the one time I guess it gave her at least a small enough boost in self-esteem that someone would want her that she finally had the courage to divorce the guy.\n\nI didn't understand why she didn't just divorce the guy in the first place but if it was between her cheating or committing suicide, I would obviously prefer she do the former. I always told myself I would never get involved with someone who had cheated but in this case I felt there were extenuating circumstances. I figure if your husband doesn't want to have sex with you for seven years then it seems kind of messed up there should be any expectation of sexual fidelity.\n\nI feel like the same reasoning applies here. Just because the OP's husband can't get an erection doesn't mean they can't enjoy other forms of affection or sex. He could go down on her or give her a hand job at least and she could do whatever she could for him. If he's not willing to work something out with her and is completely ignoring her physically then the idea there should be an expectation of sexual fidelity after a year or more of neglect seems maybe a little unreasonable. My take is if he doesn't want her then he can't complain if someone else does. Obviously the correct way to handle this is to get a divorce, but I'm not going to crucify someone when they were misled going into a lifelong commitment. It's always wrong to cheat, but in this case I wouldn't go so far as to say she's an asshole.",
          "id": 95,
          "comments": [
            {
              "score": 21,
              "content": "This. Being told by words and actions that you don't matter, and that you aren't attractive destroys your self-esteem.  Then you are told by others that it's not worth divorce, because you've put so much time into the relationship.  There's a stigma to divorce. Sometimes, cheating is the only way to get enough courage to leave the \"relationship\"",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "> Just because the OP's husband can't get an erection doesn't mean they can't enjoy other forms of affection or sex.\n\nLet's be real, that is *not* a satisfying substitute for the real thing.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -9,
              "content": "Let me say I feel sorry for the ex-gf sounds like a shit situation. However my problem with that scenario is you green light one type of cheating where does it end?\n\nLike I've been in situations my gf didn't have sex with me for three months, would I have been justified in cheating? Okay not three months, a 6 months? A year then?\n\nI also would not crucify OP, or your ex-gf but I still think they are the asshole and wouldn't consider dating them. If they can do that to their exes they can do it you or not next partner. They have shown their solution to being in a horrible relationship is not to break up but to have an affair then I can't trust they wouldn't be able to do that to you if your relationship turns sour for another reason.",
              "id": 98,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I think ESH. I don't feel as though its an impossible situation, she had a chance to either discuss an open relationship, or a divorce. She cheated, which is always wrong in my books.",
          "id": 99,
          "comments": [
            {
              "score": -8,
              "content": "Did you read the post? He doesn’t want an open relationship. He’s withdrawn from her completely. He shows zero compassion or respect for her so I don’t see why she owes any to him.",
              "id": 100,
              "comments": [
                {
                  "score": 34,
                  "content": "She can leave the relationship. No reason for her to stay an cheat.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Then you divorce. \n\nSimple as you don't cheat.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "[deleted]",
                  "id": 103,
                  "comments": [
                    {
                      "score": -5,
                      "content": "[deleted]",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Divorce exists.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This! But for me it's more of an ESH. But yeah, you can't get time back once its passed!",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Doesn't even qualify as cheating IMO based on how she's described their relationship. They're effectively roommates",
          "id": 107,
          "comments": [
            {
              "score": 3,
              "content": "I’m stunned by the responses here, and relieved to finally see someone who agrees with me. \n\nFrom a contract law perspective, they really don’t have a marriage - dude defrauded her in a truly horrendous way, and their marriage is just legal technicality, not a relationship. \n\nThe only real mistake OP has made that conceivably counts as “bad behavior” is the decision to stay in the marriage this long...  but even that is excusable considering \n\n- her youth and inexperience \n\n- the fact that she presumably loved this guy before all this happened and tried to make it work under truly heartbreaking circumstances \n\n- her social network apparently sees fit to rigidly apply its “marriage is forever”position  to a situation that doesn’t fairly even count as a marriage (so that OP has little to no social support for divorcing him)",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "They're married, and they discussed an open relationship which he refused. She literally cheated the rules (Not saying the guy's a saint. I have very little respect for him).",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Agree 100% - cheating isn’t an awesome manoeuvre but I get where OP is coming from and sounds like her husband sucks (or worse, doesn’t) big time. Life is short, get outta there.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "I agree except that you weren't put in an impossible position. You could have persued divorce, you could have ended your relationship, you could have gone to counselling to talk through the issues. \n\nI'm not saying this to say you're an asshole because even if you have been, it's complex. But rather to say excuses don't cut it for your own wellbeing. \n\nI understand where you are at but you need to stop making excuses for your OWN sake in order to stay in a relationship you aren't happy in. If friends think you're a bad person for leaving, you'll find new friends and hold on to the ones who care. But for your own sake fly free, find someone that makes more sense for you.",
          "id": 111,
          "comments": [
            {
              "score": 6,
              "content": "You seem confused. I’m not OP.",
              "id": 112,
              "comments": [
                {
                  "score": 5,
                  "content": "Not confused just unclear sorry! I'm saying to OP that I agree with you except for that bit.",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": ">Yes you cheated but you were put in an impossible position\n\nNo, no, she wasn't. She made a choice, and that's on her, despite the factors leading to it.\n\nHowever, this isn't a relationship. At all. She deserves happiness with a partner who actually cares for her, and she isn't getting this with her husband.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 45,
      "content": "I’m married and a virgin but I knew when i married my husband that he was impotent. (Teenage surgery accident.) but my husbands very caring and affectionate. I have entertained the idea of cheating, but I haven’t. Honestly my depression makes me not feel like sex anyway.  I want children as well.\n\nI know your hurting and I honestly think you shouldn’t ave to stay in a relationship that makes you miserable. But that being said, I think your husband needs to see a sex therapist, he likely feels like he isn’t a man, like he isn’t good enough and the decline in the affection could be his self fulfilling prophecy. Best of luck with this complex issue.\n\nNTA",
      "id": 115,
      "comments": [
        {
          "score": 60,
          "content": "At least you had a choice, OP didn't.",
          "id": 116,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "I hope everything works out with you and your husband!",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Everyone rooting for their own team apparently.  \n\n\nConsider new rules, breaking up and/or seeking counseling. That's better than being an asshole.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}