{
  "post content": "**UPDATE:** \n\n**tl;dr**: I will write basic holiday messages (\"Happy Thanksgiving! Love, X and Y\"), and my husband will do the grunt work of buying and sending the cards. He absolutely has my back when it comes to dealing with his mother, and I think it's reasonable for me to do these small, silly things to keep her happy.\n\nThank you all for the responses.\n\n---\n\nI want to clarify some things that people either misread or I did not put in the initial post:\n\n1. I stated that I do *not* like writing cards, just seeing people happy when I succeed. Those cards that I give to my coworkers are not holiday bullshit, but only for rather rare occasions of people I care about leaving the company, being promoted, etc. I've written 3 total. Writing thoughtful cards is excruciating, and I assumed his mother expected thoughtful cards like that every year for the holidays.\n\n2. Neither his parents nor mine are originally from the US. Mine immigrated before I was born, his when he was already a teenager. Both of us have limited experience with American family traditions. \n\n3. It may not be the case for the cards specifically, but my MIL is pretty sexist. There are some parts of her that I like a lot, especially the extent to which she tries to bond with me and the other DILs, e.g. by teaching us how to cook traditional recipes. She is a very generous, loving woman. However, she does have strict expectations for the role of wife/daughter, believing that it is my duty to serve her and my husband. It has been a point of contention between her and my husband when I do horrible things like *gasp* have him help with cleaning up. I thought she didn't mind all that much with me specifically, as she seemed much harsher with her other DILs.\n\n----\n\nWhat actually happened:\n\nSome time after his mother made the comment to me about Christmas cards, she dragged my husband away from the party and tore his head off for \"letting [me] get so bad.\" My husband spared me the details, but they had a long, nasty screaming match about me until his father interrupted. So he was in a really bad mood about this. \n\nMeanwhile, I had started thinking about that look they'd shared and previous small things where he tried to get me to lie back and go along with his mother's ridiculous demands. (For example, that same dinner his brother had brought some vodka, mostly for my benefit because he knew how much I liked it. He even proclaimed that he got it mostly for me. But his mother declared that it was not for the women to drink, and my husband begged me to roll over, so I did. [Turns out one of the guests was pregnant, and this was my MIL's weird way of not making her feel excluded]) So I was also mad by the end of the night.\n\nSo when my husband brought up the cards, both of us very quickly went pig-brained. But we love each other very much, and stayed up quite late apologizing to each other and discussing his mother. It turns out that my husband has been pretty aggressive about keeping her from getting on my case the way she does with the other DILs, but he didn't want to go completely nuclear, so wanted me to still do the small things. I guess he has told me about this before, though not explicitly enough, so I didn't realise that this was his grand strategy. It is the case that she has never stepped on any big boundaries of mine, thanks to my husband's interference. I am totally okay with doing other small things to maintain a decent relationship with my MIL.\n\nWriting the cards is definitely a small thing, so I will write in my beautiful cursive in the card and on the envelope, and my husband will handle the logistics.\n\n----\n\n**ORIGINAL:**\n                \nThe day after Thanksgiving, my husband and I went over to his parents' house. When I was chatting with his mother, she politely asked why we hadn't sent cards to them wishing a happy Thanksgiving. I told her I wasn't aware of such a tradition, as my family wasn't the sort to send cards of any kind (we don't even do birthday cards). She said to keep it it in mind for Christmas. I called over my husband, and told him that his mother wanted him to send cards for the holidays. Though I didn't think much of it then, my husband and his mother exchanged a look.\n\nBelow is a very poor approximation of the conversation we had when we got home. I believe all these points were brought up, though probably in a different order and with more fleshed out supporting arguments on both sides.\n\n**Husband**: *(jokingly)* Make sure to set a reminder for a few days before Christmas so that you don't forget to write cards this time!\n\n**Me**: It's your family. Shouldn't you write the cards?\n\n**Husband**: I think it would be better if you do it. I'm not very good at this sort of thing, and I think it would make my mother happier to see it come from you.\n\n**Me**: I am also not good at this sort of thing, and I obviously have far less experience with it (holiday cards) than you do. And you don't care enough to do it. Why do you expect me to care more about your family than you do?\n\n**Husband**: I just think it would be easier for you than for me, and the outcome would be better. *(getting annoyed)* Is is that hard for you to do?\n\n**Me**: I disagree that it would be easier for me. And I refuse to fall into the hole of bullshit administrative tasks that get relegated to women. I saw that in my own parents' marriage --\n\n**Husband**: *(very annoyed)* Oh my God, not everything is about that! You're just arguing for the sake of arguing! You haven't even said that you hate the task itself! I've seen the cards you write your coworkers!\n\n**Me**: Ok, I don't want to argue either. My coworkers, I write the cards. Your family, you write the cards.\n\nTo be fair, I do argue for the sake of arguing sometimes. Though I do not like the process of writing cards, I am good at it and I like seeing my coworkers' and friends' positive reactions. But out of principle, I do not want to become responsible for keeping track of my husband's social obligations. I have seen it in my parents' and in my friends' marriages, and it leads to huge resentment in the women. For my husband's own sake, better he suffer putting in a little effort than me blowing up over this bullshit.",
  "id": 1,
  "comments": [
    {
      "score": 10483,
      "content": "NTA\n\nHIS family expects cards? Great, he can send them.",
      "id": 2,
      "comments": [
        {
          "score": 2052,
          "content": "Agreed! My boyfriends family does christmas cards. He buys them and writes on the inside, I write on the envelope only so the postman can actually read the address (boyfs handwriting is abysmal, and most people cant read it). But it's his family so his responsibility.",
          "id": 3,
          "comments": [
            {
              "score": 837,
              "content": "Introduce him to the wonders of computer printed labels and you're all set.",
              "id": 4,
              "comments": [
                {
                  "score": 389,
                  "content": "Growing up, my dad had a customized stamp for our address. I think I even remember it having a red rose in it in the corner as well. Those were cool.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 84,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 623,
              "content": "Honestly that's nonsense too. Lots of men get away with having atrocious handwriting because even in grade school we women are being trained for this crap and nobody really makes the boys learn to write neatly. School teachers let them slide on a task as basic as writing legibly, while cracking down on girls for the same thing, because it's assumed that it isn't a skill men need. I guarantee that unless he's got some sort of disability that affects his fine motor control your boyfriend CAN in fact write legibly if he actually tries.",
              "id": 7,
              "comments": [
                {
                  "score": 162,
                  "content": "My ex-husband has terrible handwriting. He filled out documentation when we got divorced. I was shocked to see that it was STILL terrible, even on official documents. Cripes, dude, get it together.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 133,
                  "content": "Uh, I'm gonna have to disagree with that.\n\nI'm a woman with *terrible* handwriting. Like, it doesn't look remotely \"female\" and is worse that a lot of guys I know. My being left handed doesn't help but it's bad regardless of how much effort I put into it. If I write *extremely* slowly and deliberately, I can write almost average, but I'm talking toddler with a crayola level slow. Even then it still looks \"messy\", imho.\n\nDon't think there's anything wrong with my motor control either. My job actually requires a lot of fine details/motor control. I can do really nice detailed fillings but damn don't have me write a lab rx. My handwriting is actually worse than the Dr I work for!\n\nAnyways, if it's like this for me, I don't see why it can't be for some guys as well. Even if we \"try\", it still ends up looking like chicken scratch :\\",
                  "id": 9,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I too am a woman with awful handwriting. Both my kids, 13 and 11, have way better handwriting than I do. But I do think that if the cards are important to the OPs partner, he needs to write them. Honestly, take some responsibility. Definitely NTA.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Southpaw!!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My husband has beautiful handwriting compared to mine. He does architectural drafting so his writing has to be legible to anyone who glances at it. Meanwhile, mine isn't particularly bad (depending on the day and my mood, my writing changes dramatically) but his just looks so much better than mine even on my best days.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Female here. My handwriting is so bad a teacher asked me to write in Persian, not because we were in Persian class, but because she \"couldn't bear to look at my English another moment.\"\n\nI laughed so hard until I cried",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "Bullshit.\n\nI have horrible penmanship and was rewarded for it with the worst grades for penmanship in all my classes growing up. This idea that men don't get criticized for it too is ridiculous in my experience.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 61,
                      "content": "[deleted]",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Same. From years 4-11, i had to do handwriting courses and books at school, and had many teachers call it out and mark me down.\n\nThe funny bit is, just around exams they realised it wasnt improving and got me a laptop for exams. Been using one through college and uni and its the best thing to have happened. But it was an uphkll battle, and it was only me and 2 guys having to do it",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "> I guarantee that unless he's got some sort of disability that affects his fine motor control\n\nI suspect that disability is more common in than you think.  It’s called being left-handed, particularly if you grew up 30-40 years ago and teachers really didn’t know how to teach that.  So hat certainly isn’t gender specific though",
                  "id": 17,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I'm not eft handed, but struggled with handwriting all through school, but I was getting good grades so the school didn't care enough to check/help/assist, they just complained.\n\n&#x200B;\n\nMy tutor at uni sent me off to tsting three weeks in and I came back with a diagnosis of mild dyspraxi and motor dysgraphia. Sometimes it isn't just laziness.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I actually read an article once about the difference between men and women's handwriting. Apparently when we learn handwriting in school, girls have actually developed their fine motor skills a lot sooner on average, which is WHY they typically have better handwriting.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 8,
                      "content": "What's weird about this theory to me is that my first girlfriend had a typical 'girly' handwriting (quotes because a lot of people say I have girly handwriting too, I'm sorry I can move my hands in coordinated patterns), but her motor skills (both fine and otherwise) were, let's say, not as developed as you would want in an adult human. Loved her to death, but she was absolutely helpless when it came to the most basic stuff.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I am a women and I personally have never had this problem. But then again it's probably more a regional issue, and I can see this happening.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Actually girls develop fine motor skills earlier than boys do. When boys are taught to write they don’t actually have the fine motor control to do it well, that’s why most of them have poor penmanship.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "He can if he writes extremely slowly and carefully but then he forgets what he's writing and his spelling isnt great. Doesnt help that when he is writing he's thinking too damn quick about what he wants to write he cant take the time to make each word readable. When he was at school taking exams they originally gave him a scribe but he kept answering the questions and saying what he wanted written too quick for the scribe to write it down so he was given a laptop instead. He's a really bright guy but he thinks waaaaay to quick and his hand cant keep up haha. I dont mind writing the addresses, he has done the important bits and then just leaves them on my desk with a stamp so I only have to do the addresses.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 930,
          "content": "But it's more than that! Both the MiL and the husband expect *her* to write the cards (to prove that she's a \"good\" DiL/wife!)\n\nThe husband is being an ass shit testing OP like this. Maybe he needs some exile time living at Mummy's house?\n\nOf course NTA.",
          "id": 24,
          "comments": [
            {
              "score": 320,
              "content": "If she wanted to be passive aggressive OP could send a card to MIL and Only. Sugn. Her. Own. Name.",
              "id": 25,
              "comments": [
                {
                  "score": 218,
                  "content": "I would, and it would be the most basic “I’m obviously doing this out of obligation and don’t take this seriously” card I could find. Like a stock photo of Jesus with the text “It is your birthday.” on the front and maybe “Happy holidays from your darling son and his nurturing wife.”on the inside if I signed for him at all. I can’t stand learned helplessness in a partner, and I’d absolutely tell OP’s MIL that if it’s so important, she’s just as capable of sitting her son down at the dining room table with a box of crayons and telling him what she wants him to write.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 176,
                      "content": "\"Hello,\n\nHave a day.\n\nRegards, Me\"\n\n&#x200B;\n\nRegards or fondly, either is very lukewarm.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 106,
                      "content": "Just get a vaguely xmas-y card without writing & that's blank inside, then just sign your name. Nothing else.\n\nMIL gets a card with just a watercolor tree on it with \"OP\" written on the inside.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Get a stamp with her name on it and use that to sign it.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "“Enjoy this obligatory greeting card that your husband didn’t sign or write because you raised a son who expects the women in his life to caretake for him. Happy Holidays!”",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "I am not above getting several stamps (Merry Christmas, Happy Thanksgiving etc) in comic sans and just stamping it into a blank card for the relevant holiday and just signing my name.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 5,
                      "content": "> comic sans\n\nYou monster!",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Just a plain card that says \n\n“Merry Christmas, love OP” \n\nSo passive aggressive lol",
                  "id": 33,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Just do happy holidays and send the same one for every holiday.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "why even bother signing her name? Just get a card, leave it blank, address the envelope and mail it off. I've received blank cards before and it's so lazy. Would be the ultimate FU to MIL. Traditions are nice, but OP shouldn't be expected to follow someone else's traditions if she doesn't want too.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "\\^exactly!!",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "NTA my response to MIL would have been something along the lines of \"oh those are horrible for the environment, such a waste of paper, I will be sure to send you a text though. Lol",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I am 100% ok with being a shit DIL of it means i don’t have to fuck around with christmas cards.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 738,
          "content": "This is healthy marriage 101. Manage your own family so your spouse doesn't have too.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 548,
          "content": "Exactly. My husband wrote all the thank you notes for wedding presents for his family and friends and I wrote the ones for mine. There's no reason card writing should fall to women by default. OP's husband can use his hand and a pen and take five minutes to do it himself.",
          "id": 40,
          "comments": [
            {
              "score": 499,
              "content": "My husband refused to help write wedding thank you cards. So they have never gone out. When people asked me about them, I thanked them personally (if I hadn’t already,) and said they can talk to him about why they weren’t sent. That shit doesn’t fall to the woman by default.",
              "id": 41,
              "comments": [
                {
                  "score": 294,
                  "content": "Wow. That's some bullshit. I can't say it was my husband's idea to split the work but he didn't push back. He addressed invites, too, except to a few VIPs on his side because my handwriting is fantastic and his is absolutely appalling and I was worried the post office wouldn't be able to read them. A marriage is a partnership. It's not a \"women do all the admin tasks because men are too helpless to figure things out\"-ship.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 102,
                      "content": "SUPER unrelated but love your username! Tamora Pierce was one of the authors of my childhood! :)",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 46,
                      "content": "So glad to see all the Tortall fans 😂",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "When it came to our wedding thank you cards, I wrote all of them for my side of the family and friends. I told my husband if he wants them sent out for his, he'd have to do it. He never did 🤷‍♀️",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My deal with my ex was he writes his best mans and parents. Id write everyone elses and hed send them. Guess how many were sent........?",
                  "id": 46,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I’m guessing about 0 😂",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Are you me? My husband bitched and moaned so damn much about writing his half of the thank you cards for our wedding, I think about a quarter of them never went out. It was by far the biggest fight we’d ever had, it was too ‘hard’ for him and he thought that I should just take care of it. I’m grateful I held my ground, because 6 years later, he’s 1000% better about splitting domestic tasks fairly and not by antiquated gender roles.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "I typed out the thank you notes with input from hubby, he used his computer skills to place the text over a wedding photo of us, I emailed them off. If you can't work together as newlyweds, I don't hold much hope for future teamwork. \n\nSidenote: I love your username, I'm a huge fan of the Tortall books!",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "We did the opposite— I wrote to his and he wrote to mine— but only because we thought it would be nice for people to receive their notes from the newest member of the family. I found it fascinating and infuriating that so many people on my side thought I’d “trained” him somehow. And his side all assumed I did them all, which made the first Christmas a bit awkward. I really wish we’d done it the way you did. \n\nSee also: my MIL giving me a list of family birthdays “since he’s married now, these people will expect cards.” I told her she could give the list to him, and she laughed and was like “I was into Gloria Steinhem at your age too. You’ll learn that it’s just easier to take care of these things yourself since you’ll get blamed if they aren’t done well.” \nYeah, I don’t care. I’m not falling for that old trick anymore even if it pisses off a few great-aunts. And isn’t it nicer to know your son actually put thought in for you himself?",
              "id": 50,
              "comments": [
                {
                  "score": 6,
                  "content": "The first year we were married my husband didn’t get his family any Xmas gifts. Guess who got shit for that? ME.\n\nMy mom and one of my aunts were on my case about it. I finally said “last time I checked having a vagina didn’t give me magical gift giving capabilities. I reminded him several times, he didn’t get around to it. Why is that my fault? Because I have a vagina? He’s 37 years old, he knows how Christmas works.”\n\nThey were stunned into silence, but eventually agreed with me. I understand why they did all the gift shopping for both sides; they were both SAHM / wives. It makes sense. I work and volunteer, just like my husband, why should my limited free time be spent doing all the holiday shopping? He can chip in, and handle his family.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "We did it the opposite. He wrote to my family; I wrote to his. \n\nIt made my family think he was great, and it got me into the Aunt Mafia by cynically playing to their gender stereotypes.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "We did this too. Some people were surprised. I asked why and the best answer I got was “well, it’s just tradition for the wife to do it.” And that tradition sucks, so..?",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My husband was like what??????? I have to write cards??? \n\nTold him yep. Here's the excel spreadsheet, cards, stamps and pens - go to town. \n\nHe did a really good job after we got past the \"no, this is not going above and beyond, this is your doing your part of the work\"",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 418,
          "content": "This 100%. NTA. \n\nHe only got super pissed because your point about administrative tasks hit a nerve. Because it's true.",
          "id": 55,
          "comments": [
            {
              "score": 240,
              "content": "And also it’s not about the cards. He caught shit from his mom about his wife not doing what mil thinks she should be. Mil is trying to make the husband make the wife do it .. neither of them give a rats ass about sending cards. He just wants to appease his mother that is all. And wha the mother wants is to emotionally bully op into doing it",
              "id": 56,
              "comments": [
                {
                  "score": 28,
                  "content": "It seems like he already expected her to do it cause he said \"so you don't forget *this time*\".",
                  "id": 57,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I read that as MIL expected two holiday cards- one for Thanksgiving and one for Christmas. I could absolutely be incorrect, but that's how it read to me.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "OP hit a nerve",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 329,
          "content": "My ex did this exact thing. My family never sent Christmas cards and I don’t love to be in photos. He started complaining to me that I didn’t do an xmas card, so I shouldn’t expect to continue to receive them from his family. I asked him to help me he said he didn’t have time. When I said he, by definition, has more time than me because he worked 40 hours per week and I worked over 55 consistently he shifted to, “you’re better at that stuff.” \n\nHe’s my ex because that bullshit was just the beginning of him trying to make me a submissive wife while taking control of the money and assets I had.",
          "id": 60,
          "comments": [
            {
              "score": 125,
              "content": "“You’re better at that stuff.” \n\nThen fucking practice. Sheesh. \n\nGood for you, CodingBlonde.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "What is it with men and the, \"I'm not good at it/you're better at it,\" excuse! Nobody falls for that bullshit. We *know* it's not a compliment. If a guy wants to take the he's not good at something (in this case writing cards but often seen regarding housework) route then there's a magic solution called practice.\n\nOP, NTA 100%",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": ">He started complaining to me that I didn’t do an xmas card, so I shouldn’t expect to continue to receive them from his family.\n\nI think a good response there would be, \"Well, my family doesn't do Christmas cards in the first place, so I'm entirely okay with not receiving them from your family, either.\"",
              "id": 63,
              "comments": [
                {
                  "score": 5,
                  "content": "It’s nice that you think I could reason with my ex. He wasn’t a very reasonable person and liked to throw adult tantrums.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "They don’t expect cards; they expect cards from her.",
          "id": 65,
          "comments": [
            {
              "score": 116,
              "content": "Trying to cram her neatly into that Donna Reed shaped wife box.",
              "id": 66,
              "comments": [
                {
                  "score": 5,
                  "content": "Right. That's over.\n\nI exchange cards with my husband's elderly aunt on most holidays, because I want to continue her sweet tradition of sending them to us. It doesn't matter to me whether she is a blood relative or in law. My husband has initiated and participated in sending Christmas cards in both our names in the past because he enjoys doing that, as a traditional way to stay in touch with old friends, whereas I am satisfied with email.\n\nWe don't ever try to make each other send cards, because what would be the meaning and joy in that?",
                  "id": 67,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 88,
              "content": "Exactly what I was thinking.\nThe family tradition isn’t to send cards, it’s for the WOMEN to send cards. OP says “why do you expect me to care more about your family than you do?”  I think I said those exact same words to my husband a long time ago.  He learned that he is actually capable of signing cards!",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 130,
          "content": "Exactly. My husband was in charge of thank you notes to his family after our wedding. If we ever send out holiday cards, you bet your butt he's writing out the ones for his family too, but neither of us want to do that, so we just don't. Don't hold your breath by the mailbox, MIL!",
          "id": 69,
          "comments": [
            {
              "score": 130,
              "content": "My husband and I alternated after ten each to prevent writers cramp. It ended up perfect because he wrote the one to my grandfather who I don't have a good relationship with and I wrote the one to his aunt who he doesn't have a great relationship with. It worked out really well.",
              "id": 70,
              "comments": [
                {
                  "score": 39,
                  "content": "Wow that honestly sounds so cute and awesome I’m glad your relationship is healthy like that!",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "Agreed and next time his mother brings up this kind of thing make it clear to her that he looks after his family and you yours. That way if there is an unmet expectation she knows who to bring it up with.",
          "id": 72,
          "comments": [
            {
              "score": 12,
              "content": "It doesn’t look like that will cut it, it is HER job the vagina makes you much better at writing cards you know.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "NTA, I agree - but I disagree on the reasoning. NTA because emotional labour is to be split according to both partner's needs and shouldn't fall as women's duties. Duties can't just be delegated without both sides agreeing without sturring up trouble.\n\nThat said when you get married, if your relationships with both sides are healthy and positive - it shouldn't be a your family and my family perspective. They're both now your families. Keeping it seperated is going to create more cause for arguments and sources of resentment. IMO",
          "id": 74,
          "comments": [
            {
              "score": 95,
              "content": "I agree that once you are married, families are families. But, if there is an issue that needs to be addressed, I do think that is best addressed by the blood relative. For example, when my MiL over steps bounds, my husband deals with it since she is his mom.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "> it shouldn't be a your family and my family perspective. \n\nI agree - but that still doesn't address why OP needs to do the cards and not the husband.  This comes across a lot more like MIL and husband expecting OP to send the cards to be a \"good\" wife.",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5461,
      "content": "NTA, his lame attempts to foist it on you like \"it would be easier for you than me\" and \"you're better at it than I am\" is such stereotypical lazy-man-dumping-emotional-labor-on-wife behavior that I'm wondering if this is a shitpost. And if you do them this year I bet he'll add \"but you always do them\" to the list too. And also he sucks for dismissing your concerns about falling into that trap.\n\nTell him if you're better at it then he is, then he should do them because he needs the practice.",
      "id": 77,
      "comments": [
        {
          "score": 1704,
          "content": "I once read a study about division of household labour in heterosexual couples living together. It found that even in couples where they rated themselves as valuing gender equality the woman did significantly more of the household labour. When the men where asked why it was so they explained that their female partners knew how to do all the household chores whilst they themselves had never been thaught to do them, so it was just natural to assigned it to the person who could do it better. When the women where asked how they learned to do household chores they explained that after they moved out as adults they had to learn, and the most common method was by calling up their mother and ask how they did it.\n\nEver since I read that I have had a suspicion against the argument that whoever knows how to do a task better should just do it. Just because someone learned it earlier doesn’t mean it’s more difficult for someone else to also learn it latter on. So ”you’re better at it than me” is not a good argument for who should do an unpleasant task if it is the only argument you got.",
          "id": 78,
          "comments": [
            {
              "score": 1008,
              "content": "My husband tried \"you're better at it\" on me. I replied \"sounds like you need more practice then!\" And pushed the task back to him.",
              "id": 79,
              "comments": [
                {
                  "score": 268,
                  "content": "Lmao get it sis",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "Oh! Oh! This is exactly what my boyfriend told me and that was the answer I gave him. He didnt do it, i didnt do it either. He wants it? Well, he can learn!",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "last year I was super busy with work and told my husband he needed to be in charge of sending out invites to our daughter's birthday party. He made a big show of how hard it was and how it was so complicated to pick out an evite design and copy and paste emails from her class directory. \n\nFortunately since he's an intelligent and capable person he was able to overcome those challenges well I cheerfully ignored his complaints and requests for more hand holding",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "🥇",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I did the same thing!",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 267,
              "content": "It's funny, because my wife actually uses the \"you're better at it\" line on me all the time. I really am better at some household chore type tasks though, so I think it works out overall, but I never thought about the fact that \"you're better at it\" is usually used by men to get out of chores.",
              "id": 85,
              "comments": [
                {
                  "score": 192,
                  "content": "I am really guilty of using that line on my husband when it comes to making steaks.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 76,
                      "content": "I get that line from my wife about all kinds of random things, like cooking/preparing certain foods, catching spiders, driving at night, taking the dog out when it's cold, vacuuming, etc. My wife gladly does lots of household tasks that she is better at though, like the laundry and mopping/sweeping, so I think in the end it balances, it's just funny that she puts it that way.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Look there's a lot of sexism in this post but he/she who cooks the best steak should always been the chef for said holy slice of beef. There's a lot of stands to make, but fucking up a nicely marbled steak is not one of them.",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "My brother (25) says that shit to me (m32) all the time. \"Can you cook my steaks since you're better at it than me?\". \n\n\"You're 25, dude. Put it in the pan.\"",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "I insist that I do most cleaning because I am better at it.  I can’t stand something not being cleaned right so I’d rather just do it myself.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 109,
                      "content": "That's how a lot of guys(and my youngest kid) get out of doing housework. If they purposely do it badly enough times they know they won't be asked to do it anymore. You fell for it.  \n(It's okay, i did too. It's utterly infuriating to watch a perfectly capable and healthy teenager spend an hour and use half a container of dish soap to produce still-filthy dishes and a mess all over the floor and countertop. I just can't allow it.)",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "That's slightly different, though. If you want something done a certain way, then sure, you take on that task. For example, I do almost all of the cooking, and I'm particular about my tools. So I do all the dishes, too. I don't want to have something ruined because he didn't know it wasn't dishwasher safe or needed to be on the top rack, or have something put in a weird place.\n\nThe trick is to make sure that the other household tasks are distributed fairly. If you're both working full-time, it's absolutely unfair for one of you to be taking on the lion's share of house work as well. That's how resentment builds.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Same, I would like my husband to help with things, dishes, washing, cleaning, vacuuming, but I have my way of doing it (certain pegs I use and how I hang and fold it) and it annoys me when he does it “wrong”. Just like he hates watching me peel and cut potatoes because “I do it wrong”",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "This is why I strongly suggest everyone move out on their own at some point before moving in with a partner. My wife and I are each perfectly capable of doing all the household chores. We divide them based on who finds what more tolerable. She doesn’t mind doing laundry but hates washing dishes. I like washing dishes but hate folding clothes. She takes care of all the bills but I do the taxes. She does the gardening/landscaping things, I do the automotive maintenance things.",
              "id": 94,
              "comments": [
                {
                  "score": 10,
                  "content": "Years ago a good friend of mine was dating a guy, Joe. Friend was thrilled when she went over to his apartment and discovered it was spotless, well organized, clothes ironed and hung in the closet, fresh homemade food in the fridge. “I finally found a guy who gets it! He‘s organized and on top off household stuff; it’s such a nice change!” She exclaimed to me.\n\nImagine her surprise when she stopped by one day after work to drop something off for her bf, and discovered Joe’s mom, cleaning his apartment, making dinner and readying his clothes for ironing. \n\nHe’d lived on his own for years, but mommy dearest came over EVERY SINGLE DAY to make sure he was taken care of. He’d never done a single household chore. \n\nFriend wisely noped outta that relationship.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "It's really frustrating when people just expect you to be good or bad at something based on gender. Whenever I'm home, my dad constantly, randomly suggests that I \"make a pie or something\" for dessert. When I respond \"why don't YOU make a pie if you want a pie\" he just says he's not good at baking. I'm like...uh neither am I and you've had 40 more years experience. You find a damn cookbook and follow the recipe.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "That sounds like Hochschild's The Second Shift.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I read a study that looked at the division of unpaid labor between heterosexual couples in Canada, where I live and where gender equality is generally perceived as good. Here is a fact that stood out to me : \n\nIf both work full time, the woman does 62% more unpaid work.\n\nIf the man works full time and the woman stays home, the woman does 166% more unpaid work.\n\nIf the woman works full time and the man stays home, the man does 4% more unpaid work.\n\nLet that sink in.\n\n\n\nThe study was published in French only, but here is a link to it : https://cdn.iris-recherche.qc.ca/uploads/publication/file/14-01239-IRIS-Notes-Taches-domestiques_WEB.pdf",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My first roommate was a guy the same age as me (18/19), and he made a huge mess one day (pillow fight with a girl) so I asked him to vacuum while I was in class. I get back and the place is still a mess. I asked him what the hell happened. His response was \"I'm scared of the vacuum, I don't know how to use it.\"\n\nLamest excuse I've ever heard. I told him he could  pick all the pillow fluff up by hand then.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "They are a French IG account about the “mental charge”, (for the French its : taspensea) in the household... Some women in homosexual relationship did witnessed the same problem as in a heterosexual relationship with the household work. \n\nExcuse my english, I don’t have enough caffeine in my body",
              "id": 101,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Agreed. You enjoy it more than me is valid if true. It’s easier for me is mostly valid. You’re better at it is something I fall back on and it’s lazy and systematically sexist in a lot of ways.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "The only chore my wife does better than me (otherwise they're all pretty equal) is her own clothes. I thought it would be common sense as to which clothing items were considered delicates and had to be treated to special wash cycles and air drying, but nope, fucked up $110 worth of sportswear 😅",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 455,
          "content": "She also states she isn't good at that kind of thing. Although I'm guessing that was more of a response to husband's idiocy than an actual statement.\n\nBut seriously. It's a card. You don't need a degree and 2+ years experience to qualify. Husband needs to get over himself.",
          "id": 104,
          "comments": [
            {
              "score": 244,
              "content": "I also hate the excuse of “I’m not good at this sort of thing” when it’s an objective task like writing in a card and putting it in an envelope. There is no “good at it” unless your family expects hand-calligraphied masterpieces, you write “happy holidays, love the Johnsons” and stick it in the mail. “I’m not good at it” absolutely IS a common excuse men use to foist these tasks off onto women.\n\nEven if it did require skill, women don’t come out of the womb with a 20-pack of Hallmark glossies in their hands. He can learn how to do it just like she did.",
              "id": 105,
              "comments": [
                {
                  "score": 163,
                  "content": "It’s the typical helpless male bullshit. It’s how lazy man children get out of things like housework and social obligations. Play dumb. \n\nThe female equivalent are women who play helpless for stereotypical male things like changing a tire or something.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 426,
          "content": "Here is my very petty solution that will most likely destroy a couple of relationships: Do the typical “men-doing-something-badly-once-so-they-won’t-have-to-do-it-again”. \n\n*Dear family member,\n\nHusband doesn’t love or care for you enough to write you a christmas card. So I’m doing it instead. \n\nMerry Christmas!\n\nLove,\nOP and Husband*",
          "id": 107,
          "comments": [
            {
              "score": 144,
              "content": "> Love, OP ~~and Husband~~\n\nFTFY",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 71,
              "content": "This is the type of thing I would do. I'm lucky my wife is a patient woman.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "[deleted]",
              "id": 110,
              "comments": [
                {
                  "score": 78,
                  "content": "Bonus points if you actually write 'family member' instead of the name",
                  "id": 111,
                  "comments": [
                    {
                      "score": 2,
                      "content": "“Occupant”",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 227,
          "content": "I don't even know what to make of the \"easier for you than me\". Like, unless he physically can't write, what does that even mean? I realize it's actually just \"I don't wanna, you do it\" but how did he even think that was even a real argument?",
          "id": 113,
          "comments": [
            {
              "score": 180,
              "content": "I suspect, if pressed, he’d say some bullshit like she’d pick out prettier cards, her handwriting is nicer, and she’s so much better with words than he is! He just doesn’t know how to say he cares, legibly, in an appropriately decorated piece of card stock! \n\nYleck. I feel like an asshole just typing that out.",
              "id": 114,
              "comments": [
                {
                  "score": 34,
                  "content": "She'd put effort into it, and thus the results would be better. \n\nSuch BS",
                  "id": 115,
                  "comments": [
                    {
                      "score": 5,
                      "content": "This is spot on. This is why the she's-just-better excuse is so deeply annoying. It's always about tasks that requires little actual skill, just effort.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Your sacrifice is appreciated!",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My handwriting is truly abysmal, so I tend to get other people to write if I can. I wouldn't make someone pick the card or figure out what to say though.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "That's what I thought while reading this post. What does that even mean (assuming DH can in fact write)??",
              "id": 119,
              "comments": [
                {
                  "score": 24,
                  "content": "I suck at coming up with things to say in cards, while my husband always comes up with a funny or thoughtful message and it seems to come easily to him. When we write thank you cards, I do my side and he does his, then helps me with the cards I'm having a hard time with.\n\nI assume this is what was meant.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 9,
                      "content": "That's super cute and also putting way more work into thank-you cards than is necessary? The standard \"thanks so much for the toaster, we will think of you every time we eat delicious millennial avocado toast\" is perfectly fine. Especially since most people read a thank you note once and then throw it in the kitchen shit drawer for 3 years until they clean it out and toss everything.",
                      "id": 121,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "I think what he means is it’s easier for him if she does it.",
              "id": 122,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "Funny how they arent good at anything that doesn't earn money or isn't a hobby .",
          "id": 123,
          "comments": [
            {
              "score": 8,
              "content": "Ding ding.  Great insight.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Can guarantee this is not a shitpost.\n\nSource: Am a woman who has been in many relationships.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I doubt it’s a shitpost. Half the relationships I’ve seen here in my country operate on this exact concept.",
          "id": 126,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4228,
      "content": "NTA. My theory: this\n\n> my husband and his mother exchanged a look\n\nhappened because sending out the cards is assumed to be women's work in his family. Why else would your MIL talk to you about it alone? But he can't come right out and say that you have to write the cards because it's your role as the wife, or because it would be emasculating to him, or whatever, because it's no longer socially acceptable to say those kinds of things. So he had to invent all kinds of ridiculous excuses to cover up for the real reason.",
      "id": 127,
      "comments": [
        {
          "score": 1300,
          "content": "YUP. Spot on. As soon as I read about the “look” I had the same thought.",
          "id": 128,
          "comments": [
            {
              "score": 1095,
              "content": "I also wonder if \"the look\" happened because OP was violating some unspoken rule by directly stating what the MIL said she wanted, instead of letting the passive aggressive comment stand--\"Keep it in mind for Christmas.\" I wouldn't be surprised if MIL keeps everyone in the family in line this way, and OP is disrupting the dynamic by openly discussing things that aren't supposed to be discussed.",
              "id": 129,
              "comments": [
                {
                  "score": 417,
                  "content": "“Ahem! I noticed that we haven’t received your cards. I mentioned that you should keep Christmas cards in mind.” *taps foot*\n\n\n“Oh, I did! I kept it in mind for a good five minutes!” *elbows MIL hard in the ribs and sashays over to the open wine bottle*",
                  "id": 130,
                  "comments": [
                    {
                      "score": 413,
                      "content": "I call it “turning into a golden retriever”.  Just pretend to be incredibly nice and enthusiastic, but also super dumb. Take everything they say at complete face value.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Sashays! I love it!!!",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yes yes yes!! I am this disruptive wife who says what she thinks and ignores the preference for passive agression. Although in my case after almost 20 years I do it for sport. This OP sounds like a newlywed for this to be just coming up now.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 446,
          "content": "I was just about to comment exactly this! It seems obvious that his mom has made it clear that she expects cards from you and he’s trying to make that happen without outright saying my mom wants it to be you. NTA don’t write those damn cards.",
          "id": 134,
          "comments": [
            {
              "score": 418,
              "content": "And if the husband had said something like, \"Look she's really old-fashioned about this and she wants it to come from you -- if I buy the cards and create the list and take care of all the mailing, would you just do the cards for my mom and her sister, and I will do literally all the rest of them?\" that would be FIIIIIIIINE and I would totally do that to keep the peace if his mom and his aunt are uptight about women doing social/familial labor. But he's like \"Take on this tradition of my family that I don't want to deal with because it's tedious.\" That's a big NOPE, buddy. NTA",
              "id": 135,
              "comments": [
                {
                  "score": 149,
                  "content": "I still wouldn’t do it. Keep the peace for sexists? Why?",
                  "id": 136,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Because you wanna pick your battles within a family and don't wanna start WWIII over signing your name on a picture of the Nativity.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "No way. He does the cards, and when his relatives try to express displeasure over who handled it you turn it on them with the whole \"But your son wanted to do this for you, is his love not good enough?\"",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yeesssss.  At least the way you described has the husband and wife in cahoots, and NOT the husband and his mother in cahoots while husband tries to herd OP into the acceptable/mom-approved role in the family. \n\nYuck.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 325,
          "content": "That's how it was with my in-laws.  \n\nFrankly I'm glad that I lived in sin with their son for over a decade, then didn't take his name when I finally agreed to marry him, then passed *my* surname on to my children.  \n\nBy the time we got round to family Xmas cards, they'd long since given up on me.",
          "id": 140,
          "comments": [
            {
              "score": 207,
              "content": "This woman boundaries.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "Yesssssssss I love thissss",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 256,
          "content": "Nta. OMG this!!!! I read about the exchanged look and immediately knew this is coming from MIL. In their family only the women do admin and she wants her DIL (OP) to step up on bullshit women's admin. I reckon the MIL would have had a private word with the husband about her not being a dutiful wife and this is his shit attempt to bully Op into compliance. \n\nFuck that noise. No cards ever. NTA!!",
          "id": 143,
          "comments": [
            {
              "score": 9,
              "content": "OP should write a family newsletter with a chart of the emotional labor she’s taken on due to MIL’s shitty parenting of her son. Include excerpts from various books about shitty, entitled men who can’t even wipe their own butts because they’re so helpless at self sufficiency. \n\nInclude advertisements from couples therapists and divorce attorneys.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "Why would you even need to send a card if you're visiting those people over the holiday anyway? A card only makes sense if you're not going to see them, it stands in for a personal, face-to-face greeting. Getting a visit and demanding a card is just entitlement.",
          "id": 145,
          "comments": [
            {
              "score": 34,
              "content": "My family sends those cards that are basically a family portrait with \"happy holidays!\" \"Merry Christmas\" etc even though we see each other for the holidays. The new one replaces the one from the previous year on fridge. It's basically the annual updating of the family photo.",
              "id": 146,
              "comments": [
                {
                  "score": 7,
                  "content": "I know some families include a letter of what's happened over the last year. I have several family members that do it.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Ah the yearly update. I had a high school friend whose family sent a cringe worthy humble brag every year. No wonder we don't talk anymore.",
                      "id": 148,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 125,
          "content": "Yeah, I think that look was, “here OP goes again with that silly feminist stuff.”",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "The MIL thinks cards are women's work, but she's not the problem here.  The husband is the problem.  If he sent the cards, his mother would most likely be satisfied because she is getting the card she wants.",
          "id": 150,
          "comments": [
            {
              "score": 10,
              "content": "Nah. She wants OP to knuckle under. NTA",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Yup, and his arguments sound like something his mother would say or imply as well. The whole “it looks better” is an admission than mum wants cards from OP. Such nonsense",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Exactly this. And now it's become a matter of proving himself to mommy by coercing his wife into living up to mommy's outdated expectations.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Yup that also. MIL wants cards, MIL doesn't think it's something men should have to bother with, MIL makes it DILs problem. NTA.",
          "id": 154,
          "comments": [
            {
              "score": 4,
              "content": "Yup!\n\nMIL could have pitched this as “I love to get cards and I never do. It would be so nice if the two of you could send them to me!”\n\nThen she’s stating what makes her happy and asking them for help. \n\nShe didn’t do that. \n\nNTA.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1357,
      "content": "NTA. It’s very strange that everyone expects you to write the cards. My family has never had this tradition either.",
      "id": 156,
      "comments": [
        {
          "score": 373,
          "content": "Less strange with her \"administrative task [as such] getting pushed off on the woman in the room\" take being apparently spot-on in this case.",
          "id": 157,
          "comments": [
            {
              "score": 44,
              "content": "It's a form of emotional labour. Maintaining a familys social relationships, one of the numerous tasks that falls on the wife",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 152,
          "content": "[deleted]",
          "id": 159,
          "comments": [
            {
              "score": 233,
              "content": "This is why i hate going to most holiday get-togethers that involve food. I grew up in the South and i don't know if it's like this everywhere, but it was always women and girls in the kitchen preparing everything while the menfolk relax, watch tv, and drink beers. And then after everyone eats, instead of getting to relax finally, all the women get to go clean up and do dishes. The fact that I'm not into that has often made things awkward but I'm not working in someone else's kitchen when I'm supposed to be a guest just because I'm female.",
              "id": 160,
              "comments": [
                {
                  "score": 69,
                  "content": "I don't think any of the women in that kitchen are oblivious to the unfairness, but as a girl you know it's unfair, you see that it's bullshit, but you don't want to leave you mum and gran and aunties with all the work cos you see how unfair that is on them, so you help, and slowly it's becomes just how things are, and it's way to much work to try to change all those guys drinking beer, easier to just do it and so the cycle continues. Unless all the women go on strike or start raising the next gen of men differently, I can't see it changing.",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "Not from the south but one side of my family is from a European country which does basically the same as what yours does.",
                  "id": 162,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I LOVE how trained my aunt has her family - I show up for thanksgiving dinner, and it's my UNCLE in the kitchen preparing dinner, my male cousin who makes the main sides, while my aunt is still upstairs! She made the pie, and maybe throw the veggies on the stove, but come time to do the dishes, she's having her sons clear and load the dishwasher. It's truly a thing of beauty!",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'm in canada and it's the same bs up here, too.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Oh my god, yes! My family was always like that. Men don't bother to do shit because nobody expects them to. I will never forget the look my dad gave me when I told him I didn't see why I had to clean while he took a nap. This is the kind of shit women grow up with and then men have no idea why women talk about being treated unfairly. Im so glad I found a husband that actually helps. This year we hosted and my husband's sister got up immediately after she ate and asked where to start cleaning. I said \"I'm not about that getting up and cleaning right after I eat bullshit. Yall relax, we will get it later.\"",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I'm happy to report that no, it isn't the same in all families. In my family everyone helps. It's just a bit of a struggle to convince the elderly and disabled not to do more than they can.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Said same to my mom once when visiting. She didn’t take it well.",
                  "id": 167,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I live in the Northwest and my ex's family was like this. Took me a while to notice it, but one evening I looked around and thought to myself, \"Nope. Fuck that shit.\" I made a point of visibly, deliberately hanging out with the guys.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I’d imagine it’s like that in most families but not all! My dad did all the cooking because as the oldest of 9 (!) kids, he took on a lot of child-rearing and household responsibilities when he was growing up. He was a much better cook than my mom who generally disliked cooking and the expectation that she should cook.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It’s not.  My father in law does most of their day to day cooking, and often the bulk of holiday meals.  Usually they work together; ditto with my grandparents.  I volunteer to help because it gives me something to do so I can stay awake, but it’s not expected. \n\nEveryone helps clear the table.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "This happened to me and my sister at a \"friendsgiving\" my husband and I hosted last week. It was a pot luck; everyone brought something, but after everyone arrived my sister and I found ourselves running around putting food in serving dishes, layout out utensils, standing up folding tables...while the guys (including my husband) stood around in the basement drinking beer and chatting. \n\nMy solution to this bullshit was to walk right into the middle of their conversation and say **\"Human males. Help.\"** They helped. :)",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 981,
      "content": "you should totally send out cards to his family and not sign his name on em. just yours. \n\nNTA",
      "id": 172,
      "comments": [
        {
          "score": 768,
          "content": "[deleted]",
          "id": 173,
          "comments": [
            {
              "score": 1249,
              "content": "\"As per our conversation at Thanksgiving, here is the requested Christmas card. I hope it provides you with the appropriate amount of Christmas cheer.\"",
              "id": 174,
              "comments": [
                {
                  "score": 729,
                  "content": "\"If you are dissatisfied with the contents of this Christmas card, please direct your complaints to your son.\"",
                  "id": 175,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Love this",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 389,
                  "content": "*Sincerely, Raymond Holt*",
                  "id": 177,
                  "comments": [
                    {
                      "score": 69,
                      "content": "I'm watching B99 right now and I laughed way to loud at your comment lol",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "Just make a stamp with that on it.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 97,
              "content": "Happy birthday at Thanksgiving\n\nMerry christmas at 4th of July\n\nHappy easter at Christmas\n\nHappy dia de muertos on her birthday\n\nHappy thanksgiving on halloween\n\nEtc…",
              "id": 180,
              "comments": [
                {
                  "score": 137,
                  "content": "Get a stamp with all the holidays on it in a generic \"happy ______\" format, then just check off the appropriate one. Use a signature stamp too. I live for aggressive apathy.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My family actually does this as a running joke.  Especially sympathy cards on birthdays.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Or pop her business card in a plain envelope mailed with a Christmas stamp. Here’s yer card.",
              "id": 183,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Heh, I like that response.",
              "id": 184,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "[\"IT IS YOUR BIRTHDAY.\"](https://i.imgur.com/QRVkS2H.jpg)",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 119,
          "content": "YES! That, or just really random cards. Like Happy Birthday (and write \"Jesus\" next to it) or Happy Bat Mitzvah.",
          "id": 186,
          "comments": [
            {
              "score": 37,
              "content": "Someone's getting a retirement card this holiday season and damn it they will appreciate it!",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Gender reveal cards...",
              "id": 188,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "I would just get a card that already has \"Merry Christmas\" printed on it and write nothing except my name on the inside.",
          "id": 189,
          "comments": [
            {
              "score": 53,
              "content": "Why bother with the name? The envelope has the return address on it, they'll know who it's from. 😉",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I LOVE THIS",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I aspire to be this level of petty. This is excellence.",
          "id": 192,
          "comments": [
            {
              "score": 5,
              "content": "i started young, but it's never too late to begin your training. what you really need is a movie-style training montage. set that up and you'll be petty af fast.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 888,
      "content": "[deleted]",
      "id": 194,
      "comments": [
        {
          "score": 443,
          "content": "Raising his voice and calling it arguing once she started to refuse  pissed me off.    I'd be like, fine no arguing.  I'm not going to do it and that's it.",
          "id": 195,
          "comments": [
            {
              "score": 242,
              "content": "I'm really surprised that no one is discussing how OP's husband is gaslighting her",
              "id": 196,
              "comments": [
                {
                  "score": 152,
                  "content": "Right! That was my first reaction. She's aware of what he's doing by foisting the responsibility onto her, yet he still has the audacity to act as if SHE'S in the wrong. Fucking man babies",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Didn't even bother to offer to do half. It was all or nothing on OP",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 705,
      "content": "NTA If his family expects cards, then he can write them for you, it's his family, his burden and their tradition, not yours. \n\nAnd for everyone acting like what's a few more cards? Little things add up. Eventually, it becomes a bunch if cards on top of other \"little\" things that, all together, is a lot in the end. And for something so little, the husband can surely handle it. Or maybe his family should understand that not everyone follows other people's traditions.",
      "id": 199,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 614,
      "content": "NTA. This is absolutely based in sexism, and it's gross. There's no real, non-bullshit reason why he shouldn't be able to write these cards himself. It's his family. Presumably he knows how to write. I would blow my lid if my SO expected me to take over his social responsibilities because I'm 'just better at it'. He has a calendar too, he can set it for himself.",
      "id": 200,
      "comments": [
        {
          "score": 142,
          "content": "This is why his parents haven't gotten birthday or Xmas presents for a few years now. I love them, but I take care of EVERYTHING holiday related. If I don't do something, it doesn't get done, and I'm exhausted by it all.",
          "id": 201,
          "comments": [
            {
              "score": 129,
              "content": "My boyfriend deadass asked me today if “we” got anything for HIS sister’s baby shower, to which he was also invited but which he did not attend. I laughed in his face, and to his credit he also laughed and made clear he knew he was completely ridiculous.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 573,
      "content": "[deleted]",
      "id": 203,
      "comments": [
        {
          "score": 167,
          "content": "Exactly. Every comment is saying “if his *family* expects cards it’s his job to appease them” but in reality it’s OP’s husband who expects his family to get the cards and he’s trying to get OP to appease them. If he didn’t think the family deserved cards neither would be sending them. But since he thinks they deserve cards, the responsibility is on him.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": " NTA   - OP's husband is trying to get his wife to do the cards because  that's what will make his mother happy. Her doing them (not him) is the way he thinks his mother wants it and that is probably true. She didn't ask her son to write cards, because she thinks it is up to the wife, so if he did write the cards, she is likely to still  feel resentful towards his wife, *so that issue needs to be resolved in  any case.* To solve this problem:\n\nHe should stand up for his wife and talk to his mother about expectations, whether he writes the cards or not.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 301,
      "content": "NTA. It's 2019. Holiday cards are a pointless burden on mail carriers, the system, and the environment. Plus, your MIL just insisted on a gesture meant to be seen as thoughtful. This makes you sending the card a shit-test, not a gesture. If you \"fail\" the test you will face consequences from his family. \n\nI would just tell her, \"Holiday cards really doesn't fit into my schedule, budget or values. Husband can handle it if he so chooses but at this time, I'm declining to participate in this tradition. I understand if you don't send us a card in return. Can't wait for Christmas dinner! Do you want me to make something and bring it or help you cook when we get there?\"\n\nI bet you have more stories about both this MIL and Husband supporting her instead of you.",
      "id": 206,
      "comments": [
        {
          "score": 54,
          "content": "This! Cards are an old tradition that don't really make sense when you factor in the ecological and economical elements, specifically when they're intended for people who are close enough for you to actually get face time with. They're wasteful and pointless. I will send thank you cards, especially if they're for people older than me, but that's about it.",
          "id": 207,
          "comments": [
            {
              "score": 12,
              "content": "I feel the same. my mom and grandmother kept all the cards they received and now I have boxes of useless paper to deal with. \n\nCards can be nice if you really mean the sentiment written. But its a worthless ritual if you are just giving cards just because you have to.\n\n&#x200B;\n\nI just send e cards, no wasted paper, and just meant to be fun.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Idk, I kind of like the old tradition of holiday cards. But it ONLY makes sense if the person or couple or family enjoys it and wants to send them.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I agree with this up until the last bit. OP is  obviously annoyed at how \"traditional\" her husband is expecting her to be, I doubt she wants to shut that down just to offer her help alone in the kitchen. Maybe is she were to say \"us\" instead",
          "id": 210,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}