{
  "post content": "My husband, our 16 year old son, and I are going next month to visit our daughter at her college which is a few states away. She is a freshman and has been with her boyfriend Steve for 3 years. Steve is really a great kid, but since money is a bit tighter in his family, he is doing 2 years at junior college while working to save up for the school my daughter attends. We have never taken him on a trip, but since he says money is right, we decided to bring him with on our visit to see our daughter. He visited her once on his own back in the fall, but due to his finances he wouldn’t be able to afford another trip this school year. He was over the moon when we invited him. \n\nWe don’t want him to pay for a single thing. His flight, his hotel room (he will be sharing with our son, they get along really well) and his food and drink will all be paid for by us. And really we are glad to do it. We’ve also never really had a disagreement with Steve until now. \n\nWhen speaking to my daughter about plans, the hotel came up. This is when I found out that my daughters dorm roommate is out of town that weekend. And she plans to have Steve stay in her dorm with her while we visit. I told her absolutely not. I said what they do when we aren’t there is their business, but since we are going to be there and funding this whole trip, he will be staying at the hotel. Call my husband and I old school, or traditionalists, but we are Christians. And the idea of them staying together on our visit makes us uncomfortable. We think we are being rather generous to take him in the first place. \n\nThe word got back to Steve and he actually called me and asked why he couldn’t stay with our daughter. I explained my reasons above and he got irate. He tried to pull the “adult” card. I said Steve,  here is the deal. If you wanna stay with her, that’s fine. You will still be welcome to tag along with our family. But there will be separate checks on every meal. And he could figure out his own way there. He said we know he can’t afford that. And I said all we ask is that you sleep at the hotel. He agreed but now my daughter is saying we embarrassed him and he’s thinking of not coming.",
  "id": 1,
  "comments": [
    {
      "score": 20162,
      "content": "I think it's nice that you want to pay for the trip but, they are together and this is an opportunity for them to be together privately. Obviously, they don't get to do this often so why not just let them be? Your being \"Christians\" doesn't stop them from being who they are and doesn't give you the right to butt into their business. You may not agree with it but they are adults. It's just too bad your generosity is conditional. YTA",
      "id": 2,
      "comments": [
        {
          "score": 16680,
          "content": "Christian generosity is always conditional.",
          "id": 3,
          "comments": [
            {
              "score": 4268,
              "content": "100% agreed. My grandfather and my aunt are just like this and honestly it's ridiculous.",
              "id": 4,
              "comments": [
                {
                  "score": 1645,
                  "content": "Thirded. I grew up in it.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1869,
                      "content": "Here to back you up. I was raised evangelical. Help is usually based on conforming to the helper’s ideals. It sucks. It’s manipulative. And, I am so glad that chapter is behind me.\n\nThey’ve known Steve FOR THREE YEARS. Three. That’s a lot for a person so young.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 180,
                      "content": "Yep. It caused me to be pressured into getting married to a man I absolutely should have not married, because \"religion\".",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 86,
                      "content": "Same",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My entire family…….I ended up pregnant at 14. Now I’m 34 with a 19 yr old (she’s AMAZING btw).\n\n\nOP, you need to chill. Let them kids spend some time together and hang out.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My parents were like that. Catholics. Tried to shame me at 21 when, nearly two years after moving out on my own, they found out I was sleeping with my BF. Not from me, obviously. I still remember, more than 50 years later, my dad claiming that what I was doing was against all laws of “god and man”. I pointed out the many places where couples were expected to spend time living together to show that they were compatible. \n\nHeh heh heh. Didn’t go over well. I also told them that if I believed that what I was doing was wrong, I wouldn’t be doing it. And that I was just living my life, not trying to hurt them. Because it wasn’t, in the end, their business.\n\nI continued doing what I was doing.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1775,
              "content": "And cruel. I can't imagine not being allowed to spend alone time with my partner because I'm poor and the other option is parents worried about an invisible sky entity caring about their sex life",
              "id": 11,
              "comments": [
                {
                  "score": 884,
                  "content": "But OP and her husband won't get into Better Heaven if they let their daughter, who is a functioning adult *just live.* If they force their made up Xtian beliefs on her daughter, who grew up with it- obviously she knows how ridiculous her parents are- the folks get to level up or something in heaven for making someone else miserable for absolutely no reason! OP, YTA, you sound like missionaries who force starving Africans to listen to a sermon before you feed them.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 16,
                      "content": "If christians are 'responsible' to bring folks to christ, they should also be held accountable for all of those they drive away from christ. I would love to be religious, but the people.....i just can't",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 273,
                  "content": "The invisible sky entity is just as likely to knock her up.  Isn't that how the story goes?",
                  "id": 14,
                  "comments": [
                    {
                      "score": 87,
                      "content": "Also Mary was underage (16 I believe) when she was impregnated. This god guy is sounding shady.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 113,
                  "content": "Steve and the daughter should be sneaking around her parents back like normal kids of \"Christians\" do.\n\n\n/s",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "I mean if the big man in the sky didn't want us having sex why'd he make it so much damn fun and feel so good? We got the best 'Lego' sets in the world that has a billion combos.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 668,
              "content": "Isn’t Christian generosity an oxymoron?",
              "id": 18,
              "comments": [
                {
                  "score": 495,
                  "content": "I have known some very generous and kind Christians, but it's always been the ones who are very quiet about their faith. What's interesting is that one of them who was a practicing Catholic also said she was agnostic but she liked the volunteer work her congregation did! Some I didn't even know were Christian until I got know them well. The vocal ones? They call themselves evangelical, I call them performative.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 260,
                      "content": "\"Some I didn't even know were Christian until I got know them well.\"\n\nYup. People always say, 'why don't Christians every do XYZ\", but they do. They just don't bash people with a Bible while doing it, so no one realizes they are Christian. Which is how it should be - it should be about helping people, not evangelizing.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 177,
                      "content": "This is exactly why one of my oldest and best friends is a Christian despite the fact that I’m in the LGBTQ community. She practices the faith and doesn’t preach it— she just volunteers at soup kitchens and knits hats for premature babies and keeps her community supported without attacking anyone else’s beliefs or choices. She’ll leave a church if they care more about hating others than helping others and she doesn’t put folks down for not being a part of her faith. She genuinely just enjoys being a good person and makes that the core of her religion. \n\nI always call them Ned Flanders Christians because they seem like they’d only exist on TV.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I don’t usually tell people I’m Christian because of the baggage that comes with it. I joined my congregation because of the work they do in my city with refugees and for the homeless population (many of both around here), and we’re active about social justice…it’s not my job to rehab the church’s reputation, but it IS my responsibility to counteract the harm it has done to so many people.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "ONE of the nicest people I have ever known was a Christian. Never said a bad word; always helped others; never preached to anyone else. I never knew until I saw him saying grace before a meal all by himself. He was one person.\n\nOn the other hand, MOST of all the worst people I have ever known are Christian. A neighbour died while helping another person. The pastor at his funeral said that he was in Hell because he wasn't a Christian. There are many more examples. And yet they claim they are the moral ones.\n\nThere are diamonds in the rough, but they are very few and far between.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Speaking as a christian, the ones you meet who are quiet - it's because we don't believe in blasting the good things we do. We're literally taught/told in the Bible NOT to do that. I'd venture to say performative is the perfect word for the vocal ones.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I stumbled upon a Methodist church looking for a Unitarian congregation last year, and made some atheist/agnostic friends right there. Not everyone who attends a Christian church is religious and that was a nice thing for me to learn. Some are just in it to help others.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This. A place I used to work had a lot of those \"performative\" folks, always taking about their dozen church activities, their hours of weekly bible study, how they were raising their kids \"Christian\" (which apparently required \"beating the devil out of them\" when they misbehaved), etc. Until one colleague with no real family (they existed, but think Maggie's family in Million Dollar Baby) fell gravely ill, required multi-organ surgery and months of recovery. One of our older coworkers and his wife decided to take the sick colleague into their home after his surgery and nursed him back to health. I later found out that this older co-worker and his wife were also deeply religious, which came as a mild surprise since he had never talked about his religious beliefs at all.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "THIS is the comment I was looking for",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yes, there always seem to be strings attached...always a quid pro quo.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 520,
              "content": "As a Christian, I can confirm that most Christians will look down on you and judge you far more than someone else.",
              "id": 29,
              "comments": [
                {
                  "score": 249,
                  "content": "You can replace \"Christian\" with almost any religion and that sentence will still be true.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 99,
                      "content": "Xtians tend to be the most sanctimonious assholes about it, though.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 341,
              "content": "The whole religion is conditional. If you dont follow ALL the rules. Eternal🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥",
              "id": 32,
              "comments": [
                {
                  "score": 185,
                  "content": "Hope mom and Pop didn't use any birth control and only did the dirty tango for baby making only, I'd hate their souls to be damned\n\n\nAl la carte christians don't count in this case, op \n(Coercing your daughters relationship)",
                  "id": 33,
                  "comments": [
                    {
                      "score": 7,
                      "content": "“A la carte christians” is my new favorite descriptor, thank you!",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 159,
                  "content": "\"You have to thank me for your entire life in order to earn my forgiveness for the crimes I've decided you committed simply by existing.\" We call this narcissistic personality disorder and abuse in families, but it's \"holy\" when it's a god.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 13,
                      "content": "God has a bit if a mood disorder as well.  I always thought the god that captain kirk encountered was an accurate portrayal.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It’s called spiritual narcissism.  And it is a real thing. “If only you knew what I know.  If only you were as good as I am.”  It’s just another type of narcissism, that is manufactured in order to deal with low self-esteem so that they have something to lord (pun intended) over others.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 179,
              "content": "No hate like Christian love my friend ",
              "id": 38,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 166,
              "content": ">Christian generosity is always ~~conditional~~  **fictional**.",
              "id": 39,
              "comments": [
                {
                  "score": 4,
                  "content": "just like their god ",
                  "id": 40,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Uh huh",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "They are true christians who use their religion to establish dominance and force their religion on others. They are christians who use their money to beat the boyfriend into compliance. All done with true christian love.",
              "id": 42,
              "comments": [
                {
                  "score": 15,
                  "content": "In America when Muslims do this it’s called “Sharia law” and banned. But when Christians do it it’s called “religious freedom” and it has legal precedent over other people’s rights.",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Yes! My mom is Christian and still tries these BS old school beliefs on me regularly. My mom would not have allowed this to happen at 18 or 28. It’s always if you do this, you don’t get that... I hate it, it’s 2024.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "I’d go one step further and say Christian love is always conditional",
              "id": 45,
              "comments": [
                {
                  "score": 7,
                  "content": "That was my experience",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Feed the hungry and house the poor, unless there's the slightest chance they might possibly have consensual sex with your fully grown adult daughter whom they are in a long term committed relationship with. I remember that passage in the Bible very clearly",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1243,
          "content": "The Christian parents who are that in denial about what their kids are up to are the ones who end up as young grandparents because their kids aren't going to buy condoms because the parents might find them.\n\nYTA",
          "id": 48,
          "comments": [
            {
              "score": 445,
              "content": "Had this conversation with my aunt a year before her gorgeous quarterback son knocked up his girlfriend in high school.  At the time I was more concerned about HIV as we had no treatments for it then. She argued about how her beautiful children raised in the light of Jesus were not going to have premarital sex. I was old enough to remember when she and my Uncle were dating. They were definitely hypocrites and told them they had forgotten the hormones of your teen years and they were lying to themselves if they thought their objectively attractive teenagers were going to stay virgin until marriage.",
              "id": 49,
              "comments": [
                {
                  "score": 371,
                  "content": "My parents tried that. It doesn’t work. \n\nI took my daughter to the doctor for whatever form of BC she saw fit while she was in high school. We talked about respecting yourself, about making sure you choose sexual partners who respect you. \n\nI talk to my son about adult decisions having adult consequences. Since he can’t decide for a girl about bc, and he cant force her to get an abortion, he has to be responsible enough to always have condoms. \n\nWe don’t do shame in our house. We do education, we do self respect, we talk about consent. \n\nBeing in denial about teenagers sexuality is a one way street to teen pregnancy",
                  "id": 50,
                  "comments": [
                    {
                      "score": 24,
                      "content": "My kids are only 13 and 10 but this is exactly the philosophy I have about teens and sexual activity and I plan to use your approach.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Top notch parenting. Well done!",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "In retrospect, I'm often amazed/ impressed/ appalled at the levels of denialism my mom went through to provide realistic protection for me while also maintaining her good Christian self narrative. She got me a birth control prescription when I was about 15 (right around when I became sexually active, but a few years before I actually lost my v- card) because she said she'd heard it would help my acne.\n\n\nI accepted the explanation because, aside from the stray pimple when I forgot to wash my makeup off, I was remarkably acne free during those years; a fact I was deeply grateful for as I watched my sisters and friends struggle with breakouts. I always attributed it to my mom putting me on birth control and never questioned it further. \n\n\nIt wasn't until I was an adult that it occurred to me I didn't really have acne before the birth control scrip, either. I had a fear of it, but I never had it. It also finally occurred to me (as an adult) that if birth contol was some kind of miracle cure for acne, both my sisters would've taken it, and every woman who struggles with acne ever. So that was pretty dumb, but I totally bought it, and thought I'd had a real lucky break ... which I guess I did, in that my mom absolutely did not want to deal with a teenage pregnancy, and clearly figured I was the most reckless and least well-prepared of her girls. ",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "All. Of. This. My kids are 16, 19 & 22. It’s the only way.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I was never really interested in having sex (learned later on about asexuality) but when I was in high school my mom had a talk with me that if I ever felt ready to have sex we could talk about it and that she would make sure I'm prepared. I never needed it, but I think it's definitely a good approach to talk to your kids and make sure they are prepared in whatever way that may look like",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "When I (f) was 12 one of my best friends was a Roman Catholic.  Her parents decided my very non religious family was a bad influence on her and I was never able to see her again.  When I was 13 we moved from England to the US.  It wasn't until years later through Facebook that I found her through other friends and turns out she got pregnant at 14.  Meanwhile my atheistic self didn't have sex until I was 19.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "They are not even in denial because it says 'what they do when we're not there is up to them'. Which makes it almost weirder?",
              "id": 57,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "My very Christian parents went through my room at 16 and found a condom wrapper.  Kicked me out on the streets and let me be homeless for 6 months.  They only took me back because the police found me and forced them to. I was forced to be homeless as a teen for having safe sex.  The danger they put me in was 100x worse than the safe sex I was having with my long-term boyfriend. They are much better now and are very regretful of their actions before.  But man, life was tough growing up with all that \"Christian love\"",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "On top of that, being this invested in your adult child’s sex life is WEIRD. Sitting here making yourself uncomfortable because you’re having daydreams of your adult child having sex isn’t normal. I stg these people need to seek help.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "My husband and I are both the products of teenaged pregnancies, and when our daughters were dating and had serious boyfriends we had the talk about the responsibilities that came with sexual activity and that using birth control was one of their responsibilities.  When the oldest was a freshman in college she had some symptoms and decided she had a blood clot from her birth control (it was actually a pinched nerve in her neck).\n\nMy husband was telling his dad about her calling an ambulance to get her from her down because she thought she had a blood clot from birth control pills.   My father in law spluttered, 'birth control pills?  Birth control pills?  Why was she taking......oh, I get it!  She was taking birth control pills to regulate her cycle and make her periods more manageable!'\n\nMy husband looked at him and said, 'No, Dad, she's taking birth control pills so she doesn't get pregnant when she has sex with her boyfriend!'.    I thought the old man was going to blow a valve he was spluttering and stammering so much.   My husband shut him down by saying, \"before you get started, I was having sex when I was younger than she is now, and I KNOW you were because by the time you and Mom were her age you already had me!  It's better that she takes a pill every morning than to care for a baby every morning\".",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "💯 I used to work with a woman who was very strict penecostal and guess what? Both her daughters got pregnant in college. To be honest, I’m surprised they were even allowed to go to college.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Or because condoms are considered a clear sign you pre-planned it. Jesus will forgive you more quickly if you pretend that things just got out of hand so quickly and you don't know what happened and it's probably Satan's fault.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 653,
          "content": "you like/approve of the boyfriend.  They’ve been together for 3 years and have proven to be a stable couple and faithful to each other during the tough long distance. They’re having “relations” whether you approve or pretend otherwise.  They’re being adults in checking with you vs trying to be sneaky.  Honestly, you’re being the immature ones. \n\nAnd what’s the point of taking him if your plan is to control and meter their time together? One thing to say they can’t stay in the same room under your roof but it’s literally HER roof/dorm.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 575,
          "content": "The is no hate like Christian love. 🤷🏻‍♀️🤦🏻‍♀️",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 320,
          "content": "Can’t agree more.  Your daughter is an adult.  Her BF is also adult.  Your right to dictate whether they can or cannot sleep together has ended.",
          "id": 65,
          "comments": [
            {
              "score": 189,
              "content": "Right!! I’m currently attending a Christian college, due to my parents refusing to pay for a non Christian university, and this school doesn’t allow students to live off campus until 21 or married, unless with immediate family. We are also not allowed to live with people of the opposite sex, even after 21 unless immediate family. The fact that they think they have to right to tell ADULTS what to do OFF CAMPUS is fucking MIND-BLOWING. \n\nI am an ADULT. My parents cannot dictate what I do or don’t do with my body. I definitely don’t label myself a Christian, and I’m bisexual, non-binary and kinky, not to mention I have a small collection of sex toys and condoms, I’m on birth control, and my bf and I are very sexually active. OP is an AH and also stupid if they think their ADULT daughter and her ADULT bf haven’t had sex yet lol.\n\nEdit: for all y’all who keep telling me I’m “using my parents for tuition” they aren’t even paying. They changed their minds, and even if they didn’t, can’t even afford it. Fafsa and my loans are what are paying for my ONE YEAR at this Christian college. \n\nI would work and get more money, but I live in America and minimum wage here in my state is $12.50. The highest I got paid was 14.25. That’s not even a livable wage considering the state of rent here as well. Average rent in my state is $1400. We’re all being screwed over. I’m broke and can barely afford to eat, even on that salary, and yet I’m expected to just sit down and not complain? To just work to live? To work even though I have medical issues that cause me constant severe pain that not even prescription meds can help? When my healthcare won’t pay for the surgeries I need in order to live a comfortable life? Or for physical therapy that would at least help?",
              "id": 66,
              "comments": [
                {
                  "score": 9,
                  "content": "that's messed up.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah. Christian schools are fucked. I hate it here lol.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Hope you can transfer to a college that doesn't control your every move and thoughts.   \n\nPretty sure the \"Christian\" college wasn't your choice so those saying you are using your parents for the tuition are way off base.  If they want to control what school you go to then they definitely should be paying for it.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Then op doesn’t have to pay either. It’s not his right to have a free trip.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 316,
          "content": "This is that type of bad type of Christian way. \n\nMy parents used to lock my now husband in the basement when he stayed over. Literally locked him in with a deadbolt so he couldn’t go up two floors to my room. And they LOVED this guy. There was a door to get out for emergencies and windows down there so it wasn’t a major safety risk. We literally lived together at the time - what was this accomplishing during the holidays? \n\nWe now live 1600 miles away and basically never talk to them. Want to ask why?",
          "id": 71,
          "comments": [
            {
              "score": 48,
              "content": "🙋🏻‍♀️ I know why.",
              "id": 72,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "Whenever people do extreme stuff like this to keep adults apart at night, I never can resist the urge to ask them, “You know people can have sex anywhere at anytime, right?”",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 242,
          "content": "Maybe you require that they don't have sex while staying over. Soaking is ok, but absolutely NO SEX!",
          "id": 74,
          "comments": [
            {
              "score": 108,
              "content": "What about hand stuff? Or oral? \n\nOr the [loophole](https://youtu.be/j8ZF_R_j0OY?si=hkzPvZpuge6l2TgS)?",
              "id": 75,
              "comments": [
                {
                  "score": 18,
                  "content": "God's ok with sodomy, but only if you're straight?",
                  "id": 76,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Hey man, I don’t make the rules. \n\nOr believe in a god. Everyone should be able to enjoy a li’l sodomy if they want to!",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Doggy style is ok because all dogs go to heaven",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Soaking? Wtf is soaking?",
              "id": 79,
              "comments": [
                {
                  "score": 3,
                  "content": "Soaking is an alternate reality",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 223,
          "content": "Your last sentence is everything. OPs generosity is conditional. If I was Steve, I'd say thanks but no thanks on the trip and I'd save every penny I could and take the trip myself alone on a different date. \n\nOP, you are most definitely the asshole.",
          "id": 81,
          "comments": [
            {
              "score": 15,
              "content": "Maybe reddit should fund a separate trip for Steve.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I'd take a loan and go on the same date, and then I'd spend all the time in bed with their daughter. And I mean ALL the time.",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 208,
          "content": "Not to mention their Christian sensibilities don't change how many times this guy has already piped their daughter",
          "id": 84,
          "comments": [
            {
              "score": 9,
              "content": "😂",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 167,
          "content": "It’s your coin, but YTA. I wouldn’t have said anything and took a cab to her and bribed the brother with “silence” money. He has enough for that. Probably wouldn’t be caught anyway. What do you think they have been doing for three years?",
          "id": 86,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9983,
      "content": "> Call my husband and I old school, or traditionalists, but we are Christians. And the idea of them staying together on our visit makes us uncomfortable.\n\nThis is totally strange. So it's ok as long as you don't know about it? And what is the problem with Steve being at the dorm, since you're staying at the Hotel? \n\nI don't get it. This sounds totally controlling for absolutely no reason. If they're going to have sex, they will do so regardless of whether you force this or not so it serves absolutely no purpose, other than to control and alienate your daughter.\n\nYou can of course call the shots, because it's your money, but all your daughter will take away is when her parents are doing something nice, it comes with strings attached that are controlling her life.\n\nYTA.",
      "id": 87,
      "comments": [
        {
          "score": 4294,
          "content": "Straight up performative Christianity",
          "id": 88,
          "comments": [
            {
              "score": 719,
              "content": "That's a good phrase I think. Love it.",
              "id": 89,
              "comments": [
                {
                  "score": 335,
                  "content": "\"Performative Christianity\" is awesome. I'm gonna use it too.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Wait until you get a load of performative spirituality for profit - woo culture. I help run a metaphysical store, it’s wild.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "It's redundant though. Being performative is the very core of Christianity.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 577,
              "content": "$100 says neither OP nor dad was a virgin when they got married.",
              "id": 93,
              "comments": [
                {
                  "score": 81,
                  "content": "Right?! Such bs. Then to use “We are Christians”. It is because of religion and using the bible to twist things to say how they want it to say. \nI was born and raised Roman Catholic. As I got older I found a great reason to jump ship. \nWell I guess apparently I am not really married because I used a justice of the peace and NOT  a PRIEST! \nWhich does not bother me. Why? Because even though you can’t undo a baptism (I looked into it) but Roman Catholic priests and nuns were responsible for ripping Indigenous toddlers and children from their parents. These kids would never see their parents again. Put them in residential schools. Beating them if they spoke their language, cut their hair, stayed in a cold unloving environment. No hugs, kisses goodnight. \nIf a child passed away from being beaten or from disease that they refused to treat, they had the other kids dig a mass grave and bury them. Little girls were SA. If she ended up pregnant, after they delivered those babies, the priest would unalive them. The kids would plaster them into holes in the basement walls. Many other stories. \nI am disgusted by this religion. I thought there was a vow, Thou shall not kill? Where does this all fit in, with these innocent babies and children, just because of the colour of their skin? Then sweep it all under the rug and hope no one finds out. \nThis is not how any God would prefer life on earth like this to be ok.\nThis is not a religion. \nSorry, my rant about the hypocrisy of religion. \nDefinitely the do as I say, not as I do. \n“Thou shall not kill”…except us, especially innocent children! Well I just hope in the after life beliefs, there is a “special” place for these monsters. \nAlmost like a priest shook hands with Satan as they made this cult. \nAgain, this is just my thoughts.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 3,
                      "content": "~~Unalive~~ Murder.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Or they got married SUPER young/quickly so they could have sex.",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 61,
              "content": "That’s about 99% of it in the US.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 706,
          "content": "I think she is less likely to choose Christianity for her own life. When any faith is forced on someone it isn't their faith, they never chose it for themselves and when it feels too constricting they toss it aside.\n\nThe daughter's moral values are whatever they are and no matter what the parents believe the daughter has her own values.",
          "id": 98,
          "comments": [
            {
              "score": 196,
              "content": "If this is in the Bible Belt you’d be surprised how many college age students do wait. They also get married early because of it too 😂",
              "id": 99,
              "comments": [
                {
                  "score": 289,
                  "content": "And then we see their posts in RA and AITA because they got married to have sex and never even thought about “compatibility” or “our brains haven’t finished fully developing, lets make lifetime commitments”",
                  "id": 100,
                  "comments": [
                    {
                      "score": 16,
                      "content": "My MIL still makes comments about me and her son not being married when our son was born, almost 12yrs ago.. My husband's 18yr old niece is pregnant and married fresh outta high school . When I made a comment about how it's dumb for them to be doing that so young , my MIL replied \"yeah well at least they're married..it still bothers me yall wasn't married when your son was born\".. WHY the fuck should that still bother you?? Also, she hasn't been to church in 20yrs but chooses her moral high grounds to stand on.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "And divorced",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Making a huge life decision because horny must play out really well long term.",
                  "id": 103,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Check out Mormon alternatives to pre marital sex. I was shocked to learn the detours.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I heard. At least they are creative!",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 140,
              "content": "Raised Roman Catholic here and the poster sounds very similar to my mother. The result is I’m not religious, I avoid taking help especially financially from my family because there’s always some sort of string attached it feels, and there’s a good amount of built up resentment from my childhood/adolescence/young adulthood that I am trying to work through now. \n\nMy parents are much better now and not as controlling or pushy with religion but the anxiety and impact of growing up that way still affects my relationship with them.",
              "id": 106,
              "comments": [
                {
                  "score": 6,
                  "content": "My parents are not religious. We didn't go to church. There was no Bible class or religious teaching at home. No requirement to be religious. Money from my dad was always offered to me with strings. Money from my mum was given with no expectations attached.\n\nPeople use their religion as their excuse. People who are areligious find other excuses.\n\nMy dad used money to try to exert control. My mum used argument and moodiness to exert control. Neither has a religious excuse to fall back on.\n\nLike yourself, I grew up to be unaffected by emotional and financial manipulation.  I very rarely ask others for help or money. I prefer to stand on my own two feet or to receive generosity and kindness without my asking for it. I appreciate generosity and kindness given freely that way. What do I do when someone tries to add conditions to their gift? I tell them where to stick it.\n\nI understand that sometimes loans come with conditions for good reasons. If a friend or relative with no budgetary control or no impulse control asks me for help I might hand them up to a hundred pounds and see how long it takes to come back, if at all. If the money doesn't come back and I see they continue to overspend I will only provide further help on condition they spend the money on food, housing, heating, work travel or medicine i.e non gratuitously and that they pay it back at a specified rate. The first hundred is a test or a gift that may or may not come back. Anything I offer thereafter is dependent on what I saw done with the first hundred. Outside of direct money I buy food, drink or take people out. What I don't do is use money and offer help in order to tell people how to live their life; conversely, I don't let other people's struggles dominate my life when I know they've brought those struggles on themselves. Might seem harsh but took many episodes of disadvantaging myself before I toughened up and developed a compromise strategy that allows me to be helpful without harming myself.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 224,
          "content": "I believe OP point is she didn’t bring him along to allow that happen, she didn’t do this to allow them to have sex.\nIt was a kind gesture to bring and foot the entire bill, to allow him time with her. Honestly, it’s not even that big of a request in my opinion, but that’s not the point, it seems that’s OP hang up.\nSteve is considered part of the family group, but that also comes with respecting the request of those creating funding and allowed the event to even be done.\n\nI think that’s her thing.",
          "id": 108,
          "comments": [
            {
              "score": 242,
              "content": "In OP’s defense, she’s coming from a place of “sex is bad” and not “sex is beautiful and natural”\n\nWhich is completely religious brain washing. \n\nSeeing a distant romantic partner and not being able to have alone time would honestly almost be more devastating than not seeing them. \n\nI say this as someone raised Christian",
              "id": 109,
              "comments": [
                {
                  "score": 22,
                  "content": "As my grandfather once said -  \"I've only ever had intercourse 3 times. Twice were for procreation, and the third time I had to go to confession after because it was for pleasure.\"",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 186,
              "content": "Gotta disagree with you\n\nWhat behavior Steve engages in on the trip isn't up for discussion or sale.  No reasonable person would assume that they can use the funding of a trip to bootstrap selectively picking what aspects of someones personality and behaviors they can express or engage in outside of areas covered by the funding (ie dont do x,y, and z at the hotel). That's a super fucked position to take. They don't own Steve.\n\nThe scope of enforcing what bed Steve sleeps in can only be dictated for beds paid for. Since daughter will be sleeping at her home in her own bed, OP does not have a say.\n\n&#x200B;\n\nAlso? Turning around and suggesting there will be a literal price to pay for having sex with their daighter, and that price is a couple hundred bucks on your own dinners? How little value do the parent place on their daughter? For a couple hundred, go to town? That's Gross!",
              "id": 111,
              "comments": [
                {
                  "score": 179,
                  "content": "Using money to control the behavior od other adult creates resentment and distance. You may get your way on this trip, OP, but neither your daughter nor Steve is going to forget how you handled this situation. \n\nThis could be the difference between them staying at your house with the grandkids for Christmas, versus staying at a hotel so they can control their own time. The decisions you make now are what determines the kind of relationship you will have with your adult children. I would rethink your stance on this.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Or not visiting with the kids at all, because they know that “gifts” from the grandparents always come with unreasonable strings and demands. My father has never met his granddaughter for much the same reason.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yeah, sure all this checks out in the context of a strict understanding of who gets to call the shots, which is probably why Steve and daughter would rather decline this \"favor\" and wait until they can build their own relationship on their own terms and distance her family from it. \n\n\nI certainly would rather do that. Her parents will be \"Reddit morally correct,\" \"religious morally correct,\" *and* have jeopardized their closeness to their daughter. Yay! ",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I just think private time is so important to developing relationships and whatever they choose to do with that I just don't know why the parents wouldn't want their child to be developing a relationship with time spent together. Seeing if you're compatible depends upon spending time together. And yes physically intimacy as well. I would just want my adult child to be happy in her relationship and get to be a young adult. I remember those days. I'm glad for getting to make some of my own decisions and learning a lot. Seems very controlling to say where everyone has to sleep just bc may have sex when they are of legal age to do so and are committed and 3 years in.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This is one of those times where you can be technically correct, but at what cost?\n\nA kind gesture was just turned into something Daughter will always remember. She isn’t going to walk away with their values, she isn’t going to thank them later. She’s going to learn the hard way that their love and support is conditional, and that she either has to hide her life and choices from them or gain enough to never need their help again and do it her own way openly knowing they judge her. \n\nEither way it’s a barrier, years down the road OP may wonder why her daughter isn’t close to her or telling them about her life. If that’s worth it to her then it is what it is. \n\nTrying to control your kids at this stage with force and money instead of open dialogue, trust, and letting them make their own mistakes will only work for as long as Parents hold power over them. \n\nI still remember the first time my Parents said “No you can’t share a room with the boyfriend you’ve been living with for years.” And I said “Ok, well, we’ll just come for lunch then and get back to our hotel. See you year I guess.”",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "So she is saying he has to pay to have sex with her daughter. Seems legit for a$$holery. OP YTA.",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 176,
          "content": "Lol I love all the insane assumptions people are reading into this that aren't remotely implied by the story. They pretty much say that they understand and accept that their daughter and Steve have sex. There's a difference between \"my daughter has sex with this guy\" and \"this guy is fucking my daughter in her room at this very moment.\" One's a little more awkward, and they'd rather not have to think about it. That's not the kind of spiritual abuse people are making it out to be.\n\nNot to mention, it's their money. This sub has, on multiple occasions this week, handed down a NTA verdict on an OP deciding not to give anything to a sibling who was cut off from their inheritance for some kind of screwed up reason or another. There was usually implied to be some sort of abuse or character assassination involved, and the OP showed zero empathy for it, and AITA was like \"whatevs, your money is your money.\" But some teenager has blue balls for a couple days and it's the religious crime of the century lmao.",
          "id": 118,
          "comments": [
            {
              "score": 181,
              "content": "Except the only thing said here is that he'd be staying over with her, that doesn't mean sex is always involved.\n\nThe biggest thing is that OP knows they are dating, that they do have sex and that the two are together, etc. They claim their reasoning is because they're old school which honestly is batshit insane for two reasons.\n\n1.) They're ADULTS. We're not talking teenagers, but full grown adults, and OP who is offering to take the boyfriend with them for their daughter's happiness is adding a stipulation that two grown adults can't stay in the same room??\n\n2.) OP's comment on traditionalism isn't even about them possibly having sex on the same trip with the parents there, it's about the fact that they're not married. If the boyfriend and girlfriend were married but just in different locations finishing their goals, there absolutely would be no issue with him staying over because \"business between a married couple belongs in their bedroom\". \n\nOP is an asshole because they claim they're doing this as a nice gesture to allow the girlfriend and boyfriend to spend some much needed time together, but only with the rule that they can't stay in the same room together.\n\nWhich equally implies that they aren't going to permit any alone time between their adult daughter and her adult boyfriend, because honestly they could have sex at any point in the day so long as there is alone time, it wouldn't have to specifically be at night when he's staying over.\n\nIt is there money yes, but that doesn't make them any less of an asshole for knowing that the boyfriend is financially struggling, has only done one trip to see the daughter, knows their daughter probably misses her boyfriend too, but they're only going to permit this \"kind gesture\" on the basis that these grown adults can't even be alone together. That's fucking whack.\n\nEven normal Christians aren't like this at all.",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "You should know by now that anyone who mentions even being remotely religious on this sub gets eviscerated, lol.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If this is what you think about on vacation, you should probably read a book because that’s fucking weird. I don’t make a habit of assessing whether the adults around me are having sex currently behind closed doors",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "I am going to guess that there is a difference to the parents about knowing they are not following the morals of their religion and essentially funding the “sin”. I am not saying the daughter and boyfriend are wrong but neither are the parents.",
          "id": 122,
          "comments": [
            {
              "score": 109,
              "content": "I totally agree. The daughter is certainly old enough to choose to have sex. I don't think the parents are wrong to say they're not paying to provide it.",
              "id": 123,
              "comments": [
                {
                  "score": 51,
                  "content": "I agree too honestly. I don't think what they are asking is a huge thing. Yes, the boyfriend and daughter are \"adults\", so that means if they want to go off and have sex they can do so on their own dime. It is pretty disrespectful to the parents hosting him to on the trip to demand otherwise, and it is rather immature. \"Yeah, adult to adult, you need to fund my stay while I go diddle your daughter.\" Not very classy. And I'd say no to that too. Not to mention, my opinion of the kid would drastically drop from there.\n\n\nETA NTA imo.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Yep, this is it. Posts like these prove how full of teens and college kids this sub is, who think that college kids dependent on their parents should be able to do whatever they want no matter what their parents think— oh and foot the bill while doing it. OP thinks premarital sex is wrong. OP isn’t telling Steve or their daughter that they aren’t adults and can’t make their own choices. She just doesn’t want to finance choices she has a moral opposition to. Steve and her daughter can stay together in the dorm if they want, but OP isn’t going to pay to make that happen. Maybe it would be a different story if OP was saying Steve was prohibited entirely from coming along if he was going to stay with her in the dorm, but it sounds like he still is allowed to come ride in the car with the family and participate in the trip. They just aren’t going to pay for him to do it. NAH.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "But that's also making the assumption that there \\*will\\* be \"sin\" if he stays with her and that there couldn't be if he stays in a hotel room.     \n\n\nWhat are they going to do, put guards outside his room or keep him from any opportunity to see her outside of their gaze?",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "It really doesn’t matter what their reasoning is, it’s still shitty and controlling. They have no authority to tell Steve he can’t stay with their daughter if that is what she wants, and threatening to not fund his trip if they stay together is so manipulative. \n\nI knew a couple who got married, and his extremely religious parents offered to pay for the rehearsal dinner (one of the only things they paid for, bride’s family was covering everything else). Cut to day of rehearsal dinner, and they then stipulate that they will pay for everything except the alcohol (a huge chunk of the bill) because drinking is against their religion. So bride’s parents then had to cover that cost too. It put everyone in a bad spot, and why even offer to pay for something in the first place if you have caveats? \n\nSame thing applies to this situation. Just because you or your religion disapproves of something doesn’t mean you get to enforce those rules on other people or manipulate other people into following them.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Then you're saying that OP doesn't actually really care about the \"sin.\" OP cares about his own feelings and/or reputation. That's honestly worse to me than caring about the sin.\n\nI'm also pretty sure it doesn't like work like that with an omnipotent, omnipresent deity. Yeah, I just thought they were jumping on the mattress and I didn't check so I'm AOK now, even though you can read my thoughts.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "[deleted]",
          "id": 129,
          "comments": [
            {
              "score": 22,
              "content": "\"Listen mom and dad, I'll be fucking someone that Saturday night at 11pm. Either it's my BF or someone from the dorm. You're either going to get grandchildren very, very much sooner, or very much later, than you expected. I know Steve uses condoms, so I hope it's him.\" lol 😂",
              "id": 130,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 70,
          "content": "OP has realized they have an opportunity to assert authority they otherwise don't have, and they have decided to take it. This is 100% just a power trip. YTA",
          "id": 131,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "I support their rights to their beliefs. I do not support them using their beliefs to control other people. Their beliefs are their own to practice, their daughter is an adult, and what they believe in isn't something to force on other folks. I heard an analogy along the lines of \"You can be on a diet if you want to be, but you don't get to be mad at other people for eating a doughnut\".\n\nIt's certain that Daughter and Steve have already had adult special hugs and will do so in the future. This mentality of \"my money means you follow the rules of my God\"  is barbaric and will cause damage in this life, right now; not later in the after life.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4382,
      "content": "Edit: YTA, I think. I get a weird controlling religious vibe from more of OPs comments. \n\nI don't think you should have offered to pay. I think the boyfriend assumed that your offer to pay also came with some amount of freedom. It seems as if you're offering to pay but also want the boyfriend to have zero freedom of movement. If he wants to see your daughter and have alone time with her, he will do that. \n\nIf you pay for his trip you're basically giving him the green light to do that. I think that might have been where he was confused. \n\nIn other words, I think it was a mistake to offer to pay.",
      "id": 133,
      "comments": [
        {
          "score": 2025,
          "content": "The problem with these religious types is that they love policing other people ",
          "id": 134,
          "comments": [
            {
              "score": 575,
              "content": "Absolutely agree. The OP displays the hallmarks of a controlling religious person.",
              "id": 135,
              "comments": [
                {
                  "score": 9,
                  "content": "In all honesty I would carefully look into how involved the parents are with the daughter and if she will be able to set boundaries once she's financially independent and if unsure maybe take a step back to think if he would want these people in his life long term. ",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 194,
              "content": "Totally.  They say they would not feel comfortable about it… but are perfectly fine making things incredibly ackward between their daughter and her partner.  Poor Steve may even be rethinking the whole eventually joining her if they plan to continue to police their life.",
              "id": 137,
              "comments": [
                {
                  "score": 118,
                  "content": "They feel so uncomfortable with their daughter's sex life that they've decided to insert themselves into it and impose regulations on how and when it can happen.",
                  "id": 138,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 401,
          "content": "Also being Christian is not an excuse. Normal Christians wouldn't even care",
          "id": 139,
          "comments": [
            {
              "score": 141,
              "content": "Correct. I know numerous Christians who are not controlling in this manner.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 221,
          "content": "They only offered to pay so that they could pull the \"under my roof\" card.",
          "id": 141,
          "comments": [
            {
              "score": 89,
              "content": "Exactly. Offering to pay should have been a gift. It wasn't so it shouldn't have been offered.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "100% that’s exactly what it is. If they use money to control their adult children they’ll have a rude awakening when their children are financially independent.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "It wasn’t a mistake. It was a cold, calculated manipulation by a couple of puritan control freaks. Who also sound like they love to lord over their child’s partner because they have more money than his parents. YTA, just leave your kid and her boyfriend alone. You won’t be seeing much of them once they are financially independent anyway.",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "They also probably want to just spend time alone together.  She might want to hang put on campus and introduce him to her friends. And yeah, maybe later they’ll have sex but they’re adults who have been together for 3 years (thats 17% of her life!!!). They obviously care deeply for each other",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3857,
      "content": "Do you want your daughter to marry Steve?\n\nThey're been together for 3 years, and most likely have had sex before. Okay you don't want them to have sex on your dime.\n\nBut what is the long term plan? A Long distance relationship requires work to survive. It requires faithfulness and understanding and a LOT of patience and resisting temptations. I assume you want your daughter to marry the guy she's been investing her affections in for the past 3 years, a good guy according to you.\n\nCouples need a cuddle, and sometimes to cry together and reassure each other. Sure you're paying and you have a right to express your preferences. But what is the bigger picture OP? Do you want them to break up? forego some intimacy and alone time (not everything is sex btw) because you're uncomfy? \n\nYou're getting the YTA because you sound uncaring about what is best for your own kid. Spending some time alone with her partner isn't a big ask. Suppose they want to just stare at each other to remind the other person of how they look, since it's been a while since they've seen each other in person? \n\nNot everything is about sex. Maybe your morals/beliefs should let your mind be open enough to think your daughter is MORE than just a sex stared young woman.",
      "id": 146,
      "comments": [
        {
          "score": 1632,
          "content": "Imagine that OP's daughter will break up with Steve because long distance is trying and will get herself a local boyfriend. Whom her parents cannot control. And who has their own dorm, or can stay at hers without their information. It's where they will regret their power play.",
          "id": 147,
          "comments": [
            {
              "score": 840,
              "content": "This is 100% why I told my mom NOTHING about ANYONE while I was in college. She made it abundantly clear I’d be shamed for learning about my own body and who I’d want in a relationship. She apparently would have preferred it if I just married the first guy I wanted to have sex with and be miserable for the rest of my life like her. I’m also not a Christian anymore, if that says anything.",
              "id": 148,
              "comments": [
                {
                  "score": 359,
                  "content": "I was raised in a fundie household. Everything was about protecting my virginity or I would BURN IN HELL AND DIE. Im 40 now and I tell my mom nothing, NOTHING, about anything. This is how OP will end up as well. Times have changed. Having the occasional penis in your vagina no longer brings shame like it's the Middle Ages. Time spent talking, cuddling, and yes having sex is important for a relationship to survive. The parent comment here says it all.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 175,
                      "content": "My dad is super fundie too, my mom (they’ve been divorced for a couple decades) was not and I lived with her so most of my childhood was relatively normal when it came to sex ed and not being shamed for having hormones and stuff. But I do remember when my husband and I were dating and my dad would make comments that were anti sex even though I was well into my 20s and not about to discuss my sex life with him. But as soon as we got married, it was like something weird flipped? Like oh now sex is great! And dad wanted to ask questions about my sex life like this is just normal conversation. Yeah no. Absolutely not. I went 27 years with never being able to mention sex in front of you and now you want to talk about how I need to “please my husband *wink wink*” yeah fuck all that.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Grew up muslim and I had to lead a double life in my 20s. Made really risky choices with sex and had issues with intimacy because of it. Finally worked through a lot and am now married to a wonderful guy. We got married last year when i was 32. My parents still tried to play the modesty card about all aspects (even though they love him and we had been living together for 2 years) but no family was to know and I was asked to lie about him converting and that my dress wasnt modest enough, all sorts of things. My engagement was hell and was exactly why I had lived a double life for so long. I had periods of not speaking to my parents before but that was the final straw. Besides making a polite visit at Thanksgiving, I have barely spoken to them in over 6 months and have zero regrets.\n\nIt really sucks growing up that I didn't have an adult to talk to about sex, healthy relationships, my body etc. What parents like this don't understand is you're not preventing anything, you're just telling your child to figure it out on their own.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I think it’s so funny that people think they were super chaste and judgey in the mid ages about sex. They weren’t until Christianity took over and even then they really didn’t care much unless someone had a kid.\n\nIt was the noble class that was strict about it cuz they had property to inherit. Not cuz sex was bad but cuz they had to make sure they knew whose kid was whose, and needed to make arranged marriages.\n\nThe poor classes have always been more sexually open.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Exactly this. Same situation. There's only so much I'm willing to force conversations with people who vocally do not enjoy anything I say or try to share.\n\nHow you relate to your kids while they're growing up and trying to spread their wings will define your relationships with them as adults.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Sounds like me & my mom!! \n\nSenior year of college, my husband and I started dating. My roommate had to move so I needed another roommate to help pay the rent. We moved in together and my mom just about flipped her shit. \n\nShe said, “Your father and I are only letting the two of you move in together *before marriage* because we see this relationship going somewhere.” Direct quote. \n\nPay no mind that I was 21, about to graduate with honors and already had been accepted to grad school. She even made me *lie to my grandma* saying that if my grandma found out I was “living in sin” then she would have a heart attack and die. No exaggeration. \n\nMy husband and I did get married and we celebrated our 19th wedding anniversary recently. \nI told our teenage daughter that she needs to live with her future spouse because you don’t know if you can REALLY live with a person until they’re in your face 24/7. Better to figure it out before marriage.\n\nEdit: I grew up Catholic.",
                  "id": 154,
                  "comments": [
                    {
                      "score": 7,
                      "content": "The whole “letting you” thing is just.. ick. They certainly get off on the control, don’t they? I hope you’re doing much better now, sending hugs!",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "Strong agree. She can do a LOT that you can’t see. This is one tiny snapshot. You have raised her with your ideals but now she gets to choose how she spends her time and what parts work for her. She’s already doing it without your knowledge anyway. You seem to not mind her. \n\nAll you are doing is protecting your “Oh ick, my little girl!” sensibilities and sabotaging their relationship. ",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Exactly, she could be having sex with a different person every night at college and they would not know, but instead she has a long-distance boyfriend, she likely faithful to, instead. Furthermore, they might not even be having sex!",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "And while she's finding that one local boyfriend, she sleeps with half the college. Right now they only have one penis to worry about,, if she and Steve break up they could have thousands of penises to worry about.\n\nThis definitely isn't the hill I would choose to die on - one guy, who they have known for years and seemingly like being in a committed relationship with their daughter or some local randoms. I know who id prefer my kid slept with 🤷🏼‍♀️",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 332,
          "content": "Yeah, I want to reinforce the \"not everything is about sex\" point. MANY young couples want private time and the pleasure of spending the night together without it being only about sex.",
          "id": 159,
          "comments": [
            {
              "score": 3,
              "content": "And have sex too. ",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 205,
          "content": ">not everything is sex btw\n\nYes, was thinking this as well.  Also, maybe the bf doesn't feel comfortable staying in a hotel with the family and sharing a room with the brother.",
          "id": 161,
          "comments": [
            {
              "score": 72,
              "content": "Yeah I have no idea why he would be uncomfortable. /s",
              "id": 162,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I find it amazing that they’re not comfortable with the bf spending the night in the dorm but they have zero thought about putting their underage son in a room with a non-related adult male because “they get on so well”. Would they let their kid go to a Xtian camp and room with a pastor? Because that’s much more likely to get the family in strife than this open, honest, age-appropriate relationship. Not saying the bf is anything but a good guy here, it’s just the hypocrisy that amazes me",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "Exactly. A successful relationship requires all sorts of intimacy. Maybe they want to hold hands, hug, kiss, tickle, and cuddle. Maybe they need the freedom to hold each other and share feelings that they'd feel too vulnerable to share in mixed company. Maybe they want to sit around and laugh about they things they find mutually funny. And maybe they want to have sex. But OP is so fixated on sex and myopic about everything it takes to build a healthy relationship that sex is ironically the only thing OP is emphasizing with this ban.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "This is an excellent response!",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Exactly what I was thinking - it's not just time for sex, but they're young so thats what OP's mind goes to right away.",
          "id": 166,
          "comments": [
            {
              "score": 5,
              "content": "I can assure you it's not just because they're young. I'm in my 40s and my fundie mom still thinks I broke up with my last bf because we \"got bored with having intercourse with each other and want new people.\"",
              "id": 167,
              "comments": [
                {
                  "score": 6,
                  "content": "sounds like something she may need to look into internally…..jk (kinda, just don’t wanna disrespect a strangers mom)",
                  "id": 168,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Oh I think the same. I've told her she is the only person I know who's so obsessed with sex and truly no one else has it on the brain line she does. It's helping her mask something from her past but it's her path to walk.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "Yes, I'm wondering if the daughter and Steve will even get any time alone together or will the whole family be there the whole time.\n\nIf they stayed in the dorm, the day could be spent with family, but they could still get some time together at night.   That may or may not mean sex.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "They obviously can't get their minds out of the gutter long enough to think about any of that because they're such moral and upright Christians. 🙄",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I think the real key here is that OP doesn’t view their daughter as an adult, they’re still viewing their daughter as a child. Like a literal child, who is like an accessory, and that you can just pick up and control.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Not everything is about sex. My first boyfriend’s mum was EXTREMELY Christian and banned us from sleeping in the same room when we were 17. He snuck into my room when she was asleep and we stayed up for hours just staring at each other, talking and holding each other. We fell asleep in each other’s arms. Didn’t even kiss, but it was so intimate and special. She found us and banned us from seeing each other for a month lmao.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2439,
      "content": "> Call my husband and I old school, or traditionalists, but we are Christians. And the idea of them staying together on our visit makes us uncomfortable. \n\nSo sin is ok as long as no one knows about it?",
      "id": 174,
      "comments": [
        {
          "score": 456,
          "content": "But, doesn' God know everything?",
          "id": 175,
          "comments": [
            {
              "score": 370,
              "content": "I guess he relies on self reporting?",
              "id": 176,
              "comments": [
                {
                  "score": 176,
                  "content": "That actually explains alot.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 260,
              "content": "NOT IF THEY GET SEPARATE CHECKS\n\n/s",
              "id": 178,
              "comments": [
                {
                  "score": 36,
                  "content": "Money solves every problem ! Just need to be rich and you are A OK",
                  "id": 179,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "Cues up The Loophole",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "God is in the room with them, he likes to watch. \n\nOP, YTA",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 135,
          "content": "Sin's OK as long as you're paying. She clearly said 'not on my dime'.",
          "id": 182,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "Of course. Isn’t that what every person who proclaims their religion to others feels?",
          "id": 183,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "Yeah, like he said, Christians",
          "id": 184,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "As long as they aren't in a situation where they might feel compelled to think about it, which is even weirder. Like..ok just don't think about it then. They shouldn't be thinking about her sex life anyway. ",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2163,
      "content": "No hate like Christian love. Do you but if your kid is an adult it's not your business. But by all means force your kids to lie to about where they are and what they're doing so you can impress your sky daddy",
      "id": 186,
      "comments": [
        {
          "score": 559,
          "content": "That's why so many strict Christians get married at 18 and either divorce before they're 30 or live miserably ever after",
          "id": 187,
          "comments": [
            {
              "score": 261,
              "content": "And ask Reddit, “Why is my wife so frigid? Why doesn’t she like sex? Is it ok if I sleep with someone else if my wife thinks sex is bad? That’s the way she was raised!”",
              "id": 188,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "The two fastest ways to get married:\n\nDate a soldier\n\nOr \n\nDate a Mormon",
              "id": 189,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 63,
          "content": "Sky daddy. That’s awesome.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yeah I guess technically if it’s their dime then it’s their rules, but forcing that kind of a stipulation on a “gift” is just such a Christian thing to do",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1610,
      "content": "Well, I hope you weren't expecting any sort of a relationship with him.",
      "id": 192,
      "comments": [
        {
          "score": 63,
          "content": "I hope he actually doesn't go.  I mean, if they can never be alone and can't even touch each other, what's the point?  Might as well just see each other on Zoom.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1364,
      "content": "Soft YTA.. although I understand it may be uncomfortable, your daughter is at college. She could have a different guys or multiple different guys in her dorm, if she so chooses. She’s not. She wants her BF, who you like, of 3 years to stay with her. \n\nYou have the right to pull funding, but your daughter and Steve will have the right to hold it against you in the future. Also Steve pulling the “adult card”, should’ve been a legitimate thing.. because they are adults. Your “right” to control your children, is now over..",
      "id": 194,
      "comments": [
        {
          "score": 415,
          "content": "Couldn’t agree more with the be-thankful-she’s-in-a-safe-and-monogamous-relationship angle; she could be totally promiscuous at college instead or have an OnlyFans page, or be experimenting with threesomes and orgies and who knows what else. OP, a hetero-monogamous-long-distance relationship is the definition of Christian at college nowadays and you are looking a gift horse in the mouth. Also, you’re giving them an excuse to run off on you while you’re visiting to be alone, and for your daughter to build a wall between you. YTA.",
          "id": 195,
          "comments": [
            {
              "score": 73,
              "content": "lol freshman dorms were wild. I went to college in San Francisco and at least half the ladies on my floor came out. good times.",
              "id": 196,
              "comments": [
                {
                  "score": 3,
                  "content": "I had insomnia during college so I stayed up and hung out in a common area near the stairs. The amount of guys that were snuck in after hours when the dorms were supposed to be closed was crazy.  It was like a gd parade.",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "I’m surprised that OP has not responded. This is an excellent take.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "This is a really interesting take. \n\nI was thinking this whole time, my parents aren’t religious, but there is no fucking way my dad would have paid for my bf to come visit me and have sex. \n\nLike, his brain would not have computed any other formula than that his brain was paying for Steve to visit and Steve and I were planning to fuck at night instead of him sleep in the provided hotel. \n\nI know because he explained this was his opposition to me having a single dorm room AND a car with a “large backseat”. \n\nBut my mom had a much more relaxed approach when I came home from college for the summer. And she was the one who ran the *house*. Her point was “I have no fucking idea what you when you are at college. I have to TRUST that you make good decisions and make it home safe. So why am I on your ass when you come to visit for breaks? Your grandparents did that with curfews and I hated that shit.”  \n\nHer rules were things like “tell me when you are coming home or if you aren’t coming home so I don’t worry. Give me a plausible excuse. Don’t fuck up”. Worked out well. And my dad didn’t care, cause he wasn’t paying for shit and I had a car with a small backseat so I was “boinking” anyone in the car he paid for (his words). Or letting another man drive it. That was another thing he cared about…\n\n**ETA** I feel like I can’t stress enough how much for my father it was the sheer *gall* of paying for a man to bang his daughter. Or paying for another man at all. They couldn’t drive my car. They couldn’t “boink” in my car or dorm room. Certainly not his house. He *balked* at helping me pay for to LIVE WITH A PLATONIC MALE FRIEND as one of 4 roommates in college because he thought it MIGHT be trickery to fund a live in. Oh friend. \n\nHe’s never even offered to pay for a vacation for a partner. My *husband* shares my room because he’s there. Shit, if I’m thinking about it, my husband gets a birthday text only. Never a gift. Our joint Christmas check has only my name on it. He’s probably secretly THRILLED my sister and I kept our maiden names.\n\nHe just can’t live in a world in which he *facilitates with his hard earned cash* a man’s trip to have sex with another woman, much less his daughter. It’s not religion. It’s *principle*.",
          "id": 199,
          "comments": [
            {
              "score": 20,
              "content": "My dad was like this! He would chuck these little fits all the time.\n\nOnce after we caught up he offered me a lift home (I’d moved out by then and was living with my then-boyfriend and another guy in a share-house) and during the drive he told me he felt like he was ‘driving me to my pimp’, or something implying that I was a some kind of sugar baby or ‘kept woman’. Never mind that I was working and paying my own rent there…\n\nThat man and I are married now and I haven’t talked to my dad in about seven years. Sad but that’s life.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "But principle in service of what?",
              "id": 201,
              "comments": [
                {
                  "score": 11,
                  "content": "The principle of not paying for a man to have a sexy vacation. \n\nHe makes money for HIS enjoyment only. He lets his family enjoy it because it’s his duty as a man. But he’ll be goddamned if another man would get a sex trip on his dime. \n\nIf I had a brother who was like, dad, pay for me to go visit my gf for the weekend, my dad would have refused too. MAYBE he’d allow a ride along if he was headed in that direction…and he’d slow out and let my brother tuck and roll out…but he’d die before he fronted the costs. Which is essentially what this is.",
                  "id": 202,
                  "comments": [
                    {
                      "score": 3,
                      "content": "“and let my brother tuck and roll out.” I love it.",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Adults pay for their own trips",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "100% agree with this. I can’t bring myself to say a strong YTA with Christian parents who have a similar mentality to OP as I understand where they’re coming from, but I think they’re disregarding the fact that Steve might not feel comfortable staying with the family. I’m just concerned that this might cause some friction in their relationship as I know that some people break up due to not liking their potential in-laws.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "If he’s an adult then he can pay for his own shit",
          "id": 206,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1139,
      "content": "YTA.  This isn’t about religion, it’s about control.  You’re ok with them being alone overnight as long as you don’t foot the bill or know about it.  You want to attach strings to limit a gift for two adults.",
      "id": 207,
      "comments": [
        {
          "score": 244,
          "content": "Right. Saying you’re Christian like it makes you higher morally. Meanwhile these are two loyal young adults. And Christianity in my view is about charity and love toward others, not moral codes. Btw I’m ok with someone being conservative but this sounds controlling",
          "id": 208,
          "comments": [
            {
              "score": 20,
              "content": "If it were about Christian values, actual ones, they:\n\n&#x200B;\n\n1) wouldn't assume anything sinful was going on as that's inappropriate\n\n2). they would put themselves in a position where they were judging anything sinful that took place so long as it was not directly harmful to others\n\n3). they would not be using financial methods to manipulate and control others\n\n&#x200B;\n\nAll three either directly violate examples of Christ's teachings or the general values in his messages.   They're the one thinking sinfully, they are passing judgement as sinners, Christ took a very dim view of financial dominance and dishonesty, Christ didn't like folks taking his/God's name in dishonesty.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Living for all of these comments calling a spade a spade 🫶🏻",
              "id": 210,
              "comments": [
                {
                  "score": 4,
                  "content": "Lolol same, “I’m Christian… so you know I do mental gymnastics to enforce my cognitive dissonance about my daughters sex life.”",
                  "id": 211,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Plus, if they are paying for college (or contributing to it) they are already footing the bill for her dorm when he visits on his own.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "My BFs parent allowed us to stay in the same room on their vacations and even left us for a night(they had something to attend to back in our city). BF and I still talk about it to this day. We utilized that time to get to know eachother. Play question games. Tell stories. Express our hearts. \n\nI’m honestly thankful for that time we had because we now view it as really special. His parents probably don’t realize but it meant a lot to us.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 975,
      "content": "YTA. Please don’t say you’re a “Christian” and use that as a way to control your daughter and her boyfriend. Jesus didn’t give gifts with conditions or strings attached. You’re a poor excuse of a Christian. Controlling and weird. Jesus wouldn’t be about that.",
      "id": 214,
      "comments": [
        {
          "score": 300,
          "content": "Also Jesus was pretty good friends and accepting of prostitutes so I doubt he would bat an eye at 2 young people in love having sex.",
          "id": 215,
          "comments": [
            {
              "score": 69,
              "content": "His dad had sex with his mom without love",
              "id": 216,
              "comments": [
                {
                  "score": 113,
                  "content": "Hot take: god raped Mary. She didn’t know or opt into that pregnancy.",
                  "id": 217,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}