{
  "post content": "\nMy son is 18, He is going to be attending community college and is living with me, my husband and his 2 younger half sisters.\n\n\nThe other day I found out that he found and accepted a job without telling me. I was upset with him about it and the reason for that is that first of all, he should've told me since we live in the same house and also, and more importantly now I'm left without someone to stay with the girls from 3 to 8 where my shift start-ends. my son is usually the one to stay home with the girls and his new job is during these hours so one way or another we are impacted.\n\n\nHe told me his friend found him this job and it just happened - but I don't think it did because he knew he had to give up staying with his sisters while I work. my husband travels most of the time (he's a pilot) and paid child care is a no for me. My son said I shouldn't be surprised by him trying to work to save money to be able to pay for himself but that is just absurd since he literally lives with us without having to pay for anything except for his own entertainment. He said he needed the job and he wasn't reallistically going to stay and watch his sisters for days on end especially he doesn't get paid for it. We kept arguing and my husband got involved and he too was upset saying that my son had no respect for us. my son basically had a \"like it or not\" attitude with us and kept refusing to discuss this wirh us saying we have no right to be upset with him and should just accept it. but I'm just...I think that he's being inconsiderate of my husband's and I's struggle to provide for the family as a whole. this should mean something to him but he acted selfishly.\n\n\nETA okay, it seems that I did not mention the reason why the babysitter option isn't ideal and is because my daughters don't want a babysitter. they're both dealing with some issues and are unconfortable being with a stranger at home. besides that my son decided to stay with them and we didn't ask him or anything.\n\nETA Okay, some of you here are implying or suggesting that I'm making my son to be the girls' babysitter but that is in fact not true. He doesn't do much for them, just stays home with them while he studies or plays video games. He adores his sisters and only stays with them when he wants to. otherwise we wouldn't force him. Also, my husband said the girls are too young for therapy and I agree with him on that.",
  "id": 1,
  "comments": [
    {
      "score": 50675,
      "content": "YTA, he isn't free child care. He has his own life he needs to live and what he is doing is bettering himself for the future.\n\nYou need a better plan than forcing your kid to babysit for no money.",
      "id": 2,
      "comments": [
        {
          "score": 16070,
          "content": "\"but I fEeD aNd HoUsE hIm\"\n\n\nETA judgement, YTA",
          "id": 3,
          "comments": [
            {
              "score": 14003,
              "content": "AnD aCtIvElY dIsCoUrAgE hIm FrOm GeTtInG a JoB sO i CaN mAiNtAiN mY oWn CoZy LiFeStYlE wItH fReE cHiLdCaRe\n\n&#x200B;\n\nEdit: Thanks for the silver!  <3",
              "id": 4,
              "comments": [
                {
                  "score": 14878,
                  "content": "She said that the younger kids are too young for therapy.. these aren't rational people. SMH. OP, YTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 9078,
                      "content": "Too young for therapy but somehow can't get a babysitter because they need therapy",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1325,
                      "content": "Somehow, they're too young for therapy, but when older brother is watching them for 5 hours a day, he doesn't have to take care of them at all - just sit around studying and playing video games.\n\nEither they are leaving exceptionally young children with an irresponsible babysitter because it's free and free > safe. Or they are old enough for therapy.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 663,
                      "content": "Yeah, little kids get play therapy. If you can talk and move, you can get therapy. smh",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 463,
                      "content": "If they're old enough to have issues that interfere with their comfort in a normal situation then they're old enough for therapy!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 232,
                      "content": "This really confused me, I've never head anyone say that before. They clearly NEED therapy, it seems like they just don't want to deal with it.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 179,
                      "content": ">too young for therapy\n\nThe things I want to say in response to that would get me banned from this subreddit.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 59,
                      "content": "There are child therapists and family therapists. No one is \"too young\" or \"too \\[anything\\]\" for mental health care.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Too emotionally disabled to tolerate babysitters but too young for therapy.\n\nOP, this doesn't sound like a situation to dump on an untrained 18 year old kid to handle on his own. Emotionally disturbed/disabled young children need a trained carer.\n\n...Or maybe you're just making stuff up.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "But he has EVERY right and responsibility to himself to grow out of this phase.\n\nOP sorry that it throws a wrench into your current/previous set up & ad much ad I know that BLOWS for you...\n\nYou need to be both OK w his separating and individiuating and be willing to roll w the inconvenience... I get wanting to keep the circle of care for his half sisters small & safe - but it's appropriate for both to change now.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Eye roll she also said she couldn’t get a babysitter as kids weren’t comfortable with a stranger \nSit down and explain it to them than. If we never did anything kids didn’t like nothing would get done",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 727,
                  "content": "My mom did this with me but with my sister's kids. I didn't get paid, wasn't allowed to have a job, and she actively prevented me from getting my driver's license. I found a job behind her back and my then boyfriend's step mom helped us get a place so I could move out.\n\nBased on the edits, he originally offered to watch the girls but I bet that was when he was in HS and didn't have a whole lot going on. It sounds like he's brought up getting a job before and was guilted out of it, why else would he sneak getting a job?\n\nOP, don't be surprised if he finds someone else to live with too. YTA",
                  "id": 16,
                  "comments": [
                    {
                      "score": 168,
                      "content": "So abusive.  I'm so glad that you managed to get out.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "As he SHOULD. He was not born to give HER 2nd spouse free childcare. RUN son --run now.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Also the edit says she’s not forcing him to babysit…while making a post about forcing him to babysit?",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "see.. I am in a similar boat to OP and likely your mother. i can't work without the babysitting, but she was in highschool and a little bit after, so it's on her way.. she doesn't really have to do much besides pick them up, they're old enough to entertain themselves. but because I'm single, I don't have another back up and I simply don't earn enough to justify care..\n\nhere's the difference - the second she got a job, daycare became 100% MY problem again. They're MY kids! she did me a solid helping me out when she had the time but her priorities start and end with what she needs to do with her life. luckily my kids were 10 and 11.. plenty old enough to get themselves home and self directed enough to do their chores and homework before I get home.\n\nI owe my daughter for giving me that time but I'm not entitled to it. my daughter didn't have to sneak around to gain her freedom - I actually got her the first job. my kids don't dictate whether they're having a new babysitter and when my kids needed therapy because of my abusive ex, they got play therapy. \n\nand I've been very mindful of potentially parentifying my eldest by putting her in a situation where I rely on her that hard. if it became a case of the children being unable to go into care and my daughter needing to work or study, then I am afraid I need to find a different job - not my favorite choice, I don't have the luxury of a second income, but once again, it comes back to being my problem to deal with!\n\nall of these non issues she keeps throwing out to excuse this situation speak to a lack of maturity. you can be a little miffed that you didn't get much notice, but I would be asking myself *what is it about our relationship, that makes my daughter feel like she can't come to me with something like this*\n\nYTA because as much as I empathize with the situation, being a working parent myself, that's what you sign up for.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "Then in a couple years, she would be complaining that he’s unemployed, no job history, living at home “freeloading”",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "> fReE cHiLdCaRe\n\nBut didn't you see the edit? It's not babysitting, he only has to stay in the same space they are in, make sure they are ok and alive, can't leave, can't get a job, chooses to be there, and he doesn't do much for him. Totally not free childcare at all that son is providing!",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 597,
              "content": "AnD hOw DaRe He WaNt tO GeT a JoB aNd LeAvE!",
              "id": 23,
              "comments": [
                {
                  "score": 362,
                  "content": "Wait a few months and we'll see OP back on here. \"AITA my son changed his number, and I can't contact him\"\n\nYTA, OP.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 19,
                      "content": "He will also be posting on r/entitledparents and r/raisedbynarcissists.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "And when the son answers the phone he'll probably say \"New phone. Who dis?\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 312,
              "content": "so do prisons",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2059,
          "content": "I am genuinely curious as to what her plan was if her son ended up having classes in that time period. As a student, I speak from experience when I say classes can be at odd times.",
          "id": 28,
          "comments": [
            {
              "score": 763,
              "content": "I wouldn't even consider 3-8 to be \"odd times\" for college classes, especially at a community college that might have a lot of first shift workers/second shift students. Classes in the 3-6 range would often fill up first when I was in college because professors would teach their higher level or degree-specific classes earlier and the gen eds in the afternoon, mostly because we had a large teaching college so we'd often be doing practicums at schools around the area in the mornings and come back to campus in the afternoons and we needed those classes not to interfere with school hours.",
              "id": 29,
              "comments": [
                {
                  "score": 144,
                  "content": "I used to jam my schedule with classes from 9AM-9PM on Tuesdays & Thursdays so that I could have MWF off. Most professors didn't want to teach all the way up to 9PM, so more often than not I was out of there early.  But I remember that freshman year I had no choice at all for a lot of the classes, and definitely ended up with classes in the late afternoon.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 13,
                      "content": "My first semester, I was very lucky to have classes primarily on Tuesday and Thursday and like 2 on Friday mornings. I tried to keep that up the rest of my time because it made life so much easier. I do also distinctly remember the movie class I had on Wednesday nights, at around 6 or 7 PM for 3 hours. Fond memories of watching various Billy Wilder classics in that class.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": ">I used to jam my schedule with classes from 9AM-9PM\n\nThis reminds me when I signed up for college. I had graduated at 17 and am labeled the \"problem child\" so I didn't have a license because that was a \"privilege\" I couldn't ever get. My mom drove me and demanded control over my schedule. She set it up where I had all my classes 9am-9pm on Wednesdays. Which really would have been 7am-9pm since I would have needed tutoring (my mom also picked my \"major\" which was a 2 year certification in the medical field). I didn't want it at all and she wouldn't make a compromise because taking me to school once a week would already be an \"inconvenience\". The conversation ended up with me crying, my mom crying making me out to be horrible and my mom having all my classes dropped. The whole thing happened in front of whoever helps new students with their schedules. I got yelled at for \"wasting\" her time, we had driven there 2-3 times total that week of registration. I'm 24 now, ended up never going to college and didn't learn to drive until I was 21 (my then boyfriend, now husband, taught me). \n\nOp sounds a lot like my mom (and MIL but thats a whole different can of worms). They're both horrible people and we're glad they aren't in our lives. I hope OPs son finds peace in going limit or no contact after he moves out. Happy that he got that job and stood up for himself.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Truly. My undergrad I had classes anywhere from 9-5 and my graduate work was all after 6pm. Most people would be proud their child wants to work and do school. And community college is a few years, he will need to save money anyway to possibly move out for four college…or…you know…have a life?! OP, YTA",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 209,
              "content": "Absolutely. Like 3-8 every day? So he has to leave college by 2 to be home to watch his sisters?",
              "id": 34,
              "comments": [
                {
                  "score": 190,
                  "content": "*To raise his sisters. Do the parents even see their daughters during the week. No wonder the kids don't want babysitters. They want their parents!",
                  "id": 35,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Great point. Dad is always gone for work, and I'm assuming they're in school, so mom only gets them ready in the morning and comes home just around the time they're going to bed. Then she says the brother doesn't really interact with them when watching them, he's just there to supervise, make sure they're alive and in the house. No wonder they have issues.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "My parents pulled that. I had to take my sisters to school, my mom to work, do a full course load, be back in town by 2 pm to get my sisters who were just too precious to walk the mile home I had to walk even in the snow and rain, and then i had to be at my job by three. I lasted one year in college. Failed English 101 twice, had a teacher pass me even though I slept through every class of his just to get me out of his class. Literally ran away from home at 21 to be with my now husband. \n\nI'm 42 now. Only the baby sister talks to me. Their dad and our mom split up and left our state. One guess who was ultimately blamed for it all.... Yes, I'm the oldest. \n\nI hate parents like OP with a passion.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 145,
              "content": "They’d of bullied him to drop it. “yOu CaN TaKe THat class ANNNYYTIME OR LATER ON!”",
              "id": 38,
              "comments": [
                {
                  "score": 16,
                  "content": "Or the classic, \"just take it online!\".",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "I remember talking to friends during the college years and them saying they have a class from 8am to 10am, another class at 2pm to 4pm and from 5pm to 7pm and they would just hang out at the school during those hours becasue it was easier than going home and coming back.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "2 of my 5 classes are in that time frame. i have a wednesday 2:20-3:35 and a monday/wednesday at 4:00-5:15\n\npretty typical to have later day classes",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "And, if a class is run once every other semester, you gotta take it when you can.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1447,
          "content": "It’s “absurd” an 18 year old would want his own income…. What’s really absurd is that she would expect him not to.",
          "id": 43,
          "comments": [
            {
              "score": 183,
              "content": "At best, this is poor planning on OP. They really had no plan for the future and I'm not sure how long she expected this to go on. Could OP have given her more of a heads up? Sure. Is it weird that OP had no back up plan or thoughts on what to do in the future? Very.",
              "id": 44,
              "comments": [
                {
                  "score": 12,
                  "content": "Not weird so much as Extremely Self Entitled.",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1376,
          "content": "This- husband is a pilot - they can afford childcare or to pay the son to do so.  A normal parent would be happy the kid went out and found a job on his own- wtf",
          "id": 46,
          "comments": [
            {
              "score": 572,
              "content": "Not every pilot is a millionaire. There's a **big** gap between major airline captain and starting first officer at a regional airline. Most make under $40K the first couple of years; often closer to $30K. And they're usually based in a high-cost-of-living area. Take a look: [https://www.airlinepilotcentral.com/airlines/regional](https://www.airlinepilotcentral.com/airlines/regional)\n\nStill, YTA OP. His siblings are **your** responsibility, not his. He's trying to build his own life, and you're actively trying to sabotage that.",
              "id": 47,
              "comments": [
                {
                  "score": 377,
                  "content": "And none of this stuff in her story -- the husband being a pilot, the kids being too emotionally disturbed to have babysitters but too young for therapy -- explains why OP can't pay her son for babysitting. \n\nShe's been using him for free daycare. Because it's not an occasional thing but a regular schedule for her work.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 48,
                      "content": "She's afraid if he gets some money together he'll be able to escape.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Not the oldest child’s issue",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 288,
              "content": "But her precious babies don't want to be left alone with a stranger! Apparently they have some kind of issues, ones they're old enough to have, but not old enough to go to therapy for! OP's husband said so, gosh. It would be so cruel to get them a babysitter (and mental health care) when OP's son is living cozy and rent free in her house, doing nothing\n\nIn case it isn't obvious /s",
              "id": 51,
              "comments": [
                {
                  "score": 42,
                  "content": "What even is “too young for therapy”? I was in play therapy at age three because of some inherited mental health issues that became apparent around that age. My parents spent hours talking to and interviewing age appropriate therapists for me who had specialization with my specific issues. It helped me immensely, and I’m so thankful that they took the steps they did at such a young age to protect me and my health.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Same. I stopped talking and being able to read when i was 4 and my mother took off. My dad had a therapist come to my school once a week for 2 hours. I cant remember a time before I was in therapy.\n\nI'm so thankful and it's one of the biggest reasons I think my dad was a great dad\n\nEdit: is* a great dad, he's alive",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Supply and demand. It sounds like he's in big demand as the perfect babysitter right now. If the parents want to retain his exclusive labor supply, they need to offer to compensate accordingly.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "OP's son needs to watch out. Parents that feel entitled to your presence are a special kind of batshit. When I left, mine: filed a missing person report, hired a PI, harassed my friends, and hacked my email and bank account to monitor my activity. I was 25.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Right? How many posts have there been in this sub to the effect of \"my lazy grown child has no ambition and just sits around sponging off of me\"? This kid sounds like a real go-getter and the correct reaction is to be proud of him.\n\nInstead OP is prioritizing her own convenience and the wants of her \"new\" family over his need to exert a bit of independence. Maybe a new babysitter would be unnerving to her daughters but they'd only be new once and \"no non-family babysitters ever\" is a major overreaction that gives me helicopter parent vibes. Small wonder that junior is excited to have a reason to leave the nest for a few hours a day.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Also, presumably they are a two-income family. OP works, or they wouldn't need all of this childcare, right?",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1088,
          "content": "“I pay for everything but entertainment”\n\nSo you’re admitting there’s a cost for him that you don’t cover? How do you expect him to pay for it himself without a job. YTA op just pay him competitive babysitting rates if you’re so desperate. \n\nAlso info: how old are the girls?",
          "id": 58,
          "comments": [
            {
              "score": 614,
              "content": "But that doesn’t even matter. OP, you’re saying he doesn’t have expenses, but obviously if he wants to live on his own at any time in the future, he needs to make and save money. He has given you and his stepdad a couple of years (yes?) of 100% free childcare. Now he needs to start working on his own life, so you need to find a plan B for your younger children. \n\nYTA for sure. \n\nAnd your edit that you’re _not_ making him their babysitter? Come on! You are ridiculous. Your son stayed home to make sure his sisters didn’t get into any mischief while you and your husband were away. That is exactly the very definition of babysitting—except that your son didn’t get paid. \n\nYou need to take this loss, find a babysitter, and wish your son fair winds and happy travels.",
              "id": 59,
              "comments": [
                {
                  "score": 189,
                  "content": "I'd argue that it is more the definition of parentification, which is a form of abuse - she doesn't want him to get a job and develop independence because if he does, she will be forced to find an ACTUAL babysitter and have to pay them for it - why do that when she has an older child that she can strongarm/guilt trip into doing it for absolutely zip, claiming \"YoU HaVe tO dO iT! I pAy FoR eVeRyThInG fOr YoU!!1!1\"",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": ">but obviously if he wants to live on his own at any time in the future, he needs to make and save money. \n\nAt some point once the girls are older, they aren't going to need him for childcare anymore, and I wonder how long it would take them to start complaining that he's just lying about the house doing nothing, and he should be getting a job.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 461,
              "content": "> He adores his sisters and only stays with them when he wants to. otherwise we wouldn't force him.\n\nThe whole post sounds like they're forcing him! Most parents would be thrilled if their 18yr old got a job and was going to school. This mom would rather he play video games than enter the workforce and start living his adult life.",
              "id": 62,
              "comments": [
                {
                  "score": 38,
                  "content": "More like the parent is illusioned, or lying... \"only when he wants to\"? So what do they do with the girls when he doesn't want to watch them?? Leave them there alone? Take them to work with mommy? Bribe or guilt the son into staying there anyway?? Lol.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 15,
                      "content": "This 100%. He \\*wants\\* to. He doesn't think he has a choice.\n\nTil he got this job.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 33,
                  "content": "I loved this edit. “He absolutely wants to, even when he doesn’t want to. Because he has to, but he really doesn’t HAVE to. He wants to. Because I say so.”",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Right? He sounds like a good kid that is finally setting some healthy boundaries so he can work for his future.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Come on now! They would never force him... except every work day from 3-8 when he can't work himself because he is (not?) being forced to stay at the house...to keep his sister's alive....but that's not even babysitting for real because they're potty trained and can use the microwave...but other than that OP and her husband are totally not forcing him. He has complete freedom, except for, ya know, damn near every night. Jeezzz can't you see how OP is not forcing her son to be a babysitter, I mean it's ssssooooo obvious...right?\n\nEdit: typo",
                  "id": 67,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "That's what i don't get about her edit. We arent forcing him to babysit, we're just getting into arguments, saying he's disrespectful and actively trying to prevent him from having a job because he has to stay home to watch his siblings. \n\nLike what? How is that not forcing him to babysit?",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This is exactly what I thought. If he’s not allowed to work, he will never be able to leave the house. I know that’s lifelong free babysitting, but is that really what anyone would want? Poor guy",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Wana bet that, once the younger kids don't need a babysitter, they'll be kicking him out of the house and complaining he doesn't have a job and has been living off them too long",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "I really thought this post was going to be about mom and dad paying for everything and them wanting him go focus on school instead of working. Wow was I surprised.",
                  "id": 71,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "They’re “too young for therapy” according to OP yet also old enough to be “both dealing with some issues and are uncomfortable being with a stranger at home.”\n\nWhich is just an amazing möbius strip of a thought.  It’s like the term “child psychologist” never existed in her world.",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 981,
          "content": "After the edits. \"We don't force him to babysit, and he only babysit when he wants to\"\nWho watches them when he doesn't want to?\n\nHe clearly doesn't want to, and wants to work. He's an adult, doing adult things. He's not the parent. What is OP going to do when he moves out?",
          "id": 73,
          "comments": [
            {
              "score": 348,
              "content": "Exactly. If he’s only expected to watch them when he ‘wants to’ then this should be no issue. He’s now working and no longer ‘wants to’- which is apparently fine by OP because she ‘is not forcing her child to provide free daycare for her other children’",
              "id": 74,
              "comments": [
                {
                  "score": 350,
                  "content": "[deleted]",
                  "id": 75,
                  "comments": [
                    {
                      "score": 250,
                      "content": "\"We don't force him, we just emotionally blackmail him. Totally different thing.\"",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "If manipulation, guilt tripping, pressuring, and the use of Emotional Blackmail aren't Force, then what exactly Would you call those things?",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 31,
                  "content": "My suspicion is that \"only when he wants to\" is code for \"only when I back him into a corner by reminding him that I house and feed him for free\". OP is so out of line here.",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": ">What is OP going to do when he moves out?\n\nOP will just break his ankles Annie Wilkes a la Misery style so he can't move out\n\nOP YTA",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "How does he move out with no job? \n\nAh. Exactly.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 767,
          "content": "YTA\n\n*Not every teenage boy enjoys spending time with younger siblings, especially younger sisters.\n\n*He chose a paid job over an unpaid job. While you and your husband provide for his needs, I'm sure there are things he wants that he's either too embarrassed to ask for or he thinks that you'll veto\n\n\n*Your daughters will need to learn to deal with strangers sooner or later. Perhaps it would be helpful to have the carer initiaIly come while a parent is home so they can get to know her in a safe environment.  I I say this as someone with severe PTSD who has panic and anxiety attacks\n\n*He didn't tell you because he knew that this would be your reaction",
          "id": 81,
          "comments": [
            {
              "score": 40,
              "content": "Maybe he work to save some money to move out and be independent.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "> While you and your husband provide for his needs, I'm sure there are things he wants that he's either too embarrassed to ask for \n\nMaybe - God forbid! - he wants to take a girl (or guy) out on a date! And, you know, pay for said date!\n\nGood God, lady (OP).",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Isn't an 8 year old in school? All of those I know of,including all family members where/re in school full time at that age. Even I began full day school at age 5.",
              "id": 84,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Even if he's not worried about disapproval, it's still a great idea to save up for bigger purchases and it just feels good to buy something with your own money sometimes rather than having to beg your parents. There are many reasons why having a job as a teen would be a good idea.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 403,
          "content": "Agreed! OP You say he doesn’t have to pay for anything, just his own entertainment…. How does he pay for that? I’m assuming he asks you for money? You cannot be all shocked pikachu face that he wants to stand on his own two feet and not have to beg his parents for money to hit up a movie or something. Either pay him for bebe sitting or get over it and introduce your other kids to a babysitter so they’re not a stranger. YTA fo sho",
          "id": 86,
          "comments": [
            {
              "score": 68,
              "content": "And jobs nowadays all want someone with experience. Him not working now would make it much harder to find something decent when he's done with college (unless he goes to university afterwards, in which case the money he's earning now will matter much more than the experience.).",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Right?! And what about saving for the future? Will OP be paying his bond when he decides to move out after college?",
              "id": 88,
              "comments": [
                {
                  "score": 25,
                  "content": "He can't move out! OP needs him to stay home for free childcare!",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "He doesn’t get a future until mom allows it. /s",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Heh heh heh \n\nI see that bébé there and I love it",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Shout out for the Bebe /Schitt’s Creek reference!",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 312,
          "content": "I admit, I wasn't expecting to read a complaint from a parent about her adult child having the audacity to get a job.",
          "id": 93,
          "comments": [
            {
              "score": 31,
              "content": "Unfortunately this is very common with entitled parents.  The failure to launch phenomena is often enabled by the parents who would rather coddle their children indefinitely (think Cartman’s mother) and keep them safe at home rather than allow them to develop and grow in order to leave the nest.  OP and her husband are damaging this young adult and his sisters by sheltering them in order to support their current lifestyle, rather than to flex and adapt to the changes.  The son has taken a mature step and is trying to develop some independence and work experience for the real world that he will soon face when he leaves the house of his helicopter parents.",
              "id": 94,
              "comments": [
                {
                  "score": 25,
                  "content": "Oh, it doesn't even seem like sheltering to me in this scenario, OP just likes having free labor and is suddenly realizing that with her son getting a job a) free labor is not available anymore, b) he now has independent means of supporting himself, so she can't pull the \"I feed and clothe you, so you better obey me\" card.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 297,
          "content": "But I'm unclear about what actually happened. OP said she \"found out\" her son had gotten a job. OP, do you mean that he was keeping it a secret from you and you found out? Or do you mean by you \"found out\" that HE TOLD YOU that he was going to be working now and you needed to make other plans for childcare? Because the former would be bizarre behavior that would make anyone angry (secretly going to a job when he says he's staying home with his sisters.) The latter is only to be expected and you need to get over yourself bc you already got X amount of free childcare from him which is more than you have a right to expect.",
          "id": 96,
          "comments": [
            {
              "score": 181,
              "content": "Not telling them about the job until after accepting wouldn't be that odd if they were using it to force a way out of being free child care",
              "id": 97,
              "comments": [
                {
                  "score": 34,
                  "content": "They're going to be really surprised in two months when they find out he's moving out.\n\nYTA big time.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 12,
                      "content": "and goes low contact..",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "If she is actively trying to keep him from getting a job it would not be surprising for him, an adult man, to find one in secret and sort of \"oh well it's too late for you to do anything about it now\" sprung it on her.",
              "id": 100,
              "comments": [
                {
                  "score": 16,
                  "content": "I agree. At 18 he really doesn't need his mother's permission, so going \"behind her back\" to get a job is telling. You can only control your kid for so long and then they grow up.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17048,
      "content": "so instead of getting a paying job for himself, you want him to work for you FOR FREE?!?\n\nYTA and this should be crossposted to r/choosingbeggars lol",
      "id": 102,
      "comments": [
        {
          "score": 2738,
          "content": "And r/AmITheDevil",
          "id": 103,
          "comments": [
            {
              "score": 694,
              "content": "For sure there are tons other. OP is wild lmao",
              "id": 104,
              "comments": [
                {
                  "score": 1313,
                  "content": "u/entitledparents",
                  "id": 105,
                  "comments": [
                    {
                      "score": 1128,
                      "content": "r/raisedbynarcissists",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 711,
          "content": "Wow pretty selfish of the son to want to earn money while he's working...",
          "id": 107,
          "comments": [
            {
              "score": 472,
              "content": "I like how the edit is like \"What he's doing isn't even babysitting! But if he doesn't do it I would need to pay a stranger to babysit.\"\n\nOk so that's called babysitting then 😂",
              "id": 108,
              "comments": [
                {
                  "score": 65,
                  "content": "Agreed, the only time it isn't called babysitting is when it's called parenting.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "You forget, the only thing he needs his own money for is entertainment. He can’t get money without a job and they don’t pay him for the work he does. He can’t get a job because they *need* him. Thus he gets no entertainment.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 154,
          "content": "The dad is a *PILOT*.\n\nA literal pilot. As the daughter of one, money is not an issue when your husband/dad is a pilot.\n\nChildcare should be an issue either. YIKES",
          "id": 111,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Bro, work for free because the alternative of a paid sitter is a no-go...due to the girls having issues...that therapy could address.. except the parents won't because they think their daughters are TOO YOUNG for therapy.\n\nSo don't want pay for therapy = don't want to hire a sitter = don't want son to get a job. Sounds like ALL the kids are getting screwed over!",
          "id": 112,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "And then berate him for not having any savings and still living at home once they no longer require his free labour.",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "It almost seems like your family was surviving only because your son was the unpaid babysitter.\nYour high flying husband and you between yourself have decided to spoil his and the girls life. By denying them therepy you are doing a form of abuse.\nBy denying him rights to work you are exploiting him.\nI hope he moves out soon for his own mental health.\n\nmajor level YTA",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "The amount of posts I’ve seen on this subreddit of parents wanting to know if they’re the AH for getting mad at their *adult* children for not providing free child care for them is honestly baffling",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Right like maybe if they were paying him but for free no way",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14889,
      "content": "YTA the man is 18, he needs a job and he doesn’t have any children, YOU have children. Stop relying on your son like he is your co parent or partner. He is not.",
      "id": 117,
      "comments": [
        {
          "score": 1311,
          "content": "exactly!! He NEEDS a job. Even if he doesn’t need the money, the job economy is rough and my friend recently graduated college with two degrees and has been struggling finding a job with his degrees. I couldn’t imagine how much harder that would be on someone who has NEVER had a job in general. OP, YTA.\nIve been working since 16. Job interviewers have often said they like seeing how much experience I have with working as hiring someone who has 0 job experience can be a risk to them. It helps him gain independence as well because he’s 18, soon he won’t be living with his parents. Rentals also like seeing job history. His siblings are not his kids, no reason to watch them unpaid.",
          "id": 118,
          "comments": [
            {
              "score": 255,
              "content": "it's taken me quite literally 6 years of *in-industry* work experience to reach a livable wage, it's a massive asshole move to try and delay any young person's income in this dogshit economy",
              "id": 119,
              "comments": [
                {
                  "score": 20,
                  "content": "My parents actively discouraged me from working when I was in college. That put me in a position of complete poverty when I graduated, which took me years to get out of.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "You need to build a resume to get hired after graduating for sure.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Exactly this. I've worked in jobs where I have recruited graduates into their first job out of uni/college. Those shitty pt jobs that boomers seem to think are so unimportant are literally the only working history we have for them. No work experience anywhere? It's going to be tough to land a job with us, the interview process will be brutal without ever having experience one too. Yeah you have a degree but so does everyone, it's it's absolute bare minimum for us to even consider you, what else you got?",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I highly recommend college students sign up to work for GrubHub because you only have to make 1 delivery a month to continue your “employment” so that you have a work history to list when you graduate. I “worked” for GrubHub for the last 3 years so I had a nice steady record of employment when I graduated last spring.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 842,
          "content": "[removed]",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 521,
          "content": "Why so some parents think that their older kids sole purpose in life should be to raise their other f-nuggets?\n\n\"Here, I bred multiple times and it's your problem as their older sibling to raise them\". It's insane!",
          "id": 125,
          "comments": [
            {
              "score": 17,
              "content": "It is abuse I tell ya  !",
              "id": 126,
              "comments": [
                {
                  "score": 17,
                  "content": "It's called [parentification](https://en.wikipedia.org/wiki/Parentification)",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 132,
          "content": "Yes! OP is such an AH. Her son has taken the initiative to be responsible and independent. How are these bad things? This is what all parents want for their children. He has a life to start living and cannot do that if he is expected to parent his siblings.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": ">Stop relying on your son like he is your co parent or partner. He is not.\n\nBoom! This is everything that needs to be said. OP has extremely inappropriate expectations of her son.",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Yup. And look at the edits to the original post. She still isnt getting it no matter how many people comment here. No wonder the son is trying to get out more.",
          "id": 130,
          "comments": [
            {
              "score": 19,
              "content": "It's not babysitting honest, he just has to be home to be responsible for younger children in the house. Oh wait...",
              "id": 131,
              "comments": [
                {
                  "score": 18,
                  "content": ">he only stays with them when he wants to. We dont force him. \n\nThats not at all what it sounds like. \n\nOh, and also this gem:\n\n>…my daughters dont want a babysitter.  \n\nToo damn bad. Who is running this house??",
                  "id": 132,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "You can’t put “babysat younger siblings” on a job resume, and at 18 he’s due to start building that up.  \n\nYTA, make other arrangements.",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "It almost sounds like he got the job so he can move the fuck out. She says he said he needs it for money, but then implies he doesn’t need money because they provide him with everything failing to put two and two together that maybe he wants to GTFO of this toxic situation and become an independent adult.",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Even if he wasn't 18, those are not his children and it is not his job to be their childcare.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9902,
      "content": "> paid child care is a no for me.\n\nUnless you can't afford it, seems it'll have to be a yes for you. He is right in that he has to start being independent. Your kids are your and your husband's responsibility, not his. \n\nYTA.",
      "id": 136,
      "comments": [
        {
          "score": 3038,
          "content": "Even if she can't afford it, it's not really his problem. \n\nParents can't expect their older kids to take on caring for their younger siblings because they can't provide adequate care.",
          "id": 137,
          "comments": [
            {
              "score": 1380,
              "content": "I didn't realize my kids were all off school a few Fridays back and had two critical meetings. I asked my 10-year-old son if he'd be willing to watch my 3yo for those meetings for $20, with me being in my bedroom with the door closed. ASKED. PAID. He's not their parent, and he's not responsible for his siblings. JFC YTA OP.",
              "id": 138,
              "comments": [
                {
                  "score": 481,
                  "content": "My son has to mind his sister for 1.5 hours while I clean a house next week. The house is on our street and he's in his teens, she's almost 9 and they will be safe. Payment has been agreed that I get them a Maccas if they be good and my son gets a nice shock case for his switch and snacks available for the hour or so. That's it. But it's agreed and deemed fair by both parties.\n\nETA by \"has to\", I mean I asked did they want to come with me and both immediately said no and insisted on staying in ours with dvds, their gaming consoles, Netflix, etc so that leaves a situation where my son's in charge",
                  "id": 139,
                  "comments": [
                    {
                      "score": 52,
                      "content": "Yep, and a 9 year old is probably on the verge of being independent anyway. It's a bit different than watching a preschooler. I've got two kids between the oldest and youngest, and I've had him stay with the other two sometimes, but he's not really watching them, just being the responsible one while I run to pick up a kid.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "10yo me would be thrilled with all the candy I could buy with those 20 bucks if I plan good enough...",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Yeah, parentification is abuse. I’d be willing to bet the son has had to step in to care for his siblings in the past, too.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1283,
          "content": "But the girls DoNt LiKe StRaNgErS. Okay so pay him to babysit for you. If the reason paid baby sitting is a no is because the girls act out with strangers than pay him what he’d make at his job to watch the girls. Easy. Then he can pay for his EnTeRtAiNmEnT and anything else he wants and you have a babysitter. Wonder why you didn’t immediately do this 🤔 hmm could it be because the actual reason paid babysitting is off the table is because you don’t think you should have to pay someone?",
          "id": 143,
          "comments": [
            {
              "score": 1059,
              "content": "Also the edit where they say the husband says the girls are \"too young for therapy\".\n\n*Too young for therapy?* Are they *infants?*",
              "id": 144,
              "comments": [
                {
                  "score": 729,
                  "content": "If they can communicate in any way, they’re old enough for therapy. This family is messed up and it’s because the parents are making it that way.\n\nEdit: thank you for the award, kind Redditor!",
                  "id": 145,
                  "comments": [
                    {
                      "score": 239,
                      "content": "I was doing therapy at 8 with a school therapist because my parents had a horrible divorce. I’m so thankful that I did. We basically played board games while talking.  At the time I had no idea it was therapy.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "any family that thinks their son-of-age getting a job requires their advance notice/permission really fucking needs therapy at all levels",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Right? I mean, even toddlers who have been thru traumatic incidents are helped dramatically thru play-therapy.  I smell something weird going on here!",
                  "id": 148,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Not just that but they wouldn’t force him if he didn’t want to… so him getting a job and you trying to strong arm him into quitting isn’t forcing him to watch them after he doesn’t want to anymore?",
                  "id": 149,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "I agree my son is 7 and in therapy for his anxiety, that he sadly gets from me.  But as soon as I saw the signs I got him in therapy to try and help him out",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I'm so confused by this. The kids are old enough to have strong opinions about not wanting babysitters, but too young for therapy? What does that even mean? If their hesitation around babysitters is trauma-related, then they definitely need therapy, OP.",
                  "id": 151,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 507,
              "content": "And the next edit was even worse!! \"My husband and I agree that our daughters are too young for therapy\" ????? That isn't a thing ma'am, god forbid your kids learn healthy coping mechanisms and get help understanding their own thoughts and feelings TOO YOUNG, that's supposed to be saved for your midlife crisis or something",
              "id": 152,
              "comments": [
                {
                  "score": 141,
                  "content": "Too young for therapy and we’d never force him into babysitting when he doesn’t want to… unless the reason he doesn’t want to is because he got a job. In that case he has to quit. We need him!!",
                  "id": 153,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Well you see he willingly decided to look after his sisters at one point so that automatically means he has to for life. Or at least until they are old enough for therapy, maybe when they are in their 20s",
                      "id": 154,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "ETA 3: I have more excuses for why I’m not an asshole (op, probably)",
                  "id": 155,
                  "comments": [
                    {
                      "score": 13,
                      "content": "*proceeds to make it 10x worse*",
                      "id": 156,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "She's afraid the other kids will also start learning to set healthy boundaries, and that is a no for her.",
                  "id": 157,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 86,
              "content": "Honestly even if she paid him he's better off taking the job. Babysitting doesn't impress anyone on a resume.",
              "id": 158,
              "comments": [
                {
                  "score": 18,
                  "content": "THIS! Even if the wages are the same, babysitting for your Mom is certainly not comparable to having an actual job in terms of work experience.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Also, when you work in the U.S., you're putting money into social security and also possibly retirement. When my aunt had to take time off of work to help care for my grandmother, my uncle (he handled all finances for his mother) paid her above her pay rate to make up for that. Basically, take home pay could be the same but there's an impact on other things.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "My guess is that OP would tell him she will pay him just to get him to quit the job and then renege.",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 537,
          "content": "There's a commercial pilot shortage in the US. If OP is hurting for money, it's because of mis-management, her husband is in a highly sought after career. \n\nAnd, there are after school programs and teens who want extra cash, OP has power cost options and isn't trying.",
          "id": 162,
          "comments": [
            {
              "score": 218,
              "content": "Pilots are paid well. Agreed that if you have a good paying job and can't afford to pay a babysitter, you're probably not great at managing your money.",
              "id": 163,
              "comments": [
                {
                  "score": 62,
                  "content": "> Pilots are paid well.\n\nSenior pilots are paid well. Pilots at regional affiliates (SkyWest, etc.) are paid peanuts.",
                  "id": 164,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 272,
          "content": "Right? That’s cute. Paid child care is “a no” for her, so he should be saying that unpaid child care is a no for him. Guess we couldn’t work out an arrangement, so you get to pay for child care,Mom!  Since they’re her kids and not his, it works out perfectly. Maybe when he’s moved out she can try and get child support payments from her own son, since apparently now he has to parent her children. FFS.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "> my daughters don't want a babysitter.\n\nHer excuse is that her other kids don't want a babysitter. Since when brats interfere with a sibling's decision to work or study or go to college?",
          "id": 166,
          "comments": [
            {
              "score": 12,
              "content": "So no one should ever have child care because what kid wants strangers watching them?",
              "id": 167,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "The starting hourly wage for a pilot is $20-$50 per hour. On top of that, OP appears to work full time as well. So they definitely do have the money to pay for professional childcare, they’re just selfish assholes who don’t care enough about their own daughters to pay the bare minimum. YTA 100%",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Her reason is that her daughters don’t want a babysitter. I’m sorry. That’s just wouldn’t be a valid excuse for me",
          "id": 169,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "OP says that they don’t want a babysitter because their daughters wouldn’t be comfortable having a stranger in the house.\n\nI feel like there’s a fairly obvious solution: pay the son for his time to baby sit the kids? Is that so difficult? I mean he might not want to anyways since he might genuinely want this job, but at the very least she could *try* compensating him",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6328,
      "content": "Oh my god, no wonder he didn’t tell you. YTA, a million times over. I wish him well saving so he can get far away. Pay someone to watch your kids or change your schedule. He’s not their provider.",
      "id": 171,
      "comments": [
        {
          "score": 1666,
          "content": "But he’s the older brother! He should WANT to watch his younger siblings for free! It’s sibling bonding! /s\n\nParentification is real and is 💯 abuse.",
          "id": 172,
          "comments": [
            {
              "score": 286,
              "content": "Yup! I was expected to watch my siblings instead of doing the usual teenage fun stuff, I moved out as soon as I got a full time job! Rather pay bills than be shouted at for not picking up kids toys and for not keeping them quiet enough. Not my kids, not my problem.",
              "id": 173,
              "comments": [
                {
                  "score": 40,
                  "content": "Me too! I left at 17, pretty much right after I graduated HS. My parents still don’t get it. Just because THEIR parents were even worse, doesn’t mean it’s ok.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Same! I left at 15 to live with a boyfriend at the time while I finished HS. After I graduated I moved states. I had to move back for a month in October 2021 and wanted to pull my hair out. The sister I always had to babysit had been so dismissed since I left she just... Sits there. 24/7. Reminds me of when I did that. I spent the entire month telling her she was enough but it just didn't reach her, after being pushed aside from the moment I left. I can almost guarantee once I left they just pretended she wasn't alive. They did it enough when I *was* there. \n\n\n\nOP, unless you'd love limited contact with your son as he matures and realizes what you've put him through you might want to stop doubling down and seeing him as free childcare. Put the girls in therapy, we all know the narrative that they are \"too young\" is utter BS. My sister is 11 and I want nothing more than to afford her therapy. It's my biggest motivation. Stop with this nonsense. You are *PARENTS*. Act as such!",
                      "id": 175,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Check the second edit.  Apparently he adores his sister's and watches them \"only when he wants to\" \n\nWell guess what OP, he apparently doesn't want to, because he can be doing actual work instead of your free babysitter.  Your girls may be too young for psychiatric medication, but they are not too young for therapy.  That's not really a thing: anyone going through trauma could benefit from therapy.\n\nIt sounds like you're just projecting how you want your kids to feel onto them, about the therapy and about your sons desires.  Otherwise you'd recognize that he doesn't actually want to watch them every time you're gone.  YTA",
              "id": 176,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "New rule, if the person didn't get to have the fun of making them they don't have to have the responsibility of raising them.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 177,
          "content": "I want to go fund me this kid for a deposit on an apartment.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "OP in 10 years: \"Why is my relationship with my son so frosty, and why am I not allowed to see my grandchildren? I just don't understand!\"",
          "id": 179,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5466,
      "content": "YTA\n\n🚩🚩\nHow about you and your husband stop USING AND ABUSING your son🚩🚩\n\nYou and your husband are huge assholes!! Be adults and find childcare for your daughters. YES you need to PAY for child care. You cannot force your son to give up his life to take of of your children. That's the using part. You two are FINANCIALLY ABUSIVE to YOUR SON by NOT paying him wages for the child care. And now that he is a legal adult he is doing the best thing he can for HIMSELF by getting a job, and an education to get the freak away from you two.  You cannot force him to take care of your children. That's what your responsibility is as a parent. You owe him an apology and past wages for that matter. Let go of your son.\n\n\n\nOP stop trying to justify this nonsense\n\n\n>ETA okay, it seems that I did not mention the reason why the babysitter option isn't ideal and is because my daughters don't want a babysitter. they're both dealing with some issues and are unconfortable being with a stranger at home. besides that my son decided to stay with them and we didn't ask him or anything.\n\nYour daughters are your responsibility. If they are uncomfortable then you need to find a solution to help ease them into including therapy for them too ( are you even DOING THIS). Your SON isn't a permanent crutch for your misgivings!!\n\nAlso funny how you claim you didn't ask him to babysit... So that's cool. He didn't ask you about living his life and doing something else besides being your free child care. You have nothing to be mad about if that mess you just spewed is how you feel. NOTHING.\n\n\nOhhhh edit number 2\n\n\n\nNow it's \"not\" a big fucking deal to them... His help isn't that important and he really doesn't do anything...... Funny cause your original post said otherwise\n\n>ETA Okay, some of you here are implying or suggesting that I'm making my son to be the girls' babysitter but that is in fact not true. He doesn't do much for them, just stays home with them while he studies or plays video games. He adores his sisters and only stays with them when he wants to. otherwise we wouldn't force him. Also, my husband said the girls are too young for therapy and I agree with him on that.\n\n\n\nOh look.. her girls have mental health issues..THAT THEY ARE REFUSING TO DEAL WITH. That's cool.. Let your daughters suffer as well because you want to act like a coward and bury your head in the sand pretending nothing's wrong with them.... My God I hope this is a troll.... Those poor kids.\n\nAnd now she's backtracking and saying he doesn't do much. Besides watch them FOR 5 TO 6 HOURS EACH DAY.\n\nBUT THEY DON'T FORCE HIM. So if that's true than wtf even make this post?? Why be so upset him being an adult and working and going to college??\n\n\nEdit....thank you for the awards.... This post blew up quickly.....",
      "id": 180,
      "comments": [
        {
          "score": 1076,
          "content": "That's the bit that gets me. They didn't ask him to babysit. So did they tell him to babysit? Or did he just offer to out of the blue? I know which my money would be on.",
          "id": 181,
          "comments": [
            {
              "score": 313,
              "content": "[deleted]",
              "id": 182,
              "comments": [
                {
                  "score": 13,
                  "content": "He probably offered as to not hear it from her or them. God, the things I’d say to shut my parents up. They say I was lying when I was actually telling the truth and eventually I’d just say “yup I did it”\n\nI also never offered to babysit because I didn’t have to. It was understood that I was forced to do it. There was no conversation. He probably knows he obligated",
                  "id": 183,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 70,
              "content": "Yeah, or he probably just was home and they left the kids there is what i’m getting from that, it seems like they didn’t tell him to but they just basically said “here’s some kids, have fun” and left. Which imo means he can do whatever he wants and it’s none of their business.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Judging from the description of their reaction, I imagine he caved to relentless emotional blackmail about how hard it is to be a parent; how family should help out; how he has all this free time; how he's disrespectful, inconsiderate, and selfish.  \n\nI'll believe they never outright asked. They didn't have to. He volunteered, just to get them to shut up.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Right? Like how is she able to plan her work schedule if his care of the girls is happenstance?",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 598,
          "content": "Apparently she and her husband think the girls are too young for therapy. What?!?!",
          "id": 187,
          "comments": [
            {
              "score": 234,
              "content": "That made me so angry!!!",
              "id": 188,
              "comments": [
                {
                  "score": 421,
                  "content": "It's an excuse. I've seen it hundreds of times from moms like her. Saying their children have mental problems to avoid taking any social responsibility for them but also backtracking against therapy because 'they can't afford it' or 'they're too young for therapy'.\n\nJust simple toxic excuses to justify bad parenting.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 40,
                      "content": "What are they hiding ..looks suspicious to me plus the children don't run the house you do ..get your shit together take them to therapy. ..this whole family is full of red flags ..",
                      "id": 190,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 116,
              "content": "Yeah, that's not a thing. If they have issues that prevent them from participating in normal life situations, you get them treatment. Simple as.",
              "id": 191,
              "comments": [
                {
                  "score": 36,
                  "content": "For real, kids can be mentally unwell at any age. Kids can get traumatized at any age. Kids can face difficulties at any age. \n\nNot dealing with this is just negligence.",
                  "id": 192,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Seriously, when I was inpatient in a psych ward, I've met kids as young as 7-8 who were there for suicide attempt. \n\nThe patients there started at even as young as 5-6.",
                      "id": 193,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "When I started therapy at age seven my shrink had patients as young as three. If you’re verbal you can benefit from therapy, and if the girls are dealing with trauma the time to start treating it is yesterday.\n\nEdit: I meant if the kids are old enough to speak, non verbal adults can clearly benefit and I now see the same for pre verbal kids",
              "id": 194,
              "comments": [
                {
                  "score": 12,
                  "content": "Therapy is good for nonverbal folks/children also :)",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "There really isn't a \"too young for therapy\". It is just about finding the therapist with the right skillset. People under age 4 are usually best served either through Family Therapy or by an Infant Mental Health Specialist. People ages 3-10 need Play Therapy [(funny video explaining why)](https://www.youtube.com/watch?v=Zt3QRLTXZW4) and you can find a Registered Play Therapist through [www.a4pt.org](https://www.a4pt.org). People 8-13 need Activity Therapy with a heavy emphasis on play. Around 13 the emphases can move more towards activities and less on play, but people age 12-18 still need Activity Therapy. Talk Therapy can start as early as 16, but it isn't the ideal for anyone under 20 (though many 18/19 year olds can handle it very well).\n\nTalking is allowed in all of those types of therapy, it just isn't required. Play is a person's first language, and there are decades of research that show the effectiveness of play therapy for resolving all kinds of mental health issues. The older we get and the more our brain develops, the easier it becomes to process issues using words. That's why the type of therapy shifts depending on the age.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Right?!? That makes it even more messed up",
              "id": 197,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 130,
          "content": "handle sloppy ossified wild slim piquant voiceless mighty noxious middle\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "id": 198,
          "comments": [
            {
              "score": 37,
              "content": "My guess is she’s one of those “My children would never go to an awful daycare” moms and she’s projected the fear of paid childcare on the kids. They don’t like strangers? Then hire the person to come over for dinner and play when you’re home a few times before babysitting begins. Now they’re a friend! YTA, OP",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 36,
          "content": "Exactly. \"he only stays with them when HE wants too\".  Then why would OP say \"he's the one who usually stays with them\" because she's at work.  Hmmmmmmm",
          "id": 200,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "Also how old are the kids u/throwawayjob49 has? You can do therapy with younger kids it’s just parents are expected to be there as well. It sounds like parents are just not wanting to deal with their issues bc it would take work on their part and are letting them get worse",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "> He adores his sisters and only stays with them when he wants to. otherwise we wouldn't force him\n\nThe guts to claim something like that, when the post is literally about trying to force the son to keep babysitting when he doesn't want to do it any more.",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "To young for therapy? Child psychologist are a thing. And it sounds like they need therapy.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2597,
      "content": "YTA \n\nHe does not owe you childcare. He is allowed to make decisions regarding his own life and a part time job is *absolutely* something he has a right to without consulting you first. \n\nTake care of your own kids or pay someone else to. Full stop.",
      "id": 204,
      "comments": [
        {
          "score": 472,
          "content": "OP just wants to make sure that her son graduates with absolutely zero real world job experience. That way, he can struggle and stress not being able to find work after his degree. Then, it'll be the perfect time for them to decide that they don't need free child care anymore so they can throw him out on his ass for him to bE hIs OwN mAn.\n\nPretty standard shitty parenting.\n\nOP's son is smart. He knows he can't count on his parents to look out for his best interests, so he's doing it for himself.\n\nYTA, OP.",
          "id": 205,
          "comments": [
            {
              "score": 65,
              "content": "My instant gut reaction to this was that if he went with their wishes the rhetoric would flip to \"you're an adult you should've had a job ages ago so we're kicking you out\" within 3 years",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "YTA\n\n1 - your son is 18 years old and should be allowed to have a life outside of the home\n\n2- your son is 18 years old and doesn’t need your permission to get a job\n\n3-your son is 18 years old and doesn’t have to be your unpaid babysitter\n\n4- you’re 18-year-old son is not the kids babysitter and doesn’t do much  for them, except give up any opportunity outside of babysitting\n\n5-your son is 18 years old, let him have a life that doesn’t include being subservient to you and your his step father\n\nIf it’s not clear, YTA",
          "id": 207,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2467,
      "content": "YTA you should be proud of him for actually working towards his independence. Older children are not free labor for parents. Get a babysitter.",
      "id": 208,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1224,
      "content": "How is your son responsible for your family? YOU decided to have children, YOU look after them. Stop expecting your adult son to give up his own life to take care of your children. Having a job will teach him a lot and it's perfectly normal to be working at his age and while in college. YTA",
      "id": 209,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1057,
      "content": "Lol Either you’ve never been on AITA, and really clueless about how rude it is to expect free childcare from your teenager, or you’re just trying to start shit, knowing how angrily people will respond to this",
      "id": 210,
      "comments": [
        {
          "score": 326,
          "content": "Seriously, how many people in this sub are childfree purely because of the trauma of parentification by their own parents? It's so common to hear from posters here, and it's just tragic.",
          "id": 211,
          "comments": [
            {
              "score": 24,
              "content": "Me me meeee! Although I raised my mother, I didn't raise other siblings. Thankfully she stopped after 1.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This was my first thought. No way she's spent any time here and expecting to be not the AH",
          "id": 213,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}