{
  "post content": "My boyfriend (both 20, been together around six months) and I were getting drunk together on Zoom last night and playing a good-natured game of truth or dare. For my truth, he asked me if I would ever post/send nudes to make money and I said \"Hell yeah! I already have actually...\" He thought I was fucking with him at first, but when I told him I was serious he kinda freaked out and asked me what I posted, what type of posts, etc.\n\nI explained to him that my ex and I used to post videos of us having sex on Pornhub to help him pay his tuition and for his mom's chemo. All the videos were amateur and anon and none of our faces were ever in them. We developed a pretty popular profile and some of our videos racked up close to one million views. My boyfriend was shocked speechless at this point and kept asking me if I was joking, and because I was drunk I just kept going and trying to over-correct (I knew I was digging myself a hole, but I just kept talking). I told him we only did it for about a year and after we broke up, he deleted all of the videos from our account. My boyfriend asked me if I was forced into doing it for his pleasure/gain and I said no, I really enjoyed it. I really did not see a problem with it at the time—and I still don't—since I was so in love with him, we had a phenomenal sex life, I liked being filmed, and I was helping my him pay for college.\n\nWell, my boyfriend did not take to that well at all despite me reassuring him that I was always anon, the videos are deleted, and that I no longer film myself. He looked literally heartbroken and said that he was really upset and needed time to process this. He also asked why I didn't tell him earlier to which I responded that I didn't think it was something that I needed to disclose, but that I never tried to intentionally keep it from him. He then just hung up on me and texted me that he needed time. I respect that and left him alone.\n\nHe texted me this morning telling me he thinks he failed his midterm because he couldn't concentrate. That really hurt me because now I think it's my fault. I just really did not expect him to get that offended. He's definitely a fair share more conservative (raised in a very religious family) than the other guys I've dated, but our values and beliefs align on the biggest issues and we've never had a problem with it before. I don't know...AITA?\n\nEdit: Lol why do I feel like this post was infiltrated by incels?? There's a lot of hate here for women and the way they use their bodies for no apparent reason. \n\nUpdate: Boyfriend texted an hour ago saying he wanted to FaceTime and talk it out. I'm about to call him, we'll see how it goes down.",
  "id": 1,
  "comments": [
    {
      "score": 670,
      "content": "NAH.  I'd normally say that would be way over the line of TMI and the exploits with a past partner really should not be shared with a current one, but he did ask.\n\nI can see that being a very bitter pill to swallow.  Logically, he should be able to say that it was in the past and you're with him now, so that should be enough. But, relationships aren't all logic. They're also emotion.  \n\nIt's just a shit situation. Sorry.",
      "id": 2,
      "comments": [
        {
          "score": 291,
          "content": "I agree with the everything in this comment, but it was a total asshole move of the boyfriend to say that he failed his midterm because of this. No one is responsible for his actions except for himself, and this move comes across as manipulative. \n\nNTA, OP.",
          "id": 3,
          "comments": [
            {
              "score": 99,
              "content": "Totally agree that it was an asshole move for him to blame failing his midterm on it.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Not to mention, he was getting drunk the night before his midterm. Something my psychology professor told me in college - when you sleep, your brain consolidates the day’s memories into longterm memories. Drinking affects the brain’s ability to do so. If he studied at all during the day but got drunk that night, that also contributed to him struggling with his midterm.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "Yeah, I'm hoping he takes his time to process and ultimately decides that what I did in the past has no influence on our current relationship. Also, I am totally beating myself up for over-sharing, but whenever I'm drunk I always feel the need to keep explaining even when I know the situation is getting shittier. Thanks for the support!",
          "id": 6,
          "comments": [
            {
              "score": 13,
              "content": "[deleted]",
              "id": 7,
              "comments": [
                {
                  "score": 14,
                  "content": "I don’t know that commoditizing sex says anything about your views on sex in this day and age. Media is EXTREMELY sexualized. Advertising is sexual. Hell, look at celebrities - Kim Kardashian isn’t famous because people think she’s smart. She’s famous because of her sex appeal and she commoditizes sex to further her brand image. Making porn is a step farther, sure, but it’s not like OP was a porn star acting in cast scenes with varying partners (which there is also nothing wrong with, but I could see your point a little more because sex is their entire livelihood).\n\nI totally get if you’re (General you, not you specifically) religious or conservative sexually or sex is special to you and your relationships & it’s completely fine to have those views! But I think you can both commoditize sex and separate romantic, loving sex from what you’re doing to make money.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I really fucking hate how people say this. It's so bullshit. You can separate the two. It says NOTHING about how she views a perfectly monogamous relationship Jesus Christ",
                  "id": 9,
                  "comments": [
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -8,
              "content": "Hope it will be Ok.  If he's a good guy and really cares about you, it should be.  But yeah, going forward you might want to not mention that kind of thing again. \n\nYou don't owe people a full report of your life by virtue of being in a relationship with them.  Not 100% kosher, but if you need to tell a white lie or two to maintain your privacy, just do it.",
              "id": 11,
              "comments": [
                {
                  "score": 57,
                  "content": "can we not imply that because he isn’t okay with this he isn’t a good guy or doesn’t care? yeah she’s with him now, but some people aren’t comfortable with that and if he isn’t then that doesn’t make him a bad person. if he went on to shame her etc that’s different",
                  "id": 12,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Thank you!!!\n\nSex is a super personal thing, and he isn't some kind of monster for preferring to be with someone whose shares his feelings about sex. \n\nI could never be with someone that sees sex as a transaction to be bought/sold. I would not be comfortable being with someone whose sex life has been on view for a million people, when it's something deeply intimate and personal for me. \n\nActions have consequences, and OP is finding that a consequence of being in porn is that not everyone is comfortable dating someone who did porn. That doesn't make her or her boyfriend in the wrong.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "That's fair.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -13,
                  "content": "OP should've just tell him \"Yes! I would do it\" not mentioning the fact that she already did it with her ex. Completely unnecessary info that she should've shared sometime in the future and with more tact, but she was drunk so...",
                  "id": 15,
                  "comments": [
                    {
                      "score": 1,
                      "content": "On the other hand, boyfriend could have not asked a question he wasn’t ready to hear the answer to. If you ask a question, you are opening yourself up to whatever the response may be.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I think what makes the pill more bitter is perhaps the shock of OP being so excited to tell him (likely by virtue of being drunk, I don't think it was intentional)? I'm not saying that's necessarily wrong, but if OP had said \"oh, yeah I did once, but that was ages ago, and its been deleted\" first, maybe he wouldn't be quite as upset? (not that I'm saying OP should have said that, just feels like sometimes this kind of news is best delivered without coming across as being really proud/excited about it, even if you are, which is fine, but can he hard to hear).  \n\n\nHell, even your partner being excited to tell you about non-sexual past partners can leave a sting for a lot of people, it's not their fault by any means but, like you say, a shit situation.  \n\n\nAlso I appreciate that you mention that relationships aren't all logic, its often far too understated here in my view.",
          "id": 17,
          "comments": [
            {
              "score": 7,
              "content": "She also said that she really enjoyed it? And it was a phenomenal sex life? Like what? Does she not care about her boyfriend and at least try to make the situation better?",
              "id": 18,
              "comments": [
                {
                  "score": 2,
                  "content": "\"Hey hun, I was gaggin' on my ex's dick and filming it. So get over it, kk? Oh btw ur an incel if you complain.\"",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 295,
      "content": "NAH, he’s allowed to be upset and you’re allowed to do what you want with your body",
      "id": 20,
      "comments": [
        {
          "score": 101,
          "content": "True, but he's not allowed to pin failing his midterm on OP.  Which is exactly what he did, without saying it explicitly.\n\nGonna say that makes him TA.",
          "id": 21,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 251,
      "content": "NAH, but he's not an asshole or immature if he leaves. That would be a deal breaker for me, too",
      "id": 22,
      "comments": [
        {
          "score": 6,
          "content": "This.",
          "id": 23,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 193,
      "content": "NAH- i can see why you wouldn't have thought to disclose this to him, after all, the videos were anon and no longer exist.  \n\nBut i cant help but think i wouldn't have been too happy to learn about this either, personally. I think i would've taken it better, but i still wouldn't have been happy about it.",
      "id": 24,
      "comments": [
        {
          "score": 93,
          "content": "Nothing is ever completely deleted, but the Anon point stands.",
          "id": 25,
          "comments": [
            {
              "score": 96,
              "content": "Yeah I mean let’s not kid ourselves, those videos are definitely still out there somewhere.\n\nWe got told a lot of lies during our childhoods. “Once it’s on the the internet, it’s forever,” is not one of them.",
              "id": 26,
              "comments": [
                {
                  "score": 24,
                  "content": "She said some of their videos had close to one million views. Every single one of their videos were saved and moved to other websites by someone else. It always happens.",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 158,
      "content": "NTA Six months is not a long relationship. The fact that it came up that early is good. What are you supposed to do? Tell someone you did porn before with an ex on the first date? No.",
      "id": 28,
      "comments": [
        {
          "score": 1,
          "content": "Six months can be a very serious or a completely non serious relationship lmao",
          "id": 29,
          "comments": [
            {
              "score": 1,
              "content": "True, but six months is still a pretty new relationship",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -17,
          "content": "If it was anon. You keep that shit until the grave. \n\nSome things are best left unshared.\n\nESH.",
          "id": 31,
          "comments": [
            {
              "score": 9,
              "content": "NAH it's not wrong to have an emotional response to it but it is an AH move to expect someone to hide their past sexual behavior when specifically asked about it. It's not shameful, and OP shouldn't be shamed for it.",
              "id": 32,
              "comments": [
                {
                  "score": 0,
                  "content": "They were playing truth or dare..and she started this whole line of questioning by volunteering that she had already did amat anon porn..\n\nThis will be a deal breaker for some people. Knowing this, if you reveal this secret to a SO that you love, there is a chance they bail. Shaming has zero to do with it imo.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yes and if it’s a deal breaker they break up. It would be immoral to hide something from your SO if you knew it would be a deal breaker for them. I don’t think he’s TA if he breaks up with her I don’t think she’s TA for revealing something she did without shame.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 135,
      "content": "NAH, but girl what you said about your values and beliefs aligning in big things? They don’t. Sex is a big thing. A huge thing in relationships and the fact that you don’t see you having sex tapes in your past a big deal (which isn’t wrong) and him thinking it is, is a ginormous disconnect. He’s a man, he’s visual, and he apparently has some conservative opinions about sex. Him guilting you about failing a midterm? Guy don’t DRINK before a midterm like damn. Either way I don’t think your paths and outlooks aren’t as aligned as you think.",
      "id": 35,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 122,
      "content": "I think the poor midterm showing was probably more from the alcohol than the porn revelation, TBF. \n\nNAH - past exploits with an ex are in the past. I don’t feel you should have to discuss them if you don’t want to. You didn’t lie when it came up in the game, you were truthful. It was a shock for him, I think that’s expected. I don’t see either party in the wrong at this point.",
      "id": 36,
      "comments": [
        {
          "score": 3,
          "content": "If you were with a new partner, you wouldn’t care if they previously did porn and disclosed the fact? Maybe a simple “hey btw millions have seen me been railed and thousands have it saved on their computer” would have sufficed.",
          "id": 37,
          "comments": [
            {
              "score": 3,
              "content": "They’ve been together 6 months, they’re still very early days, still learning about each other and revealing things about themselves. I think that it’s not unreasonable to have not discussed it at this point.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 68,
      "content": "I was N A H until he insinuated that it's your fault he did poorly on his midterm. After wasting almost a decade with a manipulative ass, that shit doesn't fly with me. NTA. He's allowed to be uncomfortable and want some time to reevaluate if he wants to move forward with the relationship. But dude is an adult and needs to take responsibility for his own actions and drinking the night before an exam is 100% his own bad choice",
      "id": 39,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 61,
      "content": "NAH. You didn't lie, you elected not to share information about your pre-relationship sex life. That's just polite.\n\nNow. If he's not comfortable with the fact that potentially a million people have seen you having sex that's his prerogative and we can't hold it against him",
      "id": 40,
      "comments": [
        {
          "score": -30,
          "content": "If he consumes porn it sure makes him a hypocrite though",
          "id": 41,
          "comments": [
            {
              "score": 35,
              "content": "It really doesn't.  \n\n\n\"If you use pipes but don't want to be a plumber, you're a hypocrite\"",
              "id": 42,
              "comments": [
                {
                  "score": 3,
                  "content": "That's not a sound analogy imo.\n\nA better one would be \"I like when a  plumber fixes my pipes but I would never date one cuz ew, that's gross, they touch toilets.\"\n\nPeople who are willing to watch porn but would never date someone who's done porn are basically admitting they look down on porn actors. You're okay with using them as jerk-off material, not okay with dating them. If that's the case I honestly don't think you have any business watching porn.",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": -11,
                  "content": "I don't think it's quite the same thing. If he uses porn why would he look down at the performers, for want of a better word? If you use pipes but think the existence of them is horrible and icky then you are ridiculous",
                  "id": 44,
                  "comments": [
                    {
                      "score": 21,
                      "content": "he is NOT looking down on performers. he’s just uncomfortable because he probably wants his own, personal sex life to be private, and OP didn’t share that sentiment. duh.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "[deleted]",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 56,
      "content": "NAH- He's upset because it's become clear to him that y'all don't have the same morals/values. Morals and values are important in a serious relationship. \n\nI won't get into the morality of making porn. But just the fact he's not an asshole if he leaves you.",
      "id": 47,
      "comments": [
        {
          "score": -36,
          "content": "what exactly does this say about OPs morals? please elaborate.",
          "id": 48,
          "comments": [
            {
              "score": 59,
              "content": "some people think sex is supposed to be a private and intimate act to only be shared with it's participants. \n\nmorality defined as \"principles concerning the distinction between right and wrong or good and bad behavior\" - but it's subjective, not objective. what some people see as right and good, others see as wrong and bad.",
              "id": 49,
              "comments": [
                {
                  "score": 2,
                  "content": "If they believe that but watch porn, they're not living up to their own values though.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 34,
              "content": "That they are most likely different from OP's bf's morals. It seems from the post that this isn't something he views as good while she's fine with it. Since sex and morals surrounding sexuality hold quite a bit of weight in relationships, it could be something that impacts their relationship greatly.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}