{
  "post content": "I (26M) am an orphan of the \"left at the doorstep of the fire station\" variety. No name, information, birthday, anything. I guess I wasn't a very cute kid, because I was never adopted. Then I went through a series of foster homes and the things that happened made me wish the US had actual orphanages, because at least workers are there for money, not whatever twisted fuckery they think is \"parenting.\"\n\nI grew up bitter and worked hard, desperate to prove myself on the off chance that they'd see and come back. When no one was there for high school graduation, I broke down. Then I let go of the resentment, but in order for that to happen, I also let go of ever wanting anything resembling parents.\n\nI went to college and then got into med school. Not because of a particular interest in medicine, but because no matter what happened, someone would always need a doctor. I fell in love with a classmate and we started dating. I never told her that I was an orphan, only telling her my parents were chronically absent (true) and someone else took care of me (also true).\n\nAfter two years of dating, she proposed the day after our graduation six months ago. I was so happy that I finally had physical evidence (and a rather expensive ring at that) showing I was worthy of being loved that I didn't remember parents are at weddings, so I'd need to tell her.\n\nedit: the \"physical evidence\" bit was tongue in cheek. I grew up without gifts like that and I learned to make do. The salient part is that that was the happiest that I've ever been, and I didn't want to jeopardize that by unloading my past.\n\nWe matched at the same hospital where her family lived, so we moved in together there, and after the 12th unsolicited visit from her mother asking what our plans for the wedding was, I decided to tell my fiance in a probably crude way. I told her that my parents were chronically absent because I didn't know who they were and \"someone else\" was the foster homes. After asking a couple questions, she ran away to her parents to discuss my parentlessness, then they all came back for dinner.\n\nMy prospective MIL said that she and prospective FIL wanted me to think of them as my parents from now on and that she'd be my mother for the wedding. I thanked them but said I wasn't interested in having parents of any kind. But, she insisted, everyone should know a parent's love. I made a joke about a mouse in my research eating its baby. She pushed again and I said it'd be akin to stepsibling incest. Then PFIL slammed the table and yelled at me for not taking his wife or daughter seriously, and I snapped, telling them to get a grip and go find my parents if they wanted me to have them and God I hope they have better luck than I did. They shut up and left.\n\nLater, my fiance and I were going to the room they were holed up in to apologize and talk calmly, when we overheard them talking about the situation. They were really concerned...about what it would look like to Gramps if his granddaughter was marrying an orphan. See, that's the kind of thing I've come to expect from parents.\n\nBut my fiance is still upset and demanding to know what else I'm hiding from her. The answer is nothing, her parents and her gigantic family that won't fit in a damn farmhouse are obviously important to her but I never knew mine so this wasn't a huge secret, just something I didn't like talking about.\n\nAITA? or even if I am, is there anything else I could've done to get a better outcome?\n\nsome clarifying details:\n\nWhen I made this post, I knew Lola's (fiancee (I can't believe I've been spelling it wrong this entire time and no one pointed it out)) family was rich but there's rich and then there's influential, both of which they are. I only knew about the latter part in vague details before the events happened because I didn't care before and Lola becoming a doctor was in part an effort to break away from the mold of the family so she doesn't like going into too much detail.\n\nThey are deeply entrenched in the businesses and local government of the US South and are conservatives, so my lack of heritage is a problem to them not only in a social lens but also in a practical one in terms of possible scandals/campaign ammunition (eg \"your homelessness policy sucks horse cock and yet your son/nephew/grandson in law was 12 dollars away from being homeless in 2014. Curious.\"). That's why it's become an issue. Prospective FIL has been told point blank that they don't want a \"nameless bastard\" marrying into the family.\n\nupdate:\n\nThanks everyone for the comments. Mostly everyone has been pretty helpful, even if I disagree (and if you weren't, I raged at you, so the universe is in balance) and after taking a step back, I've seen some of the faults in my thinking.\n\nre: AITA?\n\nI'm the asshole for keeping my status as an orphan from Lola only for the reason that she is the person I've decided to dedicate my life to, so I should trust her with everything about my life. I don't agree that I should've told her because if it turns out she has a problem with orphans, that's wasted time for both of us (more on that [here](https://www.reddit.com/r/AmItheAsshole/comments/zfe8sv/comment/izicjhp/?utm_source=share&utm_medium=web2x&context=3)), nor do I agree that I lied. I was never under the illusion that I could keep it a secret forever, but I don't see the issue in having waited past a year or six months or whatever subjectively defined timeline you (in the royal sense) personally might've wanted to know about it. All relevant factors (eg not being a Strong Family Man) are exactly the same whether I'm an orphan or just have really absent parents.\n\nI'm the asshole for saying vulgar shit to prospective MIL and FIL in an attempt to distract away from the topic of me considering them as my parents. They've apologized for not taking more time to understand my situation. They simply thought didn't have parents = wants parents. I've apologized for what I said. I'm glad that a lot of replies here are understanding of my desire to just leave the \"parents\" section of my life blank; PMIL and PFIL still think it's just a defense mechanism that I'll eventually get past.\n\nre: therapy\n\nNot entirely sold on talking to a therapist instead of just talking to her, but at least one of the two is happening.\n\nre: Lola\n\nWe are doing extremely well. I figured I'd be, at the very least, occupying the couch for a bit, but on the first night, she came out after brushing her teeth telling me to hurry up and come to bed as if it was my fault or something. Sometimes dreams do come true.\n\nThere's been a little adjusting as she comes to terms with the new information, but she trusts that there's not anything else I'm hiding and I'm not.\n\nre: the family's reaction and marriage\n\nWe're still engaged, but most of her family is adamantly against us getting married for the reasons laid out above. Her parents are one of the few on our side (oops). Hope things can cool down so we can get married without incident but it's out of our hands for the time being.\n\nre: people that think this is fake\n\nconsume my nutritionally deficient testicles\n\nThanks everyone for taking the time. I fell ill after everything happened so I called out of work and spent a lot of time on here, but it's time to get back to life and moving forward. \n\n&#x200B;\n\n ",
  "id": 1,
  "comments": [
    {
      "score": 3176,
      "content": "You have to admit that you intentionally deceived her (aka lied) for a few years so if nothing else you are the A for that.\n\nYour future in laws were trying to do something nice for you but took it too far so they are As for that.\n\nWho the hell cares what grandpa thinks.\n\nThe one thing you are not an A for is wanting replacement parents. With what happened to you I don't think anyone could blame you.\n\nESH\n\nAlso, did your fiancé give you an engagement ring too? Don't see that often.",
      "id": 2,
      "comments": [
        {
          "score": 798,
          "content": "She did. I have a nonexistent taste in fashion and she probably didn't want to see what I turned up with. She knows jewelry far better than I do.\n\nI guess I should mention that her entire family is very well off and from old money as far as I can tell. Realistically speaking Gramps is probably not the only one that takes issue. \n\nShe's the first woman in her family to be a doctor and she told me that that caused tensions, so I'm not exactly enthused at the blowout of her marrying an orphan. Her family is important to her and I don't want her to have to choose between them and me. Maybe I should've just kept my mouth shut lol.",
          "id": 3,
          "comments": [
            {
              "score": 661,
              "content": "Up til the parents in law offering to be 'parents' it was great.\n\nBut I have no clue why they kept pushing so hard after you said you were uncomfortable with it. I guess they had no idea you would push back against something they thought was unambiguously nice in their mind.\n\nThat being said, they clearly like you(pushing for the wedding), and getting over the initial shock and quickly offering to be 'parents' is pretty commendable.\n\nAlso, their concern with grandpa could just be it, concern about grandpas opinion, NOT about your 'heritage'. People are always not the best equipped to handle new situations.\n\nAll things considered, this could be a matter of good intentions gone too far, maybe a good heart to heart conversation would be helpful.",
              "id": 4,
              "comments": [
                {
                  "score": 189,
                  "content": "It looks to me like OP’s fiancée’s parents are very attached to a certain wedding format, which has a set role for the mother of the groom. (A groom-mother dance, or similar.) Faced with OP’s lack of parents, they wanted to contrive something that would fit their chosen format instead of adapting the format to reality. Though even the version of OP’s background they thought they knew wouldn’t provide parents appropriate for special roles in OP’s wedding.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Yes. And there is a possibility for compromise in this. I completely get why OP doesn't want to consider his inlaws his parents. But maybe he can take them up on their offer for the wedding and talk through the procedures and who can assist him in this.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I bet the fiancee's parents also never thought about how OP has has \"parents\" forced on him his entire life, and has never had anything come from any of those relationships, really.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Having been adopted myself, I can say a LOT of people THINK they understand but have no clue. It's really extremely annoying having to say over and over again that I don't want to do shit like ancestry.com because I have absolutely no interest in meeting \"family\". People just can't accept that. Unlike op (and probably because I was adopted into a good family) I'm very upfront about it, because I want to know if she's going to do that shit because I'll just end the relationship immediately rather than deal with it.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Lol I don’t think that’s what match.com does.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Yup. My late husband was adopted by close family and wanted to know about his background.   \n\n\nWhen he and his first wife married, they adopted two kids. Their kids had no interest in knowing about their birth family at all. In the end, one of them sought some info from the adoption society, but only because they developed a certain medical condition.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "I think it would be interesting from the perspective of finding out general info like ethnic background. I believe you can remain anonymous on those sites so no one could reach out to you.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 187,
              "content": "If you want to marry this woman you did the right thing in telling her. Hopefully it all works out for you. Congratulations on your engagement and recent graduation from med school.",
              "id": 12,
              "comments": [
                {
                  "score": 95,
                  "content": "I meant maybe I should've just gone along with her parents' plan. Maybe that would've smoothed things out with the whole family a lot better. \n\nThank you, it's been a long journey and it's not over yet.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 205,
                      "content": "I don’t think you needed to give in and go along (and they pushed much too hard) but I think it might have gone better (and maybe you can still do this) to respond a bit more like this rather than with incest/mice eating: \n\n“MIL, FIL thank you for the kindness of your offer. I havent had a good experience with parents and so would be more comfortable looking forward to gaining you as such thoughtful parents-in-law when I get to marry my love.”\n\nEdit: sounds like from your other comment you may have done this first. I’d stick with the above script if it comes up again and hopefully your fiancé will intercede and explain. you are gaining family and in laws when you marry.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 129,
                      "content": "It sounds like you reacted emotionally and it came out more aggressive than needed. They were trying to be accepting and make you feel ok and you responded by blowing up and getting literal about it. It's not about going along with it, it's more about misunderstanding the intent, which is understandable because that sounds like a super high pressure situation.\n\nA few things:\n\nIt doesn't matter what money they have. You're both doctors. You'll be rich regardless. It's not a factor even if they cut her out. \n\nYou need some therapy to work through your feelings about family because even though you might have been fine until now, you're about to get your own family and that deserves some attention and care to your mental health. You might need therapy again if you decide to have kids or at other moments. Do it, take it seriously, set some goals about how you want to relate to other. It'll make you a better partner.\n\nTalk to your fiancée about what happened. Admit that you were rude or overreacted or whatever. Hear from her what her concerns are. Did she assume you were from a wealthy family because absent parents + nanny is a common rich family arrangement? Did she tell her family you were from a wealthy family? Is she worried about other things like not knowing about genetic issues? You want to be married to each other, communicate and get on the same page. \n\nIf things go well with your fiancée, apologize to her parents like this: \"I'm sorry for the way I reacted. I know you were trying to be kind and welcoming by saying you would now be my parents, but instead of hearing that empathy, I got sidetracked. This is not something I usually discuss with anyone and I was caught off guard. I hope to be a great son-in-law and I hope we'll have a close relationship that will continue to develop naturally. I'm not ashamed by my lack of my parents and I hope you won't be either.\"",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "All you had to do was say thank you. It's not like Mil wanted to breastfeed you.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I think you could have thanked them for their sentiment and their concern and that you are fine,  and are looking forward to getting to know them better.  You could have even said the words parents and mom/dad are emotionally difficult for you and you will need to go at your own pace, but you want to build a good relationship with your in laws.  They weren't going to have you sign a letter in blood, this wasn't committing to anything.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "From me, NTA. There's a lot to unpack and no easy, 100% accepted way to say \"I'm an orphan.\" There's a LOT of judgment about someone's family, and in your case it's lack of family. Hope you get all the grace, goodwill, and patience that you've earned.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Personally, I’d say don’t set a precedent of caving with them or it will never stop",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -3,
                      "content": "Maybe take it one day at a time.  You have never had that kind of 'family' sense so you are possibly hesitant.  Let them know this and that you need to take it one step at a time.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "You poor thing. Look, you have giant amounts of trauma about families and parents because of what must have been appalling mistreatment by multiple sets of “parents” through your whole childhood. I’m so sorry.\n\nJust the mention of parents already has your hackles up. You’re so sensitive about it you couldn’t even tell your girlfriend for over two years. Even if your wife’s parents were the most understanding, gentle, trauma-sensitive people in the world, this would be really hard for you. However, they are not. They are just regular, sort of snobby, sort of obsessed with heredity, people.\n\nThis is going to be really, really hard. NAH because this is kind of nobody’s fault except the foster system’s.\n\nYou need therapy, my friend. Not because you’re screwed up or you did something wrong. Not because you’re in the wrong or because you have to learn to accept her parents as yours. Just because this is a difficult situation and you are not going to be able to deal with it well, and you need help.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "NTA, but maybe having people who consider you their son wouldn't be so bad. And try to be open to people who offer you their love. Good luck and congratulations.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "This won't be the only issue. You're gonna have to sign a prenup too, so don't get offended by that.",
              "id": 23,
              "comments": [
                {
                  "score": 19,
                  "content": "Oh I'd do that gladly. I don't care about any of the wealth, nor do I give a shit about their \"image\" if I'm in it. Unfortunately the latter is way harder to fix than the former.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Will you take her last name? If there is an option for that. Or each of you are keeping their own last name",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "NTA- because you have scars. That’s normal. As someone who had a troubled childhood themselves , work on allowing people to love you. It’s hard and feels uncomfortable at first, but you deserve it.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">so I'm not exactly enthused at the blowout of her marrying an orphan. \n\nYou use a few phrases like this, and I'm absolutely blown away by how big a deal this seems to be. I completely understand being upset about the lying and the sudden revelation, but I don't get why being an orphan specifically is a problem.",
              "id": 27,
              "comments": [
                {
                  "score": 1,
                  "content": "It's about family image. They're a very influential family in the US South - business owners, CEOs, local government politicians, etc - and their base is very conservative. They didn't like me very much when I met them last year, but since I was a doctor they were willing to overlook my relative lack of prestige. Now that they know I'm an orphan, not only do I have nothing to bring to the family but there's also the stigma and they're no longer willing to deal with it. Neither Lola nor I like their politics much so we don't talk about it, but I looked into it and yea these people are the types to kill homeless people to solve the housing crisis.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I understand the game of thrones style family stuff they're into, even if I think it's dumb. But I still don't get the stigma. They already assumed you were from a poor family with no influence. Why do dead parents make it worse?",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "She’s not choosing between her family and you. She’s an adult living her life as she sees fit. If Gramps has an issue, it’s his issue, especially since his objections seem to stem from sexism and elitism. If he issues an ultimatum regarding your marriage, then he’ll be the one “making her choose.” Personally, I wouldn’t be too invested in a relationship with a relative who tried to dictate my career or my relationships. He sounds bigoted and controlling. She would have needed to establish boundaries eventually if she wants the freedom to live on her own terms. This is just the first line she needs to draw.",
              "id": 30,
              "comments": [
                {
                  "score": 4,
                  "content": "Old Gramps was more or less fine with her breaking off from the family business because she was pursuing a prestigious career, but he wasn't impressed with me the first time we met last year and he certainly isn't now. I hope that it doesn't come to this, but with the amount of influence Old Gramps has on the family, it really might become a choice that has to be made.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Naw, dude.  You did nothing wrong.\n\nIt's your past, it's your choice whether or not to discuss it.  It's also entirely your choice to not accept \"replacement\" parents.\n\nI get how you feel, to a point.  I was adopted, I was given up at birth, too.  You aren't really an orphan, your bio parents are likely still alive, just like mine.\n\nAnd, I totally get how the gift, to you, is a concrete symbol of belonging.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My fiance has an engagement ring. We're planning a long engagement and I asked him if he wanted one. He thought about it and decided he did so we got him a cool meteorite and opal ring.",
          "id": 33,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "No, he's not.\n\nNTA\n\nHis past, and if he didn't want to discuss his parentage, or lack of parents - that is entirely his right.\n\nWho his parents were is utterly moot.",
          "id": 34,
          "comments": [
            {
              "score": 1,
              "content": "If it were just some random person he was hooking up with then I'd 100% agree with you, but it's not. This is his fiance. He has to be honest with her about it. It would be one thing to say, I don't want to talk about it. It's another to lie.",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "INFO: What does their “old money” come from? \n\nThis could explain why they’re so hell bent on an “other” marrying into their family.",
          "id": 36,
          "comments": [
            {
              "score": 1,
              "content": "Don't know where it originates. The family business(es) is kind of a conglomerate nowadays, but from what I can tell (with 0 understanding of business or economics), their most profitable ventures are high end fashion (prospective MIL is a designer) and real estate. They're also deeply entrenched in local government as Republicans.",
              "id": 37,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1049,
      "content": "I don't think you're ready to share your life with someone yet.\n\nIt's understandable you don't want a parental figure in your life, but that was an AH way of shutting down someone who could literally have no concept of what you've been through trying to tell you they want to support you and be your friend.\n\nYou need to work through your issues with some professional help.",
      "id": 38,
      "comments": [
        {
          "score": -63,
          "content": "> I don't think you're ready to share your life with someone yet.\n\nThat's a cruel thing to say to someone who's about to get married. \nJust because he have some self - work he need to do, dosn't mean he don't deserve love.",
          "id": 39,
          "comments": [
            {
              "score": 87,
              "content": "It’s not about deserving love, it’s that he doesn’t seem ready for marriage and the responsibility and commitment that it entails if he reacts this way to his future in laws trying to reach out. He needs to work through his issues, and it looks like he has already rebuilt bridges with his future in laws which is a good start towards being ready.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -66,
          "content": "Disagree. He needs a relationship with someone who understands him. Unfortunately the number of people that can fulfil his needs is severely limited.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -74,
          "content": "Bullshit!!  \n\nHe doesn't like to talk about it so he needs therapy?  WTF?",
          "id": 42,
          "comments": [
            {
              "score": 56,
              "content": "No, he needs therapy because he said it was his fiance proposing that showed him he was worthy of being loved.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -77,
          "content": "I think it's really creepy to gatekeep who gets to be in a relationship and who doesn't.",
          "id": 44,
          "comments": [
            {
              "score": 126,
              "content": "> I think it's really creepy to gatekeep who gets to be in a relationship and who doesn't.\n\nYeah okay. I don’t think anyone is  gatekeeping. They’re offering perspective. \n\nOP himself was so happy to “have evidence of being worthy of being loved” when his partner proposed. Someone that unsure of their own worth is likely to tank the marriage if they don’t do their work first. The secretiveness alone is very worrisome. It’s not saying that OP is not allowed to be in a relationship, sure he is, but that he’d be doing everyone a huge favour if he did his work before rushing into marriage.",
              "id": 45,
              "comments": [
                {
                  "score": -18,
                  "content": "They literally said \"I don't think you're ready to share your life with someone else\"",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -43,
                  "content": "Why is it worrisome? Lots of people don't like to talk about or otherwise downplay really shitty things that have happened their lives. That doesn't make them liars or dishonest or bad people. That makes them human. \n\n&#x200B;\n\n>Someone that unsure of their own worth is likely to tank the marriage if they don’t do their work first.\n\nCitation needed.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 27,
                      "content": "It does make them human but if you shut out the person you're supposed to trust the most until they find out that you have been hiding very big part of yourself it makes them question how much they really know you",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -213,
          "content": "I have no problem with being friends, but it's parents that I don't want. And I did tell them that politely the first time. Then yeah I joked about stress induced filial cannibalism in mice and step-sibling incest but that's how I deal with it. \n\nEither way, I gave them 3 chances to back off. Are you suggesting I should've gone to more when that's already 2 past the limits of my patience on this particular topic which, as you say, is obviously sensitive for me?",
          "id": 49,
          "comments": [
            {
              "score": 263,
              "content": "So they shouldn’t have pushed. However, just because joking is ‘how (you) deal with it’ doesn’t make it OK and not an AH thing to do. I think you were a bit confrontational from the start with the ‘of any kind’ statement.\n\nYou not wanting parents is understandable, but getting married comes with parents-in-law. They will be ‘parents’ of some kind through your wife, so if you want to get married you better get used to the idea. And I can see where they were a little taken aback by your initial very hard refusal. \n\nA better way to approach this: “Thank you for your kind offer, but I am uncomfortable with the idea of having parents. I’ve never had parents, so it’s not something I personally have any context for. I do want to develop a relationship with you, but I don’t know if I can get my head around calling you parents.”\n\nThe way you snapped about telling them to find your parents indicates this isn’t as ‘settled’ in your  brain as you think. It’s still a sore spot and you are still angry. You have not ‘let go’. Therapy would be a good course of action.",
              "id": 50,
              "comments": [
                {
                  "score": -23,
                  "content": "Wait wait...op is wrong for defending himself after being pushed? What kind of messed up message is that? He didn't do anything wrong, if he doesn't want a parent why does he have to accept it? What kind of condescending talk is \"everyone need the love of a parent?\" Well op didn't get it so what? He didn't reacted poorly, he reacted because he was being yelled on a issue about his life and growing up",
                  "id": 51,
                  "comments": [
                    {
                      "score": 88,
                      "content": "Yes. And. And and therapy is still probably a good idea. He’s got a block on the topic. What happens if/when he becomes a parent. It’s time for some professional help working thru this.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 78,
                      "content": "You’ll notice I said they shouldn’t have pushed. But he reacted from the start with open hostility to the idea. The ‘of any kind’ was unnecessarily harsh.\n\nThey were coming from a place of empathy and kindness; he met them with hostility and derision. The ‘love of a parent’ line was clumsy, but was probably an earnest attempt to express sorrow that OP hadn’t experienced that kind of love. It didn’t need to be met with such contempt. \n\nOpen hostility on a hair trigger like this rarely equates with being at peace with the issue. Therefore, the suggestion for therapy.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "All he had to do was say thank you and leave it at that.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 170,
              "content": "Dude, You are my father.  He too was an orphan, raised in foster homes (during the Depression, which was extra fun).  I can always spot an orphan raised in foster care.  Please, please, please get therapy.  If not for yourself, then for your future wife and children.  I have seen firsthand the intergenerational trauma that is inflicted.  I had to get therapy to avoid passing my father's trauma down to my own children.  The lying and burying the truth? Check.  The way you push people away?  Check.  And that is just the tip of the iceberg.  I really wish you the best of luck, but again, you need therapy.",
              "id": 55,
              "comments": [
                {
                  "score": 56,
                  "content": "cough cow smell illegal office person encouraging rain silky sparkle ` this message was mass deleted/edited with redact.dev `",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "[deleted]",
                  "id": 57,
                  "comments": [
                    {
                      "score": 3,
                      "content": ">FWIW, I agree with OP that my dad’s orphanage experience was probably better than what OP experienced being shuffled around to foster homes, even if my dad called those nuns \\[insert horrible name\\] till the day he died.\n\nLikely was a no win situation back then. My grandmother and her many siblings were shipped off by their father \"to the nuns\" (to a Catholic orphanage) every time my great-grandmother was institutionalized, and the kids there were habitually handed off for a period of time to various families as effectively slave labor (farm hands, housework, childcare, etc). One uncle actually ran away and joined the circus as a geek, and one aunt came out of whatever the father of one family did to her as a life long alcoholic, but none of them were treated well.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "You deflected with jokes and a lot of people take that as people just trying to be nice. Especially since you have already let them know that you are not honest about this situation. \n\nRealistically the worst part about this is it sounds like you broke the trust of your girlfriend by lying to her the entire time y'all have known each other. \n\nI'm not going to call you anything because there's a good chance you just fucked up your entire relationship and that sucks",
              "id": 59,
              "comments": [
                {
                  "score": -20,
                  "content": "Unless you think that everyone who doesn't immediately share their trauma with their family is a \"liar\", the OP was never dishonest.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Half truths are whole lies",
                      "id": 61,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 44,
              "content": "Totally fine to not want parents. But do you want family? Because if you are marrying this woman, these people are your family. They were wrong to push, but if you want to be with her and have a family with her, think about the intentions and not just the execution of what they did.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Wtf. Get help. Sounds like you seriously need it if that’s your way of coping with a stressful situation.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Everyone handled it badly.\n\nI would reach back out to them in writing and explain, very generally and not getting into gory details, that your experiences in multiple foster homes have given you very traumatic associations with every single person who has ever attempted to be a parental figure in your life, to the point that even the idea of forming that kind of relationship with someone is panic-inducing. Tell them that you sincerely hope to have a positive familial relationship with them, but it will be much easier for you to do so if you can avoid any kind of parental label.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "You’re not just marrying your fiancé, you’re marrying into the family. The parents have been welcoming so figure out a way to embrace this, otherwise your fiancé may rethink your future together.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Yes. To be blunt you never had a family which is why you don't understand family dynamics. There is stuff that you put up with because you love the other person and they are there for you. They are not trained therapists so it's gonna take time for them to understand and that requires a level of tact that you did not display. If you love your fiance you but up with her family and present yourself in the best light possible. And damaged nameless orphan was obviously not a good image to show gramps.",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "You use dark humor to deal with the situation. You needed to survive and you did and you did great becoming a doctor and proofing \"your worth\" to yourself and to the world. But you know what? \nWhat you had to deal with is brutal. And you were worthy, worthy of love and care since the beginning, if you became a doctor or not. \nThere could be many reasons why your parents abandoned you, or why you weren't adopted. But non of those reasons is you. You were never at fault! \nI know what I'm saying is true! I think you should definitely go to Therapie to deal with all that and learn how to love yourself,  to learn how to be a good parent to your future kids, to learn what a typical childhood looks like, so you learn to communicate your needs and emotions and those of your kids.\n\nI think you should go get married, but hope to wait with kids until you started this therapy journey. \nEmotions are a complex thing. What we missed or suffered as children causes us troubles through our lives, and we have to work to unlearn some things and patterns, learn new things, and so on.\n\nEven if it seems silly, because you are already dealing with things, or seems huge, please start and search for a good therapist you trust. Everything gets complicated in relations. You owe it to yourself! Good luck!!\n\nEdit, missing word.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Why the hell is this down-voted?\n\nReally, Reddit?  Really?",
              "id": 68,
              "comments": [
                {
                  "score": 4,
                  "content": "I saw people massive downvoting someone, just for answering a question with objective explain of info requested.\nReddit is wild",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 965,
      "content": ">After two years of dating, she proposed the day after our graduation six months ago. I was so happy that I finally had physical evidence (and a rather expensive ring at that) showing I was worthy of being loved\n\nThis is a pretty big red flag to me. It sounds like you truly haven't worked through your past abandonment issues and your comment about her money and now you had evidence that you were worthy of being loved. That's not how that works. Doesn't sound like you actually love yourself and are only in the idea of love.\n\nYou lied to your fiancé all through dating? You really think that's a great way to start any marriage? Her family shouldn't have tried to swoop in, but I think in their own way they are trying to welcome you into the family and show that while you may not have bio parents, you are going to have a family who loves you.  You don't know what it actually means to be loved from parents or a family and even expect people to judge you for being an orphan. Yet you seem to be judgmental of her own family with your gigantic family comment. You are already setting yourself up for failure and if you keep this up, you will end up losing the two things you want: family and love.\n\nI think you need to get into therapy to work on your issues with being abandoned.",
      "id": 70,
      "comments": [
        {
          "score": 174,
          "content": "Exactly so how is he going to handle more of adult life issues thrown his way if this is how he reacts to his in laws offering (a little excessive admittedly) an olive branch of sorts. He needs therapy before he blows this marriage if he hasn’t already. It’s like he has a self fulfilling prophecy. If it goes down bad he gets to say “See! I told you they didn’t want an orphan!” When really it has to do with him lying and going at her parents so negatively. Comparing a mothers love to a mouse eating her baby. Dude has serious issues that will manifest when he has a kid",
          "id": 71,
          "comments": [
            {
              "score": -8,
              "content": "Well not everyone wants kids and I would suspect OP would want to be child free due to his own upbringing. He doesn't quite strike me as someone who wants kids given his upbringing.",
              "id": 72,
              "comments": [
                {
                  "score": 65,
                  "content": "Doesn’t even seem like he views marriage in a healthy way. A big fancy ring doesn’t mean someone loves you. He really needs to work on his shit before he becomes possessive of her and paranoid she’ll leave too. Abandonment is a hell of a thing",
                  "id": 73,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Not engagements but you shpuldve seen the gifts I'd buy people I was planning on breaking up with 👀 why did I do such things? Nobody knows",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 141,
          "content": "I get it.\n\nI'm an orphan too, and grew up in foster care. \nUsually even BAD foster parents make a big show about 'We're family now!' and it doesn't last. \n\nThrough the normal course of dating (and school, come to think of it) it's completely natural to make very close bonds with people you don't keep in your life. \n\nAfter a while, it feels like the common denominator is you. \nYOU aren't good enough.\nYou are surrounded by people who include you, but never to the extent a nuclear family would. It all sounds like lip service, because you've seen this show and how it ends. \n\nA big, permanent seeming, expensive, showy step feels like your soul being put at ease. These words suddenly have something behind them.\n\n\nI'm not OP.\nBut when I got married, goddamm \nSomeone chose me, in a big, public way and this is REAL. \n\nJoke was on me though \n\nI ended up a pregnant widow with an infant in my arms and a pension plan that HEAVILY penalizes remarriage. \n\nI'll never be who I was when I was married, for a million reasons, but not the least of which is feeling 'unchoosable'...for my own good.",
          "id": 75,
          "comments": [
            {
              "score": 19,
              "content": "I'm so sorry.",
              "id": 76,
              "comments": [
                {
                  "score": 13,
                  "content": "Thank you. \n\nThis post just got me at an odd time. I'd JUST gotten back from a trip with my now teenage daughters from a trip for military widows.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "“You feel unworthy of love. That’s a red flag, so you’re unworthy of love” \n\nNice empathy bro",
          "id": 78,
          "comments": [
            {
              "score": 23,
              "content": "I feel like this is more about the evidence-part. OP can’t really change his feelings, but he still has responsibility over them. And if this feeling of unworthiness is so strong he needs material proof of his finances Love to feel secure, he needs to work on that. Putting the burden of proof on your partner essentially outsources the responsibility for his trauma and feelings on to her-and that’s not okay. Also, speaking for experience: A partner who constantly tests your love for them and demands proof is dooming the relationship.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "That was tongue in cheek. I don't need a ring to know that I'm loved (or, if you want to be less charitable, a ring isn't going to make me feel loved one way or the other).\n\nI was neutral on her family until I heard the comment about her Grandfather taking issue with me being an orphan. After that, I figure it's fair game to be contemptuous.\n\nThis isn't my first relationship - the first time I did what the commenters think I should've done and told my girlfriend at the beginning. She dumped me saying that she wasn't ready for a relationship, but curiously had another boyfriend two weeks later. The next time I waited a bit until things were more serious and then told her, and she was so suspicious and bitchy of what else I'd been hiding that I dumped her (which is the reaction I'm getting now). Seems like a lose lose to me. But yes, I am judged for being an orphan and I don't know what to tell you if you think that's not the case. Like I did mention the comment about Gramps didn't I?",
          "id": 80,
          "comments": [
            {
              "score": 24,
              "content": "You tell them upfront and the people who care aren't worth your time. But pretty much everyone has a hard time with being lied to. You don't really seem mature enough to be married.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Okay OP, think. Everntually, whoever you date will find out you're an orphan. Do you want to find out they have a bias against orphans the start, or when they ditch you before marriage? Is that really the person you want to be with and waste your time on?",
              "id": 82,
              "comments": [
                {
                  "score": 9,
                  "content": "I'd like them to see that if we have a relationship for a significant period of time and I'm well adjusted enough that I can share all the other aspects of my life without them being able to tell that this one is missing, perhaps it wouldn't have been worth ditching me over had that been known initially. Yeah I won't be telling stories about how \"Dad\" and I hunted a squirrel and then he gave me a beer at the age of 9 and my side of the wedding aisle is gonna pretty empty, but is that really the totality of a relationship?\n\nI'd also like to be broken up for things about me that aren't immutable - I've been broken up with for not wanting to go out enough or not responding to texts quickly enough, and I have no problem with that.\n\nIt's not like I don't look for signs of this beforehand as well. If we're walking outside and she sees a homeless person or even a homeless person self medicating to escape from what is a horrifyingly traumatic existence (without harming other people), I find the reaction pretty telling. I don't expect her to go and dump her life savings into an apartment, but things like understanding that that is a person who is deserving of empathy (even if their homelessness might be partially a result of their own poor choices). On the other hand, if she starts spewing garbage Ben Shapiro style like \"they should just get a job\" \"we should call the police\"....well, we're probably not going to work out very well. Because not very long ago I was not very far removed from that situation.\n\nI don't want to split hairs over this particular example, but I realize it takes an empathetic person to accept and look past that I don't have parents, and I've always been on the lookout for evidence that this is not the case ever since those relationships failed.\n\nedit: If after a serious relationship, they still can't look past something that I did not choose for myself, cannot change, and does not directly affect them in the present, then that sucks. That was wasted time born out of my hope that there are people that are better than the trash that raised me, the people that bullied me, the people that took advantage of the fact that no one was looking out for me. If you want to call that selfishness...then I guess I can't stop you, although I assure you that I could not give less of a shit.\n\nThankfully that hasn't happened yet, other than the time I told a girlfriend 3 months in, which I don't consider a significant period of time unless she happened to be dying after those 3 months were up.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Op, you don't need to come out of the box and say it, but you can't just not talk about it into late in the relationship. Reread my comment for why. You wrote a lot, but its mostly about you feeling well-adjusted. I personally feel this is third to fifth date information.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Someone who can't accept you when you open up to them isn't someone you want anyway.\nThat doesn't mean hiding who you are from someone you want to build a life together with is the answer.\n\nWould you appreciate if they kept some major part of them from you like that?",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Ok, not an orphan here but something pretty damn stigmatized [alcoholic].  I had the attitude of your last paragraph for awhile too - fun fact, it's a self-fulfilling prophecy.\n\nThe ability to be honest, open, and vulnerable is paramount to a healthy relationship. The girl who dumped you? Yeah, sucks, happens to everyone. \n\nBut not everyone's trauma can jive with ours, not everyone's lives can be compatible with ours.  There are countless people that you've turned down/haven't given a glance at because, surprise, compatibility is important and those people were not right for you.  It isnt an indictment of you as a person, just like the reason you rejected everyone except your fiancee bc theyre evil and broken.  Would you have preferred she string you along for awhile?\n\nThe one you dumped was not being \"bitchy \" - you were NOT being open/honest/vulnerable about something major until you had gotten her seriously invested. It takes away her agency to make an informed decision, so essentially stringing her along. And if the attitude youre displaying was present in that convo, then yeah I'd feel the same way as her.\n\nI had a partner with a big lie like this that came out about a year in - the thing he was hiding wasn't a big deal on its own and wouldn't have impacted how I felt about him if I had known upfront.  But I didn't, and the relationship blew up as a result.\n\nGoing through a few dating attempts/casual dating/whatever myself, I was very upfront with my issues. Not in a \"here's every gory detail of the hell my life has been up until this point\" way but just as a statement of fact.  Some were then disinterested, others were fascinated, and still more turned out to be non-drinkers who just weren't as confident in being open about it.  Found the love of my life in the one who somehow listened to the story of nearly dying halfway around the world and still thought hell yeah this bitch rules.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "FINALLY! The voice of reason enters the chat",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 513,
      "content": "Well yeah. YTA \n\nYou intentionally deceived the person you wanted to spend the rest of your life with and then mocked her parents when they (albeit a little overbearingly) tried to show compassion.",
      "id": 88,
      "comments": [
        {
          "score": -53,
          "content": "Doesn't sound like op intentionally deceived so much as intentionally downplayed out of embarrassment.\n\nIf he really only said what he did in the post then how the F could fiancé think to propose to someone without asking a follow up question? Especially if parentage is important! \n\nIf someone said that to me I'd respect their desire to not talk about it but orphan is pretty mild on the list of \"shit that could be wrong there \" and doubt I'd feel comfortable enough to propose until figuring it out a bit.\n\nAlso please keep in mind op confessed after being proposed *to*, they didn't plan to wait until after becoming engaged it sounds like.",
          "id": 89,
          "comments": [
            {
              "score": 70,
              "content": "They got engaged and there was enough time for fiancé’s mother to visit 12 times. So this story didnt happen in the span of an afternoon.",
              "id": 90,
              "comments": [
                {
                  "score": 9,
                  "content": "12 times = day 12 of us moving in. They're a 15 minute drive away",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -54,
          "content": "Being an orphan is a trauma. They didn’t feel ready to disclose a trauma until they knew they wanted to marry the person, and that’s completely understandable.",
          "id": 92,
          "comments": [
            {
              "score": 73,
              "content": "Sounds like he told her after they had been engaged for *six months*. That's a minimum of six months too late.",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -58,
          "content": "It sounds likey they were worried it would make them or their daughter look bad in front of the family.",
          "id": 94,
          "comments": [
            {
              "score": 28,
              "content": "How would it make the daughter look bad?",
              "id": 95,
              "comments": [
                {
                  "score": 24,
                  "content": "Idk ask the parents, they’re the ones who think that.",
                  "id": 96,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -76,
          "content": "Why is it so important for the partner to know? Is anyone actually willing to explain this?",
          "id": 97,
          "comments": [
            {
              "score": 103,
              "content": "Because it's normal to talk about your family and how you grew up with your serious romantic partner. That's a thing that comes up very early on, and it's very weird to hide your entire childhood like this. I would be devastated if my now-husband had lied to me about his parents because that would have indicated to me he wasn't okay being vulnerable around me or telling me (perceived) unpleasant truths. I would also wonder what else he felt the need to lie about.\n\nLike, this is a huge lie of omission. This isn't forgetting the name of your high school or the name of your first crush. It's \"I'm obscuring my background and childhood from the person I'm supposed to legally and spiritually bind myself to for life.\"",
              "id": 98,
              "comments": [
                {
                  "score": -53,
                  "content": "So his concerns about the stigma of being an orphan don't matter here? His pain doesn't matter?",
                  "id": 99,
                  "comments": [
                    {
                      "score": 63,
                      "content": "She's his fiance, not some random person on the street or even an employer. She's supposed to be the person closest to him, who loves all the parts of him. If she was the kind of person to dump him over being an orphan I don't know why he wouldn't want to know that pretty early on in the relationship.\n\nShe was going to find out eventually, so hiding this information from her until he literally had no choice is such a shitty thing to do to a partner.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Im not saying you lead with this on a first date but do you think itll be a little awkward when planning the guest list for the wedding OP invites no family with no explanation…?",
              "id": 101,
              "comments": [
                {
                  "score": -9,
                  "content": "So what if it's a little awkward? \n\n\"I don't have any family\" is a complete sentence.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 67,
                      "content": "Because you dont keep major life events and details from your life partner, thats how you build a healthy relationship.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "I would like to know about my partner's trauma because then I can be better equipped as a partner to help them continue to work through it.",
              "id": 104,
              "comments": [
                {
                  "score": -4,
                  "content": "What if they aren't ready yet? Are you willing to give them that space to work it out? Do you believe, as the top comment here does, that people holding back are lying to their partners?",
                  "id": 105,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Then they aren't ready to be married.",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "If you can’t trust your partner with stuff like this you’re either not mature enough to be married to anyone or you’re not close enough to this person specifically to commit to them.",
              "id": 107,
              "comments": [
                {
                  "score": 1,
                  "content": "There's plenty of things my own wife didn't tell me until we were married for years. It made perfect sense why and it's never bothered me once. \n\nAre you saying that she wasn't mature enough to get married? That we weren't close enough to commit to each other? \n\nWhy do you get to gate keep as to who is and isn't ready for marriage?",
                  "id": 108,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Genetics is one reason. Assuming OP and his fiancé want children and are able to, it would be valuable to know for the health of their future children.\n\nIn the UK, at the first ante-natal (the first visit with the midwife) they ask about any illness or health condition in the family, that may be hereditary.  There will be countless people who don't have this information, but it is valuable information to have. Genetic conditions can affect the outcome of pregnancy, the health of the foetus in utero, and the baby once it's born. If medical professionals have this info, they can formulate treatment plans. \n\nOf course, OP could always have genetic testing, and will be likely aware of all of this, given he is a dr.",
              "id": 109,
              "comments": [
                {
                  "score": -3,
                  "content": "Being an orphan isn't genetic.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 23,
                      "content": "They didn’t say that and we know that. However being an orphan/abandoned is extremely unhelpful from a familial medical history. OP doesn’t know their family medical history- or habits- which could affect him or any children he has.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Family relationships (or lack of) determine a ton of the emotional development of any person, and the way they’ll relate with the rest of the world. This isn’t information you can keep from a person you’re going to share your life with, let alone to form a family.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 287,
      "content": "YTA cuz of your BS story.",
      "id": 113,
      "comments": [
        {
          "score": 149,
          "content": "I kept thinking \"wasn't this a plotline on Grey's Anatomy??\"",
          "id": 114,
          "comments": [
            {
              "score": 29,
              "content": "I haven't watched it in ages but that makes so much sense I am rolling with it.\n\nIt makes more sense than this being real.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -69,
              "content": "Was it? I only watched up until Meredith >!drowns!< and I figured that the story was best ended that way. That show isn't medical in the slightest, I have no idea why they didn't just make it a typical romance drama.",
              "id": 116,
              "comments": [
                {
                  "score": 3,
                  "content": "Lol at all the Grey’s fans downvoting you\n\n-A Grey’s fan who knows it’s nonsense",
                  "id": 117,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I picked the wrong show to fuck with apparently",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Glad I’m not the only one. Children end up stuck in foster care the only exception is newborn babies with no bio parents fighting for rights. Absolutely no way an abandoned baby even one with serious health issues isn’t immediately placed with an adoptive family and adopted. It’s total fiction and offensive to actual foster children.",
          "id": 119,
          "comments": [
            {
              "score": 1,
              "content": "I obviously don't remember this but I was adopted shortly after I was dropped off, the adoptive parents divorced 2 years later, conditions were not up to CPS standards at either location, and I was taken back and not adopted since. I don't consider that being adopted and I only had 3000 chars to work with, but your mileage may vary.",
              "id": 120,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "That part is quite false . Babies do end up in foster care . Adoptions some times fall through , and by the time it could happen again , the kid is too old . People some times go the \"foster to adopt\" route and then decide not to follow through . We don't even know if OP has any kind of health condition , which many people that wish to adopt are avoiding .",
              "id": 121,
              "comments": [
                {
                  "score": 11,
                  "content": "Look up statistics there are far to many children in foster care but young children where parental rights have been terminated are not on the list. And like I said even those with serious health issues are adopted quickly. It’s only older children where this is an issue. Depending on the court system it may be 6-12 months to terminate parental rights in cases like this. The baby would have been placed with an adoptive family during that time. Even if at the last minute something feel through it would take half a dozen adoptions falling through at the last minute for a child to still be in the system when they hit grade school age (and became harder to place) in a case like this. This is fiction taken from bad tv plot lines.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "There are plenty of real orphans with these types of issues, and worse.",
          "id": 123,
          "comments": [
            {
              "score": 5,
              "content": "Yeah, \"this story is fake\" usually = \"I've never left my comfortable suburb\"",
              "id": 124,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 207,
      "content": "YTA: this is information you should have told her long ago. Your aggression towards the situation makes me wonder if therapy is something you, and you and your SO should be having.",
      "id": 125,
      "comments": [
        {
          "score": -49,
          "content": "Why should he have told her long ago?",
          "id": 126,
          "comments": [
            {
              "score": 81,
              "content": "Dude, you got your answer to that question in at least 3 separate comments.",
              "id": 127,
              "comments": [
                {
                  "score": 29,
                  "content": "Right?! Like God, we get it. Fucking on a soap box, this person has got their own stuff going on that's for sure lol.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -18,
                  "content": "No, the answers were lots of people telling me that, \"lots of people think it's important\" without bothering to say why.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Reread them. It was answered multiple times my guy.",
                      "id": 130,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "For those who have parents/parental figures, their first understanding of love comes from that person(s). Kids learn how to interact with others from them. Kids learn how to treat others from their Parent. They learn their first lessons on behavior, morality, right/wrong, and relationships from those parental figures. \n\nParental relationships, teaching, and influences all affect who a person grows into. And when that is varied then there end up being gaps. Nothing insurmountable, of course, but still gaps.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This why you are single",
                      "id": 132,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "You have to be using an alternative account unless you want your karma to bomb",
              "id": 133,
              "comments": [
                {
                  "score": -2,
                  "content": "My karma is just fine. People are allowed to disagree on this sub, it's really weird how you and others here are so upset about that.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 3,
                      "content": "^ projection. If one response is upset, your 20-30 would be an extended meltdown tantrum.",
                      "id": 135,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 191,
      "content": "YTA - you’ve lied to her your entire relationship, we’re absolutely brutal and rude to her parents for no reason. You’re totally TA",
      "id": 136,
      "comments": [
        {
          "score": -44,
          "content": "Please explain why this is any business of the partner to begin with?",
          "id": 137,
          "comments": [
            {
              "score": 67,
              "content": "Because this is the kind of personal thing you explain when seriously dating, especially when  you are engaged. Whether you like it or not their family becomes your family, when one doesn't have any it's important to state that. Like it would be if his parents were divorced or if he had a single parent. Family situations are important to discuss.",
              "id": 138,
              "comments": [
                {
                  "score": -15,
                  "content": "He's still not a liar for not wanting to rip this massive wound open, and his concerns about being stigmatized as an orphan were confirmed. \n\nAlso, he's likely not all the used to talking about his family because he doesn't have one to talk about in the first place.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 31,
                      "content": "It's lying by omission. He knew it's something it matters to most people and he chose to not say to his partner for 2 years. It's something hard of course, he should be in therapy for it, however, it doesn't mean it's not an important and essential information to share.",
                      "id": 140,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "In the beginning, no reason unless you want to. But when talking marriage, it's kind of her business at that point.\n\nBut people really shouldn't be trying to get married to someone they can't confide in. That's supposed to be a best friend you can love on for life. ( If  it works out)",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Everything is your partner's business, that is why we call them \"partners\"",
              "id": 142,
              "comments": [
                {
                  "score": -3,
                  "content": "Do you demand your partners give you their full sexual history? \n\nYou did say \"everything\", after all.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I don't makes demands of my husband, no. We share everything and it makes us closer. We are partners because we trust eachother. Why marry someone you didn't trust completely with your life and experiences? \n\nThis is a person you are planning on spending decades with, until you die. You should know eachother on the deepest level of understanding",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 135,
      "content": "Keeping a secret only to end up telling them in a crude way wasn't the best way to approach this...but it sounds like you have so much resentment towards the lack of love from your birth parents that you are trying to sabotage any healthy relationships where people show you love.\n\nWhen they said they want you to think of them as parents, I think they were just trying to say \"let us show you the love you were missing\" and not that they actually wanted to become your parents. I think they would've meant it in a natural family or MIL/FIL type of way...although I can see how it saying \"think of us as your parents\" is kinda pushing a big boundary since they aren't your parents and wanting to be thought of like that would almost be more for them to feel good and less about you...and it sounds like that was kinda proven when your father in law slammed his arms down for not \"taking them seriously\" and later by saying they didn't like their daughter marrying an orphan. \n\nI can understand why your girlfriend wants to know what else you were hiding, as you were able to hide something big and all these overwhelming emotions fairly easily.\n\n> but I never knew mine so this wasn't a huge secret, just something I didn't like talking about.\n\nBut it sounds like it was more than you not wanting to talk about it, and instead something you purposefully kept from them and probably lied about since at some point the topic of conversation around parents/upbringing would've came up.\n\n>  is there anything else I could've done to get a better outcome?\n\nMaybe by saying you can accept them as parent in laws who are loving, but aren't comfortable thinking of them as your own parents. Idk...it's a difficult situation.\n\nESH (except your fiancé).",
      "id": 145,
      "comments": [
        {
          "score": 101,
          "content": "This is the best response. I feel for OP’s fiancée though. He’s so consumed with self pity and resentment that now he’s about to self sabotage a good thing. Oh well. \n\nESH except the fiancée.",
          "id": 146,
          "comments": [
            {
              "score": 46,
              "content": "Thank you. I agree and I edited to add \"except the fiancé.\"\n\nI'm not sure how real this is, but if it is real it's incredibly sad. It's like he has so much anger, contempt, and resentment towards his birth parents that he's gonna try to protect himself at all costs, even if it means sabotaging his relationship and traumatizing those who love him. All for what? Just to prove the false idea he has about how he is unlovable?",
              "id": 147,
              "comments": [
                {
                  "score": 29,
                  "content": "It’s all self-fulfilling prophecy and it’s so sad.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I agree. And if he does sabotage the relationship he will likely tell himself he had no choice, it's something he had to do because she failed to love him enough.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "To me it reads a lot like he wants his fiancée to fill that hole of somebody loving him unconditionally, which is not what a partner in life is there to do. He needs some serious counselling before marriage to manage his expectations, because his expectations of her are… too much. Too unrealistic and unfair. \n\nHe dumped a lifetime of omitted information and trauma on her two years into a relationship—*after* she had agreed to marry him—and expects her to just… deal with it. Which, like a champ, she absolutely did, but that is a giant red flag to me about what’s next to come for her. If he can lie about an entire second life once, and expect her to move on with it, then he can do it again. I have a lot of empathy for OP, but he needs counselling.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "The sheer amount of bitterness, resentment, anger, self-pity, insecurity, and open hostility that come through in his post, comments, and the way he reacted to Lola’s parents are all very concerning.\n\nHis feelings are understandable and rooted in a lot of trauma, but these are not the hallmarks of someone who has processed and healed enough to foster stable, healthy relationships with others.\n\nHis whole hang-up about parents, however justified, is a recipe for disaster if OP & his fiancé decide to have kids. \n\nWhat happens when you become the parent, OP? Is that something you’ve discussed with Lola? I think it’s only natural that she and her folks may have some concerns, especially given that you deliberately hid and obfuscafed this very big thing for *years* (and no, you don’t get off on a technicality, so stop trying to justify your lies — you lied by omission and you know it, so own that) and the fact that you just reacted so harshly and unkindly to your future in-laws, when they were ostensibly only attempting to show you love and compassion.\n\nYour future FIL’s table-slamming sounds like the result of his frustration after you brutally and repeatedly rebuffed them. You acted terribly and projected your anger and resentment onto innocent people with good intentions. Grandpa may be an AH, but that’s not on them.\n\nSeek therapy, as so many others here have suggested. You desperately need it — for your own sake, as well as that of your fiancé, the family you’re marrying into, and any future children you may bring into this world. You have a lot of healing left to do, and Lola’s love alone can’t fix this for you. That’s not a fair weight for her to carry. You need help working through your anger, resentment, and grief before you’ll truly be at peace, or capable of giving and receiving healthy love.",
              "id": 151,
              "comments": [
                {
                  "score": 7,
                  "content": "I think OP thinks he’s fine and as long as Lola lovvvvves him and accepts him, everything will be just fine. 🤗🤦🏻‍♀️ this is a whole ass disaster.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -10,
              "content": ">ESH except the fiancée.\n\nWell there's one thing we agree on. She's watching the thread and me furiously typing with great humor (hi Lola!)",
              "id": 153,
              "comments": [
                {
                  "score": 32,
                  "content": "Ya you’re not funny at all.",
                  "id": 154,
                  "comments": [
                    {
                      "score": -4,
                      "content": "thanks",
                      "id": 155,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": ">But it sounds like it was more than you not wanting to talk about it, and instead something you purposefully kept from them and probably lied about since at some point the topic of conversation around parents/upbringing would've came up\n\nConsidering what's happening now, I feel a little justified. But no, I never lied. I said I had chronically absent parents, that I was raised by someone else, and, if pressed further, that I didn't want to talk about it. I feel like I deserve that much; I don't have parents so at least can I not talk about the fact that I don't have parents?\n\n>you are trying to sabotage any healthy relationships where people show you love.\n\nFrom your perspective, maybe. In college, I had a couple relationships. The first time, I did what the commenters suggest and told her within the first 2 weeks. She dumped me immediately, saying she wasn't ready for a relationship (but was curiously with another boyfriend 2 weeks later). Ok, maybe we weren't close enough to warrant that level of weight which I acknowledge is a lot. The second time, I waited until I thought things were serious and I thought I could trust her, and I told her. She was suspicious of what else I was hiding, and every interaction after that was laced with pity. \"It's so impressive that you're able to do that, I could never.\" The point was that I thrived in spite of not having parents, not that I want a god damn handicap because I didn't have them. I got so sick of it (and yes, I did communicate this because the relationship was no longer felt like it was between equals) that I dumped her shortly after that.\n\nSo I just stopped providing details. And things went a lot better. Yeah I still got dumped, but it was because I didn't like to go out enough or I took too long to respond to texts or something normal like that. Not over something I've never ever had control over and does not impact the other person in the slightest.",
          "id": 156,
          "comments": [
            {
              "score": 30,
              "content": "You know very well that you *did* lie to her, and everyone else. Anyone who hears \"chronically absent parents\" will understand \"parents who were gone a lot (but were there sometimes)\", not \"still-unidentified bio parents who abandoned me at a firehouse when I was an infant\". Similarly, anyone hearing \"raised by someone else\" will understand \"raised by some*one* else, *e.g.,* a grandparent, aunt/uncle, or nanny\", not \"raised by multiple foster parents\". You know this. You were intentionally dishonest. You lied. As long as you keep trying to sugar-coat it and pretend that you didn't lie, your fiancée is probably going to have a hard time believing that you aren't lying about anything else, precisely because you aren't even being honest about having been dishonest.",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "Sir I think you're letting your fears become self-fulfilled prophecies\n\nAlso I don't think you just thrived in spite of your parents I think you thrive in spite and you might want to work on that love. It's a tough road to hoe, two of my brothers are adopted (not legally we are just a group of kids that weren't wanted some legally given up in some just completely ignored unless we were getting beaten or in the way)  and every bit of this reeks of unresolved trauma",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I grew up in a shitty, abusive home. I thought for so long that I was okay and had a handle on my life. Until I absolutely didn’t, and it all came crashing down. Find a therapist. It’s the best thing I ever did for myself. The trauma we experienced in childhood doesn’t really leave us, and if we don’t actually deal with it and begin healing, we hurt those around us. I get where you’re coming from, and you’re not wrong for your boundaries. However, you were wrong for being misleading for so long. If any person can’t accept your past that you had zero control over, they’re not the one for you.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This comment brings so much context to the situation. No wonder you didn’t tell her the full truth, every other time you did that it ruined your relationship. I hope your fiancé can forgive you and I hope her parents can understand your situation. Now having said all that you definitely could use therapy, but we all could use some so don’t take it the wrong way. I would also like to say good job on over coming all the obstacles and good luck in your future.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": -11,
          "content": ">But it sounds like it was more than you not wanting to talk about it, and instead something you purposefully kept from them and probably lied about since at some point the topic of conversation around parents/upbringing would've came up.\n\nYou seem to be writing fanfiction here.",
          "id": 161,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 96,
      "content": "I say ESH except maybe your fiance. \n\nYour vague incomplete answers were the same as lying to someone you love and plan to share a life with.   I can see why she had trust issues now. \n\nHer parents can't expect to just instantly be considered your parents.   Over time you might develop a parent like relationship with them but that kind of thing doesn't just instantly happen because someone announces it at dinner one night.",
      "id": 162,
      "comments": [
        {
          "score": -40,
          "content": "Uh, whoa, what an incredibly inappropriate response.",
          "id": 163,
          "comments": [
            {
              "score": 26,
              "content": "No it isn’t.",
              "id": 164,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Jesus Christ   You're acting like you have a phD in psychology Telling someone most of the important stuff like you have no family is quite important when you get engaged I don't know why you can't comprehend that I don't know why you're so opposed to it other than the massive trauma which while you may be right should not be as big as you're saying it would be by now",
              "id": 165,
              "comments": [
                {
                  "score": -4,
                  "content": "You could just ask for clarification instead of whatever this is.",
                  "id": 166,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 63,
      "content": "YTA - I’m confused on your fiancé giving you an expensive ring as engagement since you indicate that you are American male but that isn’t an American custom.  That said, you are still a huge bunghole because you are so bitter that you have contempt for your fiancé and lied to her over something that really isn’t a big deal.  \n\nAlso, further troll bait, you indicate that your mother in law offered to be your mom at the wedding, but then she switched to her father likely being horrified at the wedding that you are an orphan . . . Which he would clearly realize when his daughter was acting as your mom at the wedding.  \n\nYTA - this is a troll post. If not, still the AH for lying and being overly cruel to people reaching out to be there.",
      "id": 167,
      "comments": [
        {
          "score": 43,
          "content": "Not everyone is traditional. I proposed to my husband. He wears a ring. I hate jewelry, and don't wear my ring. I kept my last name, and he did the wedding planning.\n\nSome people don't confine themselves to tradition, or certain customs.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "He’s a self fulfilling prophecy with thumbs. He gets an attitude with in-laws and now he gets to turn around and say See! I was right! It’s bc I’m an orphan (asshole)",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Just saw a cis man in an opposite sex relationship with an engagement ring that his fiance gave him when she proposed. Good for them if that's how they want to live. I think it's kind of a bummer that more men don't get proposed to, tbh.",
          "id": 170,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I'm Canadian (so close enough, honestly), and I would definitely buy an engagement ring for my boyfriend! Though, he's more of a watch guy so I'll likely go that route when I propose.",
          "id": 171,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -4,
          "content": "I wanted to take things slower, she didn't, so she made the move and she doesn't trust my sense of fashion (among other things now) so she got the ring too.\n\n> Also, further troll bait, you indicate that your mother in law offered to be your mom at the wedding, but then she switched to her father likely being horrified at the wedding that you are an orphan . . . Which he would clearly realize when his daughter was acting as your mom at the wedding.\n\nGIL doesn't know that I'm an orphan and MIL thinks GIL will be horrified when he finds out his daughter is marrying someone with no name at all (they're very wealthy and I'm pretty sure it's old money so that's important to them). That's all I meant with that.",
          "id": 172,
          "comments": [
            {
              "score": 25,
              "content": "Wtf is this game of thrones? You know nothing Jon snow now get into therapy before you mess up whatever kids you have with this poor woman",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}