{
  "post content": "I (24F) live with my parents and always have done. Whilst I would love to move out and have a place of my own I am expected to stay with them until marriage due to their traditions and beliefs. I don’t mind this too much because I’ll probably be married in the next couple of years and while I pay towards the bills; it is not a lot in comparison to what I would do usually in this city. \n\nMy mother does most of the cooking in the house but I also cook a few times a week. A couple of months ago she started cooking dinner later - often finishing at 11pm - as my father apparently preferred to eat late and it seems to suit her too. Tbh it didn’t really bother me too much and if I was hungrier any earlier I would just make myself something. \n\nCurrently we are experiencing a mice infestation. Now I am petrified and I can’t tell you how anxious them being in the house makes me. I’ve done the little I can do to try and deter them however my father refuses to get any work done to the house i.e blocking off spaces and holes that the mice can come in through.  He has plenty of money to do so and I have offered the money myself but he won’t budge and there’s so much I can do myself without his permission as it is his house. \n\nThe mice have taken a liking to the kitchen as mice do and often come out as soon as it is dark. I refuse to go in there and cook myself because of my phobia and on most days I just wait for my mum to finish cooking. I’m also getting take away food when I can but that’s not really a solution. Sometimes I’m just sitting up in my room having not eaten in 9/10 hours because I’m just waiting for dinner to be done. Cooking earlier doesn’t work because of my job and I don’t enjoy snacking either. I want to tell her to start cooking earlier. WIBTA if I did?\n\nEdit: I feel like people are focusing on the wrong thing here. When I said I don’t mind living with my parents I really mean it! In fact I quite like it sometimes. Yes I did say I would love to move out but it’s more of an eventual thing. Most of me wants to stay.  I can’t afford to either. It suits my parents and me.",
  "id": 1,
  "comments": [
    {
      "score": 8,
      "content": "NAH, if you \"ask\" rather than \"tell\"\n\nIt would be best to communicate with your family about your hunger and wanting to eat earlier.  If they want to continue to do the late dinner, you could ask for a compromise of having a healthy snack or something earlier in the day to tide you over.\n\nIt would also be good to press your dad by letting him know your fear and discomfort with the mice.  Part of the \"tradition\" that drives you to stay with family is largely around the care and protection of young women.  If you aren't feeling cared for and protected... maybe there is something you can lean on there.  You know the personalities best.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "Might be time to cook Your Own meals",
      "id": 3,
      "comments": [
        {
          "score": 0,
          "content": "OP does cook. Maybe read the post before making a comment?",
          "id": 4,
          "comments": [
            {
              "score": 2,
              "content": "Maybe learn reading comprehension\n\nShe said she cooks a few times a week\n If meals are too late for her then she needs to cook More often",
              "id": 5,
              "comments": [
                {
                  "score": 0,
                  "content": "No, she said she's afraid to go in the kitchen because of a mice problem. And it's hard to cook, which she knows how to do, in a place that isn't a kitchen.\n\nSo maybe you should take some of that advice you're so eager to dole out.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Again. Time to go cook.\nOr move out - which she isn't going to do.\nOr tell dad the mice need to go - which is also no fly.\nOr BTAH and guilt mom into cooking earlier.\nBut as an Adult, she should be Cooking her meals or changing her schedule so she isn't waiting 9-10 hours",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "Honestly - it sounds like it's time to move out and get some independence.  NTA, though.",
      "id": 8,
      "comments": [
        {
          "score": 0,
          "content": "Culture aside - I can’t afford it either. I live in an expensive city and a have a job that wouldn’t cover the cost of living here. My father and I split the cost of the bills of the house and any savings I have wouldn’t last more than a few months. I won’t leave the city either as my whole support network is here.",
          "id": 9,
          "comments": [
            {
              "score": -1,
              "content": "Holy shit, you are told you must live at home but also pay rent???? This is absolutely insane.",
              "id": 10,
              "comments": [
                {
                  "score": 0,
                  "content": "I don’t have to but I choose to. For both of those things.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -2,
                  "content": "She's 24. Why wouldn't she pay rent?",
                  "id": 12,
                  "comments": [
                    {
                      "score": 0,
                      "content": "I have no problem with paying your parents rent until you ad the part that it’s compulsory for them to live there.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "What’s moving out go to do with this situation?",
          "id": 14,
          "comments": [
            {
              "score": 5,
              "content": "Dinner when OP wants, no mice, not starving and hiding in her room.",
              "id": 15,
              "comments": [
                {
                  "score": 0,
                  "content": "OP mentioned she’s happy living with her parents for now so there was actually no need to bring it up. Just because that’s the norm for you doesn’t mean it is for other people who grew up in a different culture.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 3,
                      "content": "OP didn't say that.  She said she would love to move out and that she \"doesn't mind\" living with her parents.  There is a need to bring that up because the answer to this is in her first few words.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "[deleted]",
              "id": 18,
              "comments": [
                {
                  "score": 0,
                  "content": "Sure it could, but she’s happy staying with her parents for now (which there’s nothing wrong with in certain cultures). So it’s not really necessary to bring it up",
                  "id": 19,
                  "comments": [
                    {
                      "score": 1,
                      "content": "\nTraditions sometimes need to die. Culture has nothing to do with being controlled. I don’t know what’s worse, an adult being told where they have to live by their parents or being told you must marry. What an archaic point of view. Next your going to say they need their Dowery..",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -2,
          "content": "OP states in the very beginning that moving out is not an option.",
          "id": 21,
          "comments": [
            {
              "score": 7,
              "content": "No.  What OP described is an emotional/parental hostage situation.  She literally said she would love to move out.  She's an adult and can.",
              "id": 22,
              "comments": [
                {
                  "score": 1,
                  "content": "Or maybe other cultures and traditions exist outside your own? It is quite normal in many cultures to remain at home until married, for both men and women. It is quite normal in many cultures to have a multigenerational household. In fact it's rather the norm.",
                  "id": 23,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "She also said she doesn’t mind living with her parents, although i do agree it’s somewhat\nof a hostage situation.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Of course it is. Humans are autonomous no matter the culture.",
              "id": 25,
              "comments": [
                {
                  "score": 2,
                  "content": "Right, because we can make our own form of money and demand that others accept it? Humans are communal and social. We must live within the society we inhabit. And interact with that society. It's easy for you to say leave because you don't have to face the consequences of that action. The privilege of someone who's never had to stay and figure out how to make it better.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I’m sad for you.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "OP, I get that you're in a difficult situation because of your region's traditions.  However, there is no point in keeping to a tradition if all it leads to is harm, whether directly or indirectly.  In this case, you're being harmed because of a preventable infestation which has triggered your phobia.\n\nYour safety and wellbeing is worth more than preserving any kind of societal normality or appeasement of any person who mistreats you.",
      "id": 28,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YWBTA. At 24 with a working kitchen you can feed yourself. Mice or no mice. If you need food get it.",
      "id": 29,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NTA. I'm sure your parents love you, and it's okay to ask if they would consider cooking/eating earlier. I too come from a culture where children live with their parents until they get married. As an adult, I've wanted to be as less of a burden on them as I could be, so maybe that's why you're hesitating?\n\nAs a compromise, maybe consider snacking now and then, if possible.\n\nAnd definitely try to convince your dad to solve the mice problem. It can be very dangerous if mice get close to where you keep your food.",
      "id": 30,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "If you turn on the lights and make noise the mice will scatter. Also, you can seal up many crevices on your own with steel wool. I’m having a mice issue myself so I get it. NAH.",
      "id": 31,
      "comments": [
        {
          "score": 1,
          "content": "Tried steel wool as much as I can. It’s a very old house and it just needs a lot more fixing up.",
          "id": 32,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be the asshole for asking my mother to make dinner earlier as she is the one that is providing me the food and she is the one going to the effort of making it while I do nothing.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post. [To learn more about the test click here](https://www.reddit.com/r/AmItheAsshole/comments/tio99u/so_we_decided_to_fuck_with_the_sub_again)*",
      "id": 33,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (24F) live with my parents and always have done. Whilst I would love to move out and have a place of my own I am expected to stay with them until marriage due to their traditions and beliefs. I don’t mind this too much because I’ll probably be married in the next couple of years and while I pay towards the bills; it is not a lot in comparison to what I would do usually in this city. \n\nMy mother does most of the cooking in the house but I also cook a few times a week. A couple of months ago she started cooking dinner later - often finishing at 11pm - as my father apparently preferred to eat late and it seems to suit her too. Tbh it didn’t really bother me too much and if I was hungrier any earlier I would just make myself something. \n\nCurrently we are experiencing a mice infestation. Now I am petrified and I can’t tell you how anxious them being in the house makes me. I’ve done the little I can do to try and deter them however my father refuses to get any work done to the house i.e blocking off spaces and holes that the mice can come in through.  He has plenty of money to do so and I have offered the money myself but he won’t budge and there’s so much I can do myself without his permission as it is his house. \n\nThe mice have taken a liking to the kitchen as mice do and often come out as soon as it is dark. I refuse to go in there and cook myself because of my phobia and on most days I just wait for my mum to finish cooking. I’m also getting take away food when I can but that’s not really a solution. Sometimes I’m just sitting up in my room having not eaten in 9/10 hours because I’m just waiting for dinner to be done. Cooking earlier doesn’t work because of my job and I don’t enjoy snacking either. I want to tell her to start cooking earlier. WIBTA if I did?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 34,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "If I were you i’d pay to get that nice situation under control, even if your dad isn’t happy with it. No offence but he sounds shitty",
      "id": 35,
      "comments": [],
      "relation": "Support"
    }
  ]
}