{
  "post content": "throwaway for privacy.\n\n\n\nMy wife (23) and I (27) are expexting. She's due this month and things have been bit intense recently with her being extra hormonal.\n\n\nWe live in different state then my family. My wife and I couldn't visit for Christmas. my parents were calling to continue complaining about us not spending Christmas with them and demanded I make it up for them. I said I was open for any suggestions they had and they suggested they come stay with us for a week once the baby is born. That way they could spend time with us and the baby as well. I thought why not that seemed to be a pretty good suggestion since it's been months since we've seen each others so I told them to go ahead and made the invitation Official. This morning my wife was talking about her plans once the baby is here and that's when I remembered my conversation with my parents. I immediately told her that I agreed to let them over for a week once the baby is born to make up for the holiday we missed with them. She first looked shocked then freaked out at me saying I shouldn't have invited them just like that without talking to her first. I asked why not since she loves them and loves being around them but she explained that my family can be a lot of work and having them as guests while caretaking for a newborn is the last thing she wanted. I told her it was no big deal besides that we could use help if she thought about this way but she lashed out on me about how the first few days of the baby's life is essential time for bonding and being intimate and I just took that away from her by inviting my parents and invading her space. I argued that she was being melodramatic right then because my family are decent people and I'm pretty sure they'll make this experience a lot more warmer but she still disagreed and said if my family were decent then they wouldn't have accepted my invitation but I clarified to her that I did NOT invitem and this was in fact a suggested made by them and I just agreed AFTER they complained about me missing spending the holidays with them. She went off on me demanding I call them and cancel everything I planned with them but I thought that was unacceptable since she gave not a good-enough reason for me to do that and besides my parents can help but she still denied that being true.\n\nShe's gone radio silence for the rest of the day and is acting like my family are somehow making her uncomfortable though they're not the judgemental or intrusive type and are just about spending time with each others. AITA?\n\n\nHold on! #Edit few things so there's no misunderstanding here. Alright?\n\nFirst of all my wife doesn't normally have an issue with my family being around, they all get along pretty good. and second of all which is an important info my wife and I talked about having her directly speak to them about why she would rather postpone their visit so we could clear the air but she refused and said she doesn't want to ruin her relationship with them and asked me to do it (tell them not to come) but since my family are upset with me then me telling them not to come might be taken in an offensive way, you know what I'm saying? so it really feels like I'm stuck between a rock and a hard place.\n\nalso, to all the people saying that my wife shouldn't be hosting guests. I don't recall mentioning this nor expecting her to do anything for the family. matter of fact I really thought we could maybe use their help especially my mom.",
  "id": 1,
  "comments": [
    {
      "score": 60927,
      "content": "# YTA\n\n# UNTIL YOU PUSH A HUMAN OUT OF YOUR BODY AND SUFFER THE PHYSICAL CONSEQUENCES OF IT YOU ABSOLUTELY DON'T GET TO MANSPLAIN THAT IT IS NO BIG DEAL AND NOT GOOD ENOUGH REASON\n\nYou wife will have just pushed a fair sized melon out of her body. There is a good chance she will have been torn or cut. There is a good chance she won't be able to sit down. She will potentially be in a diaper and have walnut size clots of blood coming out of her body. There is a chance that the bathroom will not be guest ready after she has been in there because it will look like a abattoir are you cleaning up every time she goes in there.\n\nHer milk will come in on about Day 5 which is often extremely painful causes a huge hormonal surge and causes the milk blues. Her nipples will not yet have hardened up and might crack and bleed.\n\nYour baby may be an angel but then again it may not you wife might be feeding very very frequently meaning she won't sleep she will be exhausted look like shit and cry a lot\n\nYou think none of this is a good reason to not want to host guests.\n\nIn short the only people who should be staying with you are people who have seen her naked and could actually help her in the bathroom like her mother sister or husband.\n\nEdit. Thank you for the upvotes and awards.\n\nEdit 2 Several people have linked or mentioned the below including ScrumpetSays, AlcareruElnnesse, Lokiberry316, Snooopy-dog and I am sure many others. (If I haven't credited you I am sorry it is an oversight not a snub) and Lilllyspectial and Madpeachiepie [https://community.babycenter.com/post/a29842181/the\\_lemon\\_clot\\_essay-\\_if\\_you\\_are\\_planning\\_to\\_have\\_people\\_over\\_after\\_birth\\_you\\_need\\_to\\_read\\_this](https://community.babycenter.com/post/a29842181/the_lemon_clot_essay-_if_you_are_planning_to_have_people_over_after_birth_you_need_to_read_this)",
      "id": 2,
      "comments": [
        {
          "score": 19995,
          "content": "THIS!!! And this is all if the birth is normal straight forward delivery! \n\nMy friend gave birth, tore so much she needed surgery twice and wasn’t fit for visitors for at least a month - and that was just people going for an hour, let alone living in the house. You are the biggest asshole I’ve ever seen!!",
          "id": 3,
          "comments": [
            {
              "score": 10804,
              "content": "This needs to be louder. Giving birth is painful.\n\n>saying I shouldn't have invited them like that without talking to her first. I asked why not\n\nWhy not? Because she just pushed a whole ass human out of her body and is in pain/exhausted from the ordeal, you ignorant AH.",
              "id": 4,
              "comments": [
                {
                  "score": 4618,
                  "content": "Don't forget the farting. I remember gas just escaping as I was walking around the 1st few days. I would have been mortified to have houseguests.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 5046,
                      "content": "The first post birth poo when you're trying not to tear your stitches and all of your organs are busy rearranging themselves is also not a good time for guests. After my daughter it took hours to get that out. Was like giving birth all over again.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 875,
                      "content": "When I’d fart right after giving birth I had a few episodes of sharting on myself. I can’t imagine having to have been like, “Damn, I just shit myself, excuse me for a moment while I go change my underwear.” Op YTA and are unbelievably inconsiderate.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 400,
                      "content": "Not only did the smell make the damn dog run, it HURT.  C-section farts hurt all the way to the shoulders.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "And the sweats, no one s you about sweating so much and it smelling so dreadful because hormones are leaking out everywhere.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3329,
                  "content": "Honestly I think the fact that she would have just given birth is irrelevant. You don’t invite *anyone* to stay at your home without at least running it by the person you live with *before* you issue the invitation! This guy is totally the AH.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1503,
                      "content": "THIS. When you live with other people, everyone has power of veto over ANY guests staying overnight or longer. It's not up to me to decide whether my partner's reason for not wanting my friend from out of town to live with us for a solid week is \"good enough\". \"I'm not okay with that\" is literally the only reason they need to give. It's their home.\n\nThe fact that OP's wife will have just GIVEN BIRTH just makes this a thousand times more appalling. OP is clearly completely clueless about what his wife is about to go through, from labour through delivery and the weeks to follow, caring for a newborn while recovering from an ordeal so arduous that it'll alter her body *permanently*. I feel so bad for her, knowing that she'll also have to deal with OP whinging in the midst of all this.\n\nOP, YTA. You literally couldn't be MORE of an AH, in this situation. I really, truly hope the responses to this post are the wakeup call you so sorely need. Your wife is going to need to be able to depend on you for support and care, both physically and mentally, and it really does not sound like you're up to the task, at this point, if you think right after childbirth is the time to have houseguests for a solid week.\n\nI also don't buy that your family will be there to help your wife. They tantrumed because the two of you were unable to travel interstate when she's heavily pregnant and demanded that you both make it up to them. They're clearly being selfish and entitled, and your wife's needs and wellbeing are not a priority to them. That's not even debatable, at this point.\n\nI genuinely hope you take this as your cue to step up and support your wife in whatever way she tells you she needs. You have absolutely no right to question her on that, right now.\n\nEdit: Thank you so much for the awards! I truly appreciate your generosity 💜",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 581,
                      "content": "Absolutely. He has no respect for his wife at all",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 255,
                      "content": "Except the fact that she’s giving birth makes this even more relevant. Hopefully she’s pooped by the time they arrive, I literally hate this husband.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Yep, that alone makes him an AH. I'd be FURIOUS if my husband invited ANYONE to stay with us for a week without running it by me first!! JFC, have some courtesey for the person you live with!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "My thoughts exactly, except the fact that she’ll have just given birth makes a really bad situation a whole lot worse!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "for real. it’s just human decency to tell your roommate if someone is coming over",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I was the one giving birth and I even ran it by my husband before inviting my mom and sister to stay the week after I gave birth. He agreed because I was pushing a human out of me, so he knew to give me what I wanted. And my mom and sis were a HUGE help. They cooked every meal and cleaned our house so we only had to focus on baby. I also ended up back in the hospital with postpartum preeclampsia and they were there to watch our dogs and cat so my husband could be in the hospital with me and baby.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1581,
                  "content": "First of all these are people that \"demanded\" time when the wife is about to give birth. You think they came to help?",
                  "id": 18,
                  "comments": [
                    {
                      "score": 1367,
                      "content": "They’re gonna be the type of people who’s version. Of “helping” is holding the baby so she “can” cook/do laundry/clean up after them.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 45,
                      "content": "Yeah the people that bitched and whined about them not traveling out of  state during a pandemic with quickly rising cases while 9 months pregnant are definitely going to have the mom and newborn's best interests in mind.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "Yeah like wtf. They don't know where anything is in the house so they aren't going to be helping. It's also not needed to have any help but with this AH of a husband, it sounds like she is going to need help. Not from his family, though, who think this is a good time to stay over for a week, but from one of her sibyliy or her mother, or a close female friend.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "My MIL did come to visit for two weeks after my oldest was born, and was a huge help. But she came specifically to help!! Not to \"make up the time lost because you couldn't come for the holidays\". I am having a bad feeling about this one.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "How can anyone be upset that their son and his 8 1/2 month pregnant wife thought it best not to travel at the tail end of her pregnancy and during a panini? That’s some audacity right there. Sure, come visit after the baby is born. Minimum 2 months after the baby is born.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "And notice they demanded time because son didn't spend xmas with them. *Not* because they want to see the baby or help.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Thank you. I'm was, 'What the holy, hell?!' Why are they being obnoxious about them not traveling and visiting right before she gives birth? That doesn't bode well of their helpfulness.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 442,
                  "content": "Even without the baby it's her fucking house too. Why the hell wouldn't you ask if she's ok with many people coming to stay?!",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 241,
                  "content": "He shouldn't have invited them without talking to her even when she wasn't about to give birth. Houseguests are a huge ask.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "All of the things said by everyone above. But also, the simple facts that he invited guests to come stay WITHOUT EVEN TALKING to his wife. Doesn't matter how well they get along, that she just birthed a baby, or whether they expect to be catered to or qill themselves act like domestic help. I mean, of course those things matter...but...who invites visitors and \"makes the invitation formal\" without conferring with the other adult(s) of the household?????\n\nThis has to be fake. He has to be trolling us. Because I simply cannot believe that this man is so oblivious and callous and misogynistic. 🤮",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Hell, I'd be pissed if my spouse invited my in-laws to stay for a week without consulting me any time; right after giving birth just makes it so much worse.\n\nAlso, there is no chance OP's family is going to o be helpful and understand. Their mad a 8-9 month pregnant woman wouldn't travel long distance for Christmas and need that to be \"made up to\" for that. I don't think OP has a skewed perception of how his wife views this family.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Fuck that she just gave birth - it's her house too and he should NEVER agree to overnight guests without discussing it with her first. (With the lone exception being if someone's life is in danger.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Your quote says it all....like why can't I make plans without asking my pregnant wife first",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "And even if she hadn’t just given birth, he would be an AH for making these plans without talking to her first. You don’t invite people into your house without talking about it with the other people who live there.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1786,
              "content": "ETA: You stated your wife and your parents are on good terms.  I suspect most likely because your wife is more gracious than you realize.  Your heavily pregnant wife did not want to travel, so your parents double down and “*demand*” you both MAKE IT UP TO THEM, for carrying your child and being too heavily pregnant to comfortably visit?  \n\nMy DIL had an emergency C-section while infected with Covid.  Our thoughts were mostly on her life as well as the life of my new granddaughter.  My son was quarantined with Covid away from his critically ill wife and much awaited new daughter (tried for ten years). Everything revolves around DIL’s wishes.  No pushing.  Asking permission at every turn.  I can’t imagine having barged in for A WEEK!  How selfish.  Tell your parents yes, they can come after the baby is born at an agreed upon time (by you and your wife) of your choosing!  \n\nYTA. As well as your parents.",
              "id": 33,
              "comments": [
                {
                  "score": 407,
                  "content": "When I had my son, I lived out of state. My parents came for a week right after I had the baby and I loved it. I needed my mom and they were beyond helpful. Did the laundry, cleaned the house, loved the baby. MY parents. Not my husband’s. I love them, but they didn’t get invited until baby was several weeks old. They didn’t do much to help around the house and it felt like we had guests to entertain rather than family helping us. \n\nI have a feeling OP thinks his wife likes his family more than she actually does. \n\nRegardless, OP is a major AH. Imagine not asking wife in the first place, then when she explains the problem, digging in and denying her needs. This is a bad way to start a family. Red flags everywhere here.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I also think OP thinks his wife likes his family more than she does… we moved closer to my husbands folks after 10 yrs of marriage, he’s just finding out how much they irritate and stress me out to be around, because I’ve always acted very cordial and never felt the need to cause him stress or put him in a situation where he would feel uncomfortable, and we had much more space from them. OP is definitely the AH, my MIL was definitely NOT someone I wanted around while trying to bond with and figure out how to parent my babies.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "Right.   The fact that they were upset that someone who is that far along in a pregnancy didn’t visit then is bad.  Demanding that they make up for it is horrible.  Even if by some chance DIL does love them the way he thinks she does, she won’t after this.  Oh, and he wants her tell them not to come because they’re already mad at him.\n\nDIL should be really concerned, because it’s clear that every year from now they are going to expect her to pack up her kids and travel there for Christmas.  Traveling during the holidays with kids is so stressful.\n\nAfter my child was born, I wanted my own parents there— people that I had known my entire life and had seen me at my worst.  I know my MIL would have done a great job keeping up with the household, and she wouldn’t have been imposing at all. But I just wasn’t comfortable with that",
                  "id": 36,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Also it’s clear he chooses his family’s feelings over his wife. He needs to stand up to them. My husband would never in a million years do this to me.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I hope your DIL gets better. She was extremely lucky, but I cannot imagine how she feels right now.\n\nYou're doing the right thing. And you're better than OP and his toxic family.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Oh she’s wonderful!  A fantastic mother to her child.  We are so incredibly blessed to have them both.  Baby girl is 9 months old on Friday.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I’m still not thrilled to be around my fiancé’s mother who completely ignored both of our wishes and barged into the hospital when she found out I was in labor and would not leave. And then weeks later walked right into my apartment because I didn’t answer my phone and she wanted to visit the baby (she had already been over numerous times and I was in the midst of PPD).",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 743,
              "content": "With my son I got 86 stitches inside and out. I almost bled to death after delivery i would cry out in pain every time I had to go use the bathroom. Even peeing felt like acid was being thrown on my cooter. My mom had to wash me after every trip.",
              "id": 41,
              "comments": [
                {
                  "score": 179,
                  "content": "Oh, ouch. I’m so sorry to hear that. I sprayed myself with a spray bottle while peeing for 2 weeks to minimize the stinging and I had nowhere near as bad injury from giving birth.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 38,
                      "content": "My mom would get a large bowl with ice water to pour on me while I went to the restroom. The was the only way I could go the first couple of weeks. It was so horrible.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Key words: YOUR MOM",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 548,
              "content": "I have one friend who got epilepsy as a result of giving birth, and another who went into a coma and missed the first two months of her son's life. Giving birth is far more of a big deal than most people think.",
              "id": 45,
              "comments": [
                {
                  "score": 252,
                  "content": "I think that a lot of people think \"Hey, women have been doing it since the dawn of time. How hard can it be?\" And they're right in that women have been doing it since the dawn of time. What they omit is that some of those women died in the process, some merely had life-changing body changes, and not a single one was ready to host guests a few days later.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 28,
                      "content": "It’s literally been one of the leading causes of death for women since the dawn of time and people act like it’s nothing. It’s crazy",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Excellent answer.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I'm middle aged and childfree so I can only imagine how difficult being pregnant and giving birth can be for women. But I've been doing lots of genealogy research on my family for the past several months and it's been heartbreaking to see so many of my female ancestors and family members who died when they were in their 20s and 30s. It's bad enough with modern medicine and I can't fathom how hard it must've been for women centuries ago or, for that matter, even decades ago. \n\nThis guy is so YTA.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "My Mum went blind giving birth to me! Only for 48hrs but that's pretty serious!",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 382,
              "content": "To add to this op seems avoiding conflict and placing the blame everywhere else is downright cowardice when your wife should rightfully expect you to have her back. You're about to have a child together, but you care more about what your family thinks and wants over your wife and child. You didnt even run it by your wife first. YTA 100%",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 236,
              "content": "RIGHT!  She could have an emergency c-section, which I did, which is very  painful and can keep you in the hospital an extra day or two if all goes well.  \n\nAnd then it HURTS moving.  Even if all things go well, c-sections hurt worse.  \n\nSO SURE lets just have guests over for a week while you are hurting, not sleeping, probably not looking after yourself well, and caring for a brand new baby.\n\nOh, and did anyone remind you of this thing called GLOBAL PANDEMIC????  The risk to your newborn baby???",
              "id": 52,
              "comments": [
                {
                  "score": 12,
                  "content": "THIS! My sister is due in March 2022 and my family and I agree to wear masks around my nephew, because duh, HE'LL BE A NEWBORN.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Exactly this!!!! The exhaustion is unbearable ,however a new mother will go into momma lion mode and will not accept help from anyone until she is fully bonded with the child, no matter how tired she is. You are taking that away from her. Don’t do that. The fact that you want her to apologize to your family because she doesn’t want them to come over is bullshit. If she gets along with them, then you should of fostered and respected the beauty of their relationship rather than “it might come off wrong.” You put her in this position, you take the heat, you fix it. She has enough of her plate than to be dealing with this. I dealt with the same thing with my first, and let me tell you, my in-laws slept on a blow up mattress and never touched my child.  That was more uncomfortable than them staying home. So, I bet she can retaliate in the same way. Be prepared. And yeah, YTA!!!!",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Ans this is just the physical side. Which actually isnt the hardest part of birth. Yeah get your head around that! They have drugs for the physical side. \n\nWhat a lot of men dont realise is the hormones. The chemicals that control your _emotions_ have just been hijacked to _create life_ instead. \n\nIts a big deal. Which is ironic because the thing he is scared of - upsetting his mummy - is actually the dramatic silly thing here, not wanting some space immediately after giving birth.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Speaking as someone who had a very chilled homebirth, never had stitches and didn't attend hospital at all, I still didn't want any visitors for a month. This decision should've been hers and hers alone, she doesn't even need a reason such as a traumatic birth, but the fact her husband didn't even consider this possibility makes me wonder if he's even ready for this.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "It seems OP is hell bent on getting the Asshole of the Year award with less than a week of it left. Kinda impressive that.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2281,
          "content": "🥇🏅🥇🏅🥇🏅🥇🏅 here’s the only gold I have\n\nBut seriously OP YTA!!! Dude have you not paid attention at all when the doctors or anyone has described birth and the aftermath??? \n\nPush out a golf ball sized kidney stone and tell me if you want to wait on your family and play host, and even then you still wouldn’t understand how your wife feels. And frankly your mother is TA for having given birth and not being considerate enough to think how your wife would feel having ANYONE staying after that. \n\nThis thread is full of in-laws visiting after a baby is born and expecting to be waited on and entertained, and you have the audacity to 1) agree without discussing with your wife (AH move no matter the circumstances, she’s your partner act like it) and 2) get angry at her and post on here as if you don’t already know you messed up.",
          "id": 58,
          "comments": [
            {
              "score": 1592,
              "content": "I made the HUGE, HUGE mistake of allowing my parents to visit for a week the day after I got home from a c-section. I thought my parents would be helpful. They were not. This was over  22 years ago and I have never forgotten it and use that experience to counsel others to not do it.",
              "id": 59,
              "comments": [
                {
                  "score": 1004,
                  "content": "I also made the egregious error of allowing my parents to fly out 2 weeks before the baby was due and stay for a month to \"help.\" My parents were actually bitching to me that my daughter was overdue because they'd already been staying with us two weeks (never mind I was the one who had been pregnant for 41 weeks), and when baby came their unmanaged, pathological anxiety was so intense they undermined my husband and me trying to establish a routine and parenting philosophy we had agreed on with each other. Never, ever again. \n\nOP, you are enormously TA. NONE of your edits exonerate you from this",
                  "id": 60,
                  "comments": [
                    {
                      "score": 299,
                      "content": "How dare your child not arrive on their timetable! My mother also tried to undermine everything I tried to do.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "lol yeah I thought about this when reading the post...what if the baby hasn't arrived by the time they got there? Myself and my brother were all 3+ weeks late (I don't think they let you go this overdue anymore but apparently Medicaid wasn't paying for inductions back in 89 and 93 like they do now). I bet you anything that if she went into labor while the family was there, OP would be demanding she let them be in the delivery room too.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 298,
              "content": "Agreed, two AH because how another woman who’s given birth couldn’t understand that maybe & by maybe mean definitely wouldn’t want a whole squad of people who don’t normally live in her home directly after the most traumatic experience she may ever endure is beyond me.\n\nEdit: for grammar only",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Just my two cents about the MIL, in some cultures and families it’s normal to have the MIL help out the new mother, and the help is often appreciated. Granted, the MIL is expected to actually help and not expect to be entertained. When I was born for example, my paternal grandmother was the one who helped my mom with her postnatal issues and took care of me while she recovered from childbirth. My mom is still grateful to this day and even after divorcing my father visits her regularly. Just saying that the MIL is not necessarily TA, just maybe doesn’t know that her presence isn’t something OP’s wife would want, especially if her son is all for it.",
              "id": 64,
              "comments": [
                {
                  "score": 16,
                  "content": "That’s a good point, if the MIL was helping that would be great, but from OP’s responses I don’t think that was conveyed. Hopefully if they show up they do truly help",
                  "id": 65,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I mean if OP’s wife isn’t comfortable with MIL’s help during this intimate time, MIL just shouldn’t come. It’s hard for MIL not to feel hurt after she was invited and disinvited, so without more information the only AH I see is OP. You shouldn’t invite your parents without consulting your wife ever, much less during a stressful time like this.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "He probably hasnt been to any of the appointments. Only a complete dick would do this",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Exactly that. In my country we have a term called \"šestinedělí\", which literally means \"six Sundays\". During that time the mother is healing from the childbirth and bonding with the newborn. The baby is getting antibodies and adjusts to the world. It's a super important time for both mother and child and should NOT be interrupted in any way. And especially not by unreasonable inlaws who feel like this is the best time to come over.\n\nPlease, OP, support your wife and try to understand what a HUGE event childbirth is - for both mother and child. Your role should be making it easier for the new mother, you should protect her from the stress and allow her to bond with the child and heal with no complications. That is your role here, as the father. You should definitely start accepting guests only after you make sure your wife is okay with that and she's strong enough to do that.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2125,
          "content": "OP read the lemon clot essay\n\nhttps://community.babycenter.com/post/a29842181/the_lemon_clot_essay-_if_you_are_planning_to_have_people_over_after_birth_you_need_to_read_this",
          "id": 69,
          "comments": [
            {
              "score": 565,
              "content": "This is amazing and should be required reading for all dads to be who are considering inviting anyone over.",
              "id": 70,
              "comments": [
                {
                  "score": 60,
                  "content": "It should be required reading for dads period. Men should be aware of how pregnancy and childbirth can go and the consequences. I feel like we already lie to women about it, the fact that we still have so many men grossed out by periods, they really need to hear it.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "This should be required reading in sex education classes, and given to expectant fathers when they're supporting their wives or girlfriends at doctor's appointments. Also, these should be given to new grandparents as well. OP, YTA of the year at this point.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 406,
              "content": "That is amazingly accurate. Clots can get larger than lemons though, that just when they tell you to call. I was told not to come in unless they got bigger than a grapefruit. A GRAPEFRUIT!",
              "id": 73,
              "comments": [
                {
                  "score": 201,
                  "content": "I had a clot the size of a cantaloupe. Scared the hell out of me",
                  "id": 74,
                  "comments": [
                    {
                      "score": 379,
                      "content": "You know all the spiel they give you in high school to promote birth control?\n\nYeah, no booklet or community leader was more convincing than this particular comment",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "[deleted]",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "...what! Lord help me. I have three months of this pregnancy left and now I am sweating.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "Thank you, I was trying to find that to comment with this very link",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1213,
          "content": "I am literally living this out right now. This is very accurate. I feel like it’s bad enough having to explain everything to my kids and recover around them, I absolutely could not do it outside our nuclear family. If I could limit all the gross things I’m doing right now to just my husband, I would. Not to mention I literally have been ordered to sit or lay here and just heal for a solid week and only get up to go to the bathroom/shower. Not even get up and make myself food. If I want or need anything, my husband needs to take care of it for me. I’m not a crier and I have cried a lot in the few days since baby got here. I look terrible, and I’m allowed because I’m not a decoration, I just had a baby. But I guess my point is I just want to be ugly and yucky and keep my weird hours and heal and snuggle my baby without ANY extra bodies in my space or any added responsibilities. Let your wife have that, sir. Your wife and baby need your undivided time and attention. YTA.",
          "id": 79,
          "comments": [
            {
              "score": 574,
              "content": "I just had the flash to a Jewish custom… immediately after a death in a family, all the mirrors in the deceased family’s home are covered with cloth for a week.  Why? So the family can get through the initial shock and grief without having to be the slightest bit concerned what they look like.  The idea is you absolutely get to fall apart and be a wreck before beginning to adjust to the “new normal” of life.  Similar should absolutely be allowed when recovering from major medical procedures.  You get to be as gross as needed for you to focus on the most important parts of healing, and if that means combing your hair regularly is too much, it’s too much.",
              "id": 80,
              "comments": [
                {
                  "score": 183,
                  "content": "[deleted]",
                  "id": 81,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Agreed.  I knew about covering mirrors, but didn't know WHY.  This is the most common-sensical thing I've ever heard.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I remember going around a local hospice, and all the mirrors had little wooden doors over them. People who are very unwell and in bad shape maybe don't want to catch an unwanted glimpse of themselves.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 821,
          "content": "YTA And if she has to have am emergency c-section she's got a cut going through 8 layers of muscle/fat/skin and potential STAPLES. I've had 2 and the pain can be horrible especially if she regularly has to navigate stairs inthe home.\n\nAlso are you going to help clean?? Cook?? Make sure that your parents aren't boundary stomping about the baby??",
          "id": 84,
          "comments": [
            {
              "score": 670,
              "content": "My guess is no. Another guess is he won't ask his family to either. They're guests. His guests. And wife is right HE has to cancel because A. His family and most importantly B. He caused this problem.",
              "id": 85,
              "comments": [
                {
                  "score": 933,
                  "content": "this. Momma and daddy guilted him into a visit because he “owed” them from Christmas?!?!? Less than zero spine exhibited so far. This isn’t going to go well.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 2531,
                      "content": "This stood out to me too.\n\nAnyone who lays a guilt trip on their child not traveling while their spouse is pregnant in the middle of a pandemic is an AH.\n\nOP - you made the decision to throw your wife under the bus because you are not enough of a man to stand up to your parents. You made the decision to make your PREGNANT WIFE the bad guy because you do not have the balls to tell your Mother that there will be another Christmas next year and you will see her at another time.\n\nOP - you are robbing your wife of the time to recover after the baby is born. I've done this 4 times. It was miserable having my OWN mother in the house and the woman is very helpful and kind. Had my ILs come to \"help\" my husband would have found himself squarely in marital counseling because there is NO WAY I'd forgive him easily for putting me in the position of having to be \"on\" while recovering from childbirth.\n\nDude! Its not like hallmark where there is a cute bundle handled to smiley shiney parents. Your wife is going to be in a lot of pain and will want privacy to deal with the blood, cracked nipples, learning to nurse in her OWN home without worrying about who is in the room judging her.\n\nYour parents are CLEARLY judgemental if they are laying on the guilt over Christmas -- do you really NOT think that won't translate to every single thing you wife does in the weeks following HER baby's birth?\n\nYOU made this mess. YOU created this situation. Now YOU call YOUR family and tell them your ROYALLY screwed up and that there will be no visitors staying with you guys in the immediate aftermath of delivery until you as a nuclear family are ready to have people. \n\nYour wife will NEVER forget what you just did to her. She will  NEVER forget that you just unilaterally decided how she should recover. You are a truly terrible husband.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 780,
          "content": "Don't forget she will also be expected to play hostess and cook and clean for them on top of every thing else.",
          "id": 88,
          "comments": [
            {
              "score": 1078,
              "content": "OP edited to say the wife won’t be “hosting anyone” - as someone who feels the NEED to host when people are at my house, that’s not always an option. It is added stress.",
              "id": 89,
              "comments": [
                {
                  "score": 715,
                  "content": "What he says and what will happen are 2 different things. OP won't understand until afterwards. A few days of a baby crying every all night may help him understand why it's not a good idea.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 640,
                      "content": "And he keeps saying his mom can help. Dude. She’s going to be really vulnerable. She gets to decide who is around her full stop. It doesn’t matter if she’s normally comfortable with them. Plus having a lot of people around a newborn is dangerous anytime, never mind in a pandemic.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 250,
                      "content": "I doubt OP will care, sounds like his mom would walk in while his wife is readying to breastfeed and offer to “help”, which to OP sounds super helpful and not intrusive at all.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "It is also so \"funny\" that he says they will be helpful, especially his mom, when his parents are very upfront that they are coming to *spend time with OP, wife, and baby*. That is very clearly NOT an offer to keep house so that OP and wife can focus on taking care of her and baby.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 658,
                  "content": "Given how clueless this guy is, I suspect he doesn't see all the things his wife normally does to prepare for guests. The cleaning, the shopping, planning and preparing meals, planning outings, etc. Clueless dudes tend to think these things just happen by magic.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 127,
                      "content": "As someone with 3 sisters who probably equally prepares for guests, I notice these things easily and am always shocked at how clueless someone could be.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Which is why marriage benefits men more and women file for divorce more often - and why men are shocked when they do.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 240,
                  "content": "And let's not gloss over     . . .\n\n&#x200B;\n\n> she explained that my family can be a lot of work and having them as guests while caretaking for a newborn is the last thing she wanted.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 74,
                      "content": "Oh yes. The helpful family has arrived... If I roll my eyes any harder I'll go blind.",
                      "id": 98,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "The conversation should have ended there, but he keeps on being an asshole.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "Plus, some people SAY that they don’t need to be hosted, but once they’re in your house, their feet are up and their hand is open and their mouth is saying “could I get a drink?”",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "I agree with this and just to add a person who is as oblivious as OP is does not make a good host. There is just no way. I would lay money on the fact that he wont keep the house correctly.\n\nOP: YTA your wife is perfectly reasonable.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "Right?? If you’re in my house, I’m not comfortable “not hosting.” What would that even look like? Staying in my room all day while others play pass the baby? Hoping that all messes magically clean themselves in the exact way I want them to be cleaned?",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "He says that but he doesn’t seem to understand anything about hosting or being a team player",
                  "id": 103,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Even if she isn’t expected to cook and clean for them, she is going to be forced to visit and spend time focused on talking and visiting with them. Which would also include getting dressed in proper clothing for company. I personally have not given birth, but I have friends that have, and they spent the first two weeks at least in pajamas without a bra because it hurt too much and they were breastfeeding constantly. Time for OP to sit down and read the “What to Expect” chapters on after-birth recovery.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "[deleted]",
              "id": 105,
              "comments": [
                {
                  "score": 12,
                  "content": "My mom came specifically to “help” after one of my births.  Upon me picking her up from the airport (husband deployed) I made my needs every clear: I just needed her to help amuse the older kids when they were around (they all went to school during the day) and to take over cooking duty.  Woman was constantly asking me about what my plans for dinner or lunch were. I said she could make whatever, we had a very full pantry, but I didn’t have her ingredients, so I offered the car to go get whatever she needed.  She told me she wouldn’t drive someone else’s car.  I would buy her ingredients, but somehow be the one who ended up cooking most of the time and doing the grocery shopping.  If I didn’t need her for an emergency surgery I did have right after birth and so got her help FOR THAT DAY ONLY, it would have been so much less stressful to have no one there.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Even if not, the parents are coming to get attention at least from their son, so instead of being around his wife and their newborn he is going to be catching up with his parents??",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 729,
          "content": "I just gave birth last month and im so enraged for the wife. I was so thankful for no family being around, it was crucial for my recovery and bonding with baby. OP needs to cancel on his family, his wife and her health are the priority, not his parents feelings.",
          "id": 108,
          "comments": [
            {
              "score": 46,
              "content": "Exactly! And I don't give a shit if he feels like he's between a rock and a hard place, he literally put himself there the second he thought it was a good idea to make this decision without his wife.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "This post enrages me so much. I don't even want to be around people during menstrual cycles because I have endometriosis. Hosting or not, I just don't want anyone in my space. I don't care if they are low-maintenance, I don't want them in my space.\n\nAfter the seven surgeries I had, I only wanted one person in the home, and it was more ideal for them to just stop by and help with certain things and then leave so I could have the space to recover.\n\nI COULD NOT IMAGINE pushing a melon out of my body and then having a chaotic household. OP's edits don't make him any less of an AH. He and his whole family need to go get some Act Right.\n\nETA: And the pushing a melon out aspect includes all of the aftereffects of doing so. Every fiber of my being is pissed for OP's partner right now.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 685,
          "content": "This comment right here!! YOU are the AH Big time on this. YOU DO NOT GET TO TELL HER IS NOT A BIG DEAL YOU DON’T HAVE TO GIVE BIRTH TO A BABY AND YOU WILL DO NOTHING I BET. SHE HAS TO HEAL, LEARN TO TAKE CARE OF A NEW BORN AND RUN WITH NO SLEEP AND YOU WILL DO NOTHING. So dont act like is not a big deal. Yes is a HUGE deal and you F’ed up BIG TIME. You family seems very pushy not as laid back as you say. If your family was laidback and understanding they wouldn’t be DEMANDING you to spend time with you and berating you for missing Christmas. Your wife was in her last trimester and is risky to travel that much they SHOUL’VE understood that and they SHOULD NOT be demanding you make it up to them I”m sorry but you seem to have a blind spot when it comes to your family but from what you’ve said so far. Your family sounds demanding and self centered. They did not take her health and feelings into consideration, they just want to have THEIR way because you Missed THEIR christmas? Come on! Give me a break! You can’t possibly be this DENSE OP 😡",
          "id": 111,
          "comments": [
            {
              "score": 332,
              "content": "OP unable to see any issue's with his family's expectations is especially asshole-ish to me.\n\n>my parents were calling to continue complaining about us not spending Christmas with them and demanded I make it up for them.\n\nHis parents find it a wrong committed against them that needs to be made up for that they just had a fucking baby and had the audacity to not travel out of state to see them for Christmas.\n\n***HOW THE FUCK DID THEY THINK THAT WAS A POSSIBILITY IN THE FIRST PLACE?***\n\nEverybody knew the due date, right? Christmas didn't change dates suddenly. Why does it sound like they were surprised or still expected them to show up?",
              "id": 112,
              "comments": [
                {
                  "score": 117,
                  "content": "The demanding a visit is a HUGE red flag.   These are selfish people who will not be of any help whatever.    The fact that hubby invited them for a week (anytime not just now) without discussing it with wife is also a huge sign that he is just like them.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Exactly!!! It baffles me the fact that OP can’t see the issue in all of this. Like this is all information for that poor woman, to have a husband this dense I’m sorry but he needs a reality check. And his family too! I hope he does take these comments into account, looks at himself and makes it right by her. Or his marriage will be in trouble from here on out.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I'm in a fantasy league and we were planning a boys trip for the draft to visit two people that moved out of state. Two of us had kids or were due close to the draft date. No one thought it was a possibility that they would travel. Closest thing was just unserious roasting about learning to count to 9 when looking at a calendar.\n\nEven if one or both of those guys said they would make the trip anyway, we for sure would have called them fucking idiots for even thinking it. We knew months in advance that wasn't a possibility. WTF is wrong with OP and his family?",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "his poor wife. I feel so bad for her. Like, my heart is breaking for her right now. It must be so hard to even look at him after he pulled this crap.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 400,
          "content": "Sooooo much this. Giving birth can be a traumatic experience. OP, your wife WILL be exhausted.  The ONLY way other people should be allowed to stay at the house is if a) you both agree on it and b) those people are there to WORK. By that I mean, clean, cook, do laundry, run errands, etc. Not by “helping hold the baby”.  Especially if planning to breastfeed, mom and baby need a LOT of alone time to work on that.",
          "id": 117,
          "comments": [
            {
              "score": 243,
              "content": "Yes, I was fine having my in-laws, but my MIL is a saint. There wasn’t a dirty dish in my house the entire time she was there. She did laundry. She took the baby and told me to take a nap. She cooked all the meals and cleaned my bathroom. \n\nWe’re also pretty close and I don’t get embarrassed easily. \n\nOP’s wife doesn’t seem to feel the same about her MIL as I do about mine. I asked for my MIL after I had my babies, but I knew she’d be awesome, and I was not worried about her seeing me try to breastfeed.",
              "id": 118,
              "comments": [
                {
                  "score": 69,
                  "content": "That was my dad. Fed us, cleaned the house, and sat up with the colicky baby so we could sleep. He was a nurturing saint.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Go dad!!!! I wish more dads had that kind of attitude, sounds like you lucked out",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "I am so glad there is someone else with a great MIL (and mother).    For my first baby, we didn't have anyone come until a few days after the birth.   My Mom was a great help, and my MIL as well. (They each came for a week and were a huge help! No baby hogging, but took care of everything else and of course we happy to hold baby while I napped, etc.) \n\nFor the second baby both my parents and my MIL were there- and luckily for me they were amazing.  They watched my 3 yr old, took care of all the cooking, cleaning, etc so all I had to do was nurse the new baby and heal.    \n\nSo- it can work out IF you have good Mom's and MiLs.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yes! It’s such precious time for mom and dad to bond with baby and each other. They will never have this time back.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 384,
          "content": "And he wants her to call them up and tell them they can’t come.\n\nThe sheer audacity.",
          "id": 123,
          "comments": [
            {
              "score": 262,
              "content": ">And he wants her to call them up and tell them they can’t come.\n\nAnd this, right here... this says everything we need to know about this man that we need to know. \n\nHe wants his wife to play bad guy with his parents because he is too afraid of mommy and daddy to fix a mistake of his own making.",
              "id": 124,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "One thing men have for sure is the audacity smh",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "This. He got them into this situation. He needs to get them back out. His edited response about how he feels stuck between a rock and a hard place is such BS.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "No, not audacity. Spinelessness. Childishness.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 19617,
      "content": "My dude, you have fucked up....BIG time!!! So clearly YTA\n\n1. You invited guests over without checking with your wife: YTA\n2. You invited people to visit a new born: YTA\n3. and without checking with the mother: Big YTA!!\n4. When wife reasonably got stressed, you dismissed her feelings: YTA\n5. And told her that \"disinviting your parents would be bigger issue than her comfort\": YTA\n6. After her justifiable upset and not talking to you, rather than realize you've seriously messed up, you post here to get validation and overrule your wife: YTA\n7. (From u/Punkinpry427): During a pandemic: YTA\n8. (From u/Ok-Entertainment5862): Without consideration for wife's need for physical recovery: YTA\n9. (From u/sgtwhatif): Blaming wife's thinking on her pregnancy (e.g. hormonal). Does OP know what being pregnant means?: YTA\n10. The edits. \\*\\*Facepalm\\*\\* : I'm losing hope that OP will rescue this!!: YTA\n11. (From u/anneofred):  First stages of breast feeding can be super stressful, and don’t need an audience: YTA\n12. (From u/lsp2005): (Like child bearing and delivery won't be hard enough): OP \"refused to address this with his own parents to make his wife the bad guy.\": YTA\n13. (From: u/Maigraith): OP kicked off all this commotion and stress on his heavily pregnant wife by not immediately dismissing his parents COMPLETELY unreasonable expectations that they travel for the holidays.: YTA\n14. (From u/BigMamaMB): It was almost going to be a \\*\\*\\* SURPRISE \\*\\*\\* visit as OP had forgotten to even mention that he invited his parents to stay: YTA\n\nI'm sure there are more reasons as you're on a \\[FREAKING\\] Roll!!\n\nBut there's some hope for you yet, as hopefully posting mean open to realize you're wrong:\n\n1. Apologize to your wife....profusely. \\[I suggest the curated list of reasons above you can list to your wife as part of your apology\\]\n2. Talk to your parents and importantly (do NOT blame wife), but tell them that in second thoughts right after birth is NOT a good time. And you'll have them over some time later once you all think is best. You can tell them you're looking forward for them to meet her/him and will video chat before their visit.\n3. Get some peace offering for wife like a breakfast in bed, or some flowers\n\nCongratulations on your baby and best wishes to mum and child!\n\n\\[Edit: 7-... thanks to brilliant comments below\n\n1. There are many other helpful comments, OP be sure to read all the ways you are wrong here below\n2. I'll stop editing as the post is getting kind of long. But Many thanks for helping compile this list. I HAD to add No. 14 from u/BigMamaMB which is another great point.\n3. Part of me hopes that OP is not editing, as he's busy getting the flowers, and brunch ready, and practicing his apology in the mirror. But I would bet against myself here, as I think he carries the same entitlement as his parents\n4. Finally, MANY thanks for **ALL** the awards. Some **VERY** kind Redditors bestowed me with things I didn't know existed. 😀😀 Very thankful!\\]",
      "id": 128,
      "comments": [
        {
          "score": 3449,
          "content": "7) He did all this in a pandemic.",
          "id": 129,
          "comments": [
            {
              "score": 766,
              "content": "Yes! I said that in my comment too. COVID has led to stillbirth. Of course she doesn’t want to risk getting sick and harming her unborn child, just so they can visit his parents for Christmas!!",
              "id": 130,
              "comments": [
                {
                  "score": 17,
                  "content": "Came here to say this. It’s normal for parents to not let people around their new baby because they’re so susceptible to getting sick.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 266,
              "content": "THIISSSSS",
              "id": 132,
              "comments": [
                {
                  "score": 384,
                  "content": "Yup, this is one of those posts that requires people to read between the lines because of how fucking oblivious the OP is, but in this case, it's really not difficult.\n\nThis family threw a hissy fit because OP couldn't spend the holidays with them *while preparing for a birth during a pandemic?* They're even more oblivious and selfish than OP is. So not *only* are they likely going to swan around and demand that this poor postpartum woman entertain them, they **absolutely cannot fucking be trusted to do the testing and isolation regimen to keep a newborn safe under these circumstances.**",
                  "id": 133,
                  "comments": [
                    {
                      "score": 37,
                      "content": "This is what got me!  OP claiming they’re great people and it won’t be work to host them when they are clearly the kind of people to throw a hissy fit if things aren’t done exactly their way even when their way is wildly unreasonable.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "Honestly, u/JosephPeckerjr might take the award for the biggest AH I've seen this year. \n\nIf I were his partner, I would've left him to hang out with his family and gone to my parents/family/very trusted friend if at all possible. \n\nIf it weren't possible, I'd tell him to go get a hotel room where he can hang out with his parents, and that I'd call someone I could trust to stay with me during that time. \n\nHow obtuse can one be?",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "Totally agree.  Held off saying that piece in case he doesn’t believe the pandemic is real (the he’ll just close himself off to all the other feedback)",
              "id": 136,
              "comments": [
                {
                  "score": 142,
                  "content": "I would counter with RSV if they wanna go the stupid Covid denier route.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 43,
                      "content": "A friend of mine from high school went through RSV with her then 3 week old a few years ago. The baby literally almost died and had to be care-flighted to a hospital in a bigger city 2 hours away bc the hospital in our home town didn't have equipment small enough for the treatments she needed. \n\nNow let's add in the fact that hospitals are about to get FUCKED by holiday covid cases and hope that the hospital nearest OP has the resources available to treat a very sick, very small baby.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "And are they up on their dtap?  Probably not (though all older individuals should be, baby or no)",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1670,
          "content": "8) He gaslighted her very legitimate argument against having to deal with guests a WEEK AFTER GIVING BIRTH by repeatedly calling her \"hormonal\" and \"melodramatic\". Because heaven forfend that he actually acknowledge that his wife is a rational, sensible human being and not just a \"ridiculous, emotional woman\".",
          "id": 140,
          "comments": [
            {
              "score": 532,
              "content": "He might as well have called her hysterical.",
              "id": 141,
              "comments": [
                {
                  "score": 54,
                  "content": "Vibrators were invented for hysterical women. I suggest his wife swap him with one.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 25,
                      "content": "The history of hysteria, women, and medicine is sick and sinister.",
                      "id": 143,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 194,
              "content": "It's not even a week after giving birth. It's for an entire  week immediately after giving birth. It's unbelievable.",
              "id": 144,
              "comments": [
                {
                  "score": 25,
                  "content": "It's like he \\*wants\\* her to get PPD.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Why do men dismiss pregnant women as \"hormonal\" as if they're just not trying to be rational when in fact they are producing enough hormones to grow an ENTIRE HUMAN BEING!!! Your brain is being soaked into chemicals. Do they have any idea how traumatic that is, ON TOP OF EVERYTHING ELSE!!",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "I have a week old newborn atm and my parents visited today. FOR TWO HOURS. Boy, was I happy, when they finally left! And they didnt even want water or tea, just hold the baby, coo on them and talk to us...",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 735,
          "content": "Dude, I wouldn’t even invite my family to stay for a week without checking with my housemate. That’s just the bare minimum courtesy of living with someone. YTA",
          "id": 148,
          "comments": [
            {
              "score": 215,
              "content": "Seriously, it's bad form to invite people to stay at your house without clearing it with a spouse/partner/roommate regardless of circumstances. Add in the pregnancy, new baby, pandemic aspect and this dude is the ultimate asshole. YTA so much. His family kinda sucks too for making him feel guilty for not visiting at Christmas with a pregnant wife during a pandemic and then turning that around to invite themselves over in the immediate aftermath of having a baby. Who does that?",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Most people wouldn’t invite family over for a week even without just giving birth 😂",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 470,
          "content": "And the parents didn't actually offer to help - they're coming over so OP and his wife can \"make it up to them\" for not traveling two states away while days away from giving birth.  OP says they all get along but yikes.",
          "id": 151,
          "comments": [
            {
              "score": 219,
              "content": "EXACTLY. The fact that this whole situation kicked off with OP's parents' emotional blackmail is a strong indication that they are the LAST people who should be coming over so soon after the baby is born. I can already see OP's parents ganging up on his wife while OP himself cowers in a corner, happy to let his wife and new baby be meatshields against his asshole parents.",
              "id": 152,
              "comments": [
                {
                  "score": 34,
                  "content": "I can just see OP's Mom absolutely undermining his wife when it comes to breastfeeding because she wants to give the baby a bottle. This will be 100% abou the in laws wants as opposed to his wife's needs.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yeah, I'm sure they \"get along.\" Because OP is so oblivious he doesn't notice his wife's grinding her teeth during every visit.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 357,
          "content": "Absolutely! Everything mentioned above - but also, did you notice how he mentioned at the beginning of the post that \"things have been intense lately\" with his wife being \"hormonal\"? Like he was trying to make her out to be irrational and unreasonable hoping we'd side with him smt. YTA OP and in need of a harsh reality check my dude.",
          "id": 155,
          "comments": [
            {
              "score": 34,
              "content": "Oh this set me off right away that he already doesn't give a crap what his wife is going through and doesn't care to know what is happening to her. My heart breaks for her, how can someone she loves be this careless and dismissive.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Exactly. It’s hard to believe he’s 27 and not 17.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Things have more likely been intense lately since OP doesn't seem to be taking the whole \"birth\" and \"baby things seriously, nor does he have a lick of sense that he might want to educate himself on what the first couple months are going to entail.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 255,
          "content": "He lost me at “extra hormonal”. She’s still your wife, dingbat. and with a baby looming at any moment, I can imagine she needs a little compassion. Major YTA.",
          "id": 159,
          "comments": [
            {
              "score": 43,
              "content": "Totally. Accusing any woman during her period of being hormonal is low. Accusing your heavily pregnant wife of being \"extra hormonal\" is like Flo Rida would say \"low low low low\"",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 236,
          "content": "Add on he’s doing all this because his parents are butt hurt that their son and his 8+ month pregnant wife wouldn’t travel to them for the holidays. You’re not supposed to travel when you’re that pregnant, what if something happens? Then you’re far away from your care team and everything becomes 10x scarier, f that noise. He should have put his parents in their place, which is below his wife on the importance ladder.",
          "id": 161,
          "comments": [
            {
              "score": 10,
              "content": "What are his parents going to do when shocker, the new family stays home for Christmas in 2022 because traveling with a 1 YO is a nightmare. (Even before a pandemic,  airplanes are germ recyclers.)",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "Legit took MONTHS for bleeding and pain to stop... And I had a relatively straightforward birth experience. Jesus... the first couple of weeks were brutal. \n\nDid this guy not attend the birth classes?? They cover all of this... I can't understand why he does not understand that this is obviously an issue.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Yes. All this. Well said!",
          "id": 164,
          "comments": [
            {
              "score": 95,
              "content": "8. His wife will still be physically recovering from birth",
              "id": 165,
              "comments": [
                {
                  "score": 174,
                  "content": "9. His wife might be recovering from a TRAUMATIC birth. What if she has an emergency csection? What if something happens with the baby and they need time in the NICU? will OPs family still be waiting at the house expecting to be entertained and fed??",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "You forgot the part where SHE has to now uninvite them because her husband is too scared to",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7770,
      "content": "Yta. So instead of having the week after giving birth to begin healing, bonding, time with her little family of three you have made it so your wife has to host and put up with having guests? Do you have any idea how much pain she’s going to be in? Not to mention the two of you learning to be parents.\n\nPlus well done on showing to your wife that at her most vulnerable you will not be putting her first.",
      "id": 168,
      "comments": [
        {
          "score": 2638,
          "content": "[deleted]",
          "id": 169,
          "comments": [
            {
              "score": 1174,
              "content": "And apparently she’s being ‘hormonal’. Good grief OP, she’s heavily pregnant and you are being like this - I think she’s being pretty relaxed given the circumstances!",
              "id": 170,
              "comments": [
                {
                  "score": 422,
                  "content": "Heavily pregnant during a time where omicron is spreading like crazy, even to those with vaccines, and can take several days to test positive. My mom just tested positive after having fully quarantined and testing negative for the last 6 days away from people who tested positive.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I'm sorry to hear this. I hope she recovers swiftly.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 326,
          "content": "I had pain medication that I had to shove up my butt. It was gross and uncomfortable but I would have totally loved having guests in my house for a week while i dealt with that and more. /s obviously.  I'm not a fan of this fella at all.",
          "id": 173,
          "comments": [
            {
              "score": 43,
              "content": "My husband had to help dress me. My milk never really came in and I was topless all the time because my daughter was hungry. We ended up switching to formula but I was fragile as is without being under the eyes of other people.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Don’t forget the maxing out of suppositories due to the extremely severe constipation from all of the pain meds. \n\nI had such a high fever for a week due to infection after birth I actually can’t remember most of that week except a few of the 911 calls due to the voices of sheer panic that got through my hazy brain. But OP is worried most about how his parents will feel rescheduling instead of how his wife will be after giving birth. What. An. AH.\n\nNot even sure why bother with the doubling down edit. Just even more of a colossal AH.",
              "id": 175,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 262,
          "content": "No matter how well meaning OP’s parents are, it’s almost impossible to figure out how *you* parent when there are other authority figures hovering ready to ‘help.’ \n\nI also really don’t buy that people who are willing to invite themselves over for a week to see a new baby are going to be respectful of the new mom’s privacy, space or preferences about how the baby is handled.",
          "id": 176,
          "comments": [
            {
              "score": 36,
              "content": "I feel like thats why he wants his parents there. He is thinking that they will help him get sleep and clean the house and tell him what to do so he doesn't have to figure it out on his own or do any extra work",
              "id": 177,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "Yes this this holy shit. There is no way they would respect her, they already aren't.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "The post screams mommy issues to me lol he’s more concerned with pleasing his parents than his wife’s mental and physical health",
          "id": 179,
          "comments": [
            {
              "score": 22,
              "content": "Mommy issues to the point that he hasn’t taken it upon himself to learn anything about giving birth & what happens after or he would’ve understood why he and his wife will need those precious few weeks to bond and soak up uninterrupted time with their newborn. \n\nClassic male bullshit where a guy marries someone he wants to mother him so he never has to take responsibility for anything or think of other people.",
              "id": 180,
              "comments": [
                {
                  "score": 16,
                  "content": "Yeah definitely concerning for the wife. I hope this is a serious slap in his face, but the edits on his post make me think he’s never going to learn unless she leaves him. I hope she invites her family over unannounced one week and lets him deal with it. Inviting family over for a week is a lot of stress even without just giving birth lmfaooo",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "For me the biggest sign of delusion is that OP right off the bat says his parents strong armed him into inviting them and yet is like… “wHy wOuLdN’t mY wiFe nOt wAnt tO hOsT tHEm”",
          "id": 182,
          "comments": [
            {
              "score": 21,
              "content": "The fact that he thinks it wouldn’t be any extra work just shows how much extra work and stress would be put on his wife.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "If I were in the wife's shoes, I would say it's fine for his family to visit. I would then take the baby and go to my parents' house for that week.\n\nRecovery after birth fucking sucks. On top of the physical damage, you're ridiculously hormonal, milk is either going everywhere or not getting anywhere, plus you don't get any restful sleep for AT LEAST the first month. Even if the wife isn't having to do the work of hosting, just having people in her space while she's recovering and trying to figure out a newborn would be awful.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "And the edits. \"I never said I expected her to be doing hostess work!\"\n\n\nMy dude 95% of men are absolutely oblivious as to what work is even involved in hosting. It just magically happens, and THEY don't have to do it, so obviously no one does and the work doesn't exist. If HE is not handling extra concerns, then yeah he IS expecting her to pick up the slack *lmaoo*\n\n\nDid he think about sleeping arrangements for them? Arrangements that will be comfortable for a week, extra blankets or pillows? Meal planning/grocery shopping for feeding extra people? Extra cleaning to make it guest-ready instead of normal-ready? Extra cleaning to keep it presentable while there are extra people around?\n\n\nHas he planned any activities, or consulted them what they were expecting to be able to do? Board or card games, places to walk or visit?\n\nHas he talked with his parents about what they are willing to do to help?\n\n*I could go on*.\n\n\n\nAnd to think this all could have been avoided by him seeing the text, and then quick messaging her like \"Hey hun, my parents want to visit, when would be a good time?\", not just immediately throwing them whatever they want in appeasement.\n\nYTA",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "My sons father invited his mother to stay with us immediately after I gave birth. I tried to tell him that I was not okay with it but he insisted it would be fine. His mother ended up calling him while he was at work because I was upstairs sleeping while my son was napping (since I’d been up all night breastfeeding and doing new mom stuff) and that I wouldn’t let her hold our son while he was crying (because again, breastfeeding). It was an absolute nightmare that I don’t wish on anyone. YTA OP and good luck trying to fix it if you go through with this.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6488,
      "content": "All I need is the title for this one: YTA. \n\nThe first few days are precious immediate family time. Barricade the door from the world and bond with your new arrival. \n\nFamily have to wait their turn.\n\nEDIT: having read a few lines, your family are assholes too.",
      "id": 187,
      "comments": [
        {
          "score": 1327,
          "content": "Well they raised an AH, so no surprise there.",
          "id": 188,
          "comments": [
            {
              "score": 33,
              "content": "Good one!",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "The nut doesn’t fall far from the tree, after all.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "So much so, i would say the apple doesn't fall far from the tree.",
          "id": 191,
          "comments": [
            {
              "score": 29,
              "content": "Or in this case the asshole didnt fall far from the ass!!",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 236,
          "content": "Yeah, I think we all forced ourselves to read through the whole thing but he clearly established being the AH within a few lines.",
          "id": 193,
          "comments": [
            {
              "score": 57,
              "content": "the edits are even worse",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "It was all downhill from the title.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "The titles are usually purposely misleading, but not this one. Went from bad to worse to the worst.",
              "id": 196,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 211,
          "content": "The way this post reads it looks like OP is about to drive his marriage off a cliff if he doesn’t immediately turn things around and start giving his wife the respect and understanding that she deserves! He is clearly demonstrating his cluelessness on so many levels (fully documented in everyone’s comments) that he must not only fix this situation OF HIS MAKING but get an even larger clue about the new reality that his life is about to become.\n\nSo pump the brakes and turn it around fast! Otherwise you are seriously TA!!",
          "id": 197,
          "comments": [
            {
              "score": 16,
              "content": "Wouldn't be surprised if the wife and baby left the hospital and didn't go back to their house.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 187,
          "content": "Right!?! He has to make it up to his parents during a pandemic with a pregnant wife that they couldn’t spend Christmas together!? WTH",
          "id": 199,
          "comments": [
            {
              "score": 16,
              "content": "Did his mother not have a child? Does she not remember the recovery time? How dare she even ask this of him? What a bunch.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "yes, if his family were not assholes they wouldn't have been mad about not spending Christmas with them when his wife is heavily pregnant and during a pandemic and thought this was a good suggestion.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Very true. I stayed with my sister on and off for the first few weeks, but she and her husband asked me to be there.",
          "id": 202,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "Something about the fact that he mentioned he used a throwaway “for privacy” and still not seeing that this visit will be a huge invasion of privacy for his wife after having JUST given birth just really solidifies the YTA ruling.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I actually did need me than the title simply because my own paternal grandparents were very helpful when my sister was born. However, my sister was the third child, not the first. My mom has a really good relationship with her in-laws. And my grandparents specifically volunteered to help out with the new baby (which was mostly taking care of the house and keeping us older kids out of Mom's hair), knowing the answer might be thank you, but no. \n\nOP's parents are already bulldozing him into submission and clearly expect to be treated as guests instead of extra hands. Even if they were perfectly accommodating and helpful, OP's wife (the one going through the hard parts) has the absolute right to say \"no visitors at the beginning.\"",
          "id": 204,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4881,
      "content": "YTA. Fine line between “my mom offered to come help with the newborn,” and “we’re going to host my whole family as soon as we get home from the hospital.” And from the sound of it, you had no intention to help with the hosting. You need to cancel this. Hosting a whole family is a lot of work. Not to mention COVID risk to the baby.",
      "id": 205,
      "comments": [
        {
          "score": 1406,
          "content": "Fine line between \"my mom offered to help but rly wants to spend the whole time holding the baby and not listening to my wife\" and \"btw babe you're in charge of everyone byyyeeee\" I'd be livid. Like this alone would be enough for at least a separation for me",
          "id": 206,
          "comments": [
            {
              "score": 655,
              "content": "To be honest, I was surprised she’s just not speaking to him I had expected to hear she had packed up and gone to her family’s.",
              "id": 207,
              "comments": [
                {
                  "score": 333,
                  "content": "Okay but same. Cause that's exactly what I would have done. You don't get to invite people FOR A WEEK and then wonder why tf I'm mad after just pushing a kid out of my vagina....",
                  "id": 208,
                  "comments": [
                    {
                      "score": 201,
                      "content": "Reading him going on about how she was over reacting was painful. Dude. Sigh.",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "The reason why she didnt pack up most likely (this is speculation) is because no family member of hers lives close to the hospital. Shes due this month and probably doesn't/shouldn't travel far because of that (which OPs family are assholes for being mad about that on top of the fact that its still a pandemic)",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 331,
              "content": ">I'd be livid.\n\nI'd be divorced.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 167,
              "content": "[deleted]",
              "id": 212,
              "comments": [
                {
                  "score": 36,
                  "content": "\"Well she's being melodramatic\" rly? Is that what you call this? And you think doubling down and putting your EXTENDED family above your wife isn't? Like so many women have said ehy you're a dick and just... He still doesn't get it. I don't understand",
                  "id": 213,
                  "comments": [
                    {
                      "score": 24,
                      "content": "So many men think that just because womens bodies are made to do child birth that it’s easy and women are blowing it out of proportions because they are just weaker than men. \n\n My cousin was like this until he had to pass a huge kidney stone by hisself and no one had sympathy for him because of how vigorously he’s shat on every pregnant woman/mom in our family for being dramatic. \n\n He came out of the bathroom (we were hanging out at the great grandmas I was 16 he was 27) he came out begging for pain meds anything to take the pain away. That no one can understand his pain. \n\n His (ex)wife looked at him while breastfeeding their two week old daughter after he just scolded her infront of everyone about her boob being out and “can’t she just go outside, he doesn’t want anyone seeing his wife’s boob.” It was winter in north Texas so yeah no. \n\n But his wife said, “It’s natural, people pass them everyday, your body is made to pass stones so don’t be so dramatic.” He screamed (yes how you are thinking) and ran back into the bathroom. \n\n We left and my great grandma called me the next day to tell me that his kidney stone was so small that he could barely keep it on his finger to show people…",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Yeah, my mom came to “help” but spent the whole time expecting us to feed her, taking photos & posting them to socials without telling us, complaining about our general cleaning standards, claiming she “didn’t know how” to help when asked to do things like sterilize bottles or start a load of laundry, constantly giving terrible, outdated advice because “in my day blah blah blah”.\n\nShe just really wanted cute photos for the socials so she could get all the “you’re such a great grandma” love online. It was absolutely exhausting.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Right?  How many MIL actually come to do the laundry and dishes when a baby arrives?  If MIL wanted to help out with that kind of work, she would be offering to visit *before* the baby was born.  I'm willing to bet that this trip is about control ,and access to the infant - not about helping her immediately post-partum DIL.\n\nEdit: typo x2",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 283,
          "content": ">to all the people saying that my wife shouldn't be hosting guests. I don't recall mentioning this nor expecting her to do anything for the family\n\nYeah, these are words that could only be spoken by the kind of asshole that's never pitched in to help prepare and host a family in one's own home.",
          "id": 217,
          "comments": [
            {
              "score": 21,
              "content": "Not to mention EVEN IF he did all the work, cooked all the foods, prepped all the rooms, entertained the fam -- this COMPLETELY removes her freedom to do whatever the heck she needs to do to be comfortable. Like waddling back and forth to the bathroom in those granny panties. Or wearing no shirt because the boobs hurt too much. Or any of the other \"postpartum is TMI and IDGAF\" things I've blurred over in the past five years.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "And completely ignores his wife when she tells him that his family can be a lot of work. He’s utterly oblivious.",
              "id": 219,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 130,
          "content": "And even if his mom offered to come help with the newborn, If the wife doesn’t want it, that’s the answer. I just had a baby and the amount of inconvenience visitors bring far exceeds the help they give— no matter her how “willing to help” they are. It messes up the routines for me and baby, it makes me have to have conversations when I’m exhausted and just want to blank stare bc I’m tired, it makes me relocate if I don’t want to show my boobs to everyone, it makes me have to explain and deal with eye rolls for things like vaccines and COVID testing to be around my baby, it makes me have to share my baby when I’m not ready, it makes me self conscious bc I’m sure there’s something I’m doing they think is wrong… the list goes on.",
          "id": 220,
          "comments": [
            {
              "score": 12,
              "content": "And if the wife doesn't want help the message HE delivers to HIS parents is. \"No thank you, we do not want help.\" Alternately: \"No thank you, \\*I\\* do not want you to come.\"\n\nDo not throw your wife \\[any farther\\] under the bus \\[than you already have\\].",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": "Not just Covid risk, but also all the other infections newborns are particularly susceptible to (RSV, flu, etc)",
          "id": 222,
          "comments": [
            {
              "score": 14,
              "content": "In my country there is an rsv pandemic, because so many stayed at home.when covid hit in 2020 and 2021, so the children who were supposed to begin pre-school never caught rsv naturally, and never developed immunization, so this fall/winter those children all caught rsv and spread it to their baby siblings, so a part from covid patients the hospitals all over the country has pediatric wards full of babies with rsv. (those children could die If they did not get adequate care at the hospitals). \n\nSomething to think about before inviting guests...",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "She'd be better off leaving him. Him and his family have shown their true colors.",
          "id": 224,
          "comments": [
            {
              "score": 49,
              "content": "Yeah the audacity of his family to say he has to “make it up to them” is astounding.",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "Also, a woman's MIL \"helping with the baby\" is a lot more stressful than her own mother helping.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Any family invited immediately after a birth shouldn’t expect to be hosted. \n\nThey should expect to be working. Dishes, laundry, cleaning, running errands, making meals, and waiting on mom hand and foot and doing everything they can to make the transition easier for the new family. \n\nI didn’t realize how many people had such shitty family members. Made me really grateful for my parents. They helped so much right after baby came home. My in laws were the opposite and stressed me out big time. Like I just had a baby, I don’t have time to entertain you and I’m not up for cooking for your ass either.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Also whooping cough and RSV. Did his family get their tdap and flu shots?",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I actually don’t think there’s any distinction between the two; I think they’re both equally egregious. Even if his mom offered to come help, his wife should have been consulted on that. As much as I really like my MIL, I didn’t want her around in the first few days at home when I was sharting blood products left over from birth.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "And is asshole off from work too help or is he working the whole week and leaving her to deal with his parents.  You think she wants to see them when she has bed head and in pain? My wife tore herself giving birth to ours.",
          "id": 230,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3706,
      "content": "She just gave you a good reason — SHE JUST GAVE BIRTH! She’s fucking tired! How inconsiderate of you, poor woman. Please do her a solid and cancel your plans. Your whole family visiting a week after she just gave birth will be an unnecessary burden on her, just tell them that your wife will be busy getting rest and nursing the child that will, by the way, be crying and waking everyone up all night. Also, who do you expect to do the cleaning and other tasks? Unless you’re prepared to be a solo host and let your wife do her thing, cancel it. YTA man",
      "id": 231,
      "comments": [
        {
          "score": 449,
          "content": "This!! \n\nAnd she’s exhausted even before giving birth. She can’t breath right, or sleep, or pee in reasonable intervals.",
          "id": 232,
          "comments": [
            {
              "score": 162,
              "content": "I didn't get a good night sleep from 16 weeks on with my first. I was so sleep deprived by the time I actually delivered I was basically a stressed, anxious, zombie for the first 4 weeks.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 152,
              "content": "The first week after we had our baby I was incontinent ( peeing yourself is very common right after birth, but I was also incontinent of stool) and whatever nursing shirt I was wearing was soiled with breast milk and blood from my nipples, plus my boobs were often out to nurse, or out because putting them in my nursing shirt/bra was painful. Not really the way you want to be seen in front of other people.",
              "id": 234,
              "comments": [
                {
                  "score": 21,
                  "content": "I had essentially puppy pads for everywhere I had to sit because by the time I realized I had to pee I was peeing. I was embarrassed it was happening in front of my husband I’d be mortified to have it happen in front of my in laws",
                  "id": 235,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 233,
          "content": "It's also not safe. There is a HIGHLY contagious covid variant ripping through the country right now plus a strain of flu that the vaccine doesn't protect against plus it's an awful RSV year. Having visitors that have to travel to see you right now puts your newborn at a lot of risk of infection and serious complications. \n\n&#x200B;\n\nIf OP's family truly wants to help they can stay in a hotel/AirBnB, visit briefly through windows as mom and baby are ready, and porch drop meals off every day.",
          "id": 236,
          "comments": [
            {
              "score": 30,
              "content": "As someone literally dealing with the newest COVID variant right this second, DO NOT EXPOSE YOUR WIFE AND INFANT to this virus. \n\nI couldn’t swallow without absolute agony until I got a shot of steroids in the asscheek. Exposing your wife who just gave birth and your newborn to this shit just to please mommy and daddy is selfish and pathetic.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "Absolutely and how does his mother of all people not know this!!!",
          "id": 238,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2489,
      "content": "> Imagine you go through a medical event. One that's been inhibiting you and making you sick for nine months. \n\n> You return home from the hospital exhausted. You have been in pain for hours and it's finally over. \n\n> Your wife's parents are there. This is your home but no one asked you whether they could come over. They will be in your space and demanding your time and energy whether you are comfortable dealing with company or not. \n\n> You're sore from someone biting your nipple every few hours. You can't get a good night's rest because of all the crying. You're still in pain from that medical event. \n\n> And on top of all that, you can barely stand to look at your partner because they're a massive asshole who invites people over without asking and dismisses and belittles you when you explain you're upset by that.\n\nTell your parents that you made a big mistake by inviting them without consulting your wife and that they are not to come. Apologize for wasting their time. \n\nI can also think of another person you owe an apology too. YTA.\n\nEdit: lol at your \"they might be offended.\" \nYes, they might be. You have to deal with your parents anger. There are consequences for actions. You made a huge mistake that has emotional implications for all involved, and now you must deal with the fallout. **Suck. It. Up**",
      "id": 239,
      "comments": [
        {
          "score": 704,
          "content": "THIS AND — PANDEMIC & A NEW BORN BABY & TRAVEL!!!",
          "id": 240,
          "comments": [
            {
              "score": 248,
              "content": "And flu and RSV season on top of a pandemic.",
              "id": 241,
              "comments": [
                {
                  "score": 47,
                  "content": "Omg and do the husband’s family have their tdap vaccines up to date? Because the baby won’t be vaccinated til month three.",
                  "id": 242,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "You forgot: 'good chance your penis has been torn or cut and has stitches in it'",
          "id": 243,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1813,
      "content": ">intrusive type\n\nWell they invited themselves over for a week after your wife gives birth, so I'm pretty doubtful on that.\n\nYTA for several reasons. First, guests are a *lot* of work and you don't just invite people to come stay, and especially not for a week or longer, without consulting with your partner.\n\nSecond, giving birth is a brutal experience. Many women simply want to be alone with their spouse and adjust and bond with their new child afterwards. They don't want to feel obligated to entertain, cook, and clean for their guests.\n\nThird, she doesn't want to have to fight for time with her new child. People lose their goddamn minds around babies, especially newborns, and everyone wants to hold and play and cuddle. It's not exactly healthy for the newborn, and it's frustrating for the mother who doesn't usually want to share that time with anyone but the father.",
      "id": 244,
      "comments": [
        {
          "score": 493,
          "content": "#3!!! Momma needs newborn time and cuddles for so many reasons.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 279,
          "content": "Your first point is really what this boils down to. OP can say that it will be beneficial for her until the cows come home, but if MIL really wanted to help she would have asked what mom needs, not demanded to spend a week invading their space in one of the most vulnerable times possible. Nothing else matters except the fact that MIL isn’t there to respect and help mom, and saying it’s wrong for mom’s family to come because MIL can’t ignores the intentions. My mom is visiting for a week after my baby comes. **a month after** because she asked me when would be the best time for me. That’s helpful.",
          "id": 246,
          "comments": [
            {
              "score": 29,
              "content": "My MIL is super intense, and wanted a grandchild for years. Even her had the decency of asking ME, when was ok for her to visit us. I only wanted my mom around and that is what I did. Nobody in the hospital, nobody visiting until I felt like it.",
              "id": 247,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1811,
      "content": "YTA. don't be surprised if it's just you and your family for the first week & your wife has taken her child elsewhere.",
      "id": 248,
      "comments": [
        {
          "score": 637,
          "content": "Oh, how I wish OPs wife could see this comment and work towards that immediately....",
          "id": 249,
          "comments": [
            {
              "score": 364,
              "content": "If her mother or sister live even remotely within driving distance of the hospital she’s been planning to give birth at, she should go stay with them starting now, until at least 2 weeks after baby is born.",
              "id": 250,
              "comments": [
                {
                  "score": 71,
                  "content": "Or until the child turns 18.",
                  "id": 251,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "She doesn't even have to have him in the delivery room if he continues to stress her out.",
                  "id": 252,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 320,
          "content": "I'm surprised I had to scroll this far down to see this. If I were the wife I'd absolutely go stay with my mother or sister for the first few weeks after childbirth if my husband invited his whole family over. OP you can clean the house, make all their meals and entertain them. But I hope your wife finds a more supportive network that she can lean on in her most vulnerable times because it sounds like you are completely unreliable. YTA. Your wife and your baby should be your priority not appeasing your family.",
          "id": 253,
          "comments": [
            {
              "score": 48,
              "content": "No I would stay in my house with my baby.... I'd tell this AH to go stay with mommy and daddy. I'm not budging but he sure as hell would be.",
              "id": 254,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "lol agreed, I hope she does this. and omg the edits make it even worse. \n\nholy cow YTA. OP stop it and stop it now.  of course she shouldn't be the one to tell them. then they'll resent her. AND IT WAS YOUR MISTAKE. so own it and tell them that your family wants the first few weeks for intimate family time and recovery and sorry that the plans have to change. END OF CONVERSATION. no further explanations and for the love of everything, DO NOT place the blame on your wife when talking to your parents. do not say it's because of your wife. end it there. if you want to be an equal partner worthy of respect, then do not throw her under the bus for YOUR mistake. again, it doesn't matter how much she loves them or they love her, stop it, do not force this on her. if she spirals down into post partum depression, anxiety, or medical complications, I would squarely put the blame on YOU and the stress, anxiety and situation you put her in.",
          "id": 255,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I hope wife takes the baby to stay with her mom or sister, where she’ll get actual support",
          "id": 256,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1696,
      "content": "YTA the week after having a baby is time for quiet bonding … NOT for hosting guests.\n\nBecause they are YOUR family it will not feel like entertaining to you, but it will for your wife.  \n\nThis is Husbanding 101 dude.\n\nYou should NEVER invite ANYONE to stay without at least discussing it first, and it’s ridiculous to suggest anyone other than her mother stays after the baby is born.\n\nI can’t say YTA enough times\n\nEdit:  OP has edited his post to say his wife wouldn’t be entertaining his family.  This is delusional.  The woman always has the burden of hosting.  She makes sure the bathroom is clean and everyone has linen and food.  Will she be able to walk around in her pyjamas covered in dried breast milk? No. Will she be able to spend all day quietly alone with the baby? No.    OP doesn’t even realize that having people staying in your house is WORK for the woman.",
      "id": 257,
      "comments": [
        {
          "score": 278,
          "content": "My mom stayed with my brother and SIL after the baby was born. SILs mom couldn’t stay because she was quite ill. My mom stayed in her own room all day, except at the agreed upon times where she’d be on baby duty or she was running errands for them. I can’t imagine having someone there who doesn’t understand that this is your first week as a family. Even ignoring the physical toll pregnancy and birth take on a new mom, it’s still an important time. I wouldn’t bring my MIL on my honeymoon, even if she were to make us a gourmet meal every night and do our laundry.",
          "id": 258,
          "comments": [
            {
              "score": 76,
              "content": "My mom was the same for my SIL over the summer when SIL was having some nasty health issues herself (she’s recovered now).  My nephew is 2, and brother and SIL also have 2 very energetic dogs.  So, when mom went to stay (invited by both) for 2 weeks, her main focus was cleaning the house, doing any laundry, cooking some, entertaining the very energetic toddler because his mom was essentially on bed rest.  And in the evenings when he was asleep, unless mom was invited up, she just went and occupied herself with her own stuff in the guest space in the basement so my brother and SIL could just utterly relax.  So there was a very clear delineation that her visit was to help out and make life as easy as possible for my SIL, not to socialize and visit.  Without that sort of understanding, it’d be a nightmare",
              "id": 259,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}