{
  "post content": "My girlfriend (25F) and I (29M) live in NYC and there's a popular app where you buy leftover restaurant food. Restaurants advertise \"surprise bags\" at a reduced price in order to reduce foodwaste. The customer doesn't know what they're getting until they pick the food up, but the cost at least 3x lower than the normal menu price. (EG if an entree is usually $24, the restaurant is allowed to charge $8 at most for it.) These are hit or miss - sometimes you get exactly what you want at a greatly reduced price, but sometimes you get something that you otherwise wouldn't have picked from the menu.\n\nI ordered a surprise bag from a barbecue place that I was picking up on the way home yesterday. I texted my girlfriend asking if she wanted one but she said no, she wasn't in the mood for barbecue. However, there was an indian restaurant right next door that also had surprise bags available on the app, so she ordered one of them. The barbecue was $12 and the indian food was $10.\n\nWhen I get home I unpack the meals to see what we got. I was psyched about my bag. Since I paid $12 I knew the value had to be at least $36, but honestly the platter looked a lot more expensive. This was a hit. (Keep in mind that we live in the west village, which is the most expensive neighborhood in the most expensive city in the US, so $36 for one meal is pretty typical.) There were burnt ends, ribs, pulled pork, baked beans, potato salad, bread, onions, and pickles.\n\nMy girlfriend, however, was  less lucky. Her surprise bag only had 6 different types of soup, half of them being variations on cauliflower soup. She was disappointed to say the least. She asked if we should share my barbecue and I said no, i'm hungry, I offered to buy you some already and you said no, so I'm going to devour it.\n\nShe got mad and called me the asshole. I told her if she didn't want soup she should have ordered something specifically instead of using the surprise bag app. I then told her to just order something off a food delivery app. She said she didn't want to spend the money (another bit of context is I make a lot more money than her and pay all of our rent, I know she's running a bit of a lean financial picture right now.) I then tell her that if she doesn't want to pay for delivery, I'll walk to the bodega on our street and can buy her something there. (Another bit of context is that we live on a 4th floor walkup with no elevator and she broke her leg in a car accident a month ago, so it can be tough for her to get around.) She says she the grill is probably off there and all she wants is a hot meal. I tell her she has soup.\n\nAnyway, she thinks I'm the asshole. But in my defense:\n\n(1) I offered to buy her barbecue to begin with, which she declined.\n\n(2) she picked out her own food and I grabbed it for her on my way home\n\n(3) when she wasn't satisfied, I suggested two solutions (either ordering something from an app or going to a bodega)\n\nSo, Reddit, AITA?",
  "id": 1,
  "comments": [
    {
      "score": 38073,
      "content": "YTA. Come on man. You both did the surprise bags, hers didn’t work out. You know she can’t afford to order something else but didn’t offer to help pay, you offered her crappy bodega food instead. You could have at least split the barbecue and ordered something else to share and split the price. If the situations were reversed and you’d gotten a bunch of crap soup while she had a feast, would you really want to sit there hungry waiting for some crappy alternative while she chowed down?\n\nYou’re going to get lots of N T A that just have no concept of…being nice and making small sacrifices  for your partner. You and them seem like the types who if their meal companion gets the wrong meal at a restaurant and has to wait half an hour for a new one, they’ll sit there and eat and not even offer a fry.\n\nEdit to add: ffs guys, I lived in NYC for a decade, I know bodegas have good food. The *grill was closed*. Her options would have been *maybe* a deli sandwich if they were still making them, but it could very well have just been like, chips and cookies. She wanted a real dinner.",
      "id": 2,
      "comments": [
        {
          "score": 12229,
          "content": "And she is recovering from a broken foot in an 4 storey apartment with no elevator 🙃\n\n\nMy spouse often buy new food to try out and we share, it's a diversification strategy incase one of us don't like the food. Even if I bought something and changed my mind, I don't think my spouse would ever actually deny me some of his. And if I brought something delicious, I would love it if he tried some just so I could make him smile. \n\nLike, OP sounds like an A in this context. Especially since she is low on money and can't easily walk to get food herself. And soup can be very not filling especially if it's veggie soup.",
          "id": 3,
          "comments": [
            {
              "score": 2434,
              "content": "Broken leg which is worse. At least with a broken foot you can use those the boot a lot of time to take pressure off the foot or use those scooter things, but with a leg you can't bend your depending on where the break is and it's so much harder to get up and down stairs with crutches/ hopping along.",
              "id": 4,
              "comments": [
                {
                  "score": 1755,
                  "content": "Their ETA made them a even bigger AH. They did say they’d go pick it up for her but they are missing the point. They aren’t isn’t just a AH they are selfish i’m sure this isn’t the first time something like this has happened.\n\nImagine being laid up with a broken leg so she’s dependent on them and she gets a bunch of crap soup. She sees a giant platter of massive amounts of food, it smells delish and asks to share and they says “nope I’m starving” then they goes on to say you had a chance to get barbecue.” But that could have been a fail as well. \n\nSo the big person on campus (who makes more money then her and pays the rent which has absolutely zero to do with this but this fun fact again makes him an even bigger AH and let’s not forget he lives in the most expensive neighborhood,  in the most expensive city in the country) gallantly offers to pay for delivery (but not her food) or go pick up crappy food at the bodega. And what got me the most was when she said she wanted hot food they said “well you have soup”. \n\nFor some reason this is making me irate. I would never sit there and not share my food with my partner under any circumstances let a lone when they were disappointed with there food, had a broken leg and couldn’t financially afford to get any more. They literally sat there chowing down in front of her, barbecue sauce all over his face and licking his fingers while she’s staring at her gross soup. \n\nIt’s pretty sick behavior on the OPs part \n\n\nYTA!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1271,
                      "content": "Man, some of these posts are a huge wake up call for me. I was thinking in my head how oh yeah, he offered all these alternatives and she did decide to risk a surprise bag too. And then I get to the comments and I realize I just expect people to treat me like the gf is treated here, it’s not okay, and I swap the perspective I’m thinking from and know I would never treat anyone the way OP treated his gf. It’s just wrong.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 265,
                      "content": "I wouldn’t even do that to an acquaintance much less my partner!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 69,
                      "content": "OP probably forgot girlfriend means partner not college dorm roommate with benefits.\n\nIf he can't care about his girlfriend more than that then they should probably not plan to get married or be in that domestic thing that's similar to marriage but not the same. I forgot the name of it. I think Pennsylvania allows it.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "Exactly! I'll practically force my husband to share my food if I know he's disappointed with his, and vice versa. I can't imagine this level of selfishness",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I wonder if OP even ate all the food he got. If I was his girlfriend, I would’ve thrown any leftovers in the trash just for spite.\n\nYTA OP. You should’ve given her some of your meal, had some cauliflower soup, and if you were still hungry then walk to the bodega for a snack. You had an opportunity to really show yourself to her, and you blew it.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 25,
                      "content": "[deleted]",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "He's definitely selfish.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I don’t understand why they couldn’t have split the barbecue and split the soup (if wanted). It truly couldn’t have been that big of a deal. I sort of appreciate that he offered some half-assed alternatives, but any good partner would make a small sacrifice and just share their dinner.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yes. Had I opened that surprise bag with all that food, I would have been super excited to share such a score with my partner, whom I love, cherish, and respect!!\n\nEdit to say the obvious: YTA, op.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I'm nicer to strangers than these people are to their \"partners\". One time my Uber driver mentioned being hungry and I gave her two slices of the pizza we had just picked up.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 475,
                  "content": "Even dogs are often nicer to each other than this. I can’t imagine a dog who actually likes the other dog scarfing down an entire meal of food and growling “My food!” while a sad dog with a broken leg watches and cries.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 245,
                      "content": "To be honest, I bet if they had a cute dog, he'd have snuck the dog a bite but not the GF",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My dogs would absolutely do this. They love each other but THEY DO NOT SHARE FOOD. We have to feed them in separate rooms.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 360,
                  "content": "[removed]",
                  "id": 19,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I was on crutches and a scooter. When my spouse was rude I would jab him with the crutch or accidentally cruise into him with my scooter. He has that for 6months.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Maybe that's how she broke it. If my partner was this insufferable, I'd definitely want to kick him the ass. \n\nOP YTA. Take better care of your partner",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "No but I'd have beaten him with my crutch selfish ahole",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Even with a boot it still sucks and you can't do much. I had the misfortune of needing a boot and a leg brace at the same time, and crutches, a few years ago.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "NYC is a bad place to live with injuries.  Unless of course you’re rich.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1757,
              "content": "Also sounds like his bag came with plenty to share and still have a filling portion for himself. Plus I feel like it’s normal for couples to want to try bits of each other’s meals if it looks good I do that with friends/partners all the time",
              "id": 25,
              "comments": [
                {
                  "score": 879,
                  "content": "My SO and I routinely coordinate orders so we can both try a bit of different things, I thought that was normal?",
                  "id": 26,
                  "comments": [
                    {
                      "score": 786,
                      "content": "it is for couples that actually care for each other.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 28,
                      "content": "It is normal. Normal people share lol",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "OP is totally selfish. Yeah it didn’t work in girlfriends favour and she should’ve gone for the bbq but cripes dude, remember how selfish you’re behaving when next time your gf does it to you. I mean when you start selfish acts like this, it isn’t a relationship it’s just tit for tat stuff. ETA: aren’t you supposed to like this person let alone love them?",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Completely normal my significant other and I joke the only reason we’re dating is so we can get fries and onion rings when we go out😂😂",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yep. My fiance and I do this all the time, particularly with foods like curry where you can take a bit here and there from each dish.\n\nIt's easy with dinners like that - especially with sides - which is why OP's unwillingness to share his BBQ is so bewildering.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Not just couples, I've done this variously with my sister and housemates",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "[deleted]",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Yes, normal! We almost always get two things we both want to try and share. It’s 100% awesome.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My partner and I do this too. Whenever we eat out, we have to have different orders. We would never order the same meal. So we could share and try more food. Like he'd order a whole meal and Id order a salad, then we both have half the meal and salad. Its a win win",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Right? Take half, and let me try some of that soup! Having access to something I wouldn't try at a restaurant in a million years is fantastic. I'm not ordering a soup in million years.... having 6 bowls right there to try like a tasting... sign me up! And plus all she got was soup?? He expects her to sit there and choke down 2 gallons of soup like some reverse Oliver Twist shit. Nobody wants that much soup in one sitting",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Yes! This isn't like Joey and him not sharing food with his date 😂\nEspecially if the relationship is far enough where you even live together.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "THAT’S the part that really got me. \n\n> There were burnt ends, ribs, pulled pork, baked beans, potato salad, bread, onions, and pickles.\n\nMultiple types of protein and two types of starchy sides. If my partner was hungry and I had that much food in front of me, I would feel like an AH eating it without sharing. OP YTA",
                  "id": 38,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "My SO gets disappointed if I don't try his meal. We had to establish a first bite rule. If it's your dish you take the first bite, then I'll try it.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My family and I do the same. Sometimes we each get a different meal and share it.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "also soup for entree and then bbq for main sounds like a pretty good filling meal",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This is what pushed it to asshole territory for me. It soubds like dude had a lot of food.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 950,
              "content": "If you laid her possible crutches flat on the floor, they still would not fit under that low of a bar.",
              "id": 43,
              "comments": [
                {
                  "score": 18,
                  "content": "🤣 Take my poor man's gold!!\n\n🎖🏆🏅",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 250,
              "content": "My partner will go without so I can have. I try not to accept it but sometimes he insists.",
              "id": 45,
              "comments": [
                {
                  "score": 32,
                  "content": "This exactly. Something a bit similar happened with me and my partner, and she tried giving me all her food. Two people that love each other are supposed to take care of each other.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I could not enjoy my food seeing my partner with a crappy plate. Even when we both like our food we offer each other from our plates.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My husband and I once went to an Indian restaurant together. I ordered butter chicken, he ordered something spicy. We didn’t know what they would look like, so when we got the food we just dug in. (We have had the food before, but you never know what the presentation will look like at a new place) My food was delicious, but I was almost crying with the spiciness while he was mentioning being a little surprised at the mildness of his food. When he saw how upset I was that I couldn’t tolerate more than a bite or two, he very sweetly offered to trade with me.\n\nTurns out he had my butter chicken, I had his meal, and neither of us was cultured enough to know it. LOL",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "My husband is the same way and a lot of these AITA posts make me feel like I got pretty lucky. He does it consistently too, not just in a unique situation. If he cooks steaks he’ll give me the one that looks perfectly done and eat the overcooked one himself. If there’s one piece of pizza left he always offers it to me first. He can easily eat double or triple what I can eat, too, but he still makes sure that I’m full first before he takes thirds or fourths lol. If this had happened to us he would have voluntarily given me the BBQ and gone to make himself a sandwich, and been completely sweet about it too (not making me feel guilty or like I owed him, which I bet OP would do…)",
                  "id": 49,
                  "comments": [
                    {
                      "score": 5,
                      "content": "My husband is like this, too. The most selfless person I’ve ever known. I actually have to watch him in situations like this to make sure he isn’t sneakily depriving himself of something he thinks I want!",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Mine too. I can't imagine a life partner like OP. I've been with my husband for 24 years, he'd still give me anything of his that I wanted. He'd do without and give whatever he had to me. Not that I'd let him, as we'd share whatever amount we had. Also, he'd NEVER have plenty of money while I'm broke.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Exactly. Whenever me or my husband take a risk and order something we've never ordered before and it doesn't work out, the other always insists on sharing their food. I cannot imagine him pulling this shit.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I'd rather hear my stomach grumble and see someone I love full and happy than eat today when there'll be food tomorrow.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I have issues with sharing food due to my childhood and in this situation I would share with my partner. OP is ridiculous and definitely the asshole.",
              "id": 54,
              "comments": [
                {
                  "score": 10,
                  "content": "I'm with you here. When I was a kid, adult relatives consistently took food off my plate without asking (despite their own full plates). I grew up in a solidly working class family that didn't have much in the way of extras. My dad always got the largest share of the food.\n\nThat said I've shared food with others because it was my choice to do so. But for others to *expect* me to share my food isn't appropriate.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Strange for OP to describe the array of items in his bag, making it sound like a good amount of food, then refusing to share any with his unlucky partner? Not very kind or compassionate of him",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "yes, given the context of the broken leg this is sooooo….. 😐 it would send me into a full spiral / meltdown if i was the gf. my boyfriend would NEVER do this to me, nor would i to him. big YTA",
              "id": 57,
              "comments": [
                {
                  "score": 18,
                  "content": "I don’t even have a broken leg and my boyfriend would never do this to me. Honestly the second he saw a bunch of soup in my bag he’d have been offering me BBQ.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "You sound like you should read this article: [https://www.bloomberg.com/view/articles/2016-09-30/the-economics-of-dining-as-a-couple](https://www.bloomberg.com/view/articles/2016-09-30/the-economics-of-dining-as-a-couple)\n\nFull food communism FTW",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "tbh as the partner that makes more, if that happened i would be like ok lets go get you different food from wleswhere even if its just the burger place around the corner you like to make sure she could eat something she will actually enjoy.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3006,
          "content": "Why not split the soup and the BBQ? YTA\n\nEDIT: I'm tired of answering this question. The reason he should do this is because in a normal relationship you WANT good things for your partner, and you DON'T want them to go without, especially when you have enough to share. Not sharing it is petty BS and poor behavior if you want to keep your relationship. Your incel is showing.",
          "id": 61,
          "comments": [
            {
              "score": 476,
              "content": "My thinking here as well. That’s what my late husband and I would do in this situation.  I see where it is coming from and so I think while *technically* NTA I don’t think they are very kind either.",
              "id": 62,
              "comments": [
                {
                  "score": 666,
                  "content": "He's not technically wrong. But he's 100% the actual AH",
                  "id": 63,
                  "comments": [
                    {
                      "score": 264,
                      "content": "\"You're not wrong, you're just an asshole\"",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "He’s technically correct, which is the worst type of being wrong.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I mean, what kind of soup? Have some of that, take the bread from the bbq and have some chicken. A spoonful of potato salad and let’s discuss the pickles and everyone is happy",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Feels like a he's welcome to be right and single situation.\nHis girlfriend sounds completely dependant on him right now and he's being an AH.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "It's giving, \"yeah, technically cutting the baby in half is a fair compromise, but now I'm not gonna give you this baby.\"",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 175,
                  "content": "> There were burnt ends, ribs, pulled pork, baked beans, potato salad, bread, onions, and pickles.\n\nReally sounds like enough for him to share *something* with her…",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Because you actually loved each other unlike OP",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I think if you're so focused on what's right or wrong or fair or unfair at the expense of your partner, you're TA unless there's a good reason. And here the reason seems to be \"sorry, you played the game and lost, tough\" which isn't a good reason imo",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I asked for my husband's snap response. I broke my tibia and foot in three places a few years ago. Last year, I broke a few ribs. I also have back issues that cause short-term acute episodes where I can't walk, so I thought it relevant. His response was, \"Why didn't he just get two BBQ? He knows she's hurt. He knows she can't go out. He knows money is tight, and he knows he doesn't want to share and does not want Indian. I wouldn't not want Indian either, so I would have gotten two. Plus, maybe she'd like lunch, otherwise I'd have lunch.\"\n\nAlso, I am so sorry for your loss. \n\nEdit: many typos and I'm an insensitive ass.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 317,
              "content": "Thats my take. It could have turned into a funny memory and good story. Now it's just randos on the internet calling you an A-hole.",
              "id": 73,
              "comments": [
                {
                  "score": 181,
                  "content": "\"hey remember that time all I got was soup and you wouldn't split dinner with me and you actually went online to ask randos if you were the asshole?\"\n\nThis would totally still be a funny memory",
                  "id": 74,
                  "comments": [
                    {
                      "score": 156,
                      "content": "Especially because no reasonable person would get Indian food and expect it to be all soup. That's just not something that would ever enter my mind, and I eat a lot of Indian food.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "This is Netflix cinema shit",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Except it's more likely to be: \"hey, remember how I told you my ex tried to get the internet to validate his selfishness and it backfired?\"",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "This is exactly what my husband and I would have done… only difference is that I wouldn’t have needed to ask him to share. He would have just offered because he’s a kind, empathetic, wonderful human. \n\nOP, this is an AH move your your part.",
              "id": 78,
              "comments": [
                {
                  "score": 10,
                  "content": "Right? Imagine wanting your partner to be happy!",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Aww!🥰",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yeah he's the AH just for not realizing that cauliflower soups would be bomb as a barbecue side tbh",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Your edit is the main point. If I taste something good,  my first instinct is to give my wife some.\n\n>you DON'T want them to go without when you have enough to share\n\neven when you really don't have enough to share, you share. That's a relationship.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "People who think strictly in terms of legal entitlement ARE assholes. Sharing food is the most basic of kind impulses. “Sorry babe you want some of my barbecue?” would have cost him so little and made her so happy",
              "id": 83,
              "comments": [
                {
                  "score": 7,
                  "content": "And is the natural response for people who like their partners!",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I was thinking the same thing",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 801,
          "content": "yes! i want to know what he would expect her to do if the situation was reversed.",
          "id": 86,
          "comments": [
            {
              "score": 1423,
              "content": "We all know he would say \"I would eat my soup and be happy\" knowing 100% thats bullshit.  But thats Reddit for ya",
              "id": 87,
              "comments": [
                {
                  "score": 25,
                  "content": "Please sir... I want some more\n\nMoooorrrre?!?!?!?",
                  "id": 88,
                  "comments": [
                    {
                      "score": 36,
                      "content": "No soup for you!",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 641,
              "content": "He would eat one bowl of soup. Then Wait until she was finished. Help himself to her left overs. Then when she went to eat them the next day explain that he ate them and offer her some of his soup. Then post AITA, I ate my gfs left overs but offered her mine. Not sure why she’s mad.",
              "id": 90,
              "comments": [
                {
                  "score": 167,
                  "content": "“Why do my relationships keep failing?”",
                  "id": 91,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Brutal 💀",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Uhh, he would've also got the bbq in the beginning.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 319,
          "content": "And she has a broken leg. Which makes life much harder. Could’ve helped out the person you love a bit here.",
          "id": 94,
          "comments": [
            {
              "score": 19,
              "content": "Love? Sounds more like a convenient f**k",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Of course YTA, but I'm surprised that's winning here because the normal attitude of this sub is \"if you're not legally required to do it, you're not an AH for refusing.\"",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I always offer my partner some of my food even if they have food they already like, I just want them to be happy and I'm willing to give some of my own stuff to accomplish that because I love them",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Agree with YTA. The person asking him to share is supposedly someone she loves.\n\nI remember one of my experiences where a friend asked me to have lunch with her and her brother. I went with them and her brother recommended a restaurant which is quite far from my place. I agreed anyways and when we arrived I was already hungry. Luckily, there were no other people there yet. I then ordered pasta and soup. She ordered the same as me while the brother had something else.\n\nWhen our dishes were served, her brother got his meal and my friend got her pasta and soup but my order wasn't there yet. I asked the server about my food. Apparently they thought we were only ordering one soup and pasta. I corrected the server and she apologized and said that it would probably take another 30 minutes or less.\n\nThe siblings began eating while I waited for my food. I asked my friend if I could have her soup because I'm really hungry and she can have mine when it came since we ordered the same anyways. She told me no, then promptly took a spoonful of the soup maybe so I wouldn't insist. I understood that she was hungry but so was I, and I thought being friends she would give me the soup while waiting so I can eat something and not just sit there hungry while they are eating. I felt a bit upset and hurt with what she did but kept my mouth shut because she I didn't want to ruin her visit. I never went to eat with the siblings again.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "don't be slamming \"*la bodega*\". Some of them have have pretty good home-cooked food.",
          "id": 99,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Thank god this is the top-voted comment. Restored my faith in humanity a bit.\n\nWhat is it with people dating and living with people they actively dislike?",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah, he says she \"picked out her own food\", but... she didn't really!  Just like he didn't!  She took a chance on getting something she'd like, just like he did.  It's just dickish and unnecessary to go, \"I got mine, screw you!\" in this situation.  (Especially when it sounds like there was plenty to share.)\n\nIt's like he thinks her being unlucky means she did something wrong and should \"pay the price\" for it.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 26929,
      "content": "So you had plenty of good food,  could have shared it, had a good time, and gone to bed happy and in love?\n\nInstead, you're sitting here asking strangers on Reddit if you're an asshole?\n\nYTA",
      "id": 102,
      "comments": [
        {
          "score": 6206,
          "content": "Finally! An adult who's been in a real, loving relationship with someone that they like is on the internet!",
          "id": 103,
          "comments": [
            {
              "score": 2742,
              "content": "Seriously.  I love my boyfriend. I like my boyfriend. If he got the crappy end of the stick I would share my good fortune with him. Yes, even if he initially turned down BBQ and then changed his mind. \n\nI would have some soup and he would have some BBQ. \n\nI swear so many people who post here don't seem to like their significant other.",
              "id": 104,
              "comments": [
                {
                  "score": 1446,
                  "content": "It’s like they see their partner as someone they’re trying to win against instead of realizing you should be working towards the same goal.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 486,
                      "content": "Correct\n\nPartners are partners for a reason. You're on the same team. Act like it",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "1. Right!!!  You help people you love so you can both have a good time.\n\n2. Today you, tomorrow me.  Some days you get bbq, some days soup.  This is a partnership, and you share the good and the bad to make the bad easier.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "This, so much! My husband and I recently celebrated our 30th anniversary. We share.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "So many people on here seem to view relationships that way and it’s really sad to me.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Same team guys! Same team!",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Unfortunately that’s a really common dynamic and one I’ve felt myself stuck in. It’s extremely disheartening to be stuck in a situation with someone that always wants to “win” instead of seeing you as a teammate.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "More like a sibling than a S.O.🤷🏽‍♀️",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "fr I don't understand the problem lol. my bf and I would've automatically just shared both meals 😭",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Exactly. Or I’d offer to pick up the tab for him to order something else, not act like ordering is a valid option if I knew he couldn’t afford it.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "\"So I offered you BBQ, you didn't want BBQ. You ordered Indian and I got it for you. Now you want my food?...you're lucky I love you\" (playfully).\n\nEveryone wins, just split all the food and you're both happy.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I think any normal person in a relationship (even a friendship!) would have said, \"oh that sucks you got hosed with a bunch of soups, please have some of my bbq!!\"\n\nLike, maybe if it was a co-worker you aren't friends with, or a total stranger? Ok fine. But not your SO who you allegedly love!",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Holy shit! It almost feels like everything on Reddit is transactional.\n\nMy partner and I went to lunch over the weekend, I ordered exactly what I wanted, I just did not like it when I got it, it was just one of those days!\n\nAm I an adult and know how to manage my own emotions? Yes. Does my partner know me and can tell when I’m slightly disappointed? Also yes. He just swapped our dishes. \n\nI am going to go give him a hug.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "See that’s where I am at too. My bf will goof around and say I can’t have a bit of his icecream or something because it’s “soooo good” but watch him like a minute later offer me some. I am 100% the same and I think if we were in this scenario he would have 100% offered me some of his (esp cause he knows I don’t like soup). Like maybe she took a risk but he is being a bit of an AH by not sharing ANY of it. She’s not asking for all of it just some.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I'm aromantic and even then I would 100% share with my partner in this situation. I'd share even if it was just a friend or roommate.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yesss so many people think of it as “I don’t *have* to do this” and yeah, sure, you don’t. But if the whole world ran on the principal of what they have to or are legally required to do, it would be an awful, awful place. \n\nIf I’m in line at a coffee shop and I hear someone behind me talking about how excited they are there’s one pastry left that they want when they thought there wouldn’t be any, I don’t *have* to not order it. Even if I previously had no interest, I can technically order it in front of that person and not be breaking any rules. But is it a shitty thing to do? Yes. But it feels like we forget the second part a lot. Anyone who lives their life on “what I have to do” is not a good person and either doesn’t have a significant other or friends, or shouldn’t and I feel bad for them because those people in their lives deserve better in my opinion (and for both men and women since people think OP is only getting YTAs because it’s a man). \n\nBut absolutely, especially with a significant other here. If you love or care about someone or are even a halfway decent person, you do things you aren’t required to do just because it’s the right thing to do but so many people here don’t seem to feel that way and just want to “win” on principal instead. I’m so pleasantly surprised a lot of people on this post said to share.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "My bf has his own issues but there's absolutely no situation on earth where he would say no to me about food. Like he'd give me his meal that he ordered and he loves, and take my meal which I ordered and we both hate. He makes me feel bad about this lol.\n\nOP is so YTA. The way he's acting is perfectly acceptable... IF HE'S SINGLE.",
                  "id": 121,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I always wonder why women talk so much shit about their boyfriends, but when I read posts like this it all makes sense. These dudes are fucking hopeless.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "So many of these responses sound like people who don't like their SOs, don't understand sharing and compromise, or just have never been in a good, long-term relationship before.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1401,
          "content": "Right? Even if I LOVED my six containers of cauliflower soup, my fiancé would have tossed me a rib or two just to see my happy little food dance because he enjoys seeing me have my happy little mouse nibbling on my foods moment and going to bed happy and in love. I don’t know why so many people just… don’t?",
          "id": 124,
          "comments": [
            {
              "score": 544,
              "content": "Honestly, I would give my wife (of 30 years) my entire order if I could make her happy.  However, she would never take my whole dinner, because she wants me to be happy too.  So we would have devoured that pile of BBQ together.  That's just what partners do for each other.  What the hell is wrong with this guy?",
              "id": 125,
              "comments": [
                {
                  "score": 215,
                  "content": "And it would have been funny and romantic. Like it's pretty hilarious to unknowingly get several types of cauliflower soups. And then to share a BBQ feast with your SO would have been lovely and nice.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 160,
                      "content": "Right?! This could have been a cute and funny story, the night of the assorted cauliflower soups! Something funny to laugh about together whenever you see cauliflower soup on a menu, hey babe, remember that night we split your BBQ ‘cause I wound up with a five gallon bucket’s worth of cauliflower soup?!",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "> What the hell is wrong with this guy?\n\nI mean they're also humble bragging about living in an expensive part of the most expensive city and making significantly more than his girlfriend... Good chance that the assholery extends further than this instance.",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Exactly! My husband, who I am happily married to and in love with, would immediately be horrified that I only had a flight of vegetable soup, insist we share our meals, and probably enjoy a little taste of soup anyway. If the orders were reversed I would do the same for him. \nPeople who stay together learn to share and learn compassion for their partner.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I’m also assuming there’s other types of food in the house, so after splitting the BBQ, if OP is still hungry, he can have fruit/cereal/PB&J/microwave mozzarella sticks/ice cream/SOMETHING.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "This! My BF of six months would do the same, and I would do it for him too!",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 357,
              "content": "My old boyfriend would hand me my food and say, \"Come on, let's see the happy food dance!\" I'm so glad I'm not the only person who does that.",
              "id": 132,
              "comments": [
                {
                  "score": 199,
                  "content": "My toddler daughter does a happy food dance in her booster seat that makes my heart overflow with joy. We should all want our loved ones to feel happy when they eat. YTA, OP.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 68,
                      "content": "I'm about to cook my mom her favorite meal for dinner, which I do once a week, just because it makes her so happy. I don't know why so many people would rather be right than do things to make the people they're supposed to love smile.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "My partner has her own happy food ritual - and it involves stealing mine, because stolen food apparently tastes better or smth",
                  "id": 135,
                  "comments": [
                    {
                      "score": 7,
                      "content": "The sweet spice of victory!",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "One of my favorite old boyfriends called me when I when I was making lunch and I was super excited bc I cut into the perfect avocado.  He was like I already know which happy food dance you are doing.  Lol. There are certain people that just care about others and then there are the ahs. Like OP",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I do the happy food dance every day!",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My old girlfriend would do a happy food dance too, you're certainly not alone!",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 314,
              "content": "I wouldn't even have to ask. My husband would see my disappointment and say, \"Hey, let's share both meals!\" Because he wants to see me happy.",
              "id": 140,
              "comments": [
                {
                  "score": 100,
                  "content": "Same here. Mine would have a plate of food ready for me the moment he realized I got an assortment of cauliflower soups lol",
                  "id": 141,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I don't know if this is sad or not, but we'd probably go back and forth. Lol with me telling him it's ok, I know he's looking forward to it, it's my own fault, etc. And him replying that it's too much food for just him, and he wants to try some soup so it's only fair to share his food with me. Then I'll cave because I know he really wants me to enjoy the food WITH him. Not have me watch him sadly from my cauliflower soup corner.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I agree most guys, actually most people would naturally do this. Hell my boss gave me half his dessert yesterday because I had food envy.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "My bf is the rare guy that actually is happy if I want to eat his food (even if I told him earlier that I don’t want food). He’s is so kind and caring.\n\nHe would have gladly split his meal if I didn’t like mine.",
              "id": 144,
              "comments": [
                {
                  "score": 12,
                  "content": "Mine too! Feeding me is one of his love languages!",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "because so many people just want to be “right” instead of making tiny sacrifices to keep the one they supposedly love happy",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My ex gf’s happy food dance was the primary reason I cooked. Not dying from starvation was just a bonus",
              "id": 147,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "... I also have a happy little food dance.\n\nIt's the best thing ever when you find food that makes you wiggle! 😁",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Almost without fail, I would rather give my wife something (even something I wanted a lot!), to see her joy and appreciation, than I would have enjoyed the thing itself.\n\nIn reality, that's not really how it typically works, because she also wants to see ME be happy, and wouldn't want to deprive me of that joy. So we would probably split/share whatever the thing is, or get more, or sometimes she'd get it and sometimes she'd refuse. But the point is, **every outcome in which we value the other's joy, we both win.** Every outcome that we dont risks at least one of us being unhappy, and possibly both of us. **The answer is so fucking obvious - be generous with your loved ones.** It's really that simple. OP could've had 2/3rds of his BBQ, enjoyed a soup or two of his choice, and still come out of it full, satisfied, having had a bargain of a feast, and looking like the hero. Instead, he chose to look like an ass. How sad.\n\nWhy the fuck would anyone ever be as selfish and petty as OP and do their best Gollum impression over some fucking BBQ when they could be a loving, caring partner and have both people be happy? If your partner's joy doesn't spark joy for yourself, to the point that you need to maximize your own happiness at the cost of theirs, you need to find a better relationship.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "No no, this is the expensive area of the most expensive city, there were only 2 ribs, 3 burnt ends, 3 spoonful of beans, barely an pulled pork, bread crumbs, 1 little diced onion and a pickle chip. Surely only a hit for 1 person.",
              "id": 150,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 398,
          "content": "I'm appalled that the OP had so much food and didn't want to share it when he saw that his partner's food was lackluster.  He knows he's strapped for cash and his other options to her were basically \"spend more food money on this dinner.\"",
          "id": 151,
          "comments": [
            {
              "score": 22,
              "content": "Especially when 98% of her food was basically creamed cauliflower. Even if my food was barely enough for one, I would have said you know what, let's split it. And I hate cauliflower.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 303,
          "content": "Doesn’t really matter whether he’s right or wrong. Even if he wins the battle, he’s already lost the war",
          "id": 153,
          "comments": [
            {
              "score": 29,
              "content": "Yup, comes down to the age old question of do you want to be right or happy?",
              "id": 154,
              "comments": [
                {
                  "score": 39,
                  "content": "And it's not even about being right. It's about being kind. They both ordered a surprise grab bag. hers was bad and his was a feast. It's not like she ordered lots of cauliflower soup on purpose and changed her mind later lol",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "He chose ribs over... well you know",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "(Viewing relationships through the lense of \"battles\" and \"wars\" is part of the problem, perhaps)",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 300,
          "content": "This was literally my first thought as a happily married person 🤣",
          "id": 158,
          "comments": [
            {
              "score": 206,
              "content": "My husband will legit trade meals with me if I like his more. He doesn’t even care if he likes mine. He’s not picky which helps a lot. Sometimes these posts give me a reality check of how lucky I am with a partner that trades meals with me.",
              "id": 159,
              "comments": [
                {
                  "score": 23,
                  "content": "My partner and I have even exchanged steaks before because we like different temps/doneness and he can't eat rare whereas I like all types",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "That's how I am. I am the not picky one. I'll hand over any food to my husband if his sucks.",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I'd do the same for my wife, but I'd never ask her to do the same for me.",
                  "id": 162,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I honestly think it’s very romantic. My dad was same with my mama.",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I am this person in my relationship and I love how easy it is to make my partner happy. He's super picky and I eat pretty much anything so if he's not happy with his meal, I just take the stuff he doesn't want and give him mine instead. I do wish we could be one of those \"let's order a few different things and share it all\" couples though, that always sounds fun.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 220,
          "content": "Right? He could have had some soup, and she could have gotten some BBQ from him.  Feels like it would have been win-win.",
          "id": 165,
          "comments": [
            {
              "score": 153,
              "content": "It sounds like there was a LOT of barbecue too. Like, would it be so hard to give her some freaking bread?",
              "id": 166,
              "comments": [
                {
                  "score": 26,
                  "content": "And sides!  All very filling sides.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 38,
                      "content": "I'm now more concerned about how the fuck OP managed to eat ALL of that food.",
                      "id": 168,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "Seriously glad I'm not the only one thinking this.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Totally agree, sympathise and share, is that so hard?\nI have more love for my friends then he has to his gf, because I would have shared in a heartbeat. \n\n\n I enjoy Indian food, but would also have been disappointed with soup since I don't find it filling, and without anything on the side, quite boring.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yep OP is definitely the type of guy to get hung up on idiotic particulars. He probably “keeps track” of stuff in the relationship to hold over his partners. \n\nYeah _technically_ he doesn’t owe her anything, he paid for his food and she paid for hers. But I cannot imagine looking my partner (whom I allegedly love and respect) dead in the eye and going “huh, sucks to suck” and not giving them any of my food. A partnership is a give and take, and sometimes even if you’re in the right by sheer cold logic, that doesn’t mean you’re not also an asshole. YTA OP",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Lmao spot on. \n\nWho doesn’t share food with their SO when eating out? Most times if we can’t decide we will split two entrees.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10994,
      "content": "Ok, YTA. Hear me out. Based on the principle, you are technically in the right. You both gambled, she happened to lose. However, you're in a (presumably) loving relationship with this woman. She politely declined and took her own route to eat. It's not like she expected you to go out of your way to go to a different place. When she hit zilch on her bag and you hit gold, that's prime time to pool the meals and divide them up a bit to help her get some good food. She can't function at full capacity with a broken leg, and didn't demand your food either. \n\n&#x200B;\n\nYour response? Forgive me if I editorialize but to me you seemed like a snarling animal wrapping your arms around your food and baring your teeth. \"Tough luck\" is not an appropriate response in a relationship. If you were friends, I'm with you. But she has a broken leg, she asked nicely, she got totally screwed, and you have an excess. You're absolutely an asshole for refusing to share, it's just not cool.",
      "id": 173,
      "comments": [
        {
          "score": 1630,
          "content": "“Joey don’t share food!”",
          "id": 174,
          "comments": [
            {
              "score": 1497,
              "content": "Joey ended up alone.",
              "id": 175,
              "comments": [
                {
                  "score": 907,
                  "content": "Joey also expected others to share food with him",
                  "id": 176,
                  "comments": [
                    {
                      "score": 550,
                      "content": "This is true. And he even said  \"I'm not even sorry\"\n\nJoey deserved to end up alone",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Joey once pulled a fork out of his shirt pocket so he could eat someone else's food. (It was a stolen cheesecake, but still wasn't his.)",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Even better, Joey said this when Rachel was talking about him not letting her baby take some of his food.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 13,
                      "content": "And let's not forget how he wouldn't share Hugsy!!!",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I don't remember that. So I didn't watch all of the later episodes. Did Emma want chocolate or something??",
                      "id": 181,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1070,
          "content": "All of this. I am extremely food possessive and hate if people take it without asking. But if I was in this situation I would have shared without even being prompted. And that's just with friends, not even a romantic interest or partner. \n\nOP, what would happen if you got married and shared joint accounts/groceries? Would you never let her eat anything that you had brought into the home? You couldn't even give her a single rib? Like wow.",
          "id": 182,
          "comments": [
            {
              "score": 483,
              "content": "I would've just split both bags equally. Have some soup and bbq together. It'd be like the garbage plates I used to order back home lol you get a little bit of everything.",
              "id": 183,
              "comments": [
                {
                  "score": 191,
                  "content": "Literally my immediate thought. They would have had BBQ for dinner and soup for lunch the next day. Perfection. Except OP went ahead and effed that up.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 88,
                  "content": "They never even said the soup was bad, just that it was a lot of soup.\n\nHave good bbq and good soup. Both enjoy a nice meal together and you come out an awesome dude to your girl. It’s win win.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 67,
                      "content": "Indian cuisine is one of my favourites and I’ve never even seen soup at the various buffets and restaurants I’ve been to… no one orders a mystery bag of Indian food expecting to get nothing but soup 🙃 lol from a deli maybe!  but any reasonable person would have expected some kind of solid food.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "That was my take. I'm imagining the gf just wanted or needed some protein, not that she didn't like the soup. But even if she did he knew it could be a gamble for either of them. I hope his next bag is shitty and she doesn't share hers with him.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "ROC, NY Native?? Hah",
                  "id": 188,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I know…through her a bone.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "unless is was *really* funny to do it to them and it was a specific kind of super-close-basically-family friend, then I'd be sharing with all my friends. Life is more than a good gamble on barbecue.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 482,
          "content": "I mean in a similar situation I’d probably offer to share with friends too but maybe that’s just me?",
          "id": 191,
          "comments": [
            {
              "score": 345,
              "content": "It's not just you. This comment kinda annoyed me, I hate when people make friendships sound like a grade b type of relationship, in which you can treat a friend less good than family/partners.",
              "id": 192,
              "comments": [
                {
                  "score": 81,
                  "content": "I'm super sorry for the friends of some of the people here. Good friends are like a second family. Hell, sometimes they are better than the actual family...",
                  "id": 193,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Yeah. I think it's a really twisted concept of closeness that we have in modern society. You can only be emotionally intimate with a romantic interest, your parent, or your child. Anything else is called into question as \"maybe you have romantic feelings\". \n\nIt's just so fucked up. Love has so many forms, thinking romantic/familial love are the only ones that matter is crippling your own self. Besides, just as friends can leave your life, so can a romantic partner. Then who are you left with? That person you were willing to be shit to since he is grade b in your life?",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My closest friend always says she knows my entire medical history. Which is actually true! We’ve been through some shit together \n\nI will always give her my last snack",
                  "id": 195,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "The only way my friend isn't getting half my bbq is if he straight up said \"no I don't want any food\" and then changed his mind when he saw what I got. Even then I'm still giving him a little bit if he asks and if he wants to go halves then I say yeah buy us something from the bodega to split so we're not still hungry after.",
                  "id": 196,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "Half the fun of going to restaurants with friends and family is that we all order different things b/c we know other person will let us try theirs.",
              "id": 197,
              "comments": [
                {
                  "score": 9,
                  "content": "YES, my friends and I would love going to all-you-can-eat sushi places and ordering for the table lol. we'd all share the appetizers and rolls",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It’s not just you, I would do it too",
              "id": 199,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Even if we ignoring morality, logically it's the right move to share the food. You can't expect someone to share with you in the future if you rejected them before. And sharing the surprise box food effectively normalizes the distribution, reducing the chances of getting a meal you really hate. It's the same concept as buying insurance. Assuming the OP plans on using the app more than once, it would be the right move to share here.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "I dunno man, even if they were my roommate and we had zero chemistry and just were polite with each other, I would STILL offer to share because Mr. Rogers taught me that sharing is caring. \n\nBecause I'm a nice person.\n\nThere are a ton of situations where a person can be correct, but an asshole. This is a prime example.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I agree. And she didn’t even ask to switch, asked if he was willing to share. Any decent person would’ve at least halted it. And honestly if he didn’t want the soup it’s silly to expect her to eat it too.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This. It seems people rather be right than be kind.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah, this was the vibe I was getting. College dorm kinda stuff. I mean he might be 19 or thereabouts and just hasn't learned any manners.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I agree but I’ll also say I wouldn’t even do this to a friend lol. If we’re eating together, I presumably like you enough to be a kind person to you and this is one of those situations where kindness is all that’s needed so why not give it?",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Bro EVEN IF THEY WERE JUST FRIENDS I would STILL be like \"ya sure let's split it\".",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I wouldn’t do my friends like that lol. Even if there were four of us, we’d be eating a couple burnt ends apiece and ordering more food.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7059,
      "content": "I wish there was a voting option for: **’technically not the asshole, but I wouldn’t want you as a friend/boyfriend’**\n\nTechnically, NTA… but dude…. If my husband ordered food at dinner and didn’t like what arrived I would absolutely offer to share mine with him.",
      "id": 208,
      "comments": [
        {
          "score": 3918,
          "content": "I think it’s ‘technically not Wrong but he is an asshole’.",
          "id": 209,
          "comments": [
            {
              "score": 2399,
              "content": " A Person who relies on being “technically right” is usually an asshole.",
              "id": 210,
              "comments": [
                {
                  "score": 332,
                  "content": "It’s the only time “technically right” even comes up",
                  "id": 211,
                  "comments": [
                    {
                      "score": 34,
                      "content": "You are technically correct, the best kind of correct.",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "This honestly sums up op perfectly in one sentence.",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "How about technically not wrong but still an asshole nonetheless and I wouldn't want this person in my life or TNWBSAANAIWWTPIML for short",
              "id": 214,
              "comments": [
                {
                  "score": 14,
                  "content": "YTA for short.",
                  "id": 215,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Meh, I'll go with TNWBSAANAIWWTPIML and you go with YTA and we'll see which one sticks around, mkay.",
                      "id": 216,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "You're not wrong Walter, but you're an asshole.",
              "id": 217,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "There really should be a Lebowski rule.  When you're not wrong but you're just an asshole.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "THATS THE POINT OF YTA\n\nIt doesn’t matter if someone is legally or technically correct, it’s whether or not they’re being a jerk!\n\nThis sub has gone so far off the rails if folks are asking for a “technically correct” option lmao",
              "id": 219,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "“You’re not wrong Walter, you’re just an asshole”",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1068,
          "content": "this isn't \"was I wrong\" it's \"am I the asshole\" you can be right and an asshole. This guy is TA.",
          "id": 221,
          "comments": [
            {
              "score": 85,
              "content": "Good point lol",
              "id": 222,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 361,
          "content": "\"You're not wrong, Walter, you're just an asshole!\"\n\n(Worth adding that this line from The Big Lebowski was about enforcing bowling scoring rules at gunpoint)",
          "id": 223,
          "comments": [
            {
              "score": 31,
              "content": "Also, the title was misleading. I came in thinking she was gonna demand his whole meal. “Giving” should have been “sharing with”",
              "id": 224,
              "comments": [
                {
                  "score": 12,
                  "content": "GF stole my paycheck and gave it to our waiter (she borrowed 5 bucks for tip)!",
                  "id": 225,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 243,
          "content": "That’s where this sub has 2 camps. One who says “they followed the rules, so they aren’t the AH”, and the other that says “there’s a compassion component of not being an AH”. \nI agree that “not an assholes” act with compassion even when they’re technically right.",
          "id": 226,
          "comments": [
            {
              "score": 135,
              "content": "1st camp = assholes",
              "id": 227,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Especially as it sounds like OP had more than enough food to be able to share.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "That means they’re an AH 😂\n\nJust because you’re not technically wrong that doesn’t absolve you from being an AH. In fact being technically right is one of the biggest flags that you are an AH",
          "id": 229,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "*PARTICULARLY* when it was a grab bag. I might see it differently if he ordered a rib platter and she ordered 6 pints of cauliflower soup, and then changed her mind when it showed up.",
          "id": 230,
          "comments": [
            {
              "score": 4,
              "content": "Right, I think thats the biggest component. It could've just as easily been some BBQ item he didn't like and a full amazing Indian meal. It was entirely luck that he got a great meal. To me it's like, why even be in a relationship if your reaction to a difficulty for your partner is \"sorry you had a difficulty, git gud scrub\". And if she can't trust him to ease a difficulty when it comes to dinner, how can she trust him for anything serious?",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "\"You are technically correct. In this context, not the best kind of correct.\"",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "He's technically right, but still the AH. Sure as hell I would not want him as a friend.",
          "id": 233,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Technically right, forever lonely I think is the correct phrase. I know darn well my wife would immediately offer to share, as would I.",
          "id": 234,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5853,
      "content": "Would it have hurt you to swap some pulled pork and potato salad for some soup?  I have no idea why people find it so hard to share and compromise.  YTA",
      "id": 235,
      "comments": [
        {
          "score": 696,
          "content": "Right!  My spouse and I would have split it and then split the soup for lunch the next day.  But now I'm wondering if my local restaurants have this app!",
          "id": 236,
          "comments": [
            {
              "score": 165,
              "content": "Try search for “too good to go” app",
              "id": 237,
              "comments": [
                {
                  "score": 49,
                  "content": "Was this just a brilliant ad for that app?",
                  "id": 238,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I mean, it is the sort of good idea that kind of sells itself with word of mouth.\n\nA lot of the eco products and services out there offer something inferior or more expensive. It's a bit like \"you can save the planet, but this lightbulb will cost you 3x as much and barely light a room\".\n\nToo Good To Go is all pros all across the board.\n\nThe companies get some extra revenue and avoid the negative press from binning lots of good food.\n\nThe customers get to eat professionally prepared food without breaking the bank, in a cost of living crisis. That's ignoring that the app has supermarkets on, so you can also reduce your grocery bill by buying those and just cooking with whatever you get the same day.\n\nEven societally, the grocery bags and carvery type meals are a lot healthier than the comparable price processed foods. The bags from supermarkets are 90% fruit, veg, meats and bread. It might help with the obesity crisis, at least as far as it is caused by affordability rather than laziness and gluttony.\n\nAnd then the reduction in food waste reduces the demand for habitat destruction, overuse of land and water, and saves it from releasing methane in a landfill.\n\nWe need more stuff like Too Good To Go.",
                      "id": 239,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Thank you!!! I’m in Atlanta and they just barely started serving here. Can’t wait!",
                  "id": 240,
                  "comments": [
                    {
                      "score": 10,
                      "content": "That’s exciting! If it’s just started in Atlanta I’m sure it’s not here but I love the idea of this app and I hope everyone strikes it big!",
                      "id": 241,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Thank You!!! I’m in Los Angeles and am shocked I haven’t heard about this yet. Such a Great Idea!!",
                  "id": 242,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Lol same! My partner and I literally did this last night when I asked him if he wanted food, he said no. But when I got home with the food, he was happy that I had thought ahead to get some to share. It's not hard to be considerate.\nAnd also agreed about the app! I'm like, what's the name of the app?!",
              "id": 243,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "It’s called too good to go in case you’re wondering! In my city (LA) most places on there are bakeries so far but it’s still great. Got over 200+ worth of breakfast pastries and bread for 4.99 once lol",
              "id": 244,
              "comments": [
                {
                  "score": 4,
                  "content": "Holy shit. That’s a lot of pastries!!",
                  "id": 245,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 336,
          "content": "This leads me to believe that OP is not just an AH in this situation, but in general. He had so much food and instead of sharing he ate it all in front of her. I'm sure his just selfish and self-centered in general. I hope she realizes she deserves better.",
          "id": 246,
          "comments": [
            {
              "score": 88,
              "content": "And kind of delusional if he thinks the west village is the most expensive neighborhood in NYC. Also don’t even understand why that (false) info was necessary? People know NYC is expensive, but anyone from here also knows you can find cheap and delicious food in every neighborhood.",
              "id": 247,
              "comments": [
                {
                  "score": 7,
                  "content": "Yeah, NYC native here. My eyebrows went to the ceiling when he said West Village was the most expensive neighborhood in NY. Not even close to true unless all you eat at are Michelin-star restaurants. There are so many delicious, cheaper hole-in-the-wall places where you can go sub $20 (15 yrs ago, sub $10, but inflation 😔) and get a great meal. \n\nBtw - I've traveled a fair bit out of NY since I grew up there and I now think Miami is honestly more expensive than NYC in terms of food and goods.",
                  "id": 248,
                  "comments": [
                    {
                      "score": 6,
                      "content": "NYC remains the most expensive city to live in the US but the gap between it and other cities is definitely shrinking, and I haven’t been to Miami in a long time, but I would assume NYC probably has a larger variety of cheaper options for everything.\n\nETA: quick google search shows that Miami COL is 14% higher than the national average, with housing costs at 45% higher than the national average, but NYC COL is 129% higher than the national average and housing costs are 369% higher. So the gap is not shrinking nearly as much as anyone may think.",
                      "id": 249,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 255,
          "content": "I have a relevant story for once!\n\nA few years back I was on holiday in Greece with my girlfriend who's a bit of a picky eater, and one night in restaurant she ordered a \"risky\" meal (some sort of lamb stew thing) while I got a safer option, basically chicken skewers with bread and chips.\n\nThe food turns up, and mine looks fine, however, hers is this horrible grey-coloured lamb in a watery sauce. Bless her, she gives it a go, but it's obvious within a single bite, it's not for her at all. She's looking at mine like she's wishing she'd just got the safe option like me.\n\nAnd you know what I did then, OP? I split my meal with her without her even needing to ask. We shared the chicken, bread and chips. And we laughed about the situation while doing it. Still do to today whenever she orders something new in a restaurant.\n\nI didn't split mine because I'm partner of the year or anything. It's because I'm a normal person who cares about my SO, and felt awful for her when her meal didn't turn out as hoped. Who gives a crap if I went a little bit hungry that night, hell I'd have happily given her my whole meal. Like you said, it's not that hard to share and compromise in a relationship. \n\nOP, is  100% the asshole here.",
          "id": 250,
          "comments": [
            {
              "score": 32,
              "content": "This. Your girl likes to try new things. Sometimes it works, sometimes it doesn’t. I’m sure that spirit is an endearing quality. Seeing her enthusiasm backfire I’m sure makes you want to cheer her up. That’s called being a good partner. There is no point tallying in a relationship.",
              "id": 251,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I’ve never been in a relationship, but reading through this thread this story is a shining example of how I feel about this. Yes, you’re right, she is not entitled to your food and you do not have an obligation to give any to her, but being “correct” in this scenario doesn’t matter for shit because theres no “incorrect”. One way, you make a tiny sacrifice, because you presumably like and enjoy the company of this other person, and both of you have a good time and wake up the next morning happy with the “inconvenience” you’ve suffered a long distant memory vastly overshadowed by the time spent with your partner. The other way, you end up in this scenario asking strangers on reddit if you were an ass while your girlfriend is angry with you. I just feel like when you consider the conclusions, maybe being kind in spite of being “right” isn’t such a bad choice.",
              "id": 252,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I was once with my husband in a foreign country visiting his friend and for reasons too long to explain, accidentally ordered a dish swimming in white sauce. I’m lactose intolerant, didn’t have any lactase with me. Hubby is vegetarian so he couldn’t trade with me but his friend very quickly and cheerfully offered to switch plates with me when he realized my mistake. Someone I had just met did that! OP isn’t very nice to his girlfriend…",
              "id": 253,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "because people care more about being right than being a good person\n\nOP is YTA\n\nI don't understand how someone is in a relationship and this self-centered.",
          "id": 254,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2879,
      "content": "I honestly can't imagine telling my wife essentially, \"tough shit\" in this scenario as you did with your GF.  \n\nWere you technically correct?  Perhaps, but you could have shared something with someone you allegedly care about.   \n\nYTA.",
      "id": 255,
      "comments": [
        {
          "score": 1104,
          "content": "My wife and I ordered from a new place one night and when the food arrived, my “sandwich” (as it was listed on the menu) was a tiny tortilla wrap. Itty bitty little thing, no sides. My wife immediately said “That really sucks, babe; help yourself to some of mine”. How hard is that?",
          "id": 256,
          "comments": [
            {
              "score": 259,
              "content": "Literally, I know for a fact my bf would do the same if we were in that situation. Why couldn’t OP do the same?",
              "id": 257,
              "comments": [
                {
                  "score": 118,
                  "content": "Heck, I’ve swapped dishes with her a couple times when she liked what I had better and I was ambivalent. Or we agree to share.",
                  "id": 258,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "My wife and I do that all the time.  It’s what couples do, something OP won’t be a part of if he keeps it up.",
              "id": 259,
              "comments": [
                {
                  "score": 8,
                  "content": "We end up swapping and sharing so often that now we usually just get things to share in the first place. We have really similar tastes, so it works well.",
                  "id": 260,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "You push over! /s\nTo OP:\nThis is a “do you want to be right or do you want to be happy?” situation. YTA and good luck.",
              "id": 261,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Right! We, wife, son and me, all share food. My son and wife can have bites of my food and I there's without even asking. Idc. My son will snatch something off my plate and I'll take his or my wife's and she will take whatever. We all share when we order out because why not? Why would it matter? Everyone is eating and enjoying the food together. My son is grown now, but we still are like this. We share because we love each other.",
              "id": 262,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 109,
          "content": "Right.  My husband would insist",
          "id": 263,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I don't even think he's \"technically correct\".  He's absurd.  If it were me, I would share everything.  Besides, that soup might have been delicious.  I've never had soup at an Indian place that wasn't delicious.  Especially in Manhattan where there is fantastic Indian food.",
          "id": 264,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "My bf is the rare guy that actually is happy if I want to eat his food (even if I told him earlier that I don’t want food). He’s is so kind and caring and he loves to see me happy.\n\nHe would have gladly split his meal if I didn’t like mine. I’m less excited about sharing food but I would have gladly done the same as well without hesitation.",
          "id": 265,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Like honestly OPs reasoning is something you’d think instead of actually say. I’d be thinking “ffs I have to share this shit now”, but I’d still share the meal if my partner got such a dud of a surprise meal. What logic is op running on I have no idea",
          "id": 266,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "that scenario has happened to me before (where one of us didn’t like our food) and I can’t imagine my bf or me not immediately offering our food to each other. Like the fact OP’s girlfriend had to ask makes me kind of sad. I feel like it’s natural if you love someone to want to share things like this. If his attitude affects other parts of their relationship and he doesn’t want to change, I hope she finds someone better.",
          "id": 267,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2058,
      "content": "Technically NTA. But in a relationship. YTA. If you ever plan on getting married you might want to reconsider when to be selfish and when not to be. \n\nI had to go back to check you wrote GF and not wife. A loving husband would share. Regardless of whether his wife had previously said no. She obviously didn’t expect 3 variations of cauliflower soup.",
      "id": 268,
      "comments": [
        {
          "score": 879,
          "content": "On top of that OP casually mentions that his gf broke her leg a month ago and they live on the 4th floor with no elevator. So not only would she have to pay again for food and delivery and wait for it to turn up while OP is chowing down on bbq she'd also have to hobble down multiple flights of stairs to get it.",
          "id": 269,
          "comments": [
            {
              "score": 37,
              "content": "Let's be fair here, op was offering to walk to the bodega so I bet he would've walked downstairs. Still should've just shared but I don't think he's quite this cruel.",
              "id": 270,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yeah, my friends and I will swap or share food when our Uber eats orders get messed up, because we care about each other and want to make sure everyone has enough food, so this dude being so inflexible seems really sad to me.",
          "id": 271,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1889,
      "content": "Yep, YTA. \n\nThe amount of people on Reddit who think \"being nice to your partner\" = \"being fucked over\" is **wild.**",
      "id": 272,
      "comments": [
        {
          "score": 477,
          "content": "This! \n\nI could see my husband being annoyed in this situation, given that I said no to wanting BBQ and now wanted his BBQ. But even if it was begrudgingly, he would have split up both meals equally so we could share both the soup and the BBQ. Just as I would do for him. Sometimes I read the responses on here and I genuinely wonder if some of the responders have ever actually been in a relationship with another person.  A little kindness and compromise go a long way, especially with someone you supposedly love...",
          "id": 273,
          "comments": [
            {
              "score": 199,
              "content": "Same!\n\nI LOVE my partner AND I like him. \n\nI don't want to enjoy things in front of him because he had a bad food bag, or make him eat cold general store food because the grills would be closed. \n\nRelationships aren't meant to be a win/lose scenario, man.\n\nHe'd do it for me and vice versa, and then whoever got the bad bag would later try to do something nice in return to show appreciation for the sacrifice.",
              "id": 274,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "I really think Reddit is full of got mine fuck you kind of people 😅 even if they agree it’s the way of the world they’re just perpetuating it, what a world to want to live in",
              "id": 275,
              "comments": [
                {
                  "score": 20,
                  "content": "Oh yeah Reddit is definitely like that. Reminds me of the guy who wanted his brother to watch his kid for him after he had been widowed for 4 years and was finally going on a date. The brother said pretty much he can go fuck himself. Of course he got many N T A votes though. God forbid he help his brother who’s wife literally fucking died. And this was the first time the guy asked for help in the 4 years since it happened.",
                  "id": 276,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I think (or at least hope) a lot of those people are full of shit and just trying to be edgy for the internet or something. I don't think most people have the balls to behave this terribly in their real lives even if they are thinking those things on the inside.",
                  "id": 277,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yup. If any of my past ex's got a shit meal and I got a super meal I would have offered to share my meal with them. \n\nNot because it was \"fair\" or because \"I won and they lost\" or anything. Because I fucking *loved* them and wanted them to have a good meal.\n\nLot of heartless people here are going to be single real quick.",
              "id": 278,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yup. My husband gets really annoyed at anyone who suddenly \"wants something they didn't before.\" And he'd also not really understand the nuance of this. \n\nBut if I asked? 100% he'd comply. it honestly wouldn't have to be a 50/50 split. Eat the soup but also have a small part of the BBQ. Not really all that difficult.\n\nIf I saw even a friend in this situation, I'd give them a bit of hell but also offer some of mine while trying a new soup. Isn't that the point of the surprise bag? To try cool stuff for a cheap price? I'm really confused at the hostility here that some commenters have.",
              "id": 279,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yours is about the 10th highest rated answer and all others are a variation on YTA. Fortunately the \"being nice to your partner\" = \"being fucked over\" crowd is not that big.",
          "id": 280,
          "comments": [
            {
              "score": 10,
              "content": "Well that's nice then. This is an instance where I don't want to be right!",
              "id": 281,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "Relationships are not a competition, and those who treat it as such, well, maybe that’s why they’re unhappy",
          "id": 282,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "It’s so bizarre! Some of these relationships feel so transactional.",
          "id": 283,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This sub is always flooded with unbelievably selfish comments. It’s pretty sad to read honestly. They view any compromise as “losing” and therefore it must never happen",
          "id": 284,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1411,
      "content": "NTA. But I wouldn’t date someone like you",
      "id": 285,
      "comments": [
        {
          "score": 659,
          "content": "YES like does this pass the court of law? Yes. Does it pass the court of being a kind appealing partner? Absolutely not.",
          "id": 286,
          "comments": [
            {
              "score": 522,
              "content": "Well this isn't \"am I technically right\", it's an I the asshole. I think this sub forgets that a lot. Winning an argument doesn't make someone less of an asshole",
              "id": 287,
              "comments": [
                {
                  "score": 159,
                  "content": "I agree, my actual ruling in another comment is YTA.",
                  "id": 288,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Very rarely do I think that the person was wrong, but not the ah, or right but still an ah. This post is one of the latter.\n\nHe was within his rights and privileges to hoard his food to himself. And he's a selfish asshole who doesn't have the maturity to be in a relationship.\n\nMy partner is my family. If one member of the family isn't happily fed, none of us are.",
                  "id": 289,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": ">Does it pass the court of being a kind appealing partner?\n\nSo he's an asshole.... What is with these N T A comments that go on to acknowledge asshole behaviour.",
              "id": 290,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Why wouldn't you date someone like him? Because he seems like... an asshole?",
          "id": 291,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "So... Yta.",
          "id": 292,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Because he is, in fact, an asshole!",
          "id": 293,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I would argue they are the asshole despite technically not being wrong.",
          "id": 294,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Technically correct is not the same thing as not being an asshole. He is Technically correct but this is totally a YTA.",
          "id": 295,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "is the reason \"because OP is an asshole\"? because he's definitely TA.",
          "id": 296,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1103,
      "content": "The only thing that matters. What app is this? I'm coming to NYC soon and I need to know. Edit I think I found it. I thinks its called Too Good To Go. For anyone wondering.",
      "id": 297,
      "comments": [
        {
          "score": 375,
          "content": "It may be TooGoodToGo. It’s what I use in CA for similar benefit.",
          "id": 298,
          "comments": [
            {
              "score": 19,
              "content": "I also use it in LA, and it's so hard to get anything besides pastries :( I do get the occasional late night pizza though, haha",
              "id": 299,
              "comments": [
                {
                  "score": 15,
                  "content": "Sometimes I manage to snag a poke bowl.",
                  "id": 300,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Looks like my neighborhood is like 80% pastries/boba and poke. The various sizes of Eataly grocery bags look interesting though . But looks like all the decent places are sold out the night before.",
                      "id": 301,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 82,
          "content": "Out there doing the lazy man’s work for us! Thank you!!",
          "id": 302,
          "comments": [
            {
              "score": 6,
              "content": "Yeah, I don’t get why people are so gatekeep-y about stuff like that… But we can see from this guy’s post that he’s not good at sharing, so 🤷🏼‍♀️😂",
              "id": 303,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "This is some fantastic guerrilla marketing.",
          "id": 304,
          "comments": [
            {
              "score": 31,
              "content": "[deleted]",
              "id": 305,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I was legit thinking this was just an ad for the app",
              "id": 306,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Not so patiently waiting for St Louis to jump on this. I've had the app for months, and there are still no restaurants participating.",
          "id": 307,
          "comments": [
            {
              "score": 11,
              "content": "I’m in Vegas and there is only one restaurant on it, I was so excited but now I’m sad",
              "id": 308,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "I suspect this post is a larp to advertise for the app and people are eating it up lol.",
          "id": 309,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "It sounds like Too Good To Go",
          "id": 310,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Founded in Denmark in 2015 and just released in a lot of countries in July 2023 including the US :) wonderful app!",
          "id": 311,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}