{
  "post content": "The other night I went to a pub with a group of friends (all female). A new place, none had ever been there.\n\nAs we walked in and asked for a table, the waiter made jokes like, \"Wow, did your boyfriends let you go out alone? I'd always keep you locked up, you're too cute!\", \"No? Don't you have a boyfriend? Better for me!\"\n\nYou could see that he said it jokingly - the pub is located in an area of the city where there are only pubs, bars, nightclubs: the staff tries to attract customers in every way, even with that kind of jokes - but for some reason it rubbed me the wrong way.\n\nI said nothing, but pulled a face. The waiter saw me and told me that he was just joking, there was no need to be offended.\n\nI rolled my eyes and said \"whatever\", just to not start a sterile argument that I wasn't offended, just annoyed.\n\nWe sat down at the table and ordered drinks. I ordered a can of soda, as did another friend (others ordered beers or cocktails).\n\nWhen the orders arrived at the table, I saw that my can of soda had already been opened, while my friend's was still sealed. I told the waiter that I wanted an unopened can, and he (the same one who had made us sit at the table) was defensive, saying that I offended him very much with my insinuations (I didn't insinuate anything, I just asked a unopened can). He said that for him opening bottles and cans are automatic gestures. When I pointed out that my other friend's was sealed, he replied that the orders for the table were many, he hadn't seen it.\n\nBy then, other patrons of the pub were watching the scene.\n\nI stood my ground, demanding an unopened can, and the waiter replied that it was absurd to waste a can of perfectly good soda and insisted that I drink that, but I said no. I finally got the unopened can but we were pretty much ignored by the waiter for the rest of the evening and when we asked for a second round of drinks we waited a lot\n\nMy friends got pissed at me, saying that I spoiled the mood and made the waiter boycott our table (and that's why they think I was an a-hole).\n\nIn my opinion I wasn't: my request was reasonable and the way the waiter reacted set off alarm bells for me. Nothing happened, but better be safe than sorry.\n\nBut now I'm wondering if I overreacted?\n\n\\*\\*\\*\\*\n\nEDIT after reading the comments:\n\n\\- my friends say I overreacted because we came as a group and left as a group. Even if my soda was tampered, they'd always be with me. I understand their point of view, but I will reflect on whether to go out with them again, because they still don't understand mine (why should I risk drinking?);\n\n\\- I paid for all my drinks, even for the soda I didn't drink, to avoid further exacerbating the situation.",
  "id": 1,
  "comments": [
    {
      "score": 10547,
      "content": "NTA, you're within your rights to ask for a different drink if you have reason to believe yours is spiked (and sounds like you had good enough reason unless something is missing)",
      "id": 2,
      "comments": [
        {
          "score": 6514,
          "content": "The waiter certainly didn't like how I reacted to his jokes when he welcomed us, and that's what made me wary when I saw the open can. \n\nMaybe he spat in it or put a laxative, maybe it wasn't spiked at all.\r  \nBut the interaction didn't sit right with me.",
          "id": 3,
          "comments": [
            {
              "score": 5058,
              "content": "The first rule of personal safety is to trust your gut when something doesn’t seem right. The assault/rape accounts that start out with “I felt really uncomfortable but didn’t want to be rude” are legion.  Which is in no way victim blaming, just confirmation that we often have an instinct that we are in danger even before we can put together intellectually what is off about a situation, so we should trust ourselves instead of bowing to misogynistic social pressures.",
              "id": 4,
              "comments": [
                {
                  "score": 2047,
                  "content": "So true.\n\n“The Gift of Fear” is a book that goes into this.\n\n“The book demonstrates how every individual should learn to trust the inherent ‘gift’ of their gut instinct. By learning to recognize various warning signs and precursors to violence, it becomes possible to avoid potential trauma and harm.” Especially important for women.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 382,
                      "content": "I LOVE that book! I recommend it frequently even though it's an older book. It pairs well with [\"Strong on Defense\" by Sanford Strong](https://www.amazon.com/Strong-Defense-Survival-Protect-Family/dp/0671522930?ref_=ast_author_mpb)",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 161,
                      "content": "I loved that book.  Equally important is how it addresses how women are socialized to avoid being rude at all costs and frequently ignore our instincts because we’re so afraid of being seen as rude.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 128,
                      "content": "Yeah, the book basically says that your subconscious will collect and rate different things, little details that you might not consciously notice, and if you are suddenly afraid, it's your subconscious rating something you aren't even aware of as \"dangerous\". People who survived dangerous situations will later recall having seen stuff that was definitely off, but they didn't know what felt \"off\" at the moment, it just did.\n\nIn the OP's situation though, everything screams danger. Though maybe the drink wasn't spiked and the waiter just wanted to make her afraid, but he was definitely messing with her. And the comments make it sound like he'll end up in jail sooner or later.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "I JUST READ THIS AWESOME BOOK!!! omg so eye-opening.\n\nanother resource: the behaviour panel on youtube. they talk a lot about how intuition is your brain recognizing certain behaviours in others and putting you on alert. it's a good and real thing.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": " I read this book back in the 90s and it still resonates with me. FYI, his bio is crazy, including being interviewed in Brooke Shield's bio. So what if your intuition was wrong (I have no idea), OP, you should always follow it for safety reasons. NTA",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Gavin de Becker also says, \"Trust your instincts.  **Their only purpose is to keep you safe!\"**",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I give credit to this subreddit for introducing me to this book. I'm city born and raised and pretty streetwise but I learned a lot, especially about how to explain your gut feelings to someone who's pushing against it.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Just loved this book so much. I never saw, not even once, a hunch of danger being wrong. One of the rules from TGOF I follow with all my heart is to be wary of people who keep insisting after we said no or wanted to remove ourselves from a situation. Even when these kind of people don't mean harm, they are trying to control you and dismissing your discomfort. In OP's case, it was very alarming that the waiter kept pushing her to accept the opened can. I doubt they would push so much if the soda was actually \"perfectly good\" as they said.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I love this book, it should be required reading for all women.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "*As long as you do the work to ensure your fear doesn't come from a place of bias, like racism or homophobia",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 602,
                  "content": "The way he insisted she still drink it gave away that something was up...",
                  "id": 16,
                  "comments": [
                    {
                      "score": 433,
                      "content": "and the fact her friends think she should've risked something that could've been as small as maybe catching a cold (if he'd spat in it), to being passed out (if he'd drugged it) just because they were there with her is absolutely horrifying to me.\n\ncan't wrap my head around it. bc while i would help my friends - or anyone - as best i could if i saw them in a bad situation, i would never *actively encourage* they even potentially put themselves in that position. everyone but OP is TA here.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 142,
                      "content": "Yeah, every same drink should be served exactly the same way, and when it's not then that's a clue that something is off with the service...add on the uncomfortable communication, and I'm just thankful OP had the confidence to request a new drink...\n\nAlso, side note - practically none of your servers ever wash their hands...I worked in bars and restaurants for over a decade and I am an avid handwasher, so I always took notice to those who washed their hands and those who didnt...and the truth is, a very, very small percentage of my coworkers ever washed their hands...this is something I have to actively ignore when I want to go out to enjoy a night on the town...\n\nEdit to add - servers and bartenders have a significantly higher prevalence of contracting hepatitis...because they don't wash their hands, and hepatitis is easily transmitted through sharing food....",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Right?! What a creep!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "She should have offered it to him to drink instead",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "This is something I wished I had known when I was younger. It took more than one bad encounter for me to stop being nice when I was uncomfortable.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "NTA. Every single time in my life I have ignored that \"something is off here\" feeling I have regretted it.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I had a situation where I was already running late and was going to take a popular shortcut. It was backed onto by houses which gave people a feeling of safety, but most gardens had trees along the fences so less visibility from the homes' windows in parts. I got to the footpath and literally froze as I was about to step onto the path. I felt sick, got dizzy and breathing went off. Fought with myself for a couple of minutes (felt like forever) before deciding late or not I was going the long way. Couple of days later it was in the paper that a woman had been r*ped along that path the same evening. Reading the article gave me that same sick feeling I had had at the path, and while I felt awful that perhaps the offenders might have been scared off by someone coming, eventually I realised that realistically a stick of an 18yr old girl wasn't going to scare anyone and there simply would have been two victims instead of one. That gut instinct is powerful and scarily accurate, I would advise anyone to ALWAYS listen to it.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I have a strong suspicion I avoided an assault by listening to my gut. I give full credit to assault survivor Colleen Stan and the true crime book about her, \"The Girl in the Box,\" which I highly recommend. She was held prisoner for years by a couple. She was picked up hitchhiking and they stopped at a rest area. She remembered her gut *screaming* at her to run but brushed it off. Spent 8 years in captivity. \n\nWhen I was a teen, this guy I met in a coffee shop offered to smoke one with me. I thought it would be outside somewhere but he tried to take me to his apartment. He left me standing in the lobby for a minute and something just felt very, very off. I remembered Colleen and booked it. To this day I don't know if he was a perfectly nice fellow or what. But the older I've gotten and the more stories I've heard that started like mine and ended horribly the happier I am I booked it. Always, always, always listen to your gut.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "THIS! Please pay attention to this.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Besides not wanting to make a scene, the target could be wondering if they're paranoid, or unfair to the suspect - either way, rationalizing away a gut instinct that was correct after all",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This is so insightful. Well said.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "There's been some suggestion in scientific circles that that feeling might be people's right brain flashing a warning. The right brain doesn't have the communication bits and there are studies showing that we make decisions before the left brain supplies a validation (which is either plausible or just completely false and made up to explain it) for why we did something.\n\nIt gets really interesting when the link between the two hemispheres is cut (accidentally or intentionally) and the arm your right hemisphere controls starts doing things on their own or when a series of images (text doesn't work no language bits) is shown only to the eye the right hemisphere uses and patients wifhout fail will point to the correct animal despite answering that they don't know which animal it is (left brain didn't get the info from right because the bridge was gone).\n\nOh also NTA OP. Waiter presented several massive red flags, and acted completely unprofessional. You aren't responsible for an adult man throwing a tantrum and punishing the table because of a facial expression, eyeroll, and reasonable request about your drink. Frankly I would consider contacting the owner or manager because the waiter's behaviour wasn't acceptable even in a bar setting.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 413,
              "content": "Alarm bells were blaring in my head while I was reading your post. Like you said, better safe than sorry. \n\nYou reacted very reasonably, he’s the one who made a fuss. He could’ve just apologized when he saw his “““jokes””” landed wrong and simply gotten you a new can when you asked. But no, he chose to get all defensive and confrontational.",
              "id": 29,
              "comments": [
                {
                  "score": 144,
                  "content": "Also the jokes were weird and sexist to begin with, as if women have to be allowed out of the house by their keepers. It’s offensive and so inappropriate for a server to say to a table of women, it’s a scary way to view men’s roles in women’s lives and tells me a lot about him. Her friends are the living worst",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "Exactly. As I was reading I thought to myself at the first point of interaction: he should had simply said: My bad, sorry for the bad joke, what can I get you? Instead he doubled down and called her \"offended\" (while in fact HE was the one being offended she didn't find his sexist remarks funny).",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 294,
              "content": "My red flag warnings were going off reading this whole interaction. Did you talk to the manager? I would. This whole behavior is uncalled for tbh. As a woman in this society, you have every right to use as much caution around creeps as you feel necessary.\nNta\nEdit: pre-coffee grammar",
              "id": 32,
              "comments": [
                {
                  "score": 90,
                  "content": "please call the place and talk to the manager if you can. you were smart to not trust him--good instincts",
                  "id": 33,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Yeah, but someone else might not be, so definitely put him on a watch list or get him fired.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 274,
              "content": "Waiter's reaction didn't sit right with me either. His excuses to not replace the can didn't make sense; if the can was clean, one of the employees could have drunk it.  Even if they couldn't, the establishment wouldn't worry about the cost of one open can over customer's discomfort and safety. \n\n\nWhen the waiter refused to replace the open can, I probably would have said fine and either gone directly to the bartender to ask for a new can myself and/or asked for a manager to report the incident. Definitely would not have drunk from the can though.",
              "id": 35,
              "comments": [
                {
                  "score": 66,
                  "content": "Exactly. A normal server would have just taken it back & switched it, plus apologized in a \"sorry that's not what you want, I'll go grab a new one!\" kind of way. Pushing & adding guilt is creepy AF. \n\nHe was trying to get her to drink that can for some reason. It's not like the soda comes out of his paycheck.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 2,
                      "content": "What first set off alarm bells for me was when he asked about a boyfriend. It's a classic technique to seek out a victim who likely won't be missed, even better when the rest of her party already seemed to be at various levels of drunk. This reads like it easily could have resulted in a kidnapping, and am glad it didn't.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "There are also a number of reasons someone wouldn’t want their soda opened for them. That honestly seems kind of gross to me and is, as far as I’m aware, not a thing. The fact that he jumped straight to her insinuating something is super weird. Dude probably spat in it",
                  "id": 38,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "I would have got a glass, poured some of the drink in it and told the waiter \"fine, you take a drink. If you ain't sick or messed up in an hour then I'll drink it.\" If he refused to drink it, that's a pretty clear indicator somethings fucky.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 190,
              "content": "And thats totally reasonable! \nI wouldnt want to drink out of an open can after that interaction either... Wouldve been a bit different if both were opened but since it was only yours thats kinda suspicious",
              "id": 40,
              "comments": [
                {
                  "score": 93,
                  "content": "Even then. It's common for waiters to open your soda in front of you and pour it into a glass, but I can't remember ever seeing a can arrive at a table already opened.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Yes I dont think ive ever had that happen either",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 184,
              "content": "You are 100% NTA your gut will save you. I would reach out to the owner or post a review of your interaction because no part of that is okay. If he wanted to open as a courtesy then he can bring it unopened to the table and open it in front of you. That is the norm. \n\nThere are ways of flirting/joking that don’t involve abusive and kidnapping like behavior. That’s a big ick.",
              "id": 43,
              "comments": [
                {
                  "score": 131,
                  "content": "Exactly this. Never, ever, ever are drinks brought to the table already opened. Sometimes they are opened in front of me, sometimes I open them myself (depends on the drink and the place) but it was highly irregular what he was saying.\n\nYour friends should have had your back instead of blaming you when the waiter was ignoring you afterwards. You should probably all have left, citing bad service.\n\nTo be absolutely clear, you did absolutely nothing wrong.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "Yes! I've always had bartenders or servers bring the unopened bottle/can and open it at the table or bar. Hell, even at events that you can only have uncapped bottles, they open it in front of you and toss the cap.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 150,
              "content": "Bad actors will absolutely use  your politeness or fear of embarrassment to cover for themselves while they hurt you. You did the right thing.",
              "id": 46,
              "comments": [
                {
                  "score": 8,
                  "content": "Nailed it",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "He can drink it if he doesn't want it wasted and he didn't do anything to it. \n\nIf your friends keep bitching about it, if it happens again hand the can to one of them and *they* can drink it.",
              "id": 48,
              "comments": [
                {
                  "score": 45,
                  "content": "I was thinking the same thing. If it wasn't a big deal, why didn't the person with the sealed can switch with her?",
                  "id": 49,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Yeah - \"Ok, let's switch if it's not a big deal\". I am pretty sure the friend didn't want to risk it herself.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Might have been different kinds of soda, like one is diet and the other isn’t.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Yes my thoughts too!",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 88,
              "content": "I work a bar at a theater and we (weirdly) have to open up all beverages in bottles or cans (New York). But…we do it in front of the guest. The fact that he didn’t want to get you another can speaks volumes. You were smart not to accept it.",
              "id": 53,
              "comments": [
                {
                  "score": 34,
                  "content": "Yeah sodas are cheap - even if you replace they're likely still making a few dollars' profit off of it. \n\nAnd I've never had a server argue about remaking food (and I have food allergies so I send things back if something is wrong fairly regularly.) That's suspicious to me - usually they just wait until you're out of earshot and vent to the other servers.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "I think you should report this to management. If there are cameras they will see what went down. Don't let anyone else to be a target for this person.\n\nNTA",
              "id": 55,
              "comments": [
                {
                  "score": 46,
                  "content": "I do agree that this should be reported to management. They would not want their customers being treated in this manner, even if he put nothing in the drink. No decent restaurant would be unwilling to toss a drink if it made the customer uncomfortable.\n\n My husband and I recently ate at a run of the mill roadhouse type restaurant where we were served lukewarm steaks. When we told them, they immediately offered to serve us a completely fresh meal and told us the dinner was free! Management would not risk annoying a customer for the sake of the low cost of a soda. \n\nAnd it goes without saying that if the waiter really is dangerous, they need to know. In any case, his service is simply not up to par and  they should know that, too.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 129,
          "content": "The whole thing is suspicious is hell. Opening cans is an \"automatic gesture\", yet only OP's can was opened? Hmmm.\n\nWhere I live, if your beverage comes in a closed bottle or can the server opens it at the table, where you can see them. No idea if this is policy or just common sense on the part of servers, but I'll take it.\n\nNTA. Your friends are kind of sucky.",
          "id": 57,
          "comments": [
            {
              "score": 6,
              "content": "It definitely screams \"Tonight at 10\"",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "I would have complained to the manager about this waiter. Not only unprofessional, but also potentially putting the customer at risk. Your request was so ridiculously normal OP. This is a bad waiter and I hope you didn't tip him anything.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "the best way to find out if he did something is tell him to drink it first. If he reacts negatively you know he did. \n\nAt that point you get management involved.\n\nNTA - this waiter had no right to insist you drink a beverage he delivered opened to your table. I'd call the manager and just explain to him what happened and why it made you uncomfortable. Then let management deal with it as they see fit.",
          "id": 60,
          "comments": [
            {
              "score": 22,
              "content": "There’s normal reasons people wouldn’t drink a soda though- I’d react negatively to someone telling me to drink one",
              "id": 61,
              "comments": [
                {
                  "score": 6,
                  "content": "agree, maybe he’s an asshole with diabetes or something",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "She has the right to ask for a new drink for any reason quite frankly. I've been on the industry for over 15 years, she made a totally reasonable request. \nThe waiter was corny as fuck and I find the behavior annoying too OP. It's not cute or endearing nor does it bring in business.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "NTA.  My rule is and always has been, if a drink seems off, different, or disturbed in any way, I don't care how many people I offend I am getting a fresh one.  ESPECIALLY if a man was making \"jokes\" of that nature to me before I received said drink that seemed off.  \n\nTruthfully, if it'd been me, I probably would have requested an entirely different server or insisted on sitting at the bar so I could watch the bartender make my drinks.  20 odd years ago when I was young and bar-hopping my crew knew my rules in advance about being in bars and clubs.  The aforementioned one, the \"keep your hand over your drink if somebody tries to take your attention off of it\", and \"if your hand wasn't on your drink when your eyes were off of it, get a different one.\"\n\nI had a friend who was a few years older than me get roofied and SA'd after being at a nightclub the year before I was old enough to join her, so I wasn't playing around.  Anybody that wanted to go drinking with me knew what they were signing on for in terms of me being a harridan about keeping their drinks and themselves safe.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "isn't it normal that those kind of drinks that come in bottles / cans be opened IN FRONT of a customer? you were absolutely right to ask for another drink. you always should do that.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah, OP, I wouldn't have drank it either. In my college days, I left SO many untouched drinks around bars and clubs because I didn't \"see\" them at some point. \n\nI also have to say about 80% of my close female friends have been slipped something, so it's not like I fear it for no reason. (Luckily for my friends, none of us abandoned them when they started feeling \"off\" after a single drink.) Unfortunately, most women learn a healthy fear of drinks like this for a reason...\n\nWe also learn to laugh and smile at jokes like the ones this waiter told you so we don't rock the boat. It's perfectly okay that you chose to do it, but I'm sure your friends were upset because they're so conditioned NOT to say anything.\n\nI'm sorry you went through all of that, but you did nothing wrong.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Even if you don't have reason to believe, only accepting unopened drinks is a blanket rule many women I know do and is completely reasonable.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4164,
      "content": "NTA. The fact he was so defensive AFTER joking like that is a massive red flag. Your safety is more important than some guy being but-hurt.",
      "id": 68,
      "comments": [
        {
          "score": 1423,
          "content": "Not to mention how the friends reacted afterwards, she didn't ruin the mood for acting the right way to be safe, it's the waiter who ruined the mood for acting inappropriately and potentially dangerous.",
          "id": 69,
          "comments": [
            {
              "score": 581,
              "content": "The friends are venting their frustration on the wrong person.",
              "id": 70,
              "comments": [
                {
                  "score": 408,
                  "content": "Absolutely and I find that sad. We shouldn't shame girls to feel like they're \"not fun\" when thinking about their safety, we should be shaming the creeps acting inappropriately who require us to be cautious.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 228,
                      "content": "it baffles me that they said it wouldnt matter if she got drugged because they were in a group?? like fuck no id rather not be drugged up or straight up unconcious. i prefer spending my nights doing fun things and not with a trip to the ER. and if they reacted like that i wouldnt trust them to help me out anyway",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "That's how a girl in my freshman dorm got raped. Her friends got upset with her for trying to be cautious, and ditched her the first chance they got. She got in the wrong car, while they were at the next club.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 309,
              "content": "The edit where her friends said even if he had done something to her drink they were all there to take care of her made me see red. That is not friend behavior!",
              "id": 74,
              "comments": [
                {
                  "score": 133,
                  "content": "I've been roofied at a restaurant/bar. It was awful. No one needs to risk that.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 48,
                      "content": "I’m sorry that happened to you, it’s so awful.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Same. It was an awful experience and it happened when I was with my spouse. They did not understand what was going on at the time either.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "Right? \"Oh just get sick as shit, no big deal we're here to take care of you.\"",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "Right like oh well I’ll just chance ingesting date rape bc my friends are with me??? Absolutely not. They didn’t care about your well-being before it happened, so even if you got drugged would you really be safe with them? They obviously don’t understand the gravity of the situation. \nDid you explain to your friends at least that that’s why you were asking for another soda? The only thing I can excuse them for if not is that maybe their mind didn’t go there & they thought you were just being picky asking for another soda for a different reason. If they knew you were afraid of getting drugged & still encouraged you to drink it, they’re bad friends.",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "If the friends really thought it was no big deal, they should have traded drinks with OP. Let them drink the open can.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Exactly. Plus they could've just went to another bar lol I highly doubt that was the only place in town",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I'm getting the idea they were arguing that, even if he had drugged her drink, they were there with her so no big deal? Like what the hell is that all about?",
              "id": 82,
              "comments": [
                {
                  "score": 3,
                  "content": ">Like what the hell is that all about?\n\nAbsolutely idiocracy. It's even proven in OPs edit, none of the girls wanted to drink from the soda. They're just hypocritical. OP needs to change friends.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "This, she needs new friends. My girls would have been all over the waiter insisting he bring a new drink. In fact, they would probably kick up a fuss and insist we leave.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Even if you changed your mind from Coke to Sprite he should have said no problem and gotten you a new one. \n\nI know I would have said, \"Here my gift to you, you drink it.\" \n\nDefensive and full on offended? Absolutely no way I would be drinking that.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": ">The fact he was so defensive AFTER joking like that is a massive red flag. \n\nThis! \n\n\"Oops, my bad. I'll get you a knew one, just a sec.\" I would see it as a genuine mistake.  But he doubled down!",
          "id": 86,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2446,
      "content": "NTA \n\nHe absolutely messed with your drink",
      "id": 87,
      "comments": [
        {
          "score": 790,
          "content": "Either that or he was trying to mess with your head. Either way NTA, and any \"friend\" who didn't stand up for you is an asshole.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 417,
          "content": "\"You have to drink that, it would be wasteful.\"\n\nWasting what, $1.50? Or wasting whatever drug you put in it?",
          "id": 89,
          "comments": [
            {
              "score": 165,
              "content": "I think OP should have said “I’ll pay for it, you go ahead and enjoy it, my treat. Go ahead, bottoms up!”",
              "id": 90,
              "comments": [
                {
                  "score": 139,
                  "content": "Or, \"I'll take another one unopened, but I'll keep this one to get it tested.\"",
                  "id": 91,
                  "comments": [
                    {
                      "score": 102,
                      "content": "This was my first thought. He was too insistent that she needed to drink it. I would have offered to trade with my friend who thought it was no big deal to get drugged, just to see his reaction. I would also have told him I would get it tested and that I would be calling the bar owner about his behavior before and after. NTA",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Or \"well why don't you give it to one of the cooks? I'll even pay for it.\"",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This one.",
              "id": 94,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Not even $1.50. I'm sure the wholesale price is much less.",
              "id": 95,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "Agreed. Why would a waiter put up such a fight when someone requests a new drink unless there was some ulterior motive there?",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Yup, probably not spiked (unless he’s a complete idiot considering she was with friends) but he could have spat in it or something.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1603,
      "content": "NTA. He opened yours but no one else’s. Big red flag.",
      "id": 98,
      "comments": [
        {
          "score": 241,
          "content": "I’m not usually a “can I speak to the manager” person but this would definitely have me calling back to speak to a manager.\nNTA",
          "id": 99,
          "comments": [
            {
              "score": 105,
              "content": "Absolutely this! First off, the waiter's \"jokes\" were, at best, tasteless. They were definitely sexist and misogynistic, and completely inappropriate. He thought it was OK to joke about locking women up? \n\nSecond, I don't think the waiter put some drug in her drink, but I'd bet money that he spat in it or otherwise contaminated it. Otherwise, he wouldn't have insisted on her drinking it. \n\nI wouldn't have cared what my friends thought - I'd be calling the manager over. \n\nNTA.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1336,
      "content": "NTA. Safety should always trump etiquette. Your friends should have recognised, between the creepy comments and the insistence to drink an opened £1.00 beverage, that you were downtown in Red Flag City. They should have supported you, and for their own sake, left and gone somewhere else.\n\nEven if you take the potential date-rape drug out of the equation...wouldn't the shitty service be enough to leave?",
      "id": 101,
      "comments": [
        {
          "score": 156,
          "content": "I had exact same thought. Just go elsewhere together the moment it rubs you the wrong way.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "It’s not even etiquette. I’ve been to a lot of different establishments, and never have I ever been given a canned or bottled drink that was opened out of my line of sight. If the waiter/bartender opens it, they open it in front of the customer.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I’m also really confused why they wouldn’t just leave. A supportive friend group would have been equally skeeved out and left. Personally, if that was my friend, I would’ve been immediately uncomfortable and want to go somewhere else.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1077,
      "content": "NTA. \n\nWhy did he even argue with you about the can? That on its own is weird enough. The guy should have just brought you a new, unopened can from the start like a normal waiter at any other place would do. Bet he definitely spat in that soda.",
      "id": 105,
      "comments": [
        {
          "score": 190,
          "content": "Or worse",
          "id": 106,
          "comments": [
            {
              "score": 199,
              "content": "I’m absolutely betting on worse.  He was far too insistent that she drink it.",
              "id": 107,
              "comments": [
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 108,
                  "comments": [
                    {
                      "score": 14,
                      "content": "You'd think, but I've had employees of the place I am harass me, and one even put his damn hands on my boobs and groped me. Not all predators are smart enough to not shit where they sleep.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 149,
          "content": "\"Then you drink it\" and see how he reacts.",
          "id": 110,
          "comments": [
            {
              "score": 89,
              "content": "That would work for a drugged drink, but not for spit: he'd just drink it. I'd just insist on the replacement drink as OP did and complain to the manager on the way out. Or have one of my friends do it, as I'd very likely to be too pissed at the waiter to be objective in my report. OP's friends not being on her side, though, would mean they probably wouldn't do that for her. What a bad friend group. \n\nI would not have paid for the pre-opened drink as OP did though. That he opened her drink outside of view, and did not open someone else's drink, is IMO a reasonable red flag and grounds for not paying for it.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": ">Bet he definitely spat in that soda.\n\nYea, I'm not sure I'm convinced it was drugged because spiking the drink of someone who isn't drinking alcohol doesn't make a lot of sense - it would immediately alert people that she had been drugged rather than drunk.\n\nBut I'm pretty certain that there was something gross in that drink.",
          "id": 112,
          "comments": [
            {
              "score": 4,
              "content": "“Something gross” triggered a thought… what if it was a bodily fluid other than spit…. Ew",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "In reality, of the rest of the group were drinking, her drugged behavior wouldn't look off to an outside observer.",
              "id": 114,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Also, it's less than 50¢ cost to the restaurant.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "The only time where a can of soda would be open in a bar or restaurant is if they serve it in a glass. Giving an opened can is so weird.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 665,
      "content": "NTA. Good job of standing up for youself! The creep absolutely messed with your drink. I would escalate it to the owner/manager. It's a serious safety issue.",
      "id": 117,
      "comments": [
        {
          "score": 119,
          "content": "This. I would absolutely report his behavior to management. It's shady business. NTA, but I wouldn't be DDing for those friends anytime soon. You felt something was off and they didn't support you in the moment.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "This is what I was thinking - definitely tell the manager *and* the owner of the pub. Him telling a sexist joke is one thing, but opening your can then trying to insist you drink it should get him fired.",
          "id": 119,
          "comments": [
            {
              "score": 6,
              "content": "Also, ignoring them after as if they had done something wrong should be s fireable offense.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Thank you. I’m surprised I had to scroll so far to find a comment like this. OP should absolutely escalate to management. The waiter’s behavior was creepy, rude, and unprofessional, and it should 100% be addressed with management. Even just on a service level - if the customer asks for an unopened soda can, you do not argue with them about it. You go get them an unopened soda can, but this combined with all the other info in this post just makes the waiter seem so creepy. I hope OP reports this.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I would report it to the manager just for the “joke” at the beginning. Keeping people locked up? Wtf? What kind of person would think to say something like that? That sort of thing actually happens to women and it’s terrifying.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 465,
      "content": "NTA. Everything you did was fair and reasonable and his behaviour was obnoxious. Your friends are a-holes for blaming you!",
      "id": 123,
      "comments": [
        {
          "score": 181,
          "content": "Those aren't friends, friends don't shame you for taking precaution during a potentially dangerous situation",
          "id": 124,
          "comments": [
            {
              "score": 3,
              "content": "With friends like that, who needs enemies?",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "100% and the OP should get new friends. Even if the waiter didn’t put a date-r-drug in the drink he very well could’ve put something else like bodily fluids or something else to make you sick, what can your “friends” do about that? And even if he didn’t do anything else  to the drink and you have great friends that would look out for you if you were incapacitated, you still do not want to put yourself in that kind of position.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Agreed. They had to deal with a bad employee and blamed OP for his poor service.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Agreed.  Every one of my friends would have been demanding I get a new drink, likely before I even got a chance to, because they care about my safety, and I’d do the same for them.  In fact, they’d likely have insisted on going elsewhere the minute he started making those gross comments.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 439,
      "content": "NTA. Even if the soda was completely fine (huge IF that I agree you shouldn't risk just to be polite), waiter sounds unprofessional as hell. You didn't make a fuss. He did. He started the interaction off on the wrong foot with a bad joke, got pissy and argumentative over a reasonable request because he was still hung up on the joke not landing, and then took it out on your whole party for the rest of the night. \n\nAlso, opening cans IN FRONT OF THE CUSTOMER is a common gesture. Handing them over already opened is not.",
      "id": 129,
      "comments": [
        {
          "score": 202,
          "content": "A bad and MISOGYNISTIC joke. Honestly, she's NTA for anything she did following that interaction. Screw that guy, his comments were enough to make him a huge AH, whether he'd tampered with the drink or not. I would have complained immediately. We need venue staff to take women's safety seriously, not make creepy, sexist and condescending jokes.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "I don't think it was a joke I think he was probing for a victim.",
          "id": 131,
          "comments": [
            {
              "score": 57,
              "content": "Absolutely.  And when OP and her friends didn’t push back on his “jokes”, other than making a face, he likely thought he had a perfect victim who wouldn’t give him too much trouble.  So glad you proved him wrong, OP.\n\nAlso, I can’t recommend @caffinatedkitti on TikTok enough.  She has AMAZING tips for how to creep out the creepy men so much they literally run away, and she has advice for all levels of comfort with confrontation.  She also has some fantastic self defence tips too",
              "id": 132,
              "comments": [
                {
                  "score": 2,
                  "content": "Wow, I just watched a couple. Instantly love her. Great advice for US teachers as well. 😔",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Agree.  Also if there wasn’t anything wrong with it why didn’t he just take it back? It would have been a free drink for him! \n\nAn option if someone is worried about ‘making a scene’.  Take the drink, wait until the waiter is gone and then go up the bar and lie and say that this tastes off, would you be able to get another one?",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 316,
      "content": "NTA his \"joke\" was creepy.  That kind of joke is 100% for getting the dating status of a group of women.  And he even admitted he liked that yall were mostly single.  Also, the joke involves *wanting to lock up someone so they cant escape*, and making light of Possessive Jealousy.   I'm sorry, in what world is that remotely funny???  Red flag #1 🚩\n\nThe \"only one open\" soda is a No No right off the bat.  We don't trust those for good reason.  Bartenders ought to know to only open them for people in front of the customer.  He could have put them in glasses, but he left it in the can.  Red flag #2, though this ones more of a half-one.  Its a ping, but its not a blaring horn\n\nThe blaring horn is when he *ARGUED*\nA good server at a restaurant would see the problem, know exactly what the problem is, and *go get you a fresh one*.  His arguing makes him look HELLA SUS.  It could have been nothing- he could have been telling the truth that it was a habit, but he also could have spiked your drink, spat in it, put something unhygienic or such in it.  That right there is three red flags on its own 🚩🚩🚩\n\nI would lodge a complaint with the bar.  They deserve to know if he is being a nuisance or a downright danger to customers.  They may have cameras that could prove or disprove tampering, but he will at the very least get a reprimand for his poor attitude.  For all we know, this could be a pattern of behaviour for him, and it could be the last straw.  It could also help him, as it could get him to have a discussion with the boss about what to do if it happens again.\n\nBut based on the info provided, his vibe is sexist and potentially predatory, and we should not let that shit slide\n\nAlso, as for your friends.  Ask them if the mood would have been spoiled if you had to be dragged out of the bar in an ambulance because you drank something spiked with a date r*pe drug.",
      "id": 135,
      "comments": [
        {
          "score": 308,
          "content": ">I would lodge a complaint with the bar.\n\nI've been over the fence all night long about reporting what happened to the manager. For all I know, nothing happened to my drink, plus my friends said I overreacted.\n\n\rThat's why I came here, to have an indipedent and external perspective on it.\n\n\rAfter reading your post, I think I'll write a mail to the pub. I won't throw allegations around - because I've no proof - but I'll say that the waiter was strangely pushy and made me uncomfortable.",
          "id": 136,
          "comments": [
            {
              "score": 182,
              "content": "I just want to tell you that if my daughter told me that this happened to her, I’d be so proud of her refusing to drink it. I have always told her to “control your drink” meaning place a hand over it, ask for a bottle or can to not be opened except by the person drinking it, take the drink with you everywhere, etc. \n\nAlso, I think there’s something you can order (I think they’re strips?) that you can put in your drink to see if anything has been put in it. I need to order some for my daughter. \n\nYou did great at this pub. Please bring this to management’s attention. \n\nNTA",
              "id": 137,
              "comments": [
                {
                  "score": 9,
                  "content": "There is also a nail polish being developed by some college students that will change color if the drink has been spiked.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Isn’t it disgusting that society is so deranged that people feel the need to invent something like this to keep each other safe?",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "That’s great to hear! Thank you",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I'd be more concerned that he spit in it than spiked it. And test strips won't detect that.\n\nI've been a server and I've never known even one person to spit in a drink or food. But there must be assholes out there who would.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Spit, laxatives, drugs, even sticking a dirty finger in it….OP trusted her gut, and that’s great.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "This!",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "Your friends are wrong. That dude needs to be reported. He works in a bar and gets offended over a customer fearing an opened drink that could potentially be spiked. He's a red flag that needs to be cut loose from that establishment.",
              "id": 144,
              "comments": [
                {
                  "score": 37,
                  "content": "Not just that, but his comments to OP when she came in were vile.  No woman will feel comfortable in a bar if that’s how they’re greeted",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Just say, \"Hi, I attended your pub at x. While there, with my friends, a server made a joke that made me uncomfortable to the point where I had a visible reaction that the server didn't like and confronted me about it. I felt on the spot but tried to brush it aside and ordered a pop. When he brought it over, I noticed only mine was opened with my friend's being unopened. This made me more uncomfortable due to our previous interaction, so I asked for a new one. This further seemed to aggrevate the server, who argued with me until I finally got an unopened one. After of which he proceeded to ignore my table and caused friction between my friends and myself. I'm very confused as to why your server appeared so hostile, but it made me feel very unwelcome\"",
              "id": 146,
              "comments": [
                {
                  "score": 4,
                  "content": "this is great. i would include the quotes as in the post.. he made a few jokes and his choice of words specifically should be pointed out. get that paper trail also\n\nalso i think even if there was no previous interaction and a waiter brings an open can to you then refuses to bring a new unopened one and argues with you, that alone is reason enough to be alarmed. it's not that big of an ask. definitely suspicious even if he had been perfectly polite\n\nOP i hope you do complain and i really hope he gets written up at the very least although i don't think he should keep his job or be allowed to work as a bar waiter at all. guys a massive walking red flag",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Reading your post I really got a flight or fight type response like that man is dangerous. If he didn’t do anything to the drink he wouldn’t have argued… \nReally good on you for refusing it and definitely report it! \n\nOnly thing is that you need better friends…",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Please report him.  His comments to you when you came in are enough reason to report him, even without the drink incident, but with that, he NEEDS to be reported before he does it to someone else who isn’t as observant as you were.",
              "id": 149,
              "comments": [
                {
                  "score": 2,
                  "content": "This! I am not living in the US, but here I would report him to the management and also inform the police. For all we know they have open rape cases from girls who went to that bar.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "You didn't overreact. You reacted. \n\nIt is not up to anyone else to be the judge over whether or not you \"overreacted\". If they would have taken the risk, they were free to do so. But it's so easy to ask other people to take a risk when they consequences will never hit themselves.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Please be very specific and factual.\n\n\"When the waiter brought the drinks I noticed my can was opened and I asked for an unopened can. The waiter then told me he was offended by my accusations etc...\".",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "even if nothing happened to your drink, it’s unprofessional and weird as hell, did he think he was gain customers with this or what. and your friends for that matter aren’t friends, seriously they said even if it was spiked you were with them so it wouldn’t matter ??? being spiked has a bad effect on the body why even test those waters",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Give a blow by blow without emotions. Don’t just say ‘pushy’",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "don't just write - call them. make sure they know an employee of there's is drugging guests",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "The arguing is the part that i would've said \"get me your manager\" and i don't do that usually unless I'm really pleased with someone. Hell i called Walmart threw times because no one was answering to ask for a manager so i could tell them that this worker bought me water when i almost fainted in front of her while being 20-21 weeks pregnant and how that was more than i expected. But if a server was arguing with me about an opened can of soda then it's an immediate manager talk. I was a server. We never argued. We just did what we could for the customer. Any bartender would take that can back in a second and swap it out because that's a safety concern. I'd definitely complain even after that to a manager now.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}