{
  "post content": "I (f19) am in my first year of college, living with a roommate, Katie (f19). Katie speaks three languages (English, German and Spanish) and she makes it her whole personality. \n\nWhenever I ask what she’s watching, she’s watching something in another language. So obviously I can’t watch it. She’s always listening to music on her headphones and when I tried to bond and listen to what’s she’s listening, it’s in another language again and I couldn’t stand it. \n\nHer friends all speak one of the languages she does and whenever I hear them, I can’t join the conversation because they mixing everything so I’m left out of their convo.\n\nThe other day, I saw she had a new book on her desk, Portuguese coursebook. I asked her about this and she said she’s taking private Portuguese classes starting February.\n\nI told her she has to let it go, that she needs to develop her personality because speaking a language isn’t a personality trait and she’s just boring.\n\nShe got really annoyed with me and told me I’m an asshole and to stop eavesdropping on her convos.\n\nI told her she’s boring and has to fake her personality.\n\nNow, she’s not speaking to me.\n\nMy friends are split, some agree with me and some agree with her.\n\nWho’s the asshole here? AITA for telling the truth?",
  "id": 1,
  "comments": [
    {
      "score": 61636,
      "content": "YTA.  Jealousy is not a personality either.",
      "id": 2,
      "comments": [
        {
          "score": 13549,
          "content": "Neither is xenophobia",
          "id": 3,
          "comments": [
            {
              "score": 6308,
              "content": "I don’t think this is xenophobia, that’s going a little far. It’s ignorant and selfish but I think this is more about being jealous about her roommates skills than hate",
              "id": 4,
              "comments": [
                {
                  "score": 5479,
                  "content": "What this sounds like to me is the room mate does not fit op’s personality preferences in room mates. \nOp you need to find your own circle of friends at school, not your room mates. YTA",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3695,
                      "content": "This. She’s your roommate not your friend. She has friends. Time to find your own.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 785,
                      "content": "OP also sounds immature. Telling people language isn't a personality trait and that they are boring is simply obnoxious and she's old enough to know better.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 361,
                      "content": "Sounds to me like OP watched too many movies where you get an instant for-life bond with your roommate, though of course OP would be the natural leader of that \"friendship\". Now she's pissed her roommate has her own friends and her own interests, and doesn't care about OP at all.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 352,
                      "content": "[removed]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 179,
                      "content": "Sounds like to me OP might have  a bit of a control  issue as well. One can set boundaries, but you don’t get to tell others what they can and cannot do.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 140,
                      "content": "Not having friend options out side of your roommate is not a personality.  YTA, big time.  And a mean girl.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Yep, with age comes the realization that your roommates aren't always going to be friends.  In some cases, living with someone who can follow agreed upon rules and live in the space considerately is far more important than being buds.  It does sound like OP is relying too heaving her roommate being her social life.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I'm really trying to understand why she's getting upset at her roommate for wanting to be a polyglot. How does that make sense her mind?",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Yeah, my first year roommates I never saw again after that year. Second year we kept in touch during college but I lost track of her after a few years. After that I was able to pick friends for roommates.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1354,
                  "content": ">I tried to bond and listen to what’s she’s listening, it’s in another language again and I couldn’t stand it.\n\nThis part sounds a bit xenophobic to me.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 865,
                      "content": "She sounds like those idiots that yell \"this is America, speak in English\"",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I agree. I can't understand the hindi language. But I love me some Indian music!! 💃🏾💃🏾💃🏾",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1248,
                  "content": "Maybe not hate, but I think there's some underlying xenophobia in the fact that she thinks that her roommate watching shows in another language and talking to friends in another language is somehow \"fake,\" as in \"unnatural,\" when in fact this girl is just existing. As if doing things not in English were somehow outside the norm.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 562,
                      "content": "If you squint you can see the \"what are they saying about me when they talk in languages I don's speak\" between the lines of OP's post too.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 392,
                      "content": "Also subtitles exist!!!\nLiterally if the show it's in another language she could ask to add English subtitles?? Also you can listen to music in other languages, you can search for translations \nMonolinguals...",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I watch stuff in lamguages I don't understand all the time. There's this thing called subtitles.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 388,
                  "content": "I think she is hurt that she is excluded. It sounds like she wants a friend, not a roommate.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 530,
                      "content": "What a terrible way to make a friend. Why can’t OP say something like “oh, I just watched x show, have you seen it?” “I’m going to go grab some food, do you want to come?” “I’ve been listening to x artist, are you a fan?” Instead of trying to force their friendship based on whatever the roommate is into? Roommates are not obligated to be your friends. Is it nice? Absolutely. Is it a requirement? No. Now that OP has called out her roommate over nothing, and made herself out to be one of the worst kinds of people, they probably won’t ever be friends. OP, YTA.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 85,
                      "content": "Yeh college can be a stressful time, and one can understand. Better ways to handle this though, and that's not by stopping someone from learning and enriching their life.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yep. Seems like OP is the boring one and she’s projecting.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Agreed. I think her pettiness is bravado: doesn’t excuse it, but this post just *bleeds* with insecurity, hurt feelings, rejection and…yeah, actually maybe a hint of some low grade xenophobia or paranoia about being slammed in different languages. \n\nFor future reference, for those who haven’t experienced it yet: living with other people is one of the absolute *worst* ways to try to make friends and even strong friendships or relationships can take an absolute beating there.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Telling someone they're boring and mocking their interests is a hell of a way to try to make them your friend.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "It could be both, I think the two ideas are probably existing together here.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Hard to say without further details but op’s post gives off a whiff of anti-intellectualism. \n\nOp, YTA. Get your own friends. Your roommate isn’t there to cater to your needs.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Sounds like xenophobia to me.  That’s going a little far to deny it.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": ">when I tried to bond and listen to what’s she’s listening, it’s in another language again and I couldn’t stand it.\n\nThat happened.",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I feel that this is a generous interpretation given we don't know the roommate's background. And even if it is just a hobby, and even if the OP is just jealous, it still presents as xenophobic. \"I don't like that you do shit in non-English even when it has nothing to do with me\" is never not gonna read at least a bit xenophobic lol",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "i completely agree, but i will say it leaves a sour taste in my mouth that she seems to have a subconscious view that if people in america aren’t speaking english to accommodate her and allow her to partake, they’re just looking for attention and trying to be different. certainly a standpoint that i’m sure many of us are not fans of",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "If Katie and/ or her friends are of different nationalities than OP, then it definitely sounds like xenophobia.\n\nIf they aren't, then it sounded to me like OP can't express the fact that she wants to bond with her roommate more healthily (and roommate doesn't seem to necessarily care about making friends with OP, because she already has a group of friends with whom she has things in common). OP really sounds like she has a problem with being open about her feelings, and can only be childish and hateful.\n\nYTA , OP",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1706,
          "content": "I really wonder if OP thinks that her conversations with friends in a different language were just.. conversations about the language they are speaking. She says that's her whole personality, but then goes on to explain that she doesn't understand any of the things being said. Can you imagine someone watching a TV show in Spanish and thinking the whole time \"yeah, I understand this. That's awesome how much I understand that language. I'm going to keep watching this because I understand the words, not because I enjoy the show.\" It's such a weird take. \n\n&#x200B;\n\nBesides that.. even if it were true that she's only watching these shows or listening to these songs to learn the language because that's her idea of fun.. it would just mean that she enjoys learning new languages. No different than say.. learning to play music, or studying history. Let people enjoy the things they enjoy. No need to judge because it's hard to relate.",
          "id": 35,
          "comments": [
            {
              "score": 856,
              "content": ">I really wonder if OP thinks that her conversations with friends in a different language were just.. conversations about the language they are speaking. She says that's her whole personality, but then goes on to explain that she doesn't understand any of the things being said. Can you imagine someone watching a TV show in Spanish and thinking the whole time \"yeah, I understand this. That's awesome how much I understand that language. I'm going to keep watching this because I understand the words, not because I enjoy the show.\" It's such a weird take.\n\nOP is entirely self-centered, so she assumes everything exists entirely for her own perception. She can't speak Spanish, so she cannot imagine a Spanish movie having any merit to Spanish-speakers; it exists solely to confuse her.",
              "id": 36,
              "comments": [
                {
                  "score": 325,
                  "content": "I'm just imagining them having a whole conversation...   \n\n\nRoommate:  Yo hablo español\n\nHer friend: Ah, muy buena!\n\nRoommate:  Hablas español?\n\nFriend: Si! Tambien hablo español.  \nRoommate: Guau! \n\nFriend: Esta es una gran conversación.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 89,
                      "content": "They can discuss about the verbs. It's never ending fun!",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "*snort*",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "😂😂😂",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I laughed out loud in public at this.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 462,
              "content": "Exactly! Based on the title, I assumed OP's roommate would constantly brag about the languages she speaks and that's why OP got super annoyed and said that.\n\nBut no, OP's roommate is just living her life. Speaking to friends, watching shows, listening to music. \n\nOP's just annoyed because OP can't understand or join in. This post reeks of jealousy. Certain parts also felt xenophobic to me. \n\nLike....as a bilingual, I watch shows in different languages, and I also speak to different people in different languages. I listen to English, Spanish, Korean, Turkish and Arabic music. I'm planning on studying and learning a new language in university. Literally how is that 'making languages my entire personality' and how is it 'boring'? It's the exact opposite, really.\n\nYTA OP.",
              "id": 42,
              "comments": [
                {
                  "score": 78,
                  "content": "also like. minor point but i'm not bilingual but i still watch tv shows and listen to music in other languages....i just use subtitles. if op wanted to bond with her roommate she could have done that. op, YTA",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I am baffled how OP made every innocuous thing roommate is doing somehow about themselves. Jeez op. Yah, YTA",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": ">But no, OP's roommate is just living her life. Speaking to friends, watching shows, listening to music.\n\nHow dare she?/s\n\nOP doesn't like it when things aren't about her.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 236,
              "content": "In a Uni History class, I asked a classmate to borrow their notes.  Sure, I was told.\n\nThey ended up not doing me much good--they were not in English(the language the course was being taught in).  \n\nI did not know the language.  I asked her about it.  She took notes in that language to help her practice it.  The process of converting lecture to that language and the practice of transcribing it.",
              "id": 46,
              "comments": [
                {
                  "score": 139,
                  "content": "This seems like a useful learning tool, although possibly she could have told you when you asked to borrow them that they were in another language she had no reason to think you spoke.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 82,
                      "content": "That was my thought--tho I admit I was more amused than anything AND impressed by her ability.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Wow, I'm really impressed by her ability there. I had a hard enough time trying to take notes in English and keep up with the lecturer. I can't even *imagine* translating them on the fly like that",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 170,
              "content": "The first time I finished a novel not in English, I was very proud of the fact I had done it whilst also feeling it was a mediocre book. There is an intellectual satisfaction. \n\nBut once fluent that wears off. Its then just enjoying the different perspective other cultures bring.",
              "id": 50,
              "comments": [
                {
                  "score": 7,
                  "content": "I read the Phantom of the Opera by Gaston Leroux in French one summer back in the late 90s. It's the book the Broadway show is based on and was published in 1910. So it wasn't just French, it was figuring out an old version of French. I also only had a French English dictionary to figure it out.\n\nI'm still really proud of doing it and can still picture myself lying out in the sun slowly reading it. It really helped my understanding of French.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "I’m semi-fluent in Spanish, learned as an adult, but also have really bad ADD. And once in a while when my coworkers are talking and telling stories I find myself thinking, “I understood that completely! Wow! I remember when I couldn’t do that. I have (almost) two whole languages inside my one head. How does a person even do that? How does it work? Where do they both even fit in there?…”\nAnd the next thing I know I realize I’ve missed a whole minute or so of whatever they were saying because I was so goddamn distracted by my own bilingualism.\n\nMaybe that’s what OP thinks her roommate is doing? It’s definitely not what I’m supposed to be doing when I’m listening to people.\n\nOh also, YTA OP",
              "id": 52,
              "comments": [
                {
                  "score": 4,
                  "content": "I have adhd, English is my second language, sometimes I blurt out the wrong language 😂",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "If you don’t use it you lose it as far as languages are concerned. The roommate is doing the right things by attempting to immerse herself in different ways of the languages.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 659,
          "content": "This. OP, you just sound miserable and jealous. Your roommate seems to have her own interests and own friends, unlike you. Leave her alone.",
          "id": 55,
          "comments": [
            {
              "score": 24,
              "content": "Now that's completely unfair....OP's \"Friends\" are split on whether or not ~~their~~ they're the AITA<wink>",
              "id": 56,
              "comments": [
                {
                  "score": 5,
                  "content": "Probably his mother telling him hes TA and him telling himself hes not. Thats his friends that are split",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Exactly. Just because she's her room mate doesn't mean she has to be *friends* with OP and is obligated to include her in her social life anyway.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 370,
          "content": "Exactly. This post reeks of jealousy because it is clear that OP wants to be friends with her roommate, but OP does not yet have the social skills to learn how to build friendships. What if OP asked her roommate about how she came to learn the languages she’s learned? What if OP asks her about her goals for learning Portuguese? I bet this would start some good conversation in the language that OP understands and could possibly lead to something like a friendship. \n\nAlso, it is worth mentioning that not all roommates in uni become friends (especially freshman) because of different interests and different personalities. Learning a language is not a personality, but striving to put the time in to be able to communicate with people in different languages is admirable to say the least. \n\nYTA OP, but you’re young so take this as a learning lesson! Maybe making friends in college is hard, but spend more time out of the dorm exploring your own interests to find your community. Best of luck!",
          "id": 59,
          "comments": [
            {
              "score": 47,
              "content": "yeah... YTA... I think she just feels left out and is using young people communication which doesnt solve anything. Maybe just ask, \"hey when we watch TV together can we watch English?\" Or when you get home and she is already watching something then she adds English subtitles. As for her having convos with her friends and studying her languages... uhhh learning languages is time consuming and she is allowed to have conversations with her friends that you aren't a part of.. even in English.. I think try to branch out outside of your randomly assigned roommate, and dont take her interests in other languages as something personal or something to dislike. Bc honestly its pretty cool! Now go find your own cool and yall can be cool together",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I mean, even the music is fine, OPs never listened to a song in another language before?  That's one of the easiest ways to experience another language, you don't even need to understand it to enjoy it.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "> So obviously **I** can’t watch it.\n\n> when **I** tried to bond and listen to what’s she’s listening, it’s in another language again and **I** couldn’t stand it.\n\n> **I** saw she had a new book on her desk, Portuguese coursebook.\n\n> **I** told her she has to let it go\n\n> **I** told her she’s boring and has to fake her personality.\n\nYTA.",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 342,
          "content": "Not only jealous but also insecure and self-centered.\n\nSeriously knowing 3 languages is awesome and learning 4th can open a lot of doors for her.\n\nOP YTA. Not everything needs to be about you.",
          "id": 63,
          "comments": [
            {
              "score": 59,
              "content": "Also entitled. There’s no reason OP should be weighing in on her roommate’s interests, or to criticize her choice of entertainment. She doesn’t need to be a part of the roommate’s conversations with friends. OP wants to be friends, but her roommate is under no obligation to change herself to meet OP’s specifications. How very presumptuous.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "What stands out to me (that I haven't seen mentioned yet) is the way OP frames the conversation- Roommate is preparing to learn a new language, and OP goes \"you need to stop\" before they attack Roomie's personality.  It's a defensive reaction.  OP, it sounds like you 'needed her to stop' because you thought that if she learns one more language, she's going to have even more of something that you don't, and you perceived it as a threat.  Then you needed to justify that reaction, so you attacked her personality/personal identity too.\n\nAlso, that summarizing \"AITA for telling the truth.\"  Bruh.  You HAVE to know you're being defensive, jealous, and ultimately not saying much of anything, just taking a stab at your roommate.  You can't possibly actually think you're spitting some enlightened facts, right?",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 253,
          "content": "Making being polylingual a whole personality would be making a big deal and pushing it in other's faces. Katie isn't doing this, she's learning, reading and watching other languages because she wants to expand her understanding of the world. OP is the one making something a whole personality by acting like the victim.\n\nIf OP wants to be friends with Katie she needs to actually say she wants to hang out and do something both can understand instead of what OP is already doing. It's obvious she's not compatible with Katie's language interests.",
          "id": 66,
          "comments": [
            {
              "score": 113,
              "content": "Since OP mentioned that Katie's friends speak one of the languages she knows, it sounds like Katie enjoys making friends from a variety of backgrounds and cultures",
              "id": 67,
              "comments": [
                {
                  "score": 14,
                  "content": "Right! Seems that way. Everything OP recounted speaks of someone doing what you must do to learn a language: dedicated self study through immersion (via books, music, tv shows, and movies) and holding conversation often in the language with others. I really hope OP can learn how socialize and make friends. It seems terrible to live through the more than likely false narrative that someone doesn’t like you or is intentionally being mean to you just by the fact that they are living their life and being a student.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": ">watching other languages because she wants to expand her understanding of the world\n\nThis! If you speak the language, it makes sense to watch movies in their original form. A lot of the nuance is lost in translation. This could be wordplay that doesn't translate, but it's also about contextual clues that get lost - for example, you can't really translate Japanese movies to English without losing a lot of context, because the way language conveys social standing works very differently in these two cultures.",
              "id": 69,
              "comments": [
                {
                  "score": 8,
                  "content": "I haven't seen it, but I've heard that the English subtitles on Squidgame aren't as good as a more nuanced translation or understanding of the original Korean dialogue.\n\nI used to read a manga series years ago, and the volumes would at the end, or the start if you try to read it by western convention, have cultural translation for references, traditions and other things (such as the significance of certain buildings). The volumes would also have at the start the honorifics and what they meant, as the English versions didn't omit them from the text. Cultural background can change how you interpret a storyline, such as the relationship between Tidus and Jecht in Final Fantasy X.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 66,
          "content": "savage",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "I'm surprised OP even has friends with the way she's so desperately attempting to befriend the roommate.",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "Burrrrrrrrn. But no it’s very much true.",
          "id": 73,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Wait, does ~~Ivy~~ Katie also work in a café and date a guy named Mark?",
          "id": 74,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21082,
      "content": "YTA - she has a personality. She has friends, interests and hobbies. Just because you don’t like her music or can’t keep up with her friends doesn’t mean those things don’t count, it just makes you sound jealous and judgy.",
      "id": 75,
      "comments": [
        {
          "score": 3492,
          "content": "Also, only listening to music in a language you can understand is really limiting and ultimately just dumb. There are sites with lyric translations for nearly every song out there, if you really want to know, but the music itself is universal",
          "id": 76,
          "comments": [
            {
              "score": 761,
              "content": "I totally agree! My husband and I are fluent in two languages each, with English being the overlap.  As such, I end up listening to a lot of Cantonese (his first language) music and love some of it!  Then we also have an eclectic mix of other music including Japanese and Italian, which neither of us speak, though I am learning Italian.",
              "id": 77,
              "comments": [
                {
                  "score": 291,
                  "content": "I listen to a ton of Japanese music, while speaking barely any Japanese. Most songs I get around to checking the lyrics for, but I forget lol",
                  "id": 78,
                  "comments": [
                    {
                      "score": 80,
                      "content": "I’ve really gotten into Aimer lately. like you, I usually look up the translated lyrics to get a sense of the song and then usually remember the general idea of the song lol",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah I listen to French, Spanish and Scandinavian music but barely speak my own mother tongue lol it's just fun to hear the melody and pitches as something new.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Same. I listen to Again by Yui a million times, belting out the song, and I have no idea what the hell she is singing LOL but it's a bop.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Again by Yui (Fullmetal Alchemist Brotherhood Part 1 Intro) is a perfect example of a banger where you don't need to understand the words to enjoy the music.  Cruel Angel's Thesis for Neon Genesis Evangelion would be another, although the lyrics really bring it together for me.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "My friends and I LIVED, ATE AND BREATHED JPOP back in HS. Pretty sure it was the ONLY genre some of them listen to.  ONLY ONE of my friends was and is conversational skills in Japanese",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "old university roommate got me into classical mongolian music back in the 70s... still have records to this day that i love to listen to... never understood a word of what they're singing about but very calming",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "I have thoroughly enjoyed some music I couldn't understand the lyrics to.",
              "id": 85,
              "comments": [
                {
                  "score": 12,
                  "content": "Shit, when Despacito was big, it topped the U.S. Billboard Hot 100 for 16 weeks. I'm sure there were plenty of people mixed in there happily listening without really knowing any Spanish.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 15,
                      "content": "And let's not forget how big Gangam Style was despite the vast majority of people outside of Korea having no idea what it was about.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Me too.  Nirvana is one of may favorite bands.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "TIL jealousy mixed with total lack of culture can result in a whole personality. And OP really \" not very smart\" to put it in a nice way to ask a place where post people are obviously, at least, bilingual.",
              "id": 89,
              "comments": [
                {
                  "score": 6,
                  "content": "Yup, that was a self own",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Classical music performances are often given in the language in which the composition was written. People still go to hear the music. Most operas have \"supertitles,\" which show translations of what is being sung.",
              "id": 91,
              "comments": [
                {
                  "score": 5,
                  "content": "One thing I love about opera, though, is that their gestures, music, and the \"production\" tend to tell a story itself without needing to know the language. I guess the same goes for dance but less relevant than something with lyrics.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Republicans love to play Born in the USA at their events... people still think Kiss wants you to rock and roll all day and party every night when they just want you to rock and roll all day and part of every night so you can get a good night of sleep (this ones obviously a joke)\n\nknowing the language doesn't make you automatically understand the lyrics nor are lyrics the most important part of most music",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Ehhh I personally don’t like foreign music because I’m big on lyrics and not just what they  mean but the rhythm of them and when things are translated, that rhythm can get lost and not hit as well. I respect when others like it tho.",
              "id": 94,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Sounds like she is the kind of person that declines watching a movie if it has subtitles.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "As somebody listening to death metal a lot I totally agree.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Heck, there's a videogame with a song that the lyrics are kinda Latin, but not quite, the gaming community has tried to translate it but definitely falling short a bit, but we have enough to get the general idea of what the song is about. No one cares, it's still a good song.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I think I mostly listen to music in other languages these days, and never look up the lyrics. Sometimes the words just really ruin the music for me so I love listening to great tunes and not being distracted by shitty lyrics.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1463,
          "content": "[removed]",
          "id": 99,
          "comments": [
            {
              "score": 575,
              "content": "[removed]",
              "id": 100,
              "comments": [
                {
                  "score": 297,
                  "content": "[removed]",
                  "id": 101,
                  "comments": [
                    {
                      "score": 217,
                      "content": "[removed]",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 109,
                      "content": "Über pathetic",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 343,
          "content": "Totally!  She sounds lovely and seems eager to share... \n\nThe irony is the ability speak and the love of learning languages IS technically a personality.  They have a name... Polygots! \n\n[https://en.wikipedia.org/wiki/List\\_of\\_polyglots](https://en.wikipedia.org/wiki/List_of_polyglots)",
          "id": 104,
          "comments": [
            {
              "score": 94,
              "content": "I was going to say the roommate just sounds like a linguist and there is absolutely nothing wrong with that. \n\nFrom Google a personality \"is the combination of characteristics or qualities that form an individual's distinctive character\"\n\nBeing a linguist or polygot are characteristics and or qualities of OPs roommate. There are also likely things OPs roommate has but due to OPs roommate expressing it in another language its lost on OP.\n\nPerhaps also OPs roommate finds OP boring or not her cup of tea and chooses not to speak English so OP can get a hint that she is not apart of the group.\n\nYou don't have to be friends with your roommate OP you just have to be respectful and cordial. \n\nYTA - you could have just asked the roommate to include you a bit more or talk it out a bit instead of insulting her.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "At the risk of sounding pedantic or being *that person*, for future reference it's \"polyglot\" with an \"L\" between the g and o :-)",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 307,
          "content": "OP's roommate's friends who speak different languages: \\*exists\\*\n\nOP: \"I'm offended!\"",
          "id": 107,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 148,
          "content": "This user reminds me of people telling me that I can't listen to BTS bc they sing in Korean and I can't understand it",
          "id": 108,
          "comments": [
            {
              "score": 108,
              "content": "I'm European. I used to listen to the radio all the time when I was little. They played songs in English, Spanish, Swedish, Russian, Ukrainian, German, God knows what else. \n\nNone of those languages was my native language. I didn't give a shit and always sang my heart out despite not understanding anything. \n\nFinding out later in life that some people look down on music in another language because ThEy Can'T uNdeRstanD it was a big fat slap in the face. Now I'm an aduly and still can't comprehend how limited and ignorant it is.",
              "id": 109,
              "comments": [
                {
                  "score": 17,
                  "content": "🎶 Mayra hi, Mayra hu, Mayra ha, Mayra haha... Hallo, Salut, something something, numa numa yei, numa numa numa yei, something something, dragostea din tei...🎶\n\nIn Europe entire clubs work on songs nobody understands, but everyone sings along to.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I can't always understand music in English either and it's my Native language.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "The Korean government and entertainment industry have worked hard to export to other countries. I am sure they are happy you are part of the army!",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Also super controlling. Why is OP critiquing her roommates hobbies, friends and musical tastes and thinking she has a right to demand she changes. They're roommates not life partners this girl doesn't have to include OP in her conversations or movie nights.",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Ya OP sounds super entitled tbh. Is the roommate refusing to turn on subtitles for the shows? Did OP even try to listen to the music to see if it was a beat she enjoyed? She is more focused on being jealous than trying to branch out. And I say this as an English speaker who watches shows and listens to music in other languages.",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "She's also intelligent, determined, and educated if she can learn three, going on four, languages.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I think the “can’t keep up with her friends” is the key here. I have a theory: OP feels left out when they’re all hanging out and Katie and her friends switch languages. And if it’s happening at times when they’re supposed to be hanging out together, that’s actually pretty understandable (especially if it’s happening a lot). And, like a lot of people (especially teenagers) OP probably hasn’t learned to voice these feelings in a mature way. So OP held them in and they turned to resentment and jealousy and then lashed out about it like an AH.\n\nOP, if I’m onto something, here’s how you can express this: “Hey Katie, can I talk to you about something? I think it’s really cool that you and your friends speak lots of languages. But sometimes when we’re all hanging out together and you start speaking in other languages that I don’t understand to each other, I feel uncomfortable and excluded because I can’t participate in the conversation. I want to keep getting to know you and your friends, but it’s hard when I can’t really be a part of things when we’re together. I totally understand that you guys would want to practice with different languages, but would you mind trying to keep things in English as much as possible when we’re all hanging out so I can be part of things? I would really appreciate that.”\n\nYTA for lashing out like that, so you’ll have to back track and start with an apology before expressing those feelings. And if it’s not even about this and you’re getting upset about conversations you wouldn’t even be a part of anyways cause you aren’t hanging out and you’re just overhearing, then you need to get over yourself.",
          "id": 116,
          "comments": [
            {
              "score": 6,
              "content": "It doesn't sound like they are hanging out at all. If OP and Katie were actually mates I could see it but it sounds like there simply roommates because of university. There's a massive difference between cohabiting a space with people who speak another language with their friends and being part of a friendship group where you feel excluded because your friends switch to another language. \nNothing about this post screams friendship. OP hasn't said a positive nice thing about Katie, only about how irritated they are whenever they hear her speaking another language watching media in another language, which leads me to believe they haven't even attempted to be friends with her.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10478,
      "content": "YTA - 100%. Your roommate has an interest and is engaging with it and with people who share that interest. There's nothing stopping you from also enjoying movies in another language--you could have asked her to turn on the subtitles. Between the two of you, you sound like the boring one, tbh. You're lurking around your roommate, judging her for having interests that don't involve you, and then were needlessly nasty to her because you can't speak the same languages she does. \n\nOne of you definitely needs to work on her personality, but, spoiler: it's not your roommate.",
      "id": 118,
      "comments": [
        {
          "score": 1714,
          "content": ">you could have asked her to turn on the subtitles\n\nI don't speak French, and very little Spanish, but I watch a lot of French and Spanish shows because they're amazing! Totally worth reading through.",
          "id": 119,
          "comments": [
            {
              "score": 304,
              "content": "[deleted]",
              "id": 120,
              "comments": [
                {
                  "score": 111,
                  "content": "Netflix has so many shows from France and Spain! It makes me so happy!",
                  "id": 121,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I watch so many shows in foreign languages, I'm probably too old to pick any of it up but they are so good! Why should I miss out on some of the most amazing supernatural or horror TV just because it's not in English, and don't even come at me with dubbed *shudder*. I watch everything subtitled anyway so I'm used to 'reading tv'.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Lupin and Money Heist are two of my favorites! And Dark, which is German.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "German not French, but *Dark* is one of the best shows Netflix has ever hosted.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 6,
                      "content": "[deleted]",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 56,
              "content": "I speak spanish and can mostly pickup some of what is being said in french, that plus the characters in movies help you understand what's going on in the film, I'm learning french now an love french movies and shows / music\n\n&#x200B;\n\nif you want a really good french thriller watch 13 tzameti, 125 rue montmarte or haute tension.",
              "id": 126,
              "comments": [
                {
                  "score": 6,
                  "content": "Oh, man, 13 Tzameti is so good but so rough. I confess that I'm *not* a huge fan of Haute Tension, but mostly because I feel like the movie cheats too much. I was on board until the end, when it lost me, though; definitely a stylish film, and I think most people won't be as hard on it as I am.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I don’t speak any Spanish but would watch telenovelas all the time in college. My schedule matched up with another girl on my dorm floor, and we would watch them together even though we had no idea what they were saying. It was funny trying to guess the plot.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I’m always surprised when people from English speaking countries refuse to watch stuff with subtitles - like OP. I mean do they think people who aren’t native English speakers never watch English movies or tv-shows?",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "I agree and think OP is jealous of roommate, and I'm also getting the sense that OP is kind of obsessed with roommate in the Ingrid Goes West kind of way. Like roommate being closer to other people and connecting with other people in other languages locks OP out and OP can't stand it because OP wanted to get closer to roommate (\"trying to bond\" comment). There's a note of obsession in this post that the roommate herself may have sensed (\"stop eavesdropping\" comment) so OP reacts to that rejection by being an AH.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Yep, it seems like the problem isn't with the roommate, but the fact that the roommate does stuff that OP doesn't/can't do. I know my first college roommate got crazy upset that our hobbies didn't mesh because she assumed we'd be \"besties 4 life\", but our personalities couldn't have been more different. I wonder if OP is the same and upset her roomie isn't a built in bestie. Or if she's just a boring child who needs to put others down to make herself feel better.",
          "id": 131,
          "comments": [
            {
              "score": 6,
              "content": "Yeah it's not that the roommate is bragging about being trilingual or she only talks about learning languages. She's minding her own damn business and OP is mad she can't lurk on the roommate and force her way into her hobbies. Things OP was mad about: roommate privately watching a film in a language OP doesn't know and OP \"can't\" also watch; roommate privately listening to music in a language OP doesn't know and OP \"can't\" listen in; roommate privately setting a Portuguese textbook down in her own room; roommate having friends who speak other languages and OP struggling to eavesdrop. OP is clearly obsessed with the roommate and she's getting frustrated that this smart girl knowing other languages is making it hard for her to butt in",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Has OP said anything to indicate that this is a roommate by choice because I get the assigned dorm-mates vibe from the post.  If that's the case and this was basically a stranger she was assigned to share a room with it's also honestly a bit creepy that she seems to take such an interest and gets personally offended.  Like showing up to a party uninvited and complaining about the food, just tacky and a bit creepy.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "\"Turn on the subtitles\" \n\nExactly this!  I watch a ton of shows and movies in languages I don't speak, dubs are usually piss-poor voice acting and I hate when lip movements don't match what I am hearing. Subtitles are great!",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Wonder what deep and interesting traits OP has about her character?",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Annnnnddddd.... having an expectation of only watching shows of interest to both people is not a reasonable expectation for roommates. Things like discussing main TV use/time can be. Making sure folks can watch stuff in their room on their laptops should be part of living with a roommie. It's a great coincidence when it does work out.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "A “hey roomie, I feel kind of left out when…” would have gone a long way in resolving this issue",
          "id": 137,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4732,
      "content": "YTA. Green isn't a good color on you.",
      "id": 138,
      "comments": [
        {
          "score": 1620,
          "content": "_\"I told her she has to let it go, that she needs to develop her personality because speaking a language isn’t a personality trait and she’s just boring.\"_\n\nI love how OP is the one snapping that the roommate has no personality and is boring, yet she is the one who is seemingly desperate for friends..... The roommate is minding her own business, paying OP dust, listening to her music/watching shows, and hanging out with her diverse group of friends while OP just sits around, stewing that her roommate and her friends don't invite her to hang out....",
          "id": 139,
          "comments": [
            {
              "score": 317,
              "content": "[deleted]",
              "id": 140,
              "comments": [
                {
                  "score": 104,
                  "content": "This!! Like she claims she doesn’t have hobbies or interests with her friends but if you don’t understand then how do you know?? OP wants to be a victim so bad lmao.",
                  "id": 141,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Yeah, and what exactly is OP's personality? It seems like she's making it all about her roommate, lmao. (eta: and hating everything that's in 'another language'. hating 'other languages' isn't a personality, OP)",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Plus how could she know if roommate is boring when she can’t understand anything roommate says!",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I love when people put \"am i the asshole *for telling the truth*?\"\n\n\nFirstly, definitely, YTA\n\nSecondly, you're not *telling the truth.* You're just being an asshole.",
          "id": 144,
          "comments": [
            {
              "score": 4,
              "content": "They’re basically just admitting that they’re assholes with no tact.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3875,
      "content": "YTA. It’s funny how many of these boil down to petty jealousy",
      "id": 146,
      "comments": [
        {
          "score": 238,
          "content": "Is this another chapter in the Ivy saga? Like, OP realized we all knew she hated this Polish woman and is changing up the languages?",
          "id": 147,
          "comments": [
            {
              "score": 40,
              "content": "Glad I’m not the only one who immediately went there",
              "id": 148,
              "comments": [
                {
                  "score": 51,
                  "content": "There are a lot of posts on this sub about people getting pissy because other people speak foreign languages.\n\nI feel like I need to get off Reddit and spend the rest of the evening on Duolingo.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "My brain jumped to “multiple languages bad” and now I remember Ivy!",
              "id": 150,
              "comments": [
                {
                  "score": 7,
                  "content": "If this is real and Ivy is a real person I feel so bad for her! I hope she stays safe from this crazy person.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "As much as I want a part 12 to the Ivy saga, the original author of that saga consistently lists their ages as 20. That and because the Ivy saga takes place in the UK, that poster says uni instead of college. \n\nThe similarities are striking though. Why are monolinguals so insecure around multilingual people?",
              "id": 152,
              "comments": [
                {
                  "score": 5,
                  "content": "I think an entire-ass subreddit started since the last one. They might be trying to hide as people see more and more patterns.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Yup. OP should probably go out and make some friends of her own or pick up a few hobbies instead of fixating on and insulting the person who is forced to share a room with her.",
          "id": 154,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2902,
      "content": "YTA. The fact is that speaking multiple languages and exploring the cultures they reflect is a lot more of a personality than mean girling your way through life by belittling people with an actual skill set.\n\nYou're the one who needs to let it go and become a more rounded person.",
      "id": 155,
      "comments": [
        {
          "score": 370,
          "content": "Also watching tv and listening to music is the best way to learn pronunciation",
          "id": 156,
          "comments": [
            {
              "score": 63,
              "content": "When I was supposed to be studying for my  certificate of proficiency, I binged movies with English subtitles on, instead. Needless to say that I passed the vocabulary section (definitely my least favorite thing to study) of the exam with flying colors 😅",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My friend and I watched a French cartoon before our oral exam for French class, and our teacher said she could tell we'd put a lot of work into practicing",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "Ironically, learning English has indeed become part of my personality, as the language has introduced me to new media (or helped me appreciate them in ways dubs and subtitles could not) and led me to develop new interests. It has even allowed me to form and express thoughts that do not translate into my native language.",
          "id": 159,
          "comments": [
            {
              "score": 10,
              "content": "Absolutely! I’m a native English speaker who studied French and other languages. I lived in France for awhile and I’m a French teacher now. Speaking French is part of my daily life. It’s become part of my personality. I’ve made friends and discovered music and other media because of it. \n\nWhat’s that quote—“he who only learns one language only lives one life? Learn multiple languages, live multiple lives” or something like that.",
              "id": 160,
              "comments": [
                {
                  "score": 6,
                  "content": "I'm curious, do you dream in French? My mom and I both dream in German when we study/immersed in it, but I've spoken to maybe people who will live years somewhere and only dream in their native language.",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Sadly, it sounds like OP is just mad that this woman and her friends aren't interested in engaging with her. Which, isn't too shocking.....",
          "id": 162,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2612,
      "content": ">AITA for telling the truth?\n\nWhat you did was give your uneducated ignorant jealous OPINION. Not the truth.\n\nYou sound jealous and it ain't cute. \n\nYta",
      "id": 163,
      "comments": [
        {
          "score": 280,
          "content": "I actually chuckled when I read that… can’t decide if delusional or arrogant. YTA",
          "id": 164,
          "comments": [
            {
              "score": 186,
              "content": "por qué no los dos?\n\nOh sorry, I wouldn’t want OP to think I don’t have a personality! I meant “Why not both?”",
              "id": 165,
              "comments": [
                {
                  "score": 86,
                  "content": "You really need to develop a personality. That language thing is super boring. I couldn’t read your comment, it was foreign and I couldn’t stand it.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I should know that there’s nothing more interesting than knowing English. RIP",
                      "id": 167,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "\"Foreigners!?\" - Waiting 😅😅",
                      "id": 168,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Thanks for explaining. I don't speak Italian.",
                  "id": 169,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "[deleted]",
          "id": 170,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1381,
      "content": "YTA shes not making it her personality, youre just sad and jealous. Have you heard of subtitles? And music can still be pretty damn good  in other languages, i dont speak french, but i sing my heart out phonetically to Indila when shes on.\n\nAlso, YOURE THE BORING ONE, being so caught up in other peoples stuff. Get your own personality that isnt toxic. If this is truly your personality, you should be the one faking it to a better one.\n\nYTA x100",
      "id": 171,
      "comments": [
        {
          "score": 51,
          "content": "I don't speak French but love  Francoise Hardy.",
          "id": 172,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Right! OP peeks in on what her roomies watching, listening to, reading...I get the wanting to bond, but what was OP offering?  Seems like she wanted to hang out with the classy, wordly, INTERESTING girl but was no where near her league.",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1261,
      "content": "You need to stop making only speaking English your personality and actually develop a real personality that makes people want to be around you. \n\nYTA",
      "id": 174,
      "comments": [
        {
          "score": 145,
          "content": "OP obviously doesn't know how much interpreters make, or how knowing other languages increases your hireability for all sorts of jobs. Tough to really learn another language complete with slang if you're not consuming media in the language.",
          "id": 175,
          "comments": [
            {
              "score": 12,
              "content": "A friend of mine was looking for interpreters for a specific language. The amount of money they were offering per hour was mind blowing. I was like “screw this! Where do I learn that language? Sign me up!”",
              "id": 176,
              "comments": [
                {
                  "score": 10,
                  "content": "Lol, the hourly rate is high. The number of hours you work? Very low.\n\nMaking $100/hour isn't particularly splendid if you only manage to work 4 hours that month. \n\nMost interpreters are independent contractors. The ones who are employees with regular schedules are not making those big bucks per hour.\n\nI loved being an interpreter, but the money was too unpredictable to continue with as a permanent career.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 839,
      "content": "YTA.\n\nThis entire post screams envy. You’re the only one who has an issue with her knowing other languages\n\n>I told her she has to let it go, that she needs to develope her personaility because speaking a language isn’t a personality trait and she's just boring\n\nSpeaking different languages isn’t a personality trait, it's a skill. What IS a personaltiy trait is jealousy, this is what you have OP",
      "id": 178,
      "comments": [
        {
          "score": 219,
          "content": "I'm so curious about what OP considers to be her own titillating personality traits. What does she do that apparently makes her so much more appealing than her roommate?",
          "id": 179,
          "comments": [
            {
              "score": 64,
              "content": "Facts. While reading this all I thought was 'OP is really jealous of this person'",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "ohh like you just like don't get it... like she has so much personality... like all of it... she listens to like the coolest music and wears like the coolest clothes... but like you just wouldn't get it... OP isn't just an entitled little brat like she has so much going on... \n\nit's not like the friends who agreed with her probably only did so because they didn't want to listen to her annoying japping anymore",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}