{
  "post content": "\n\nMy son (23) and his wife just had a baby boy, Everyone is overjoyed and excited but there have some issues that has risen recently.\n\n\nWhen my DIL was pregnant, I suggested that I host a welcoming party for my grandson right after she get discharged from the hospital. I've made arrangements and even emptied a room for them to stay but for some reason, she was against it and said she'd rather spend the first few weeks at home with her newborn. not only that but she said no to the welcoming party. My husband and I talked to my son and he said \"we'll see\".\n\n\nBut just a couple a days ago, We found out that my daughter in law had given birth 2 weeks ago and no one knew about it. My nephew told me and I immediately called my son, he confirmed it. he and his wife lied then hid the date of birth from the family. I told him this was not acceptable, lying just because they didn't want a welcoming party and love and support being given from family. I told him I was disappointed because for one...he ruined our welcoming for our grandbaby and also, I invited family members and they're all rightfully disappointed as well. He said it was his last resort after I kept pushing and made his wife uncomfortable but that was not appreciated because.. we were just trying to celebrate the new family member in a proper manner. We had an argument and he ended the call upon saying I ruined his joy for his newborn. My husband started texting him since he stopped replying to our phonecalls and now is threatening to block my nephew for tattling but I think that my nephew was decent enough to inform the family. otherwise God knows how long my son and his wife were going to hide their son just to keep us at arms length. We've always been kind and welcoming to my daughter in law and ger family, I don't why she would do this and disrespect the family like that.\n\non the other hand, some family members see it as a justified action because we insisted on the party.\n\nPs: Some folks, I'd appreciate it if you leave my nephew (m24) out of this conflict because he's not part of it.",
  "id": 1,
  "comments": [
    {
      "score": 52176,
      "content": "\"Welcoming party\" is a nice way of saying \"exposing a new born to all sorts of diseases during a pandemic.\"\n\nYTA. Always and forever. You are NOT entitled to put this child in danger.\n\nEdit: the people talking about the danger to (and exhaustion of) the mother are 1000000% right. I'm sorry for not including it.",
      "id": 2,
      "comments": [
        {
          "score": 15651,
          "content": "Honestly, where i’m from, you dont visit a baby until it is passed 2 weeks not to give it or the mother any diseases regardless of the plague. Even 2 weeks is when you’re reeeaaally close. Like a close cousin",
          "id": 3,
          "comments": [
            {
              "score": 5391,
              "content": "[deleted]",
              "id": 4,
              "comments": [
                {
                  "score": 2733,
                  "content": "Im sorry where are you people from. What is the welcoming party trend? Im truly asking, is this an US thing?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 6860,
                      "content": "I think it’s an invasive family thing. I’m from America and I have personally never heard of a “welcome home party” for a newborn baby.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 580,
                      "content": "No, “welcoming parties” for newborns are not a US thing; they are something the original poster made up. \n\nIt’s amusing that when people read a kooky and dangerous idea here their first thought is that the poster must be American.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 418,
                      "content": "[deleted]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "No it's just a mother in law thing.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "Yo my MIL literally threw a birthday party at a casino for my child the day she was born while we were still in the hospital 4 hours away and sent us a video after. I’m forever grateful she didn’t try to throw us a party that we were supposed to attend but MILs with baby rabies are *wild.*",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Not US thing. Never heard of a welcoming party, trust me, if it were a common thing, my friends' moms would have been ALL OVER that.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Most families either see the kid at the next family gathering (usually a birthday or holiday) or the parents have a huge birthday party for the babies first birthday. I remember inviting my dad and sister to come over when my son was a couple of weeks old and my sister said that it's probably best to wait until he's at least a month. My sister had 4 kids at the time so my wife and I agreed. \n\n\nA \"welcome\" party for a newborn coming right from the hospital is some next level insanity. No one with half a brain (even us Americans lol) would think that's a good idea. Especially in the tail end of a pandemic. Because not only is the baby vulnerable but the mother is weak as hell too.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Nooooo!!!!! \n\nI mean, \"no\" because that's horrible, but also this co-signed the very idea this is actually a thing. I was reading this post deciding nobody would actually throw a welcoming party for a newborn. Let alone against the wishes of the parents. Not even factoring in a global pandemic. \n\nThe only acceptable party for a new baby is driving a party bus of diapers, casseroles, and take-out gift cards to be dropped on the front porch. That's it.",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1314,
              "content": "Agreed! My culture the mom and baby stays home for 100 days with limited visitors (like 2 ppl) but only to help like bring food and light cleaning and then leave, no baby interaction. After the 100 days they have a dinner. The fact that she wants one immediately after she gives birth with a bunch of people and kept pushing is ridiculous.",
              "id": 14,
              "comments": [
                {
                  "score": 1161,
                  "content": "Right??? She wanted Mom freshly from the hospital to come to HER house and stay there all so they could expose the baby to COVID and everything else. Has everyone gotten the flu shot? Whooping cough shot? Up to date on vaccines? Jfc this reeks of JustNoMIL",
                  "id": 15,
                  "comments": [
                    {
                      "score": 899,
                      "content": "Besides the germs - the mom’s body just pushed out a human! Not only is she crying every time she goes to the bathroom, swollen, exhausted, the last thing she wants is to have to put on a show for people. YOUR DIL DOES NOT NEED TO BE A PART of Your CIRCUS FREaK show! Obviously this is about you OP needing center stage as Grandma and now you get to take center stage as the victim of your DIL who has a whole lot more to worry about than her MIL Not getting the spotlight she wants. PUsh this further and you will never meet your grandchild.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Yes I haven’t seen many point out that OP expected baby and mom to come stay with HER- usually, from every baby I’ve ever met, YOU go to the family not the other way around. It’s a pain to move around with a newborn, most new parents spend a lot of time at home in my experience because you’re so tired.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Yes mom needs to set up routines at her own house. Not with a I’m sure a future baby grabber.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Or never mind the DIL who just pushed a whole person out of her body-or had major surgery to remove baby-either way you don’t want to be in someone else’s home having everyone pass your newborn around.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 748,
                  "content": ">The fact that she \\[. . .\\] kept pushing is ridiculous\n\nShe herself used the word \"insisted\". This is one of those cases where you're like, \"I'm only hearing your side of the story, but from your version of it, you were a jerk.\"\n\nYTA",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 334,
                  "content": "That sounds reasonable to me. Like, mom just had her nether region torn and stretched or has an incision that’s healing, she’s bleeding, potentially breastfeeding. The last thing a new mom needs is see a bunch of people",
                  "id": 21,
                  "comments": [
                    {
                      "score": 115,
                      "content": "Why did I have to read this far down before seeing someone talk about the fact that this woman JUST GAVE BIRTH and her body is gonna be physical hell rn? Thank you",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Came here for this comment. I have a 6 months old and I shudder at the thought of literally having to sit through such an ordeal while being afraid that one of the visitors might accidentally kill your baby by exposing it to some kind of germ.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Someone who planned a vaginal birth, but wasn’t dilated enough when Baby’s heart rate changed or Mom’s blood pressure did, or anything that suddenly endangered one or both, and it’s emergency cesarean time can literally be healing from both. And possibly from whatever spurred the surgery, say… a hemorrhage. And is probably dealing with somewhere between 1% and 1,000,000% more,”what the heck just happened to me” while also knowing some ignoramuses are waiting to pull out the “she didn’t really give birth” blasphemy which. You’d need to fortify against if you literally were in labor and experienced basically everything but pushing (it’s still an awful thing to poke a mama who had a planned c-section but she could start preparing for the bastards whenever she and her team decided. People who got the “this baby needs to be out in 5 minutes or x” line…)",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 757,
              "content": "This and also.. it sounds like the worse thing in the world to me.. I'd hate anyone who would make me do a fkn welcoming party.. I am extremely introverted and I looked and felt like a dumpster fire after I gave birth.. Being a hot mess on display for a bunch of people.. related to me or not.. matter of fact just having to participate in anything not related to my new born wouldv made me snap like a fkn psycho! You are lucky you wasn't blocked from seeing the baby for a long while lady.. You sound like an entitled asshole to me! This aint about you or what you want.. Fk all that.. And now Im pissed off",
              "id": 25,
              "comments": [
                {
                  "score": 20,
                  "content": "Even for someone who isn't introverted, that seems like a nightmare. Like I love a good party, I'm big on celebrating things, but come on. \n\nEven if you have a super smooth and easy birth, you just went through hours of a difficult, invasive and painful medical event! What if you needed an emergency c-section or things were touch-and-go for a while, it's really really common - so add a bit of unprocessed trauma into the mix.\n\nNow come to a party where everyone is going to want to focus on YOU and the baby! They get to watch as you still figure out breastfeeding and going to the bathroom with stitches and changing your first few diapers and even though you're exhausted you don't even get to go home and get settled, you have to entertain people and regale them with your birth story before you've even been able to process it and the reality of this huge life change you've just experienced.\n\nHell. No.\n\nYou gotta wait until you're invited to meet a new baby.\n\nAnd really, a 6-week old baby isn't actually that much different from a 6-hour old baby. Honestly, it's more fun to meet them when they start being able to see things properly and smile anyway. The feeling of a baby looking at you and breaking out into a massive grin just because you exist is amazing.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yes! And quite frankly, who is this party even for? The mother who said she didn’t want it? The baby, who won’t remember it? No… wait… I got it! The grandmother who wants to make it about her and show off “her” newest addition to “her” extended family. 🙄🙄 OP is DEFINITELY the AH.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "I thought this was just common sense tbh, *unless* the couple, without prompting, makes an invite. \n\nHere are the other reasons I feel OP is TH without a doubt:\n\n• A room set up in OP's home for her son, DIL and the new baby to come to directly from the hospital, and were not even consulted...**they said no**\n\n• From the sounds of it, a very large gathering with all family *immediately* following baby's birth...**they said no**\n\n• It seems only the DIL is being blamed for \"disrespecting the family\", the son's \"we'll see\" actually meant he simply didn't want to engage with the ensuing drama...**he meant no**\n\nI have little doubt OP and her husband have been overbearing and likely overstepping often enough that they truly felt this was the easiest/only way to enjoy and bond with their child, also keeping them safe, **alone** as they have been attempting to say, knowing it will fall of deaf ears. Honestly OP, the fact they went to such great lengths in feeling they needed to lie about the birth date, says **so** much more about you and nothing about them, **they had no choice** because of you! \n\nAdvice, give them space, apologize to them both and wait for them to contact you (seriously, **stop** blowing up their phone!) if you want even a prayer in seeing your grandchild and frankly any form of contact or relationship with your son and his new family, that's *if* they forgive you. (I believe you will find it laughable that you are the one who owes an apology here, but you truly do.)",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Even now it’s not until you have all your shots OR until the kid is old enough. I got everything jabbed in me to see my nephew at 3mo. Folks are careless about baby health.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Also OP wants a party immediately after the wife is discharged from the hospital?  Does OP know nothing of recovery time after giving birth?  Do they know nothing about tearing? \n\nOp.  No one wants to leave a hospital, pack for travel to have a party at someone else’s house (an undisclosed distance away) that they are not accustomed to after pushing a breathing, nursing, shitting human out from their body.  Especially during a pandemic.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I'm due in 2 weeks. Where are you and can I relocate there?\n\n\n(also, OP, if you were my MIL I would 100% do the same thing as your DIL did. No way in HELL will I attend a \"welcoming party\" straight after being released from hospital. I cannot stress enough how that is such a huge stress and mum and baby and I would NEVER agree to any of that. Your son is 100% right and a very good husband to his wife. YTA)",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4389,
          "content": "How many bloody posts are we going to have about people being offended that a woman—who just spent 9 months creating a human and then pushing it out of her vagina with all the possible complications that come along with childbirth—doesn’t want a party and wants to spend some time alone with her newborn? \n\n~ No, it’s not personal. Imagine being exhausted, being dragged through a hedge backwards, gaining weight, having no more than a few hours of sleep at a time, having a new little creature pull on your nipples every few hours, having bleeding nipples, having tears/stitches in your private areas, feeling depressed, having low self esteem, not feeling like you have enough energy to bathe let alone wash your hair, put on real clothes or do your makeup. **DO YOU WANT TO HAVE A PARTY?**\n\n~ Imagine all those things and think, **DO YOU WANT TO ACCEPT GUESTS?** It doesn’t matter if your partner is going to do all the work, it doesn’t matter if they are coming to help, it’s still possible to feel embarrassed about the way you look, the way you smell, the way your house looks, feeling like (or actually) shitting your pants. DO YOU WANT AN AUDIENCE?? It’s demoralizing enough doing this with a nurse, doctor, or partner around. WOULD YOU WANT TO PUT ON A BRAVE FACE AND PRETEND TO BE HAPPY ABOUT GUESTS OR A PARTY? What on earth is wrong with people? \n\n~ No, it’s not a slight to you if the mother has had her sister, or her mother, or other relatives around to help. It’s not a slight to you that she doesn’t feel comfortable sitting there with her boobs or ass hanging out in front of you. Some people don’t feel comfortable enough getting undressed at the doctor. Everyone has their issues. MY MOM HAS CLEANED MY ASS. MY SISTER HAS CLEANED MY VOMIT. Have you done those things? Would you want someone else doing those things? My cousin has looked at the blood clots on my period pad to confirm I wasn’t in fact dying. Would I show any of these things to my mother in law? As much as I love her, no! I wouldn’t even want my dad there, for gods sake. \n\n~ (Some) people make allowances for pregnancy hormones. Some people make allowances for depression. This is everything piled into one with surging hormones and emotions. No, your DIL is not the asshole when she snaps at you after you keep pushing a goddamn germ party on her new born even without a pandemic. \n\n~ For gods sake OP, you’ve had kids! Don’t you remember what it was like? And even if you bounced back up and were superwoman can’t you concede that everyone handles emotional and physical stress differently?! \n\nIs it the pandemic? Do people not give a crap anymore? **Leave all these poor new mothers alone!!** It’s not your baby! You’ll get to spend time with them when the mother is ready! You’re not being secretly cut out! For gods sake I don’t have children but it’s not bloody rocket science. \n\n**In case it wasn’t clear, OP, YTA.**\n\n~\n~\n\n*Edit: Thanks for the support from everyone! I don’t have kids but my sister does, and she had a traumatic pregnancy both times. She struggled with hyperemesis gravidarum both times, lost weight, could barely eat a thing. Then when she went into labour she got an infection from the finger induction thingie and vomited all the way through her first birth. She was alternating between throwing up and pushing. She reacted really badly to the epidural and cried between bouts of laughing gas. I was with her right until the baby was coming out, as she was only allowed two people (my mom and her partner). The entire time, her MIL was trying to push her way in with a camera. My sister has a photo immediately after birth with my (ex) brother in law, massive smile and thumbs up, while she looks utterly spent. She hates that photo. After birth she was exhausted and I had to fight my mom down while my sister fought her MIL down from being too interfering. They forced her to come to a party a few months after, which my sister cried/begged me to go to with her for moral support, her MIL gave baby the wrong formula (“this one’s fine, I had it in my kitchen!” Since when?! Your eldest is in his 20s!) and sat and listened to the elderly relatives complaining about “kids these days” not letting them help when they know best. I’ve had to sit my mom down so many times and say, what’s right for you is great, but it’s not necessarily right for others, and that’s ok too. It doesn’t make them wrong. My sister is far too kind and sweet and would give up every piece of her soul to avoid making someone feel bad. She keeps her feelings inside until she is exhausted, barely hanging on and has a full blown panic attack on the highway. I love my sister and can’t stand her being pushed around. She’s amazing. And I need to do a better job in being a better sister, but I would yell some entitled MIL out of the building for her. (I was going to say something meaner but I’m trying to remain civil.) Anyway, if there are any exhausted mothers out there who can’t bear to face saying no to their intruders, I’m your woman.*",
          "id": 32,
          "comments": [
            {
              "score": 1263,
              "content": "I have found that a lot of older women have a difficult time accepting that they have to cede their place as the center of their families to the next generation. They are no longer in need of family support or attention and they don't like it so they try and grab the next generation's attention and support for themselves. It's really sad that they can't seem to figure out how to be happy without being the center of attention. YTA, OP. Get some hobbies, maybe a job if you don't have one.",
              "id": 33,
              "comments": [
                {
                  "score": 258,
                  "content": "And maybe they were forced to have the party right after giving birth “because it was the right thing to do”.   That sucks for them because it likely wasn’t right then either.  But we should not keep bad traditions just for the sake of keeping traditions!",
                  "id": 34,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I think this could be a major part of it. When I told my MIL I didn't want visitors after giving birth, she scoffed and said \"you'll just have to deal with it like everyone else.\"\n\nI really don't understand how showing up hours or days after someone has given birth to play Pass the Baby when parents should be recovering and bonding with their newborn became tradition.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "That actually makes a lot of sense, especially if they were stay-at-home moms or only worked part time, where the majority of their time revolved around their family and kids. They lost the role they'd had their entire adult lives--possibly the only thing that really made sense to them and made them feel needed and important--when their kids grew up, and now they see their kids (or worse, their kids' spouses) taking on that role. *Their* role. While they're relegated to a glorified free babysitter whose hard-earned advice is often ignored or dismissed as misguided or outdated (which it often *is*, but they rarely seem able to accept that times and knowledge change).\n\nA lot of them probably don't even realize they're doing it, they just feel displaced and want to feel important again. And some of them, especially in the mother-in-law category, are definitely intentionally trying to demean or undermine the new mothers.\n\nI think you're right about getting a job or a hobby. They need something to make them feel worthwhile again. Or at least to get them out of their kids'/in-laws' hair.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Boomers are probably the worst at this bc they've been 'parents' for so long bc their antics prevented millennials from being able to financially cut ties with them, but older gen xers are starting to be just as bad. I have a dear friend who is 54 and this close to becoming a toxic nightmare to her son's girlfriend. She wants to be called 'glamma' instead of grandma and had a coterie of similarly aged friends backing her up. I'm in my mid 30s and had to give her a bit of a reality check.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Agreed. Total YTA. This is all about OP wanting all the attention as the benevolent and generous new grandmother without caring in the slightest about what support the new parents want or need. A big party is far too overwhelming for new parents and a new baby so soon after the birth, OP only cares about what she wants. She will be very lucky if she gets to be a grandmother, her son would be wise to cut her off as toxic if she continues to trample over their boundaries and then demand they apologise for not liking how awful she is to them.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "My DH invited his horrible awful no-good evil mother to come STAY at our home (we lived in Hawaii at the time) two weeks before my due date and with an open departure plane ticket. She stayed for well over a month. Expected to be entertained and chauffeured all over. In fact, she had DH tied up on an outing for her when I went into labor. I nearly delivered on the side of the road because of her.  She ruined my entire maternity leave.  I STILL haven't forgiven DH and the baby is now 23.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "And would we want to deal with all those issues you mentioned post birth and first few weeks in someone else's house where you're a guest???\n\n NO no one would want that when they have their own home with their stuff and their privacy what the fuck is op even thinking.",
              "id": 40,
              "comments": [
                {
                  "score": 16,
                  "content": "Ugh I totally missed that part. I hate not staying in my own bed at the best of times (not least because I can’t pack light, I stayed at my cousin’s house for one night last week and was laughed at as I walked through the door—how long are you staying?!—and because adhd means I always forget something). I hate not having the things I need to hand, and can you imagine being a new mother and not knowing what those things might be? *Oh damn I’m out of adult diapers I’ll just ask MIL, maybe she’ll have a hand held mirror too or somewhere I can lay down with good lighting to check out my stitches… that won’t be weird to explain!* “But there’s a mirror in the bathroom dear!” “Too high up and not enough space for me to lay down and get a good look at my cooch!” \n\nHow are people this clueless? Maybe we’re approaching it all wrong and we should just be more flexible, relaxed about any situation, have no shame, get some self esteem and have no insecurities or reservations about our bodies, no self awareness, maybe? And we should definitely be impervious to hormones. If I don’t believe in hormones and depression I’ll be A-OK, right?\n\nNext thing we know MIL will be on AITA raging about daughter treating her house like her own, raiding the fridge at night and being rude by crying in the bedroom the whole time.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Ten bucks says that if these poor new parents actually did go to this horrorshow and, lord forbid, had some sort of bodily fluid mishap in OP's house, OP woukd be right back on AITA wanting to know if she was in the right for verbally thrashing DIL's inability to \"control\" her freshly-ravaged body.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 14,
                      "content": "OMG! \nSo the morning of my 3 weeks post partum visit comes (my midwife saw us at 24hrs, 48 hrs, 72hrs, 1 week, 2 weeks, 3 weeks, and 6 weeks post partum) and I get up, and go to go to the bathroom. I had just pumped an hour before and was trying to catch a quick nap before I had to leave to go to the office. I stand up, realize that my boobs are rocks like I hadn't just pumped, and asked my husband if he could get our son ready so I could pump real quick. Well I take my bra off to put on a clean one and milk went shooting EVERYWHERE fire hose style. I sprayed the dog (who looked like I had lit her on fire). My husband stands there in shock. So I get myself hooked up to the pump while my poor husband tries to clean up the milk shower, and my son decides to have his first blowout diaper while laying next to me on the bed. So my poor husband abandons trying to clean up the milk to deal with the poopsplosion, I finish pumping and go to finish cleaning up the abandoned milk mess, and then my husband starts shouting because my son peed all over him. At this point in my delirium I start laughing hysterically because it was such a literal body fluid show and then proceed to piss myself and the floor. I imagine that anyone else bearing witness to the morning of the body fluids would have been horrified if it had happened in their house. I wasn't terribly thrilled about it happening in mine!",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "As I read OP's post I was thinking, \"Doesn't she *remember* what it was like after giving birth to her son???\" Clearly OP didn't even consider or think about the DIL and the condition she would be in, *especially because OP has experienced childbirth as a new mother and should know better*.\n\nOP, YTA.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "🙌",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2504,
          "content": "“I even invited a lot of family members!!” The last thing a family with a newborn needs is stress",
          "id": 46,
          "comments": [
            {
              "score": 1209,
              "content": "To a party that you decided to plan even though son and daughter in law said no to",
              "id": 47,
              "comments": [
                {
                  "score": 519,
                  "content": "[deleted]",
                  "id": 48,
                  "comments": [
                    {
                      "score": 65,
                      "content": "It definitely shows self-protection from toxic, and possibly, abusive behaviors. IMO, anyone ignoring a boundary or a \"no\" is on the verge of abuse.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "The fact that the couple was willing to hide the baby's birth from everyone for two solid weeks, rather than be subjected to a party they clearly said they did not want, should put the entire family on notice. If they keep paving over the boundaries of the new mom and dad, then it should not be surprising if they decide to go low/no contact ALL the time, just not when they need space. If that message does not get received loud and clear, with immediate effect, it is going to go badly for anyone who oversteps their boundaries.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "she put the cart before the horse and threw a tantrum when nobody would pull the cart",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 31,
                  "content": "Right?  I've never had a child and even I know that the last thing a new mom wants is to be exposed to a bunch of people in a social situation where she needs to be \"on\" and let other people handle her new baby when she's in physical and emotional pain, the hormones are going nuts, and on and on and on.  \n\nIf you were LUCKY, she would have let just you come meet the baby, but not a whole crew of people.  YTA",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 696,
              "content": "\"I invited a lot of family members.\" Who are all under the impression that son and daughter in law actually want me to organise aforementioned party. And if son & DIL have the audacity to say anything about not wanting the party when I surprise them with it, I will act surprised and offended.\n\nMassive YTA.",
              "id": 53,
              "comments": [
                {
                  "score": 54,
                  "content": "Then she adds that nobody should say anything about the nephew. If the nephew hadn't opened his big mouth, then she wouldn't have known the actual birth date of her grandson. The new parents should go LC to NC.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Yes. If OP's son reads this, when you have your 2nd child, your cousin isn't to be trusted to keep his trap shut.\n\nEdit - looking at the post, OP helpfully states that nephew in question is 24, just in case son has multiple cousins.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "If they've gone so far as to hide their child's true birthdate to keep MIL-from-hell away, sounds like they're already LC to NC, and good for them! Sounds like absolutely the right decision.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 222,
              "content": "Or the mum. A huge PARTY the day she leaves hospital? That's usually 2-3 days after giving birth at most! She's going to be exhausted, sore, bleeding, most likely wearing incontinence pads, and stitched up. She needs REST! Not being surrounded by loads of people stressing her out.",
              "id": 57,
              "comments": [
                {
                  "score": 11,
                  "content": "This. Some hospitals push a new mom out 12 hours after a normal birth, even if it's the middle of the night",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "And the last thing a newborn needs is exposure to a lot of people who may or may not be current on all their vaccines.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "“And cleaned out a room!”  For the newly postpartum mom to stay overnight?!  For a party.  SMH.  I wouldn’t have lied to OP; I would straight up told her she was an insane, interfering bat.",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "And is she going to verify everyone has shots and make them all COVID test. Last thing I would want is to play pass the baby. She's delusional. Bravo for her son sticking up to her.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Oh and don't forget that the family members were \"rightfully disappointed\"! As if this baby is some kind of commodity everyone has a right to!",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1646,
          "content": "YTA. He obviously is so afraid of his pushy parents, he had to hide his newborn from them. WTF is wrong with OP? What about Covid and whooping cough?",
          "id": 63,
          "comments": [
            {
              "score": 489,
              "content": "RSV has been really bad this year as well. As a parent to a kid who had RSV, do not recommend.",
              "id": 64,
              "comments": [
                {
                  "score": 154,
                  "content": "It’s seriously no joke, I survived RSV after a very scary (for my parents) stint in the NICU before I was even a month old, as a result I had really horrible asthma for the first 5/6 years of my life and couldn’t go a year without other respiratory infections, croup cough, whooping cough, basically all the fun coughs haha. I very thankfully grew out of it, but not everyone is that lucky.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Same. I got whooping cough as an infant because my parents were convinced they had to bring baby me to church for my first Christmas and of course everyone wanted to cuddle the baby. I don't remember it of course but I have lung scars that hurt every cold winter and its very hard to recover from chest infections. Covid will probably kill me.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I mean based off of this post alone I'm not surprised in the slightest. OP is extremely pushy and entitled, and when people don't allow her to be, they're rude and disrespectful.\n\nOP needs to pull her head out of her ass and see that the world doesn't revolve around her. \n\nI don't blame them in the slightest for hiding the birth. It sounds like it was a lot easier than dealing with OP lmao.",
              "id": 67,
              "comments": [
                {
                  "score": 11,
                  "content": ">I don't blame them in the slightest for hiding the birth.\n\nMe neither, but it's just delaying the problem here. OP's son is going to have to step up and tell MIL that any relationship with her grandbaby is contingent on backing the hell off or this pushy behavior is just going to continue. She seems the type to show up uninvited on your doorstep with a bunch of people and try to guilt her way in.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Right! Not to mention the toll having a baby takes on you, psychically, emotionally, mentally...why in the world would anyone want a bunch of people bombarding them right after giving birth??",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1552,
          "content": "I rolled my eyes so hard at “he ruined our welcoming for our grandbaby” and “we were just trying to celebrate the new family member in a proper manner” I swear I could count the wrinkles in my brain. The “big welcome” doesn’t have to be immediately after they leave the hospital, have some damn courtesy, your DIL just pushed an entire human out of her body and they’re getting used to being parents. Have the celebration a couple of weeks after they get home, when she’s had a chance to physically recover from the physical exhaustion of pushing a GD watermelon through her vagina, or have a chance to heal some if she had a C-section. Give your son a chance to absorb the fact that he’s now a dad and there’s a tiny being that he’s responsible for and has to take care of. What’s with people feeling entitled to invade the homes of family with brand new babies because “omgitsababyineedtoseeitrightnaow” and not giving the new parents time to get used to their new routine? Even when my nephews were born I never went to see them until they were a couple of weeks old. The baby isn’t going anywhere, keep your pants on.",
          "id": 70,
          "comments": [
            {
              "score": 301,
              "content": "Right? Our son and DIL are having their 1st baby and we're not planning our visit until 6wks after. Pregnancy, new parenting is hard, they need time for her to heal and to get into a routine. There is always FaceTime and texting pictures. Always defer to the new parents wishes.",
              "id": 71,
              "comments": [
                {
                  "score": 210,
                  "content": "[deleted]",
                  "id": 72,
                  "comments": [
                    {
                      "score": 17,
                      "content": "It literally takes a couple of weeks for babies to learn how to smile. I feel like not enough people know this fact. Scowly little prunes is straight truth.",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "Very true!:)",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 128,
              "content": "As for courtesy, also be courteous enough to make sure the parents want the party, which OP’s son and dil do not want.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I am startled by the level of entitlement OP exhibited. She made the whole thing about herself. OP, no like likes a drama queen.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Only with how OP and her husband are acting they've likely guaranteed it'll be a lot longer before they ever get to meet their grandson. \n\nThe baby wasn't going anywhere but will if OP doesn't back off and this post doesn't give her a reality check.  \n\nHopefully sensible comments like yours will get through to her.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Seriously, all I saw in this whole post was “me, me, me”. Guess what? It’s not about you. Like at all. Good for your son for having a backbone! \n\nNow get a grip, grandma, before you’re cut out entirely. YTA",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "It's always \"our grandbaby,\" never \"their baby,\" too!",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1077,
          "content": "Yes this.\n\nYTA. Big time.\n\nOP, are you kidding me? I hope so, so much that this is fake because this is so messed up. When I had my son last year, my husband and I banned everyone from seeing him for the first week because that was OUR time to bond as OUR OWN little family. Your son and his wife needed more time than that and they were and are well within their right to have kept it from you. \n\nYou are not that baby’s mother. You don’t get to dictate how that baby’s parents shows him off. This is not about you. This is about them and their bond with their child. And pushing for a brand new mother to come stay with you immediately after birth? No. Just no. Yes, there’s joy in childbirth, but people conveniently leave out the bit where it’s traumatic. She needed her own home and time to recover. Of course your peer pressure made her uncomfortable. Did you even take her postpartum recovery into consideration? Frankly, count yourself lucky if you get to see your grandson anytime soon.",
          "id": 80,
          "comments": [
            {
              "score": 448,
              "content": "She didn’t care about the DIL.  The DIL was just an incubator for that grandbaby.  If she cared about DIL, she wouldn’t have disregarded DIL’s “no” and went directly to her son to try to get DIL’s refusal overruled.  You don’t come between a man & wife to get your way unless you don’t really care about either of them.  It’s all about that baby now for MIL.  I’d never allow her unsupervised with it, I’ll tell you that.\n\nEdited for typo",
              "id": 81,
              "comments": [
                {
                  "score": 24,
                  "content": "Exactly. DIL stopped being a human person with her own needs and wants as soon as OP decided her role as Grandma was more important than anything else in the world. \n\nOP, do you even like your son and his wife? Or were they always just a means to an end to get a new baby?",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "To me, OP reeks of narcissism. It seems like this is her way to get the spotlight again that was taken away from her with the baby being born. Then when that didn't work OP comes online to try to get pity points from the internet.\n\n&#x200B;\n\nDefinitely YTA OP",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This I'd be no contact and frankly would contemplate moving and not telling anyone were to.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": ">Your son and his wife needed more time than that and they were and are well within their right to have kept it from you.\n\nThat’s not it though. I guarantee if OP would have just accepted their no about the party, she would have been in the loop and allowed to come over for a brief visit. She cut off her nose to spite her face with her entitlement and utter lack of common sense.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 625,
          "content": "YTA also for saying “For some reason she wanted to stay home with the baby for a few weeks” could that reason be, perhaps, that she is going to be an exhausted new mother with an infant on her breast for 2/3 of her time, sleeping in 1h increments and settling into the new cycle of having a new member to their family? Could it be she doesn’t want to stay with overbearing in laws who cannot respect her wishes for HER child?\n\nAlso YTA for saying ‘he ruined our welcoming for our grandbaby’ one they already told you not to throw. One they already told you they did not want. One they already repeatedly told you to stop thinking about. He is not ‘your grand-baby’ he is THEIR SON. THEY are the parents of this child and THEY get to decide. They also get to decide who their child meets. If that doesn’t include you they are well within their right and frankly you’re gunning for them to go NC with you.",
          "id": 86,
          "comments": [
            {
              "score": 13,
              "content": "The first sentence you mentioned makes me think this post is fake. It's just....too horrible, like it's written to make the perfect villain. Or...OP is a truly selfish person with zero emotional intelligence. Which is also possible. Anyway OP YTA",
              "id": 87,
              "comments": [
                {
                  "score": 14,
                  "content": "I read too much about estranged parents recently and I don't think I have it in me to *dis*believe posts like this any more. It seems horrifyingly common for them to feel exactly like OP does.\n\nhttp://www.issendai.com/psychology/estrangement/missing-missing-reasons.html",
                  "id": 88,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Hell, my ex-MIL invited someone I had never met before, one of her friends, into the hospital room after I had our kid. She was also very very butt hurt that I didn't want her in the room as I labored and gave birth. I think she even wanted to film it. Hell tf no.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 532,
          "content": "vouch, my dad didn't tell my grandparents to wash hands and take off their outer layers when visiting me and my twin in the hospital after we where born. We where 2 months premature and nearly died because they didn't take off their coats.\n\nan immune system doesn't immediately know how to fight of every sickness right off the bat. A welcome party is a great way to welcome a baby right back to the hospital after getting sick from all the germs floating about\n\nop is TA clearly, who the fuck doesn't know the very basics of how immune systems function",
          "id": 90,
          "comments": [
            {
              "score": 103,
              "content": "People think everything is covid this day but you're literally recommended not to take newborns into big crowds.",
              "id": 91,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "But something something natural immunity.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "My NPD mom just showed up on day 4 or something so she could take 30 million pics of her holding HER FIRST GRAND CHILD while I sat tiredly in the background, looking frumpy. By the time he was five we were completely no contact for a large number of reasons so if OP wants that he can just keep going, but narcissists never really learn.",
              "id": 93,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 242,
          "content": "Even if it wasn’t a pandemic that newborn is medically vulnerable until it finishes getting vaccinated.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "OP is not entitled to the grandkid PERIOD. YTA for thinking your wishes are more important than mom and dads.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22595,
      "content": "YTA.\n\nIt's not about you.\n\nAlso...\n\n>she was against it and said she'd rather spend the first few weeks at home with her newborn. not only that but she said no to the welcoming party. My husband and I talked to my son and he said \"we'll see\".\n\nMom said no, so you went behind her back to your son, which is disrespectful and insensitive to her wishes. And he clearly wasn't on board either. It sounds like they felt pressured into lying about it after you were so insistent on the party.\n\nAlso again...\n\n>he ruined our welcoming for our grandbaby\n\nWrong. You ruined the welcoming for him and his wife. You should feel horrible for that, and for putting them in that position to begin with.",
      "id": 96,
      "comments": [
        {
          "score": 11476,
          "content": "They obviously pushed it so hard that son and DIL we're convinced they would just be there waiting at the house when they got home from the hospital. OP needs to work on respecting boundaries if she ever wants to have a close relationship with her grandson, and will have to get used to a lot of disappointment if they continue their AH behavior",
          "id": 97,
          "comments": [
            {
              "score": 2757,
              "content": "100% and OP YTA\nI’m a newly PP Mom and my MIL boundary stomped and “my babied” us to death so much that we haven’t asked her over in 4+ weeks and she gets very limited info. We also didn’t tell anyone we were in the hospital the first day. It was glorious to concentrate on the task at hand without people constantly berating us. Babies don’t belong to grandparents and you can’t make demands/act entitled to someone else’s child, or treat people however you want. Just because you want something or think it should be a certain way doesn’t make it true. You’d be wise to love them the way they’re asking to be loved and respect some boundaries.",
              "id": 98,
              "comments": [
                {
                  "score": 834,
                  "content": "YES! I am currently 33 weeks pregnant and the thought of a “welcoming party” sounds absolutely horrendous. You would think OP would understand since she’s given birth before… but who wants to be overwhelmed and bombarded with family PP right away? I hate that grandparents think they have as much right to our children and that babies belong to them. You don’t EVER get to make demands and expect the parents to just give in. I’m proud of OP’s son and DIL for setting boundaries.\n\nOP, extreme YTA. Please look at this from their point of view instead of what works for you. This is an adjustment period for them.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Yes!!!! I’m due any day and I swear just reading about a “welcome party” gave me contractions. My in-laws can be difficult at times, but I’m soooo grateful they are nothing compared to OP. This is our second and they were very respectful of the time we needed after our first and I expect them to be the same this time. We may invite them over earlier this time just to get the extra help with a toddler running around, but they are waiting for the invitation",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "This! My son is 21 years old but I still remember my MIL begging to be in the delivery room. Hubby was in the Army and we lived in Alaska, far away from our families. My MIL was going to book a flight to arrive on my due date and my mom was flying with her. As much as I wanted my mom there, I had to talk to her and get her to suggest waiting a couple months to my MIL. I'm so glad my mom talked her into waiting, my son was born on his due date and hubby would have either had to leave our moms sitting at the airport (they couldn't get on the base without him) or leave me to go through labor and delivery alone to go pick them up. And that's not even considering she probably would have been there with a catchers mitt, and not let me have any time with my baby. \n\nDon't even get me started on the time a few years later when she tried to invite herself to stay with us the week hubby came home from a year long deployment and got all kinds of angry when we asked her to give us a couple weeks to reconnect with each other. The weird part is she's not even close with my hubby, his younger brother is her clear favorite. She just has to make everything about her.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 515,
              "content": "OP is willfully oblivious. I'm not a psychic, but I can see OP's future:\n\n1. Put on information diet (already in progress)\n\n2. No Contact (all boundary attempts have been stomped)\n\n3. Missing missing reasons, as OP cries how they're the victim.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 175,
              "content": "Really makes you wonder how many other boundaries OP has stomped on that BOTH parents felt it necessary to lie rather than being honest and trusting their wishes would be respected.",
              "id": 103,
              "comments": [
                {
                  "score": 13,
                  "content": "Can you imagine how different OP's opinion of the wedding is from her DIL's?!",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Honestly would not bring my child around this grandmother until I was positive they wouldn't catch their personality traits.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 775,
          "content": "Even if Covid were not a thing, we now know that bringing a newborn with almost no immune system around a big group of people is a terrible idea - but Covid is still a thing, and there are no vaccines for newborns!!!!  Wanting time to bond as a family is very, very common these days after a birth.  The parents are in charge of this child, the 'family' does not get a vote.  Respect their boundaries or you are never gonna see that grandbaby.",
          "id": 106,
          "comments": [
            {
              "score": 162,
              "content": "> Even if Covid were not a thing, we now know that bringing a newborn with almost no immune system around a big group of people is a terrible idea \n\nThe worst part is that they knew this shit 23 years ago as well. You know, when OP had her son. I don't know what this family is smoking but if it isn't something they paid for with the explicit intent of frying their brains then they need to check their home for a radon leak or something.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yep! Even when C\\*vid isn't a thing, Pertussis still will be! Newborn babies can't be fully vaccinated against the major childhood mortality diseases for months, and until then they're vulnerable to measles, mumps, diptheria, whooping cough, and no matter what they're vulnerable to common colds and strep!   \n\n\nWhooping cough is particularly sneaky and nasty. If you've ever heard the cough of a newborn with Pertussis, you never EVER want to take the risk of spreading it! Pertussis is one of those diseases that adults need boosters for and usually adults don't know this. In vaccinated adults it just feels like a cold. But it is VERY easily spread to infants as full-blown whooping cough by adults who don't even realize they're infected!  \n\n\n[Pertussis facts from the CDC](https://www.cdc.gov/pertussis/fast-facts.html#:~:text=Pertussis%20is%20also%20known%20as,the%20%E2%80%9C100%20day%20cough.%E2%80%9D)",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 282,
          "content": "Right??? “Oh the DIL said no, but she is only the incubator for my grandchild what she says doesn’t matter.” \n\nThe rage I felt when I read OP’s post and her clear narcissistic view of no other opinion/wish should matter made my vision blur.",
          "id": 109,
          "comments": [
            {
              "score": 10,
              "content": "Note the “” I used is the feeling the post gave me, not a direct quote. I’m in noble and don’t know how to edit.",
              "id": 110,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "And what the heck did she mean by,\n\n>\"We've always been kind and welcoming to my daughter in law and ger family\"?\n\nAs if that isn't basic decency. You don't get an award for being a base line decent human. Obviously OP thinks less of DIL and her family if it's some big task worth noting that she treated them just okay.",
          "id": 111,
          "comments": [
            {
              "score": 27,
              "content": "She meant that if she gives you basic human decency she gets to control you for life.  It's that much of a \"gift\".",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 184,
          "content": "Wish i has had an award to give you, you’ve summed it up so perfectly.\n\nOP - for the reasons above 100% YTA.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "Look at OP’s language. She completely believes it’s all about her. Her manipulation and pressure have been so extreme that the parents literally had to hide the baby. Message to OP: it’s not your child and you don’t call the shots. If you can’t accept this, the parents will rightfully block you from having a relationship with your grandchild.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I also got irritated about the line about ruining the welcoming of THEIR grand baby. It’s not your fucking baby! You had your turn! You see it a lot when it’s in laws and new babies, weddings, etc. These experiences aren’t theirs. They already had those moments themselves and got to do it their way. Why would you try to steal those once in a lifetime experiences from your adult children? It’s so self centered.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "r/JUSTNOMIL will be perfect for the wife and son to visit.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "It sounds like she still planned the party even!! Ugh, this poor DIL has her work cut out for her! \n\nYta OP!",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "My favourite thing here is how quickly:\n\n> She said no to the welcoming party. My husband and I talked to my son and he said \"we'll see\".\n\nTurned inexplicably into:\n\n> I invited family members and they're all rightfully disappointed as well.\n\nCan't think why they hid the birth...",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11126,
      "content": "[removed]",
      "id": 119,
      "comments": [
        {
          "score": 3259,
          "content": "YTA  \nRight im just wondering how hard OP was pushing to the point they actually had to HIDE the birth form everyone like holy shit. Also wondering if the we'll see the kids posting on justnmil and entitledparents",
          "id": 120,
          "comments": [
            {
              "score": 1807,
              "content": ">He said it was his last resort after I kept pushing and made his wife uncomfortable but that was not appreciated because we were just trying to celebrate the new family member in a proper manner.\n\nPretty hard.\n\n\"Proper manner\"? What even is that? Woman just gave birth let her rest and heal.",
              "id": 121,
              "comments": [
                {
                  "score": 600,
                  "content": "That really got on my nerves, too. Who are they to deem what is proper? It’s proper to respect others.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 250,
                      "content": "Not to mention it's the parents' child first.\n\nBeing a grandbaby comes after that. This is one of the most entitled posts I've ever seen.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 121,
                  "content": "Poor woman is torn up and bleeding, exhausted, raw, and dealing with a newborn. \n\nOP needs to stfu.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "A “proper manner” is the healthiest thing for the baby.  That’s NOT ANY sort of party - at all.  In fact, many birthing centers advocate for quiet birthing because the transition from warm safe & toasty mommy into cold loud abrasive world can contribute to the trauma inflicted on the infant by the birth.  A few weeks with just mom & dad at home getting to know their infant is the absolute healthiest thing for the baby.  Aunts & uncles, grannies & grandpas, cousins, friends, etc. can all be slowly introduced later.  OP is a humongous AH",
                  "id": 125,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Not to mention there's a pandemic going on....",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "That part was so infuriating. IMO proper manner is going home, taking am effing shower, and sleeping in my own bed. Idk wtf OP is on about",
                  "id": 127,
                  "comments": [
                    {
                      "score": 16,
                      "content": "\"Proper manner\" is treating the baby like a human being. It's not a pet or a toy.\n\nLet it adjust to the world and its parents before passing it around like a hot potato.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "\"Proper manners\" is like how Kate Middleton and Meghan Markle got trussed up & trotted out for photo ops mere **HOURS** after giving birth. \n\nOP is pissed she can't treat DIL like that.",
                  "id": 129,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 442,
              "content": "It's sad to imagine these two parents having to plan to keep such a joyful thing secret because the MIL can't take no for an answer.",
              "id": 130,
              "comments": [
                {
                  "score": 21,
                  "content": "This! All of this!!!\n\nYTA, OP.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "That's just a heartbreaking sentence right there. OP actively robbed them of their joy in so many ways.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1108,
          "content": "I had a feeling reading the title...\n\nOP, I cannot believe that you fought that your DIL would want to stay at your house for the first few days after being discharged instead of sleeping in her own bed.\n\nAs for the welcoming party... Hello !! Covid !! And even without it, what a disrespectful thing to do because everybody is going to want to hold the baby and of course, no new mother is going to want that. \n\nOP, YTA and I don't think you're going to meet the kid any time soon...",
          "id": 133,
          "comments": [
            {
              "score": 422,
              "content": "I have my newborn, not quite able to sit properly, oozing out of orafices that did not leak previously.  I want to grow comfort and confidence with my baby with my partner.... Yes, I'll go to someone else's house, away from all the space I've been preparing for months for just this occasion!   /S",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 266,
              "content": "After I gave birth I wanted my own house and bed sooo much.  I can't imagine not going home from the hospital.",
              "id": 135,
              "comments": [
                {
                  "score": 259,
                  "content": "Our hospital has a 24 hour stay after birth policy and I was counting down the minutes, bag packed, baby in the car seat, ready to go the second the time was up. It was 6:03am, I didn’t care. I wanted my home and my shower and my own couch and bed.  Having to go from there to a party sounds horrifying.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 143,
                      "content": "I had minor complications both times and had to get special sign offs.  The younger kiddo had a touch of jaundice, I was \"Lion King\" holding that baby up to the window to get sunlight.",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 89,
                      "content": "I didn’t know that I could have gone right to a party at my in-laws. At 24 hours postpartum. Wearing an adult diaper. At bed time on a Wednesday. Without my baby, who unexpectedly needed a few days in the NICU. Fun. /s",
                      "id": 138,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "RSV, whooping cough, COVID. \n\nIt was already medical best practice to give the baby AN ABSOLUTE MINIMUM of two weeks.\n\nDick head family members.  Sounds like she told everyone to come over even after they told them no.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 638,
          "content": "Also - the comment about “for some reason our DIL didn’t want to stay in the room we emptied out for them”… how about she just GAVE BIRTH and wants to be in the comfort of her own home right after having her son! This poor DIL and son… you need to learn some boundaries OP! Not. About. You. YTA.",
          "id": 140,
          "comments": [
            {
              "score": 139,
              "content": "That’s a definite [missing missing reasons](https://www.issendai.com/psychology/estrangement/missing-missing-reasons.html) happening as we watch",
              "id": 141,
              "comments": [
                {
                  "score": 14,
                  "content": "Came here to say this.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yep. It reminded me so much of my mother. \"My adult child won't see me and I don't know why! Wah!\"\nEveryone wants their mother. There's gotta be _some_ reason the child cut off contact",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "Can you imagine coming back from the hospital to a surprise party full of in-laws? Even if they had gone back to their own house after the birth OP seems like the kind of person to just follow them there. Zero sense of boundaries",
          "id": 144,
          "comments": [
            {
              "score": 19,
              "content": "If I came home from the hospital & found my house full of in-laws, I’d burn it down before going inside.  If my husband was not a man & wanted to try to force me or baby into that situation, he can go inside\n& burn with them.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 115,
          "content": "Definitely. The new parents are obviously Low Contact with the grandparents and Grandma hasn't figured it out yet (that or she's refusing to accept it, just like she can't accept the word 'no'...which is likely a big reason for going LC in the first place). The grandparents do not respect that these new parents are adults who make their own decisions for their new family. This includes keeping a baby safe from a party *no one in the immediate family agreed to, except for you OP, even when you asked them multiple times and gave them the chance to change their minds.* \n\nIt's actually really simple OP: If you can't take no for an answer *repeatedly,* then you clearly don't deserve an answer at all. That's why they didn't want to tell you until they were ready, because you already had the party ready for whenever they told you. You just admitted that it would go ahead without their permission anyway. So why would they want to tell you? \n\nYTA OP. For the record, it'll be even longer before you see your grandbaby now and there is absolutely no one to blame but yourself.\n\n\n\nEdit: fixed typos and grammatical mistakes as well as updated a comment after reading OPs responses.",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "She fucking invited people to a non-existent welcoming party that the parents explicitly said no to. Then *those* people even got upset about a rescinded invite to a NON-EXISTENT PARTY. \n\nThis entire group of people sounds like the absolute worst kind of toxic. \n\nThis post can't be real lmao",
          "id": 147,
          "comments": [
            {
              "score": 16,
              "content": "Ten bucks says all extended family invited to this imaginary party that MIL created against the parents wishes are texting this poor couple too as if it’s their fault OP is delusional.  Usually when an adult is this delusional, they’ve been surrounded by people who enable that behavior.  Sadly, the new parents are probably getting texts from other family members trying to guilt them into apologizing to OP for how they “wronged her”.  I can even imagine how they’d word it.  “We know how she can be, BUT - blah blah blah.”",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Looks like they got some good advice from r/justnoMIL. OP is delusional.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Right? Smartest thing they ever did. OP and her husband clearly have no respect of boundaries and don't accept \"no\" as an answer.\n\nHave a newborn is a huge adjustment and those first few weeks are so important for parents and baby to bond and find their routine. That OP thinks they'd rather bring their baby to his parent's house rather than THEIR OWN HOME??? Bizarre. The entitlement and obliviousness is next level.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Seriously. OP, do you really have no idea why your son is upset with you or are you just hellbent on punishing him for not letting you get your way?\n\nThey said no. Leave it.\n\nIf you really don't understand... it's because you're overbearing. You feel entitled to their child. You blow off your DIL's feeling for not wanting to come from the hospital after pushing a watermelon out of her vagine RIGHT to a PARTY that YOU are DEMANDING. You blow off your son's feeling because YOU want something. Something you are not entitled to. You refuse to take no for answer. \n\nTip: The next time they say no to you, copy and paste this. \"I understand. Let me know if there's anything I can do for you.\" Copy. And. Paste. That. And leave it alone. \"No\" doesn't mean \"convince me.\" \"No\" doesn't mean \"bully me until I cave.\" \"No\" doesn't mean \"punish me for defying you.\" NO MEANS NO.",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "YTA\n\nYup, if they felt like they had to do this, it's obvious that this isn't the first time there have been boundary issues.  OP should take a hard look at that now before they further restrict access to the grandchild.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7499,
      "content": "YTA\n\n>\tHe said it was his last resort after I kept pushing and made his wife uncomfortable but that was not appreciated because we were just trying to celebrate the new family member in a proper manner.\n\nThe only people who decide the “proper manner” to celebrate the new family member are the parents.  Once you pushed after a first refusal you were making it about *you*, not the parents, and not the baby.",
      "id": 153,
      "comments": [
        {
          "score": 40,
          "content": "YES!!! A kindness - when forced upon you - is no longer a kindness.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5893,
      "content": "YTA.\n\nThe. Baby. Isn't. Yours.\n\nI mean, technically you are free to BE \"disappointed\" and it's fine that you told your son about your disappointment.\n\nBut YTA for insisting on a party when that's clearly not what the parents wanted.\n\nYOU invited family members, even though the mother never agreed to the party? And after she said no, you still went back and tried to pressure your son? Who gives a flying f\\*\\*k if THEY are \"disappointed?\"  That's on YOU for overstepping in the first place.",
      "id": 155,
      "comments": [
        {
          "score": 462,
          "content": "Did the family members that son and DIL had said no to a party? Because you invited them. What did you tell them OP. Because if you hadn't been so insistent on this stupid party that your son and dil didn't want would they have withheld the birthdate? You were the one who made them disappointed. Not your son. Not your DIL. YOU. You were the reason that they witheld the birthdate.",
          "id": 156,
          "comments": [
            {
              "score": 15,
              "content": "Op reminds me of those people in Rosemary's Baby the movie ..\n\nWho fucking organizes a party for a recovering mom and newborn during a pandemic and starts claiming the kid like his own.... Am guessing he probably even threatened the son with cutting him out of his will .. insufferable and a major asshole",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 373,
          "content": "Am I the only one who expects to see another AITA post in a few weeks?\n\n\"My wife and I went NC with my mother, to protect my newborn. AITA?\"",
          "id": 158,
          "comments": [
            {
              "score": 162,
              "content": "I can't wait to hear all the details OP left out.",
              "id": 159,
              "comments": [
                {
                  "score": 59,
                  "content": "Even just the ones she included are plenty for going NC",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Neither can I, though I am sure we can figure them out...",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "It will be in the JNMIL sub instead labeled as \"Just went NC with my JNMOM/JNMIL because she doesn't know that No means No regarding our newborn\"...",
              "id": 162,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4624,
      "content": "YTA, this isn’t YOUR baby. You have no say in how his parents spend the first few weeks of his life.\n\nIf I was your son, I would ban you from seeing him until you apologised and started acting more mature.",
      "id": 163,
      "comments": [
        {
          "score": 296,
          "content": "YTA. As a new mom myself I can’t imagine having someone force me to share my baby immediately after having given birth. Birth is hard under any circumstances, your daughter in law is recovering and wants time to bond as a mother. \n\nShe set a boundary and you said “your boundaries don’t matter to me because I want what I want”. If you had respected their boundaries you likely would have known right away that your grandson had been born and potentially could have organized a one on one visit. But you saw your desires as a grandmother as more important than her wishes as a mother.\n\nWhat other boundaries are you going to break that she sets because you are the grandma? They are the parents, you have the privilege of being a grandparent but that only goes as far as your son and daughter I. Law allow.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3609,
      "content": "YTA.\n\nI can see exactly why they did this.\n\nDid you not stop to think that they might not want a welcoming party? That, following birth, they might have wanted to go home and bond with their baby?\n\nYou should have respected her decision when she told you she didn’t want that. \n\nI can see exactly why you weren’t told. You wanted to do things your way and weren’t respecting their boundaries. You didn’t listen to her and instead tried pushing it on your son. \n\n…Your welcoming for your grandbaby? It’s their child and their call. You don’t have a right to welcome the child immediately after someone has given birth and you should have been far more understanding about what they wanted.\n\nWhy invite family members when they made how they feel perfectly clear? You made them disappointed in doing that, no one else. \n\nYou pushed, you made them uncomfortable. It’s their pregnancy and birth, and their time to bond with their child. It’s not at all surprising that they’re now keeping you at an arm’s length with how controlling you were being.\n\nThis is about them, and their new baby. Their wants are the only important ones, not yours. \n\nI would step back and seriously think about why you felt like you were owed this.",
      "id": 165,
      "comments": [
        {
          "score": 323,
          "content": "I have never been pregnant and don’t plan on having kids, but I am an introvert and when stressed or tired, I just want to retreat to my comfort zone while I replenish my energy for dealing with people.\n\nIf I came home to or was expected to go directly from the hospital to a “welcoming party” with family members I would at best be really disengaged and not into it, and at worst be actively anxious. Your son and his wife have just had their worlds rocked and instead of letting them adjust to being a family of three, you have to make it about yourselves and your “proper welcome” whatever that means. You wouldn’t accept no for an answer so they were forced to take the actions needed to protect themselves.\n\nFinally, you were TA pandemic notwithstanding, but to expose your vulnerable newborn grandchild and his parents to COVID, RSV, and whatever other viral diseases are running rampant this time of year right after the stresses of birth and while he has virtually no immune system is doubly a bad idea.",
          "id": 166,
          "comments": [
            {
              "score": 23,
              "content": ">If I came home to or was expected to go directly from the hospital to a “welcoming party” with family members I would at best be really disengaged and not into it, and at worst be actively anxious. \n\nNot to mention, a lot of hospitals move new mothers out pretty quickly, so this poor first time mother would be going labour, delivery, first breastfeed/ bonding, shower, nap, change, hospital discharge, uncomfortable drive, PARTY!!!! That's a lot in 12-24 hours.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "> Did you not stop to think that they might not want a welcoming party? That, following birth, they might have wanted to go home and bond with their baby?\n\nNo, she didn't consider either of those things at all. Know why? Because she was directly told that they didn't want a welcoming party, and would be spending the first couple weeks to go home and bond with their baby. \n\nSo of course, she ignored them.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Why am I guessing that MIL thought she could strong arm this party into happening?",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "She invited family members so the parents would be pressured into saying yes and go to the party. Its so manipulative and yucky. I wouldn't even let her meet the baby, at this point.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Exactly this!!! \n\nDoes OP not realise how hard is it to give birth? And to have to deal with a party right after doing so? Did she forget what it was like? Your body has to heal, you're tired and exhausted. \n\nAlso, it's a new baby. They cry all the time. The son and his wife probably are sleep deprived from taking care of a new baby and have to work out a new routine. \n\nPlus, if it's their first child they're dealing with even more stress. They are getting used to being parents, have to find their own rhythm, bond with their baby and enjoy their baby and each other. \n\nI get that OP wants to see her grandchild, if she hadn't pushed that hard, she probably would have been invited the day of the birth or the next day just to see the baby. \n\nOP, do better. You have children of your own, you know this. Is it really that hard to understand? \n\nYTA. You are selfish and you don't care about your son or DIL or their space. It's their family. They're adults and responsible for a child now. They can make their own decisions. Also, common sense is a great thing, try to use it.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "YTA. No mother wants a party after giving birth. I’m not surprised they hid it from you guys and that just speaks volumes on how you made them feel. You so realize a party for a newborn is a bad thing especially with covid right now. Family tend to come over even when sick or getting over a sickness and pass it on. Your family has no say if a party for a newborn should happen the parents of the newborn have the right to want one or not. My son at 6 months got the flu from someone and spent 2 days at the hospital in 2013 worst thing I every had to deal when any of my kids were babies. The health of the baby is more important then a party. It’s your fault that you invited family when you knew they didn’t want a party",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3024,
      "content": "This post is psychotic. What new and young mother wants to come home from the hospital and immediately be thrown into a party with her in laws???\n\nYou need to chill the fuck out or you’ll be posting here in a few months asking why your son has gone no contact with you\n\nYTA",
      "id": 173,
      "comments": [
        {
          "score": 974,
          "content": "I can't imagine ANYTHING I would have wanted less immediately after giving birth - in enormous pain, bleeding and leaking, sleep-deprived - than a party with all of my in-laws there. This is nightmare-inducing.",
          "id": 174,
          "comments": [
            {
              "score": 532,
              "content": "I can imagine something worse - all that, but in someone else's house, who is expecting you to live there, and has shown they're unwilling to listen to your views.\n\nOh wait, that's exactly what's happened",
              "id": 175,
              "comments": [
                {
                  "score": 243,
                  "content": "I know! I feel like people keep overlooking that OP cleared out a room for them and expected them just to live with her for awhile??? What??????",
                  "id": 176,
                  "comments": [
                    {
                      "score": 157,
                      "content": "It's so \"supportive\" though!! Why doesn't DIL just do everything I say? I'm always right?!?!?\n\n- OP basically.",
                      "id": 177,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "I honestly didn't even notice that until I came to the comments. OP just slid that in there like it was something totally normal!",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "AND THEYVE INVITED OTHER FRIENDS!",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "Oh maybe the whole gang can stand over her shoulder and give advice and help with latching techniques",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "I love my in laws, they are amazing and I feel so blessed after reading so many stories on here.  So much so that I texted them that just the other day.  Even saying that, I would have NEVER wanted to 1. go to their house to stay immediately after giving birth and 2. have a party with their family.  Then again my in laws are great so they never would have asked such an entitled thing.\n\nedit: demanded such a thing",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My son had trouble nursing the first week so I had to spend a lot of time nursing/pumping.  No way I would have been okay with a party.  And that was pre COVID.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 208,
          "content": "Babies aren’t suppose to be around a lot of people that soon anyway. When my granddaughters were born we had to get DPT boosters and the flu shot first, now with COVID , I wouldn’t want anyone around",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Like…she’s probably still icing her vulva and dealing with leaking, engorged breasts the size of footballs, FFS",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "We didn’t have a party, but we did go straight to my in-laws from the hospital. They were taking care of the dogs for us, and we have an excellent relationship. They both briefly held the baby, fed us, talked with us, and sent us home. I can’t believe the amount of these kinds of stories we get. My daughter will have a great relationship with her grandparents, because they aren’t boundary stompers and they respect us as her parents!",
          "id": 185,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "The post was so over the top that I thought for a second it might be DIL reversing roles. But then it sounded too much like my Mom.",
          "id": 186,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2258,
      "content": "YTA totally.  Being a grandparent is a privilege and not a right. They didn't want the party and they tried to tell you.. I don't blame them for not letting you know when the LO was born. At this point you will be lucky to ever meet that child. You need to take a good hard look at how you are treating treating them and your entitlement with this LO.",
      "id": 187,
      "comments": [
        {
          "score": 355,
          "content": "I would’ve lied for longer than a couple weeks honestly, OP sounds overbearing and exhausting to deal with. I don’t understand why anyone would think a party like this is a good idea? It all comes across as very entitled. OP is not considering their son and his gf’s feelings at all. This is a massive life changing moment for them and they need time to heal and adjust, not a stupid “party.”",
          "id": 188,
          "comments": [
            {
              "score": 177,
              "content": "Not even touching on the likely possibility of getting a newborn sick, The idea of having to extrovert at a party shortly after giving birth sounds completely exhausting. You’re still bleeding, you’re still swollen, if your nursing your milk is just coming in and you likely have a boob out constantly, and you’re literally exhausted cause no one’s getting any sleep. Why on EARTH would OP think a party days after birth would be a good idea??",
              "id": 189,
              "comments": [
                {
                  "score": 100,
                  "content": "God all that and THEN you know all the mothers there would be going like \"Oh, you must be so swollen, right? Still bleeding? Must be so sore and tired haha I remember, but this is *nothing*! Wait until your fourth! You ARE having more right? How's the breastfeeding? Here's how I would do it, I'm going to assume you're doing everything wrong and you should do it my way-great party, right?\"",
                  "id": 190,
                  "comments": [
                    {
                      "score": 12,
                      "content": "This just made me cringe. Been there!",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Not to mention for awhile you can’t hardly do anything without the front of your shirt soaking wet from leaking breast milk. Ugh. OP is clueless at best and outright sadistic, narcissistic asshole at worst.",
                  "id": 192,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I’d also like to throw in the ongoing (painful!!) contractions you endure in the couple days following giving birth. Don’t forget about those!",
                      "id": 193,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "Oh they tried!!",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Hi, I'm super out of the loop - what does LO mean?\n\nBest my brain can think of is 'Little Offspring but I don't think that's right lol",
          "id": 195,
          "comments": [
            {
              "score": 20,
              "content": "Lol. Sorry. Little One. \nLittle Offspring works too......",
              "id": 196,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Little one maybe ?",
              "id": 197,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1180,
      "content": "YTA. They said they didn’t want the party. You shouldn’t have pushed it. You should explain to all the disappointed family you invited that it’s you they should be mad at.",
      "id": 198,
      "comments": [
        {
          "score": 76,
          "content": "Exactly",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}