{
  "post content": "UPDATE: First of all, thank you all for the comments and the valuable insights. I tried to respond to everyone's questions and advice but it became impossible, what with hundreds of comments flooding in which is not something I expected so yes, thank you!\n\nI'm not sure this is how you do an update so I hope everyone who was interested in the update will be able to see this!\n\nFirst, let me address one thing that I now realize I'd left unclear in my OG post: The fiance did not REFUSE to say where he spent the money. I was the one that clammed him up by impulsively saying I didn't care (I was so upset I couldn't even be in the same room, let alone listen to what he had to say and that's on me).\n\nSecondly, a lot of you suggested he may be gambling or cheating - he is doing neither, thank goodness LOL I can vouch for that.\n\nNow, update!! I got up this morning and woke him up saying I wanted to re-address the money thing. He immediately got up and we started to talk. I told him that I wanted my share back as soon as possible, within this week preferably. I didn't care how he would get the money back and I told him he was free to sell the comics if he needed to. Now, onto the COMICS. He didn't lie about the price. He showed me the receipt and yes, it did cost as much as he had told me it cost. I just wanted to clear that up too now that I also have proof.\n\nAnyway, I asked him about where the money went and here is what he said, (and provided texts for me to see): He started off with an apology and said he'd give me the money back. He re-stated the gift thing. He ordered it in back in February and, as per the shop site, didn't expect it before the end of March (it may sound strange to people from normal countries, but I've waited for my packages for up to 2 months sometimes). He expected he'd get his salary right on time to pay for the comic but this didn't happen as his pay ran two days late (which it was, I remember) and the package arrived on time, so he (in his own words) carelessly took the money with the intention of returning it. I asked why he didn't return it, he apologized and said he wanted to but that wasn't enough for me. The rest of the money went to pay a bill from the apartment he rented prior to us moving together. Long story short, THAT SAME BUDDY I MENTIONED had moved into that apartment when my fiance moved out (and he and I moved in) and the buddy stayed for like a month and left without paying that month's utilities. Instead of calling the police, the owner of that previous flat called my fiance. Since he knew his buddy couldn't pay for the damn bill, he ended up paying it so she didn't call the police on the buddy. I saw the text message exchange. When asked why he didn't tell me, he said he knew I'd be very upset but that he felt it was the right thing to do (to pay for the bill) and that he now realizes just how stupid he was. Kept on apologizing and for calling me an ass for being mad.\n\nI told him my trust is very hard to be earned back and that, should we stay together, I will not be interested in mutual savings or anything similar to that. I gave him a two week deadline to give me my money back and he said he'd give it back sooner than that. I told him I will save on my own and that he's free to do what he wants with his money. He asked me if I could reconsider and start a travel fund again (this time, using a proper bank account, etc.) but I refused and will not entertain the idea.\n\nWe have decided to stay together but I am super cautious about going forward. I have suggested couple counseling so we can figure out why in the WORLD he does such mindless things without asking me or even trusting me and he has agreed to the idea, so we will see. There's a lot to (re)build but at least now I know what actually transpired. Still mad at him but yes. Thank you!!\n\nEDIT: Wow I...didn't expect this kind of response and I'm not sure how edits work here and if any one of you who have given me advice will see the edit. Thank you, first of all, for helping me go forward. I will have another serious discussion with Jack and see where the rest of the money went because its not like he flatly rejected telling me, its that i was so mad I just told him I didn't care about any of his excuses so...Hopefully I shall resolve this mystery soon. I will update properly tomorrow so if anyone wants to read more about my drama, feel free to check back tomorrow at this time haha 😅\n\nHello! Long time lurker/commenter in need of judgement.\n\nA few months ago my fiance whom I will call Jack and I decided to start a small travel fund. I told Jack that, when I was in my 20s, I used to save money for trips and that I never used my travel fund for anything else (like being tempted to grab some cash from it when I really needed it). It helped me save plenty without burning a hole in my pocket once I was on the road and he liked the idea. I made it explicitly clear that this was super important to me because we don't have super high earnings and anything we can save for the fund would be lovely since we were planning to travel to Italy this year.\n\nFor 3-4 months we both contributed to the fund and we saved up enough to cover accommodation expenses which made me excited.\n\nA few days ago, I was cleaning up and something made me look into our fund. Now, the fund is an envelope (I know, I know) and I opened it just to remind myself how much we saved, only to see the fund was empty. The money was gone.\n\nWhen Jack came back from the store, I asked him where the money was and he said he spent a half of it on a gift he recently bought me (it was a hardcover comic book I knew was pricey and was very happy and grateful when I received it). Jack wouldn't say where the other half was. I was livid. Not because he spent the money (though that also upsets me) but because he spent it without telling me.\n\nHis excuse is he didn't take me seriously when I said this was important to me. Jack said he would put the money back and that he was sorry and that he didn't think it was going to be such a big deal. I told him I didn't trust him anymore and that the fact he used the money I contributed to either buy my own gift or to spend it on god knows what was a severe violation of trust from my pov.\n\nJack said I was being an asshole about it and we're still just as upset at each other.\n\nWas I really TA? I'm sorry if this text is confusing, I'll answer questions or make edits if something is unclear. :(",
  "id": 1,
  "comments": [
    {
      "score": 6167,
      "content": "NTA - he bought you a gift with your own money… even that right there is ridiculous",
      "id": 2,
      "comments": [
        {
          "score": 3082,
          "content": "Even if I think, \"OK, he spent HIS half on the gift, where is MY half then?\", you know? :( Thank you for your thoughts!",
          "id": 3,
          "comments": [
            {
              "score": 2697,
              "content": "Run.  OP.  These things only get bigger and bigger.   His of excuse of “I didn’t know you were serious” was just a way to blame you into thinking you weren’t clear enough.    You were clear.  He didn’t care.  Or at least not enough that it mattered to you.",
              "id": 4,
              "comments": [
                {
                  "score": 817,
                  "content": "Hell, I'm reading this and I  can tell she's  set on saving or trips. \n\nHe's an asshole.  He takes the money she saved to buy her a present???   Lol",
                  "id": 5,
                  "comments": [
                    {
                      "score": 565,
                      "content": "HALF of it on a present - to make him feel less guilty for blowing the other half on whatever the hell he wanted (and won't admit to - which makes me think drugs, gambling, strippers or gaming... whatever his vice).",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 33,
                      "content": "And has the nerve to 'still be upset' with OP about it. WTF!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 189,
                  "content": "And the fact that he's not even the least bit apologetic, and is actually angry at her!",
                  "id": 8,
                  "comments": [
                    {
                      "score": 101,
                      "content": "It's funny how often people abuse the word \"gaslighting\" on this sub, but this time it's really gaslighting, lol",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yes, it’s quite alarming.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 179,
                  "content": "And this isn't going to be a one time thing. This is who he is. Marrying someone who doesn't respect you and won't stick to an agreed upon financial plan is a slippery slope. You make a plan together and later he says, \"Oh? You were serious?\" is BS. It shows you that anything you say isn't to be taken seriously, and that's a pretty crappy way to live. He takes her saved money and does what he wants with it, then won't even tell her what he did. I'd be taking a very, very hard look at this relationship if it was me.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Yes. Young people underestimate how important it is to be on the same page financially with  their partners (as did I when I was young). My husband and I see eye to eye on this and I don't think we have really ever fought about money. At this stage of our lives, the only time we need to discuss it is to talk about retirement goals and plans. The older you get the more important the mundane stuff becomes.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "100%. I had a short fling with a guy and during the deed I told him a few different times about things I wanted/didn't like, stated explicitly that I wanted things to hurry up and had to repeat myself a few times because every time I did he'd go \"oh you were serious? I thought you were joking\". Ran from that one soooo fast and he was surprised I didn't have a good time after I told him off.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I would threaten him with filing a police teport for theft if the full amount is not returned immediately. Then I would get rid of this criminal. NTA",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "Yeah, because her saying “this is important to me and I’m serious about it” wasn’t a big enough clue.\n\nIf he doesn’t listen and take you at your word then it’s a huge problem.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "Oh look, he's one of those people that can't handle the fact there is *spare money* there. This is a personality trait and will only change if he's willing to get therapy. Which he won't, because he doesn't see a problem.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 48,
                      "content": "My ex! Good grief, we could never save a damn dime! I had squirreled away $350 hoping to get it to 1000 before I shared with him what I had done and what we could do with it. Little did I know that he would rummage through my things (ugh!), until he met me at the door, one day with the envelope and the money, saying ha ha you’ve been stealing money. I was so quick to defend myself I didn’t even realize that he rooted through my things when I was not there.\nI was explaining he kept interrupting and saying it was for me, that I was going to do something selfish with it, so I grabbed it back out of his hand and I said ‘now I am’. I took stained glass classes and never regretted one instant of it. - The marriage ended in divorce, I know no shocker",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Had a boyfriend like this many years ago. I swore it actually was burning a hole in his pocket and he had to get rid of it ASAP.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Living this now and would say if he’s willing to get therapy and Naltrexone",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Oh sorry, I didn't think you were serious about me not sleeping with other people - OPs bf in the future probably",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Plus, OP said she was pretty serious about not touching it. So when your partner tells you that and you touch it, what part of the “serious” part the bf didn’t get?",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "She stressed she was serious about the money being for nothing but travel. If he thought she wasn't serious he would have asked. He knew she was serious so he snuck it out. All of it.\n\nHe cares about what he wants in the moment more than long term goals. This is a massive red flag if you like to have long term goals. If you want to do things like own a home or a car or travel you need to be with someone who has enough delayed gratification that they don't undermine those goals.\n\nOP, he's undermined your goals. Now you can't trust him. I wouldn't be able to respect him. He lies and now he is manipulating. \"I didn't know you were serious.\"\n\nWhat else will he do. Will he claim he didn't know you were serious about monogamy. He didn't know you were serious about having/not having children. He didn't know you were serious about going out for your anniversary. It will be unending until you end it.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Lol yeah, like he thought she was putting money in the envelope as some sort of joke?",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Seriously I am in the 14 years later version of this with a kid too and it sucks. Character never changes, get out now.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 153,
              "content": "He stole from you. You would be an idiot to trust him.\n\nI don't see a way forward with a person like that.",
              "id": 25,
              "comments": [
                {
                  "score": 36,
                  "content": "Stole from her. Let her stumble on to it. Isn’t sorry. Then doubles down and gaslights her. \n\nNTA. Run, OP; people don’t grow a conscience—and respect—@ 31. ",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "Dump this guy now; this is not someone you want to marry and get legally bound to.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "Best case scenario if I would want to steelman your BFs position is that he is in dire financial straits and need that money on very short notice. And even then he should have talked to you about it.\n\n  \nYou are right, is is NOT TRUSTWORTHY anymore. If actively stealing from you (and that is what he did) is not a red flag, I don't know what to tell you.",
              "id": 28,
              "comments": [
                {
                  "score": 2,
                  "content": "happy cake day!",
                  "id": 29,
                  "comments": [
                    {
                      "score": 2,
                      "content": "THANKS!",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "What's his is his and what's yours is his \n\n\nIn what universe is \"I basically took money out of your wallet and didn't tell you\" a thing where someone WOULDN'T get upset about it?  I mean my husband and I have totally enmeshed finances and I still would want to know if he cleaned me out of cash because I do go to a farmer's market pretty regularly and most of the vendors don't take credit cards. ",
              "id": 31,
              "comments": [
                {
                  "score": 4,
                  "content": "Same here, married for a long time, totally enmeshed finances and I still tell him (and he tells me) if I take money from his wallet. According to law, that money is mine, too. But it's in his wallet, so I do tell him when I take it. And if he would say no (he never does) I would leave it.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 56,
              "content": "So he stole the money, spent half on a gift to you and won't be transparent about where the rest went. You are under-reacting. He's hiding something, and he k ows its bad because he got you a \"gift\" to cover up whatever hes doing. Keep pulling the thread to see what will unravel.\n\nTLDR: Dude, don't get married. NTA.",
              "id": 33,
              "comments": [
                {
                  "score": 3,
                  "content": "Listen to highlyimprobable!\n\n\nThis.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Money problems causes a lot of divorces. If you’re having problems this early, you should rethink your future with him",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "I’m really concerned he won’t tell you where the other half is. How can you continue a life together if you don’t have basic trust for him?",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "i would think long and hard about whether you want to marry somebody who:\n\n1. didn’t take you seriously when you had a discussion about something is important to you (!)\n\n2. took money earmarked for something specific behind your back (!!!) \n\n3. won’t tell you what the money was used for (!!!!!!) \n\nhe’s blowing you off and being deceptive. \n\nand it’s also crappy that he used your money to buy you a birthday gift. given what you’ve said about your values, i would guess that you would have preferred he tell you he was struggling with coming up with money for a gift and done something meaningful but low cost, like cooking you a nice meal and writing you a thoughtful card, rather than spend money saved for another purpose on something pricier.",
              "id": 37,
              "comments": [
                {
                  "score": 15,
                  "content": "She didn't say it was a birthday gift. I think it was a \"don't be pissed at me because you got something out of it, too, gift\"",
                  "id": 38,
                  "comments": [
                    {
                      "score": 13,
                      "content": "OK context!! It's just a gift. He buys me stuff on the regular so this isn't a case of buying something to get me to not be mad. I received the gift in March and this incident happened a few days ago. Also, yes I am sure he didn't use mutual finances for gifts before this because we never had any mutual savings up until this travel fund thing.\n\nHe likes buying me stuff and knows i like prezzies LOL so we both randomly surprise each other with stuff we said we like or want. \n\nWhich is another reason why I got so freaking mad because his excuses were lame and hard to believe and now the gift he says he used the money on is just staring at me from the shelf and it makes me want to just toss it in the trash even though it's a comic I love so very much. 🥺",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "ah, my bad on the misread there. not fully caffeinated yet.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "This is a bit of a financial red flag. Try seeing whether there are other areas where you guys don’t align financially because that’s a huge factor in getting married.",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Treat your personal finances like a business, if he did that with his boses money would it be ok. Nope.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Stole her money",
          "id": 43,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1221,
      "content": "NTA.   He needs to come clean about what he spent the other half of the money on, and return the money.  I suggest opening a savings account for this purpose.    ",
      "id": 44,
      "comments": [
        {
          "score": 837,
          "content": "I have a hunch he either gave it to a buddy of his who's ALWAYS struggling (read: he doesn't want to get a job and when he does, he can never keep one) because he already did that in March (but it was his own money) or actually used it on my OTHER gift that I received in March. And now I'm mad again 😒",
          "id": 45,
          "comments": [
            {
              "score": 399,
              "content": "You told him it was important, but he “didn’t know it was that important”? Please. He thinks your shared money is for him to spend. Without a real come to Jesus moment, that isn’t going to get better if you’re planning to combine finances when you get married. \n\nAlso, mooches like the friend never go away if they feel there’s more free stuff to be had. Even if you keep separate accounts, you could easily wind up paying more for household bills if he keeps giving him money or having this bum living on your couch.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 318,
              "content": "He legitimately robbed you. That's what this is, it's theft. And the fact that he doesn't see it that way is major.",
              "id": 47,
              "comments": [
                {
                  "score": 79,
                  "content": "THIS.  This dude is trouble.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This right here. Him taking his half of the money back is fine, a bit AH to do without telling you but it's his money and he can choose what to do with it. But by taking your half of the money and choosing how to spend it, he robbed you. The fact that he spent it on a gift for you actually makes it worse and not better as he used it to lie to you and make you think he was doing something nice.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Exactly!!!",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 93,
              "content": "Please recognize that this is how he will be moving forward in your relationship. This buddy will always need $ and he will always provide it at the expense of you. This really is a huge red flag for him to not take your priorities seriously. NTA.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "OP so he just destroyed all trust you had in him and doesn't want to admit it or can't understand what he did. I strongly urge you to push him to replace that money and then you use it to move out. \n\nHe has just shown you he can't be trusted and doesn't care about things you've told him are important to you. This time it was the vacation money, next time it may escalate to actual cheating.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "This is an even bigger red flag. Bailing out a buddy who won’t work is strikes two and three in a relationship IMHO. It will be painful breaking up but it will be a lot less painful than staying with him and his layabout friend.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Whenever my ex took money without my knowledge, it was to spend it on \"practical\" things or on gifts for me. It made me feel crazy or like I was the dick for being mad. It took me a long time to realize that he just didn't care about how I felt or about my goals. His actions destroyed my credit and forced me to delay pursuing my dream career. So please take the advice from the detective that caught him stealing from my bank card that I did not take: don't let this go. It's a very big deal. ",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "OP, so sorry you are in this situation. \n\nI don’t get angry easily or often, but by now my flames would have burned your house to the ground.  Scorched earth. \n\nNTA\n\n**RUN. Like the wind.**",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Girl, run! He stole your money and is lying about it. He can’t even have an honest conversation with you about what happened to it. If you marry him, he’s always going to be spending your money.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Well, now you know you can’t trust him with cash. That’s a pretty serious problem in my opinion.",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "I'm glad you're mad because you were underreacting at first. This is a huge breach of trust. He stole money, used it for a purpose it wasn't intended for, didn't tell you, and once you found out on your own, still won't tell you the whole story. You can't have a healthy relationship with a liar and user like this.  \n\nI don't recommend staying with him, but if you do, never combine your money. Keep you money separate and get couple's counseling since he's a liar and doesn't see why this is wrong.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "A savings account without his name on it so he can't steal it again. Honestly think it's time to end the relationship. You can't stay with a person you don't trust and who tries to gaslight you into feeling guilty when you question their blatant theft.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I bet he just took the money a little bit at a time until the money was gone.  Some people just can't resist spending money if it's available.  They're like kids in a candy store.",
          "id": 60,
          "comments": [
            {
              "score": 8,
              "content": "He didn't, the money was all there in mid-March when I opened the envelope to put some money in it (which is also why I'm SO mad because although it wasn't A LOT of money it was still a couple hundred euro).",
              "id": 61,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 644,
      "content": "NTA. I know it's just a mental slip, but I read that as \"he doesn't take you seriously.\"  You can't take money out of mutual savings and spend it without discussion.",
      "id": 62,
      "comments": [
        {
          "score": 357,
          "content": "I mean...Yeah. He literally told me he didn't think it was \"that\" serious although I told him how important it was for me. :/",
          "id": 63,
          "comments": [
            {
              "score": 361,
              "content": "I would seriously push back the wedding over this. Money is the number one cause of strife in marriages. You need to be able to trust each other in financial matters.",
              "id": 64,
              "comments": [
                {
                  "score": 309,
                  "content": "Yeah, I'm not even thinking about tying the knot right now and will not for a while, should we even stay together.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 141,
                      "content": "You'll be lucky if you even stay together.  He literally stole from you and has the audacity to call you the asshole.  You need to get your money back and seriously rethink this.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 77,
                      "content": "In the long run he bought you a much better gift than the comic book - the gift of knowing who he really is.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "You need couples counseling stat!  You may never recover youe trust without him clearly understanding he needs to earn it back before the wedding planning even happens.",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "I want to add: impulse buying, that feeling of cash burning a hole in your pocket, is fixable. \n\nDeceiving your partner? Far less fixable.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "He’s a liar and a thief. How do you come back from that? I couldn’t. I _wouldn’t_ . It’s a huge character 🚩 🚩 ",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "He robbed you. It’s serious.  Get out now.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "it's not about importance or travel. It is about trust and financial responsibility, and he failed at both. Staying long term with a financially irresponsible person who plainly ignores financial decisions you make never ends good. Never ever combine any financials with him and don't cover his ass when he fails because he will continue to be irresponsible and drain you. If you agree that this week he buys groceries - there are no groceries if he has no money for it, that week and the next as well (he should not be allowed to \"skip\" a week because he will be skipping all the weeks). You get the idea.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I take this seriously, OP. He's minimizing, deflecting blame, and refusing to come clean about what he used it for. Doesn't matter if it's $5 or $5000-- it's shared savings, and he took it and spent it on himself. This is a big deal.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "That's not a mental slip. It's an entirely accurate read of the situation.\n\nI mean, no, you're right, that's not what OP wrote... but it's still 100% accurate.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 418,
      "content": "Jacks a thief simple as that",
      "id": 75,
      "comments": [
        {
          "score": 158,
          "content": "😂 I'm sorry this made me laugh but...At least I know I'm not exaggerating given all the responses.",
          "id": 76,
          "comments": [
            {
              "score": 146,
              "content": "Not exaggerating at all I would be absolutely furious if my so called partner stole money from me. That wasn’t a slip he knew exactly what he was doing taking that money that’s why he never mentioned it to you until he was caught. And him buying you something with the money was to sweeten you up.",
              "id": 77,
              "comments": [
                {
                  "score": 68,
                  "content": "Thank you. Yeah he told me he used it for the gift because he didn't pay online and chose to pay upon receiving the package like he normally does (which i believe and know is true based on his habits) but that this one arrived a few days before they said it would, it was the end of the month (March) and his salary hadn't been paid to him yet, but I don't buy it.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 108,
                      "content": "If that were the case he would have put that money back as soon as his salary was paid. Dude is just trying to trick you into thinking what he did is no big deal. If you stay together you need to have completely separate finances and find a more secure spot for your savings.  If you are both saving for a trip each save for your own expenses and if he doesn’t save up enough go without him. He’ll learn quick you are serious if you do so. But honestly is this the life you want for yourself?",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Where are people paying cash upon receiving a package? Is this a thing that still happens? I don’t believe it tbh, unless a local store is delivering the comic book to your house, I don’t know of any online retailers who let the FedEx guy take cash for a package they deliver",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "So why wasn't the money back when he got his salary?! If the story was true the first thing he would have done upon receiving his salary would have been going to an ATM and get cash out to put in the envelope",
                      "id": 81,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Why didn’t he put the money back in the account?",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "It's this simple. He stole from you. Period.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "What, exactly, was worth more to this user than your relationship, your trust, and his integrity?  What did he absolutely have to have so badly he had to *STEAL* for it?  Nothing important - which is what you are to him.  He’s probably counting on you to be too desperate for a man and too resistant to change to do anything more than pout for a few days.  You are ‘in a relationship’ with him so everything that was yours is all his now, right?  You are no longer a person - you know, like his buddy.  He wouldn’t go over and steal all of his buddy’s cash, would he?  Because he is a guy.  \n\nIt’s up to you to find your backbone - or to accept his limp, pathetic excuses.  “I didn’t think stealing from you was that big a deal.”  “Oh, I used part of the stolen money on a gift for *you* (that you didn’t ask for) so it’s okay, right?”  “You are being an ahole about this so it’s all your fault we are upset with each other”.   \n\nI’d rather live alone than be a mark to be taken advantage of and stolen from.  I also wouldn’t want to live with somebody I don’t trust or respect.  But if I have to, I take precautions and minimize temptations for others.  Does your country not have banks?  Are women permitted to have their separate money and bank accounts?  \n\nAnd if you don’t know him well enough to have a really good guess on where the money he stole went, then you don’t know this guy at all; you’ve never paid attention or he’s just good at secrets.  I’m doubting the ‘buddy’ is the recipient of all of his largesse.  Maybe some, but he makes a convenient cover story for some expenditures.\n\nAlso, reality called.  You are never ‘going to Italy’ with this guy unless you pay.  For the sake of all things worthy, secure your money and valuables before everything you have is gone.  Quadruple your birth control while you are at it and get an STD check up.\n\nNTA, but I’m side-eyeing some of your actions.  Not demanding the money back?  Continuing to ‘discuss’ the ~~situation~~ THEFT ad nauseum?  Thinking that his ‘buddy’ is the only thing he is spending extra money on?   \n\nYou are lucky.  This is a canary-in-the-coal-mines scenario.  The amount of money you lost wasn’t huge; it could have been much worse.  The lesson is that you and this dude-bro are fundamentally incompatible.  He doesn’t want to abide by financial rules or save to go to Europe or respect your property as separate.  He doesn’t want anyone to tell him what to do with his money or to have to explain what he spends money on.  He wants someone at home to do all of the domestic stuff, plus generate income, while he and his buddies do the real things he likes.  But now the blinders should be off.",
              "id": 84,
              "comments": [
                {
                  "score": 10,
                  "content": "It's so very complex because we have traveled before, shared finances (but not SAVED together) and he has never exhibited this kind of behavior or irresponsibility. And yes, I am European so I can have my own account (and I do) etc. etc. so nothing is holding me back that way. The reason why we ended up with an envelope is because it felt like a silly little piggy bank thing and we even used those same words to refer to our fund.\n\nI have no proof he gave the money to his buddy, I only have a hunch because that buddy asked for some cash once before and my fiance feels obligated because this buddy took him in at one point in his life and gave him a bed to sleep on (don't want to disclose because its not my story to share further).\n\nI will, however, reevaluate everything, ask for my money back and have a serious talk about our relationship going forward. Comments like yours have been helpful so thank you!",
                  "id": 85,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Thank you for taking the time to respond and clarify your situation.  Obviously you know more about your circumstances.  And Italy appears more attainable to you than I thought\n\nI’m responding from my own piggybank experience which, I’m surprised to find, is still a sore spot today.  lol.    \n\nI wish for you good things in life and the ability to create them for yourself.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That didn't happen.\n\nAnd if it did, it wasn't that bad.\n\nAnd if it was, that's not a big deal. <- you are here\n\nAnd if it is, that's not my fault.\n\nAnd if it was, I didn't mean it.\n\nAnd if I did, you deserved it.",
              "id": 87,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 263,
      "content": "NTA\nAt least get your money back and go on vacation alone.",
      "id": 88,
      "comments": [
        {
          "score": 207,
          "content": "Either that or make him pay for the whole trip lol Jokes aside, I blurted out I didn't want the money or the trip which is childish so I'm gonna ask for the money back first, you're right.",
          "id": 89,
          "comments": [
            {
              "score": 113,
              "content": "Get your flippin money back ASAP",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Demand the money back",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Get yo money girl!",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "My ex did this to me... told me I was money hungry just to make me not fight for my share. And I emotionally said fine keep it wanting to prove I'm not a money hungry person. I regret it immensely.   \nFight for what is yours! Learn from my stupidity. Even if he says \"but you said you don't want it back\"  it was your money!",
              "id": 93,
              "comments": [
                {
                  "score": 3,
                  "content": "that's how they usually manipulate and gaslight the life out of women... always telling us that we are hysterical, emotional, gold diggers  and us always trying to prove we are not. it's the easiest battle to win for them. i'd rather be called every name under the sun from now on instead of losing money to a guy or getting manipulated like a fool. i have learned lessons the hardest way. never again.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You expressed this so well! It's exactly like that. I am really sorry you had to learn your lesson the hard way.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 179,
      "content": "NTA, did he think you would forget that you had a vacation planned and wanted to spend the money?",
      "id": 96,
      "comments": [
        {
          "score": 122,
          "content": "I have no idea, like he said he'd give the money back and he apologised multiple times but I'm not interested in his excuses at all. I started to wonder if I'm exaggerating which is why I came here for insight. The thing is that now I can't even look at my gift without feeling icky about it and I was so happy when I got it. :(",
          "id": 97,
          "comments": [
            {
              "score": 89,
              "content": "Run fast and far away, don't marry whit him",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "You’re not exaggerating here. He’s upset he got caught. Get the money back and give him back your engagement ring, I’ve lived a future with someone like this and it only gets worse. \n\nIt’s ok to be mad, there’s no set timeframe to stop being mad when your potential life partner steals from you, and breaks your trust. Not exactly something you get over right away. ",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Go to Italy with or without him. I am also an avid traveler and I've made lots of sacrifices so that I could afford it. Its really a financial compatibility question. \n\nI had an ex and this sort of thing definitely contributed to us breaking up. We were supposed to go on a cruise. He promised he would save and get a passport. Months went by, no savings, no passport. He was inconsiderate in other ways as well so in the totality I just couldn't deal with it. \n\nTurns out his parents hadn't gone on a single vacation in 30 years, not even a weekend road trip. He thought that was shit was normal. He couldn't understand why I was upset. When I finally broke up with him he said, \"but why, I didn't cheat on your or hit you\" its like whoa dude we just aren't on the same page and we won't ever be on the same page. \n\nFour months later I met the love of my life. Man didn't have a passport but in the last 5 years we've travelled all over the world together. \n\nGet a man who does what he says hes going to do.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If he's not setting up a clear timeline on when the money will be paid back and if he refuses to tell you how the money was spent, he's not trustworthy. \n\nThis won't ever get better. I'd seriously suggest putting a pause on any wedding planning and maybe even think of separating for a while. He stole from you, and he's trying to make you feel like the bad guy. That's not ok!",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Some people are very “present oriented”\n\nTheir plans don’t make any sense bc they weren’t thinking about the future at all when they acted",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 142,
      "content": "Nta. I broke up with a guy over this. I was younger, bf still lived at home. (College aged) Saving for a trip, we both put money in a jar on his windowsill. He claimed his mom took the money for rent. I brought it up to her, politely just asked if she’d taken money from the jar, as it was actually our combined money for a trip. She had no idea what I was talking about. ",
      "id": 103,
      "comments": [
        {
          "score": 56,
          "content": "Ugh :( Sorry to hear this also happened to you...",
          "id": 104,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 78,
      "content": "NTA.  \n\nYou have a right to be upset. \n\nAs I read about his reaction a second time, I have to wonder, has he done this before and paid back the money into the envelope before you noticed?  That doesn’t make it ok, but it could lend credibility that he didn’t see this as such a big deal and that he’s really going to pay it back.  If so, I’m guessing he’s learned his lesson this time.",
      "id": 105,
      "comments": [
        {
          "score": 83,
          "content": "He hasn't done this before because I checked the fund like back in March when I placed 50 euro inside of it (that was the only thing left of the fund btw, that bill) and everything was there so he spent it since. I have a lot of introspection and thinking to do because the more I think about it the more instances where he's been vague about his own money for no reason do I remember.",
          "id": 106,
          "comments": [
            {
              "score": 52,
              "content": "Then that is a big red flag.  Go with your gut. You’re still NTA.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Do you think he’s in debt or gambling or something?",
              "id": 108,
              "comments": [
                {
                  "score": 17,
                  "content": "Nah, not at all, he may be the ass here but I know he doesn't gamble, he's too lazy 🤣 And he barely leaves the house.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Who needs to leave the house to gamble in 2024? There are endless options on mobile. Doesn't even have to be traditional gambling, people get sucked into those predatory mobile games with a million microtransactions or speculate on shit crypto. \n\nIt's cash so less likely. The question is, *why* is he taking money from there. Convenience? A card is just as easy to use in 90% of places these days and transferring people money is easy. \n\nSo why did he really go into your fund, and not take out his own money? He is playing stupid, but he knew you would find out and it would cause a fight. Even if he has no respect, most people wouldn't consider that worth the agro ... Unless he didn't have that kind of money to spend himself. \n\nOP if you choose to  stay, you cannot marry this man without a full understanding of his financial situation. This is perfectly sensible for people looking to marry and he should have no issue with the two of you being open about savings, shares, assets  and IMPORTANTLY debt, credit cards and loans. Especially when he has just majorly broken your trust specifically around shared savings. \n\nIf he goes nuts and tries gaslighting you about wanting to see his financial situation then there is something going on he does not want you to see. Don't walk, RUN.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "🚩🚩🚩",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "you don't know about the personal finances of someone you are planning to marry? Finances are the number one reason couples split up, and by the looks of it your fiance is not good with money and worst may be in financial disaster",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 77,
      "content": "> His excuse is he didn't take me seriously when I said this was important to me. *[...]* Jack said I was being an asshole about it\n\n... and he is still your fiance exactly *why*?\n\nHoney, this is a *major* red flag. You said this was important, he disregarded that. Then he doubled down on his disrespect, and called *you* an asshole when you complained about it.\n\nNTA -- but you *will* be if you continue this relationship with a man who disrespects you, breaks your trust, and then has the nerve to blame *you* for being upset about it.",
      "id": 113,
      "comments": [
        {
          "score": 19,
          "content": "Honestly, I'm getting kind of tired of people just accepting these heinous things in their relationships. I don't even know why I care, but I just know OP will marry this man and in five years he'll still steal her money.. and all her posts will end with 'but apart from that he's really great!'",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 43,
      "content": "[deleted]",
      "id": 115,
      "comments": [
        {
          "score": 33,
          "content": "I told him I didn't want it in the heat of the moment, I just told him he's violated my trust and that I'm not interested in joint savings anymore (Yeah, I am impulsive at times and I'm not happy I said those things).",
          "id": 116,
          "comments": [
            {
              "score": 14,
              "content": "He can't use this against you because it can be only 1 of 2 things:\n1) he doesn't take you seriously on this, as he showed you before with taking the money and claiming he didn't know you were \"that serious\" so he can't pick and choose\n2) he takes you seriously on this, meaning he was wrong when he didn't take you seriously before, so now he owes you an admission of disrespect, admission of guilt, and the money\n\nI'm glad you can see clearly. That isn't as easy as it seems when writing it out. This is behavior that at best stays and gets harder to deal with, but more likely gets worse with even fewer boundaries being honored. Please get out. \n\nAnd when dealing with someone 100% the asshole, just work with the default that you can't be one, as you're not aligned with an established asshole. If that assumption makes you an asshole, you're leveling the playing field and giving yourself a chance.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "how is that impulsive? it only makes good sense not to join save with a theif.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}