{
  "post content": "Throwaway Acct. Not new to Reddit.  \n\nI **[Male, 31]** am a Sr. Administrative Assistant and Undergraduate Registrar at an American university.  I built and maintain the department's website, handle our social media, book travel for our faculty and guest lecturers, process honorarium payments, reimburse personal expenses, process expense reports, list all our courses, track all our students grades and progress in the major, handle all work requests, hire student workers to assist me in the office, on-board new faculty and a whole lot more. \n\nTo the heart of this issue; there are many older faculty members who have been in the department since the 70's and remember a time when they had secretaries.  Many of them will make a mistake now and then and refer to me as a secretary.  Oh well, shit happens. We do not have any secretaries here at this point, and there is a genuine difference between a secretary and an administrative assistant.  Aside from the dated connotations behind the word secretary, I am not a receptionist.  I have an office with a door that locks, I set my own hours and can even work from home when needed.\n\nOne professor has, for the last 4 years I have been in this role, often referred to me as *his* personal secretary.  He is currently the chair of the department (just started his appointment this fall), and will do things like: “Dear guest, please continue this correspondence with my secretary, cc’d on this conversation”, or will come by my office to ask, “what are you and the other secretaries up to this weekend”.  He is mid 60’s and not insanely old or out of touch and it always seems to be incredibly intentional.  \n\nI have politely asked him to not refer to me as his secretary at least 10 times, and my Operations Manager has spoken with him about it.  Two WEEKS ago, I had enough after he said to another professor “isn’t our secretary fantastic! They really don’t make them like they used to!” (note I am 31 years old so… not *that* old).  I reported this along with documentation from previous offenses to HR and it escalated to the point that he has been *asked* (re: told) to step down as chair before the start of next semester.  He also has to attend some 30 hours of training.  \n\nOther admin asst.’s and sundry staff have heard about all of this and are adamant that I am an asshole for costing him a prestigious posting (and the money that comes with it) and that I needed to just suck it up because he is a product of a different era.  I feel that I worked hard to get where I am and take pride in my role.  Even if I was a receptionist I do not think that *secretary* has much of a place in modern lingo.\n\n**EDIT** weeks not months\n\n**EDIT EDIT** I am a man, added to the top as well.\n\n**THE RETURN OF THE EDIT** I do not take offense to being called secretary so much as I take offense to him refusing to respect my 10+ polite requests *not* to be called it. Most faculty refer to by my name, the rest as the admin.  Some call me the registrar if I am fulfilling that role.  \n\nI even included that randomly other professors have called me secretary and I move on, as shit happens.  His specifically was repeated and on purpose, in defiance of polite requests and a request from my supervisor. That is what sucks and what my issue is with him.",
  "id": 1,
  "comments": [
    {
      "score": 3286,
      "content": "ESH -- A secretary isn't a receptionist, it's.. an admin asst. Also, department secretary is still used at my school, and it's a serious position coordinating all the crap. \n\nYou're being, imo, ridiculous for the whole 'I'm not a SECRETARY!! \\*gasp\\*, I'm far above that,' when it's just a change in terms. Flight attendants aren't stewardesses anymore, but the job is the same. \n\nHe's ridiculous for clinging to an outdated term, esp. when you've asked, but I suspect part of it may have been due to your attitude over it.",
      "id": 2,
      "comments": [
        {
          "score": 1454,
          "content": "Yeah, this guy is 100% just doing it because OP takes themselves too seriously.",
          "id": 3,
          "comments": [
            {
              "score": 736,
              "content": "Then he's an asshole. And the school seems to realize that.",
              "id": 4,
              "comments": [
                {
                  "score": 239,
                  "content": "Not disputing that. I was just agreeing that OP takes themselves too seriously.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 141,
                      "content": "Wayyyy to seriously. Put it in perspective. Does it really matter as much as this mans job matters? You would rather him get the sack then be called a secretary?\n\nLoco coco pops.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "And can we talk about how hilarious it is that a professor doesn't get proper titles? You think he's totally cool with receiving an email going \"Dear Dr. X\", even though, teChNiCaLlY, he has a PhD, so what does it matter?",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "That still makes him an asshole. How hard is it to accept that something is important to someone, even if we don’t agree? Especially when it costs us nothing. Deliberately winding people up is childish behaviour. Adults should be able to treat each other with respect.",
              "id": 8,
              "comments": [
                {
                  "score": 2,
                  "content": "\"",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Assistant TO the regional manager. It’s Jim and Dwight irl.",
              "id": 10,
              "comments": [
                {
                  "score": 3,
                  "content": "This is why OP is YTA.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "That's exactly the post I came here for.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It seems like OP is more insulted by the professor calling OP his “personal secretary”, it comes off as more demeaning than just “secretary”",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 917,
          "content": "I'm in the exact same role as OP, but I'm a woman, so I don't fly off the handle when someone uses a term that is completely synonymous with AA other than carrying a more gendered connotation. OP definitely has a complex about doing \"women's work.\" \n\nOP should sit down and think about why he finds the term \"secretary\" so degrading. He might start by talking to some women over 60, who truly had no other opportunities in many white-collar offices. I don't believe that \"secretary\" implies that someone is menial, stupid, or low-skilled, because I know generations of extremely talented and capable women who worked whole careers as secretaries, or started as secretaries and were only able to move up when the culture changed.\n\nTo sum up: get over yourself.",
          "id": 14,
          "comments": [
            {
              "score": 386,
              "content": "Yes, I agree. His repeated clarifications that he's a MAN gave me that impression. \n\nWhen someone says \"secretary\" he pictures a chatty woman in a fuscia pencil skirt and blazer, on an 80s landline twirling the curly cord and taking a message for her boss, and he doesn't like that association.\n\nI know that women also dislike the word, in situations where someone assumes that because she's a woman she's \"just the secretary\" and asks her to bring coffee for the meeting... but where she's actually a boss or manager or professional, attending the meeting.\n\nIn other words, situations where she's NOT a secretary or office manager or executive assistant or receptionist or support staff.",
              "id": 15,
              "comments": [
                {
                  "score": 332,
                  "content": "Yeah, the necessary reprogramming is not, \"I'm not a secretary, I'm a MAN who does web content management!!\" it's, \"Secretaries are professionals who have dignity and skill, and the only reason they aren't always acknowledged as such is because the profession is still made up predominantly of women.\" The same is true of teachers and nurses. Devaluing \"women's work\" is a cudgel not only against women, but against any worker in those professions (and against patients and students who would also benefit if the people serving them were fairly compensated!). \n\nAlso, it's 2019, the job market sucks, and every barista and Postmates guy is overeducated, so for our collective sanity as a society, let's agree that all work has dignity and no work is unskilled.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 22,
                      "content": "LOL, when my mom calls her Doctor's admin assistant 'his nurse\".  I roll my eyes.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "> His repeated clarifications that he's a MAN gave me that impression.\n\nYou mean when he started his post with the word **male** in bold to make sure we don't think, for even a second, that he may be female? Why would he think that his gender should matter at all in this situation?",
                  "id": 18,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Playing devils advocate a bit but I got the feeling that the boss was using this as a degrading term. And that’s why it bothers op. The fact that he’s male and is being called not only an outdated job title but one that is typically used for females while he is male adds context to that side of OP’s frustration.\n\nI don’t for a minute think this person wasn’t trying to rile op up. It was like let’s call this dude the secretary or my personal secretary. He knew what he was doing. I agree with OP that it seemed intentional.\n\nWe are all judging op pretty harshly for stuff like pointing out he’s male, pointing out that he’s not a ‘typical secretary’, etc., while glossing over the real heart of the issue for op. \n\nIm a woman and I would be offended too. Because in this context, ‘secretary’ is being used to slag op I think. It’s not just a slip of the tongue. Maybe it was at first but I think that since op has asked him to stop, it’s become intentional.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 183,
              "content": "This. Thank you. I was wondering if anyone was going to point out that OP seems to have an issue with the word \"secretary\" bc it was always seem as a woman's job and he can't accept it's a job title, outdated or otherwise, not an insult to his masculinity.",
              "id": 20,
              "comments": [
                {
                  "score": 75,
                  "content": "This is actually not an uncommon school of thought. Lots of people consider secretary to be an outdated and insulting term when it’s not their actual job title. Not saying I agree, but it’s not at all limited to OP.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 57,
                      "content": "I know a lot of female administrative assistants and executive assistants who don't like being called a secretary. I have never heard any of them bother to correct someone a second time if someone kept calling them secretary. It's not that big a deal and it isn't worth damaging relationships over. This definitely feels gendered.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Historically secretaries were men! The word literally means \"secret-keeper\" and refers to trusted officers who can keep secrets. The general counsel (lawyer) for a corporation is usually designated the \"board secretary\" because he or she is the secret-keeper. The Secretary of State and Secretary of Defense are called secretaries because they are trustworthy right-hand men or women who keep secrets and are trusted with high-level shit! More women didn't start entering the job until the 1930s (because typing) and it didn't become female-dominated until after WWII.\n\nI used to be a lawyer and I honestly vastly prefer the term \"secretary,\" because to me that connotes a close co-worker who can be trusted with secrets and confidential work; an administrative assistant keeps calendars and works the reception desk. A secretary can keep your FILES and can type confidential memoranda and is your second, external brain who can be trusted with your internal and attorney-client privileged thoughts.\n\nI call people admin assistants when they ask! (Because I do not suck.) But if I work closely with an assistant who is privy to my confidential work and who assists me on all the tricky parts and knows all the corporate secrets I know, I would vastly prefer to call them my \"secretary.\" And sometimes I call them my secretary in my office and when I recognize them on secretary's day, and my administrative assistant in recommendation letters. Because TO ME (and many lawyers!), \"secretary\" is a much more exclusive, prestigious, and trustworthy job, although I recognize that the world has moved on and \"administrative assistant\" is what everyone else wants to call them!\n\n^((Obviously I have a conversation with them and don't just start calling them secretary out of nowhere; I'll talk to my trusted assistant and find out what they prefer in what circumstances. I) *^(might)* ^(let them know why I think \"secretary\" is a more-honored role, or I might just let it roll as admin assistant if they seem firm about it. My goal is to have the best assistants, not to force them to comply to particular and outdated definitions of specific terms! And if they said, \"I totally understand why you prefer secretary, but I prefer administrative assistant,\" that would be FINE and I would comply.))\n\nI would add that I am a woman and I am SUPER aware of how sexist the term \"secretary\" can be, and I always try to avoid using it in contexts where it might sound sexist, and would and do always absolutely respect my assistants' desires w/r/t the term and its sexist connotations. But I still vastly prefer \"secretary\" -- the people who keep my secrets -- to \"administrative assistant,\" which is just the people who keep my calendar and answer phones!",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 136,
              "content": "I'm in a similar role and I would be offended. \n\nSaying that you would/wouldn't mind something in someone else's shoes isn't helpful because you aren't actually in them. \n\nSecretary isn't degrading because of the title. Its degrading because that ISN'T his title. The fact that his coworker was using the title instead of his real one is a respect issue, and him using it repeatedly after many many requests that he correct himself implies the coworker IS using the title with the outdated connotations. There is a reason that title has been phased out in favor of new ones. It DOES carry certain connotations and baggage from other times, with very very different power dynamics.",
              "id": 24,
              "comments": [
                {
                  "score": 150,
                  "content": ">with very very different power dynamics. \n\n>“Dear guest, please continue this correspondence with my secretary, cc’d on this conversation”\n\nLike that this professor was attempting to delegate menial tasks to OP, in such a way that OP can't really refuse?  Yea, I'd push back on that, too.  The commentors here are caught up in OP's righteous indignation at being *called* a secretary, but it sounds like this professor was starting to *treat* OP like a 60's style secretary / personal assistant.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Exactly. There is a reason his job title is what it is, and for someone to use another, extremely outdated one, is disrespectful and could be actively harmful to OPs career- Job titles are important. There was literally just a thread on /r/personalfinance where everyone was more upset that the guy was \"getting a promotion\" (so his boss who was offering said) that came with no title change and no pay increase- and everyone was more upset over the lack of title change than anything, because *that is what stays on your record!* Job titles are super important in moving up!! And one jerk calling you by the wrong thing and getting away with it can lead to confusion as to what it is you actually do, and how much respect you get for it.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "The thing is that we don't know if the tasks being handed off are actually in the OP's scope of work. Like any other job, there are certain parts of it that are particularly odious to some people, but the tone of the post seems to be the complaint about the title itself, not the tasks being requested.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "[deleted]",
              "id": 28,
              "comments": [
                {
                  "score": 24,
                  "content": "I do “ Administrative work” and I could really care less about the titles. I guess since I don’t have my own office with a lock I wouldn’t understand how important it is.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": ">OP definitely has a complex about doing \"women's work.\" \n\nDamn, I was trying to pinpoint what bothered me about OP's post, and I think this is it. It's lightly dripping in \"I don't do a woman's job.\"",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": ">OP definitely has a complex about doing \"women's work.\"\n\nThe converse is that the professor is using gender politics to degrade OP.  \n\nI think they both suck for playing into the ridiculous idea, but I have NO sympathy for someone who refuses to respect a simple request.  Especially when the alternative OP suggested is just his own name!\n\n\\> women over 60 \n\n\\>> only able to move up  when the culture changed. \n\nThe likelihood is that this 65 year old professor was a part of that culture.",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "You're out of your mind. No one flew \"off the handle.\" He politely corrects people who mislabel his job. I would also be annoyed if someone called me a secretary \\*because that's not my job.\\* I would especially be annoyed if, after several polite corrections, the person continued to fixate on calling me by an incorrect title. \n\nNTA.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Reminds me of the Mad Men episode where Equal Opportunity Employers become A Thing, and a bunch of black applicants gather outside the ad agency. \n\nThen Lane comes to address them as says, basically:\n\n\"Yeah, you heard right. We're equal opportunity. We'll hire black people.  But our only openings are for secretaries, so the men can leave.\"\n\n[My meme of it](https://imgur.com/moxITN9). (For some reason, it's marked as adult content now.)",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "The clarification that he is a man was added later (according to the edit note), presumably because people in the comments section asked about it. The OP did not say that he believes the title of secretary to be degrading, but rather that it was being used in a degrading way. \n\nThe problem from the OP's point of view would only be a gender issue in that the person using the term meant it that way, i.e. \"you're a girly man, subservient to me\".  The guy used the term to annoy the OP, which means the exact title used becomes irrelevant.  The intent to annoy is the core issue.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That was my thought, too. That it's really the secretary=woman thing that bothers him more than the actual word. He's a MAN, and therefore not a secretary, dammit!\n\nNevermind that the first secretaries were men, and women weren't allowed to have that position because their feeble little woman brains couldn't handle all of the tasks that a secretary had to do.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "Secretary is definitely outdated. By the dictionary definition, it may mean the same thing as “administrative assistant” but it has different connotations, one of which is providing personal sorts of assistance (correspondence, answering phones, running errands, keeping calendars, greeting visitors, etc) versus providing a wide variety of administrative support to an office or department and sometimes managing your own projects. \n\nIt sounds like professor is calling him a secretary to make himself sound more important (“my secretary will take care of that for you”) and that’s an asshole move. I’d be annoyed too, especially after asking repeatedly not to do it.",
          "id": 36,
          "comments": [
            {
              "score": 45,
              "content": "The repeatedly and the repeated confluence of secretary with receptionist and going on about how important they are makes me think the prof is doing it to mess with the OP, who is being supercilious.",
              "id": 37,
              "comments": [
                {
                  "score": 52,
                  "content": "Maybe, but if so, Prof took a joke far enough that it lost him his position.",
                  "id": 38,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": ">he prof is doing it to mess with the OP\n\nThen he's an asshole.  It's not acceptable to \"mess\" with coworkers.  Especially about such heavily gendered issues.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Tenured professors who are chairs don't need to do shit to make themselves more important.",
              "id": 40,
              "comments": [
                {
                  "score": 17,
                  "content": "And hey so many of them still feel the need to do it",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "People don't realize how much work secretaries do these days.  My assistant / secretary / whatever does an INSANE amount of work.  It's not just answering my phone, but she handles scheduling, expense reimbursement, filing, composing letters on my behalf, and a lot more.  When she started, the position was called secretary, eventually people complained so it became administrative assistant, people complained about that and it became legal administrative assistant, people complained about that so it because just \"legal assistant.\"  The job itself didn't change. And those last three changes in titles occurred over the course of only a year.  We all still sometimes say secretary, or admin assistant, etc.  Mine, at least, doesn't give a shit.  She knows her value (the office would literally fall apart if she left).  It's not malicious to call someone in that position a term that's been used for a long time.  But yeah, that professor should've shut it down after being asked 10 times to use a different term.",
          "id": 42,
          "comments": [
            {
              "score": 58,
              "content": "\"these days\" its always been like this.",
              "id": 43,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "Seems more like people don't realize how much work secretaries have always done.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "What you wrote about your secretary was really kind. I was feeling undervalued at my job and I am moving on to another opportunity but I had so many of my co-workers send me balloons, cards and gift cards and come over to give their personal congratulations and tell me how much they valued me. It really makes the difference to know that people see how hard you work.",
              "id": 45,
              "comments": [
                {
                  "score": 2,
                  "content": "There are a few assistants in our office and all of the attorneys are VERY protective over them. We all respect them so much.  They do a shit ton of work and deal with insane personalities and get none of the recognition.  I would be lost without mine.  I hope you find yourself appreciated at your new position!",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "I agree with the ESH assessment, but your example actually kind of shores up the change in terminology along with the cultural change. Look up the requirements for airline stewardesses in the 70’s and later. That didn’t change till maybe the 90’s. We lost the title of stewardess along with a ton of horrible workplace treatment. I’m not surprised secretary is a polarizing word.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Absolutely not, the roles of secretary and administrative assistant are not interchangeable. They are different positions with different expectations and command different pay. Admins are typically paid more and have more responsibilities. Secretaries perform clerical work while admins like OP have duties outside of that. Its like calling a LPN, a RN. They are both nurses but RNs have more duties than LPNs. Quite frankly the professor was being deliberately rude and obtuse and four years of that kind of behavior to me is not acceptable. Also I'm  pretty sure that professor would not have been pleased if OP continually called him a teacher instead of professor.",
          "id": 48,
          "comments": [
            {
              "score": 45,
              "content": ">  Its like calling a LPN, a RN\n\nreally disagree with this. the difference between an RN and LPN is school and programs. that is not the case for secretaries and admins",
              "id": 49,
              "comments": [
                {
                  "score": 5,
                  "content": "Depending on the job market there typically is an education difference as well. You can get an entry level secretary position with a high school diploma but for administrative assistant positions they typically want you to have at least an associates or experience. (This is for my area, I don't know if its the same for OP).",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "At my job, you need a college education (and sometimes a master's) to be an admin. Our admins basically run entire programs and departments. We have lower-level data entry/secretarial type people who just have a high school education.\n\nThat is a difference of 4+ years of higher education.\n\nSo you are wrong, there can be a huge difference between secretaries and admins, as there is between RNs and LPNs.",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "This is really interesting to me. I've been an admin all my life and the two terms have always been synonymous in my head. I haven't seen a job listing for a secretary in decades now, everything's just looking for admin assistants now.\n\nEdited to add: all of my *professional* life, I wasn't born one that I know of.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Good analogy",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Where I am I'd say a secretary role is senior to administrative assistant 100% of the time. Literally anyone can do admin assistant positions, while secretarial work often requires specific training. So I'd say this is highly location dependant, even if the term 'secretary' is outdated.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "My eyes just rolled down the street on this one. Clearly OP has a complex about his job or wouldn't be so damn sensitive. My administrative assistant is basically a secretary. I don't call her that, but let's be real, it is pretty much the same role. However, that is the point - I would not call her that. Also, she's like 60, so not an age thing. The older dude is doing it because it gets a rise out of OP. They both suck so ESH. But OP, get a grip on yourself a little... Your aren't VP of the company man. I'm a director, but don't get my panties in a bunch if someone calls me a manager or supervisor. I know what I make and what I am rewarded with, so who the fuck cares?",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah, agree with you. There’s a world between a receptionist and a secretary and the new secretary is an admin assistant.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "but it's not his job title. It does seem a bit extreme to me as well, but I think in general if someone asks to be not to be referred to in a certain way it shouldn't be too hard to accommodate that.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Have I missed something? It seems like he views the word secretary as having negative connotations. I mean some of the most powerful people in the US have titles such as the Secretary of State. It’s not an insult.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2443,
      "content": "YTA and also a secretary. \n\n“a person employed by an individual or in an office to assist with correspondence, make appointments, and carry out administrative tasks.”\n\nLol. Get over yourself. You don’t like the word secretary because you are a dude and it seems you think it has female connotations.",
      "id": 59,
      "comments": [
        {
          "score": 1046,
          "content": "THIS!!!!\n\nTHIS GUY IS A SECRETARY \n\nBut thinks he is too male and old to be one! So got someone effectively fired.",
          "id": 60,
          "comments": [
            {
              "score": 316,
              "content": "I'm not the secretary of state, I'm the chief administrative assistant of the state department.",
              "id": 61,
              "comments": [
                {
                  "score": 9,
                  "content": "Brilliant",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 147,
              "content": "to be fair, not fired. Just asked to step down at the chair or the department - he'll still be IN the department, and have a job as professor!",
              "id": 63,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 79,
              "content": "[deleted]",
              "id": 64,
              "comments": [
                {
                  "score": 14,
                  "content": "Well, OP is subordinate to the department chair in that he does work for him. That was until the chair got demoted.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 4,
                      "content": "No, it doesn't necessarily work that way. As a registrar, he does not report to the chair of a *single department;* he reports to another line.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "If you think the title corresponding to what your job is is demeaning, change job. I have great respect for secretaries and what they do!",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "HEY EVERYONE! THIS GUY'S A SECRETARY!!! RIGHT HERE!!!\n\nSee? Nobody cares.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 177,
          "content": "Yeah like managing appointments, bookings and such for senior staff is basically actions of a secretary however this dude sugar coats it. \n\nDude you are a secretary get the hell over yourself. Being a secretary is a valid job that many hard working people perform.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "I'm imagining Woody from Toy Story telling Buzz \"You are a TOY!\"",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "If you’re right then why did OPs manager not correct OP? Why did the school remove the professor as chair and require him to do a bunch of training instead of correcting OP?",
          "id": 71,
          "comments": [
            {
              "score": 35,
              "content": "It’s like these people don’t have work experience or are older “secretaries” who have internalized this and think it’s not a big deal (which I can understand) but for new workforce generations and today’s work norms, it’s a huge deal.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "Call people by their job title. If you refuse to, you are TA.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "I read this and fucking laughed out loud. Reminds me of Dwight from the office getting mad at jim for calling him assistant to the regional manager, instead of assistant regional manager",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "I dunno, I'm the Office Manager at my place of emp., and I handle and manage everything from customer service to payroll to accounts.\n\nThere was an 80 yo employee who would only refer to me as \"the office girl\" and \"the secoot-ree\"  (yes, he pronounced secretary like that) for three years. I outranked him in pay and position, but I bit my tongue for 3 years because I knew he was an uneducated dinosaur who would die or retire pretty soon.\n\nOP is dealing with a highly educated man, two-three generated younger than the sexist arsehole I was dealing with, who should 100% know other employees roles and titles, and was asked multiple times to get it right. Did he deserve to be fired? I don't think so, but he definitely needed to pull his bloody head in.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Wonder what he thinks about the Secretary of the Interior?",
          "id": 76,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "ESH, and yeah when OP listed his tasks I was like hmmm sounds a lot like a secretary.\n\nI had a colleague at my last job who was called an administrative assistant and would go mental if someone called her a secretary. Her email signature was normal except her job title, which said administrative assistant in some obnoxious brightly colored font. \n\nI could kind of understand that she didn’t want to be seen as “just a secretary” and had aspirations to get a better job in the company but seriously, everyone who has worked in an office knows that title is just a modern way of saying secretary. If we played word association and I said “administrative assistant” I bet most people would respond by saying “secretary.”",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Can we also take a moment to recognize OP made sure to make his age and sex bold? To stand out and say “I’m a *man,* so you better not **dare** call me secretary!” SO obvious he’s riled up over a female connotation.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1076,
      "content": "NTA. You didn't \"get him fired.\" You don't have that power. You accurately reported inappropriate behavior and his bosses decided what the appropriate action was. \n\nAs an aside, you're wayyyyyy to concerned about the word secretary. It's a synonym for administrative assistant, and it's not inaccurate for describing what you do. You seem to be the \"head secretary\" but you ARE a secretary. You just have a fancy title. I think he kept saying it on purpose to mess with you because you take the word and yourself too seriously. \n\nThere's nothing wrong with being a secretary. Any halfway successful business person knows they're completely dependent on their secretary, or senior administrative assistant since you insist, to keep their office running smoothly and value their contribution very highly.",
      "id": 79,
      "comments": [
        {
          "score": 267,
          "content": "The funny thing is that the British civil service (government employees) had a hierarchy of employees with set grades (in a good number of departments). The lowest employee rank used to be........ administrative assistant. Being a secretary was a higher grade than being an AA.",
          "id": 80,
          "comments": [
            {
              "score": 80,
              "content": "[deleted]",
              "id": 81,
              "comments": [
                {
                  "score": 25,
                  "content": "This whole sub thread proves how important job titles are, which is what OP is on about. Whatever words they use in your official is a reflection of your pay grade and duties. Constantly trolling someones job title can gave s negative impact on their career.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 5,
                      "content": "This guy would be insulted if he was introduced as Teacher. It’s what he does, really.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "There is no \"secretary\" grade in the British civil service nor as far as I am aware there ever had been.\n\nUnless you're talking about permanent secretaries which is a post below a minister and I dont believe has ever been confused for administrative assistants of any kind.\n\nI'm not sure what you're talking about when you say an admin assistant is lower than a secretary in a context of British civil service grades.\n\nUnless you're just stating a truism that someone who is an administrative assistant is typically lower in the hierarchy than someone who is...I dunno..the Secretary of State.",
              "id": 84,
              "comments": [
                {
                  "score": 27,
                  "content": "From Yes, Minister - the scene is on YouTube but the sound quality is terrible -\n\n**Hacker:** Who else is in this department?\n\n**Sir Humphrey:** Well briefly, sir, I am the Permanent Under Secretary of State, known as the Permanent Secretary. Woolley here is your Principal Private Secretary. I too have a Principal Private Secretary and he is the Principal Private Secretary to the Permanent Secretary. Directly responsible to me are ten Deputy Secretaries, 87 Under Secretaries and 219 Assistant Secretaries. Directly responsible to the Principal Private Secretaries are plain Private Secretaries, and the Prime Minister will be appointing two Parliamentary Under-Secretaries and you will be appointing your own Parliamentary Private Secretary.\n\n**Hacker:** Can they all type?\n\n**Sir Humphrey:** None of us can type. Mrs Mackay types: she's the secretary.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "They've certainly had secretaries, acting as secretaries to seriously senior people, but they probably technically were at an AO or EO grade though their job description (and certainly their job title) was as secretaries. \nPermanent Secretaries, as you mention, as a grade are the most senior member of the civil service.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Right, the Permanent Secretary is the most prestigious and senior a Civil Servant can be,",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "1. Totally agree with OP not getting him fired. It’s HARD to fire people, I wouldn’t be shocked if he had a pattern of intentionally disrespecting people after they had tried to handle the matter themselves. \n\n2. Actually in a lot of places the term “secretary” is considered outdated, sexist and kind of rude and is no longer an actual job title (I think this is more common in larger cities) so depending on where OP is from he might not actually be wrong for finding it offensive.\n\nOP is NTA for me.",
          "id": 88,
          "comments": [
            {
              "score": 34,
              "content": "According to a reply above, he didn't get fired at all. He is likely still employed, but was asked to stop being dept chair which is separate from his professorship.",
              "id": 89,
              "comments": [
                {
                  "score": 5,
                  "content": "NTA. I’m a woman and a feminist. If this guy were a woman, we’d all call it what it is—intentionally patronizing. This dude is doing it to be a dick. OP has had enough, and he’s taking professional steps to address it.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "While I get your point about the term secretary, someone also pointed out that we don't refer to flight attendants as stewardesses anymore, and there is a reason for that. There are (mostly sexist) implications to these titles, and if OP doesn't want those implications, I think he is right to stand up for that. His title is Senior Administrative Assistant, not secretary, and that should be respected.",
          "id": 91,
          "comments": [
            {
              "score": 2,
              "content": "Wait, actually asking, steward/stewardess is is no longer used? I swear I've still heard it during in flight announcements and never heard it looked down on. \n\nI mean, I usually just say \"excuse me\" if I'm trying to get an attendent/steward's attention so I haven't thought about the title in a while.",
              "id": 92,
              "comments": [
                {
                  "score": 13,
                  "content": "Yeah no I want to say it was the 2000s that saw the big switch, it's actually been quite a while. I took my first ever flight in 2014 and at that point it was already pretty well known to call them flight attendants because steward/stewardess was a bit rude. You actually can often see them cringe a little if you're looking at them when someone calls out \"Stewardess!\" to get some help.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I can't speak for ALL flight attendants, but I have two friends who work as one and they do not like it at all. In the past decades, they were only women and that was for a reason. Flying was a luxury, and to have beautiful women in little skirts serving you was part of the branding of flying. Now, flying is much more accessible and attendants serve much more of a purpose than lending the illusion of lusty luxury. It also perpetuated  the whole \"women exist to be sexy and serve men\" ideology that was common in households of the time as well. Take a look at these vintage airline ads, they might make it more clear: https://flashbak.com/sex-sells-seats-vintage-airline-advertising-382775/ the same concept was true of secretaries as well.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "Devils advocate: While OP may be fixated on the term (which, given that the whole post centers on it, may not be true), I'd hazard the greater assholery is prof refusing to call him by his preferred title. It didn't cost prof anything to be polite and he chose not to be.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "I'm an admin assistant, and I wouldn't have so much issue with being called a secretary as someone deciding I was *their* secretary. I support a team of about 20, I'm trying to help *everyone*, yet I have one boomer who's decided I'm *his* personal assistant and that he can monopolise my time with impunity. So I can see why this attitude really bothered OP because it REALLY bothers me.\n\nNTA",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I agree, NTA. But only because Im sure that the reason that man was calling him HIS personal secretary was a power move. It's hostile and it sucks to be around someone like that. \n\nThat was one of the reasons I left my last job. I was hired as an interior designer in the CAD Department, and my manager always referred to me as their assistant. I've told her countless times \"I'm a designer, I'm not an assistant\" and she would act like she said it on accident or reason by saying that I assist her.  Well by that logic any coworker that assists me with my work is my assistant too, and I'm sure that wouldn't fly well with them. It's condescending.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "My uncle, the \"secretary\" for a major CEO makes more than most CEO's. Nothing inherently demeaning in the word.",
          "id": 98,
          "comments": [
            {
              "score": 5,
              "content": "Indeed. Secretary of State or Secretary of Defense are not exactly low ranking positions.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "It is funny how the Secretary is the top Bureaucratic position anyone can get in many countries.\n\nIf anything, a Secretary is a far more prestigious term than an administrative asistant.\n\nHim refusing to call you by your preferred tag (especially when you asked politely many times and that is your actual designation) is pretty shitty of him though.\n\nOP reported it to HR, and HR decided that he wasn't mature enough to be dean. OP has no power. So, the hate from everyone else seems a bit unjustified. (it might just be salt, because they aren't the nicest person, but that's different)",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yes, you said exactly what I was going to say. Also, there is no way that OP’s complaint is the sole reason for the disciplinary action taken. It was either an excuse for management to do what they always intended to do anyway, or there is more to the story that OP hasn’t been made aware of.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I think you're missing the point,  it's not that he objects to being called a secretary, it's that he's being called  (and treated as) this guys *personal* secretary, despite having more to do than babysit him.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 775,
      "content": "ESH. You made it clear to him repeatedly that you don’t like being referred to as a secretary. That’s not your job title, so he should have respected that and made an effort to change. \n\nOn the other hand... most of your duties are those that traditionally would have been completed by a secretary (booking travel, processing expenses, etc.). And by your own admission, he didn’t use ‘secretary’ in any kind of demeaning way. He was complimenting you. So you escalating it to the point of him losing his job seems a touch petty on your behalf.",
      "id": 103,
      "comments": [
        {
          "score": 252,
          "content": "It was demeaning to refer to him as his personal secretary in an email, and probably intentional.",
          "id": 104,
          "comments": [
            {
              "score": 234,
              "content": "I feel like this sub sometimes justifies intentional button pushing because “the person is making too big of a deal about it”, and this is one of those cases.\n\nIt’s the same exact logic as parents telling kids “don’t react to the bullies and they’ll stop”, the implicit message is “it’s your fault that you’re being treated like this”",
              "id": 105,
              "comments": [
                {
                  "score": 85,
                  "content": "I agree, and the question wasn't \"am I an asshole for not wanting to be called by the wrong job title\" it was \"am I an asshole for reporting him and the resulting consequences\". Bottom line is this guy does not want to be referred to by the wrong job title, I can't believe that is even being challenged.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Well the consequences have nothing to do with op. He just reported it. There's no way this one incident alone caused this guy to lose his position",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "Absolutely. This guy was obviously fucking with him. Probably having a chuckle about, \"My secretary is a man\"\n\nYou have to love the people here who are all, \"Dude, you're totally a secretary. Dur hur hur.\"",
                  "id": 108,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That's the attitude given that reddit is pretty much, \"DAE STEM?\"",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "This sub is literally defending a bully and saying it's OP's fault the bully got in trouble. NTA OP WTF is wrong with this sub",
                  "id": 110,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I know right. I saw one of the top comment saying something like \"OP's too MALE to not be called a secretary.\" Like, really?",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I don’t agree with that last thing. \n\nTypically bullies do things for reactions, if you don’t give them a reaction, it deflated their fun... \n\nIt’s basically saying: “this bully wants my negative reaction, and I’m refusing to give it to him.”",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "The Prof was the department chair and this guy worked for the department, so the Prof was correct in referring to him as \"his secretary.\".  Sending an email with \"I'll have my *title* do X\" is just common workplace language.  My boss sends emails where he says I'll have my associate do X and Ive sent emails where I said I'll have my paralegal do X.",
              "id": 113,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "The owner of a company I used to work for, kept calling me a common nickname for my full name, a nickname I have never liked. I corrected him a few times at first and suggested he could use a nickname for my full name that others used and I did like, but he persisted.\n\nRather than make an issue of it, when he introduced me to someone as the nickname I didn't like, I started to say \"Oh, never mind that, X is the only one allowed to call me by that name, Y is what everyone else calls me.\" That tickled him, and he told me much later that how I handled that was one of the reasons he put me on the fast track. He said he could count on me to finesse a tricky situation.\n\nNot expecting up votes for this story because it's a bit of a brag, but it seems appropriate on this thread.",
          "id": 114,
          "comments": [
            {
              "score": 86,
              "content": "That’s all well and good but it makes the owner look like an asshole, and him calling you by the wrong name just seems like a bit of a power trip.",
              "id": 115,
              "comments": [
                {
                  "score": 26,
                  "content": "not the person your responding to but:\n\nsure, people are assholes.  You cannot avoid them.  You can only control how you react and navigate a world where they exist.\n\nIt does nobody any good to say \"well he shouldn't have been an asshole.\" Technically correct, yet non-actionable.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 4,
                      "content": ">sure, people are assholes.  You cannot avoid them.  You can only control how you react and navigate a world where they exist.\n\nAnd one of the ways to react, arguably the *correct* way, is to report their asshole behavior to HR.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": ">because it's a bit of a brag \n\nHonestly, it's not.",
              "id": 118,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "The guy didn't lose his job, just the chair position.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "But he asked him not to call him that. How is he an asshole for that? The professor wasn't calling him that as compliment, he said \"my secretary\", \"our secretary\", which offended OP",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 625,
      "content": "YTA for spending two fucking paragraphs detailing and humble-bragging about your duties and having \"an office with a door that locks\".\n\nThis isn't a job interview, we don't give a shit.",
      "id": 121,
      "comments": [
        {
          "score": 133,
          "content": "Posts need context and that didn't seem like a humble brag.  He was telling his story and outlining his duties, none of which are what a 60 yo boomer thinks his responsibilities should be. \n\nHe's no ones fucking secretary or personal assistant.  You sound like a dick. \n\nHe gave the dude a chance through the proper channnels and he blew it.. There is nothing more satisfying than knocking a pretentious dick down a peg or two.\n\nNTA",
          "id": 122,
          "comments": [
            {
              "score": 56,
              "content": ">He's no ones fucking secretary\n\nAdminstrative assistant is a synonym for secretary. Adminstrative assistant just sounds a bit less working-class than secretary. Much like sales associate instead of cashier or clerk.\n\nThe Bureau of Labor Statistics use the two words interchangeably:\n\nhttps://www.bls.gov/ooh/office-and-administrative-support/mobile/secretaries-and-administrative-assistants.htm",
              "id": 123,
              "comments": [
                {
                  "score": 3,
                  "content": "do NOT call me a cashier",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "He spent two paragraphs detailing his responsibilities..... Which are that of a secretary. He's a secretary. Lmao. There's nothing at all wrong with that but he's in denial if he thinks his title makes him not a secretary.\n\nYTA.",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "His position is the Department Secretary.",
              "id": 126,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Very much needed because I thought he was just a glorified secretary till I read all of his duties.",
          "id": 127,
          "comments": [
            {
              "score": 70,
              "content": "What does a \"glorified\" secretary even mean? His job duties as listed by him are exactly the same as those for a secretary. That's what they do, administrative and organizational tasks. What do you think a secretary does?",
              "id": 128,
              "comments": [
                {
                  "score": 44,
                  "content": "I thought it was kind of funny when he was listing all that stuff out because he’s detailing exactly what a secretary does. I’m not sure what he thinks a secretary’s duties are if not exactly what he wrote...they don’t just sit at a desk and paint their nails all day.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Yep my office is small and the company owner and I share an admin assistant. \n\nHer responsibilities per her job description are very limited and she's part time. She gets us coffee, orders lunch, puts documents where they need to go, sends faxes(I don't know how tf to send a fax lol) answers the phone and runs errands for the owner. \n\nWe still don't call her a secretary...that job title doesn't even fucking exist anymore does it??",
              "id": 130,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I thought he was a glorified secretary, then I read all of his duties and realized that he *is* a glorified secretary lol",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "No kidding.  The *secretary* of my department at the college I go to also has a “door that locks.”",
          "id": 132,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "When I was in college the Department Secretary had her own office with a door that locked",
          "id": 133,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -22,
          "content": "Just laying out my role because I assumed someone's question would be \"well are you *just* a secretary?\".  My bad, thanks for the reality check.",
          "id": 134,
          "comments": [
            {
              "score": 137,
              "content": "And you are. One that takes themselves much too seriously.",
              "id": 135,
              "comments": [
                {
                  "score": 41,
                  "content": ">takes themselves much too seriously\n\nYup. Like a lot of secretaries I've had the pleasure of working with, coincidentally.",
                  "id": 136,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 96,
              "content": "[deleted]",
              "id": 137,
              "comments": [
                {
                  "score": 28,
                  "content": "\"Thanks for the reality check\"\n\nStill a little bit to go yet.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 72,
              "content": "Just a secretary? YTA. Get over yourself OP. Senior administrative assistant is what all of our school and college secretaries had as their job titles. There’s nothing wrong with being a secretary. Suck it up dude. If you dislike secretaries so much then it’s time to find a new job. You cost someone their prestigious position just because you have some internalized misogyny about the connotations of what a secretary is.",
              "id": 139,
              "comments": [
                {
                  "score": 1,
                  "content": "He didn't cost anyone anything. The professor could have just started using the right title after being asked multiple times. If it was some kind of memory thing he could have had a nice conversation with the OP about it and cleared the air after being talked to by the OPS manager. The professor lost their position through their own actions. \n\nThe fact that HR took a hard stance on this makes me think OP isn't the only one complaining he just might be the only one who took the time to document it so this was the complaint they could act on.",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "It's hard to believe you don't care whether you're called a secretary or an administrative assistant when a) you made the request to not be called a secretary in the first place, and b) you assume people will look down on you if you're called secretary. If you truly didn't care, you wouldn't have made the request to not be called a secretary in the first place.",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "You are though.",
              "id": 142,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "You are a secretary. Your use of \"just\" makes me think you look down on those with that title but your tasks are the same just you take your title more seriously.",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "You kinda are though, the job is more than fetching coffee and screening your boss's calls nowadays.",
              "id": 144,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Oh, honey, just.... no. \n\nYou gave a clear layout of your job duties, and it's secretarial work, regardless of whether that's your title or not, and regardless of whatever you think the difference between administrative assistant and secretary is. \n\nThis will probably come as a shock to you, so sit down, but you are \"just\" a secretary, whatever that was supposed to mean in your comment.",
              "id": 145,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "You literally are. Everything you've described is consistent with the job description of a secretary. Secretary -> admin assistant is a change in language, not a change in job description.",
              "id": 146,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Perhaps OP would feel better if we called him Senior Secretary, in deference to the important work he does.  That way no one will confuse him with the other lowly secretaries.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 483,
      "content": "[deleted]",
      "id": 148,
      "comments": [
        {
          "score": 115,
          "content": "I agree. But that's his right. The old dude should respect the fact that he doesn't want to be called a secretary, for whatever reasons.",
          "id": 149,
          "comments": [
            {
              "score": 41,
              "content": "I guess what it really comes down to is when he is called a secretary, is it intentionally done in a demeaning manner, or if the other person didn't really mean any offence, because, to reiterate, it's just a different title for the same position. If they don't mean any harm, OP is being too sensitive. If they're intentionally doing this to get a rise out of OP, then OP has a reason to be upset",
              "id": 150,
              "comments": [
                {
                  "score": 88,
                  "content": "Not at all. After being asked many times to stop (or even just 1 time), you should stop, no matter your \"intentions\". If you continue doing it knowing they don't like it, well your intentions are automatically wrong.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": ">what it really comes down to is when he is called a secretary, is it intentionally done in a demeaning manner, or if the other person didn't really mean any offence, \n\nThis is the lamest justification ever for offensive behavior.",
                  "id": 152,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "That's like demanding not to be called a \"hairdresser\" but a \"stylist\".",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "They are not the same thing. The state university I worked at had DISTINCT classifications: administrative assistants, and secretaries. Also university assistants but that's more part time work.",
          "id": 154,
          "comments": [
            {
              "score": 16,
              "content": "That may be true in your environment but not OPs. Based on the responsibilities OP has both \"secretary\" and \"administrative Assistant\" fit.",
              "id": 155,
              "comments": [
                {
                  "score": 22,
                  "content": "We both worked at a university. How is that not the same environment? I've seen both AA and secretaries and they have different responsibilities, salary and expectations.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I know, people who are claiming they're the same job have no idea what they're talking about.",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 32,
          "content": "They are completely different jobs. At a university I guarantee you these will be completely separate job descriptions with different duties and compensation attached. A secretary will do strictly clerical work such as answering phones, filing, and managing calendars, and will generally be required to perform those duties on site. An AA will do higher level work such as preparing reports, making recommendations, supervising employees, etc. (the kinds of things OP described) and their work will have more flexibility. It's not just semantics. As a Sr. AA OP may even be salaried rather than hourly, a secretary would be hourly.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "No, it's not. I've been an admin assistant for about 10 years and worked in about as many different offices (I did a lot of temp work) and not ONCE have I been called a secretary. I've never even met one. I've worked with admin assistants, project officers, business support officers, receptionists and EAs, but have never met anyone who's job title is secretary. In Australia at least, it's not a title that's used anymore.",
          "id": 159,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 433,
      "content": "YTA\n\n>We do not have any secretaries here at this point\n\nThis right here is a dead give away. All college departments need secretaries. Your college has secretaries, they're just called \"Administrative Assistant\" because I guess some people (like yourself) are sensitive and want to sound more important (btw, a good secretary is pretty important so it's pretty lame that you're being offended over this).\n\n>there is a genuine difference between a secretary and an administrative assistant.\n\nThat's debatable. I mean, of course not all assistants are secretaries but your job description sounds more or less the same as the secretaries of any college I've been too. And like I said, considering this place doesn't have \"secretaries\" just means that they have that same position  but it's just under a different name. Colleges need secretaries. Sounds like you're just insecure about your job and you want to sound as important as possible. You getting offended by being called a secretary (when you technically are one) is just an insult to secretaries and to yourself.",
      "id": 160,
      "comments": [
        {
          "score": 136,
          "content": "It’s so weird we have no secretaries and everyone keeps asking me to plan everything... huh....",
          "id": 161,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "How is it that the prof gets a pass for refusing to address OP by his name?  And intentionally playing up gender politics at work?  And just flat out instigating?\n\nI don't love OP's attitude to the word secretary either, but he has a right to be addressed by either his job title or just his actual name.  The prof was being a dickhead and deserved the consequence.",
          "id": 162,
          "comments": [
            {
              "score": 28,
              "content": "OP is a secretary. He's the sexist one because he believes secretary is a demeaning term for women and he's FAR above them.",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": ">>playing up gender politics?\n\nSo you’re saying that secretary means women which is degrading? Nobody mentioned sexes as an important part. If you think it’s an insult, *you’re sexist*.",
              "id": 164,
              "comments": [
                {
                  "score": 2,
                  "content": ">Nobody mentioned sexes as an important part. If you think it’s an insult, you’re sexist.\n\nI'm a woman.  Also a secretary so just cool your jets.\n\n> So you’re saying that secretary means women which is degrading? \n\nI'm saying the word secretary fell out of use for a reason - and that reason is the history of heavy sexism that is all over this thread.  The professor is refusing to call OP by his name.  He is using this word for a reason.  It doesn't take a genius to figure out why \"they sure don't make 'em like they used to!\" is a joke.  The prof is getting a kick out of OP being \"a secretary\" and a man.  Which is indeed degrading to both genders and very sexist.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 225,
      "content": "YTA. You are a secretary. Please get over yourself. This is the most pretentious attitude a glorified secretary can have. You're not a doctor. You haven't earned the right to demand people address you by a title anymore than a Subway employee has a right to demand to be addressed as a \"sandwich artist\"",
      "id": 166,
      "comments": [
        {
          "score": 16,
          "content": "A Subway employee has to go to special classes to be deemed a \"sandwich artist\" so they in fact have more of a right to demand the correct title than this guy.",
          "id": 167,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "[removed]",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 204,
      "content": "YTA. It’s a title. You don’t like the connotation that comes with the secretary title.",
      "id": 169,
      "comments": [
        {
          "score": 119,
          "content": "I got this reading it too.  It has a feel of \"but I'm a man and only women can be secretaries!\" At least post edit.",
          "id": 170,
          "comments": [
            {
              "score": 20,
              "content": "That’s the vibe I got as well.",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Are you suggesting titles don't matter? The only connotations that matter here are the ones that imply that \"secretary\" is his job title. It's not his job and it's disrespectful to refer to him otherwise, especially after several corrections.",
          "id": 172,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 161,
      "content": "NTA. I'm a Ph.D. student, and I know that being the registrar isn't a personal secretary position at all. Our registrar is the engine that makes the whole department work for everybody  and you're probably similar. If the chair is enough of an oblivious pompous ass that he can't suss that out, more fool him.",
      "id": 173,
      "comments": [
        {
          "score": 73,
          "content": "[deleted]",
          "id": 174,
          "comments": [
            {
              "score": 14,
              "content": "Agree with both of y’all. And NTA",
              "id": 175,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "You couldn't be further from the truth. There are some companies where secretaries are such a huge vital part of the company. What defines a \"secretary\" is the job description, not the importance of the job.\n\nYou're discrediting all the hardworking secretaries out there. You're mixing up \"personal\" secretary with the \"department's\" secretary. All the evidence OP used to describe being the professor's \"personal\" secretary was misinterpreted.\n\nFor example, If I was talking to a customer as a customer support person, I \"I'm going to refer you to an engineer.\"\n\nThis is ambiguous in the fact that it could be an engineer from a different company, so it's actually REALLY common and fair to say \"I'm going to refer you to one of our engineers.\" Does this mean the engineer is ***my personal*** engineer? Nope.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Same. I’m also a PhD candidate, and the thought of calling our department’s admin a secretary is just completely a different job title, and also forces a role on OP that isn’t part of their job. NTA",
          "id": 177,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}