{
  "post content": "Context: Me and my wife have two sons, one’s 15 (Mike) the other is 8 (Ben).\n\nMy wife wanted us to take a week-long vacation, just the two of us. There was a problem, who would watch Ben? My wife suggested that we force Mike to do it. I objected, saying “Let’s be honest, this isn’t going to end well. Besides, we shouldn’t force him, he’ll just resent us”. \n\nMy wife disagreed, saying “Considering how much money he costs, he should at least babysit for free”. I disagreed, but she still did it anyway (when I was out, after which we left. She said that she paid him for it, and I was too tired to question her.)\n\nTurns out that I was right (in that it won’t end well). To get revenge, he:\n1. Played rather vulgar music loudly, just so that Ben would hear. \n2. Repeatedly had loud sex, just so Ben would hear.\n3. Told him just about every curse word, and two slurs (n-word and the f-word, the one used to insult those who are homosexual.)\n\nI mainly blame my wife because I told her that it wouldn’t end well, but she did anyway and then lied about.\n\nMy son’s to blame as well, but he’s 15 and was justifiably annoyed, so I don’t blame him too much.\n\nWhy it might be YTA:\nSure she messed up big time, but you should at least have some sympathy. Also, why aren’t you blaming the son more? He’s the one who did it.\nWhy it might be NTA:\nShe did something that I warned her against, and then lied about it.\nWhy it might be ESH:\nI suck for blaming her more than my son, she sucks for going behind my back, and Mike sucks for obvious reasons.\n(Note: If you think that two of the three people here suck, say “ESH-Except for...”)\n\nWell Jury, what’s the vote?",
  "id": 1,
  "comments": [
    {
      "score": 81,
      "content": "ESH except the little ben. \nyour wife wasn’t wrong in giving some responsibility to your older son but she does strike as a bad parent, and so do you. Evidently though he has extreme behavioural issues, WHAT 15y/o has sex?! Why are you not disciplining him for using the n-word and for using homophobic slurs?! Awful parenting. Your son needs to do better. \nAlso yes, you should DEFINITELY blame your son more. It was more his fault than anyone else’s. You discarding your son and not ever having him be responsible is problematic.",
      "id": 2,
      "comments": [
        {
          "score": 17,
          "content": "Literally at least a third of my class, if not more, had sex by the end of junior year. So some had sex when they were 15, even 14. A few years ago an 8th grader got pregnant, and gave birth early freshman year. But yeah. ESH, your wife should’ve offered to pay Mike, Mike shouldn’t have taken it out on Ben, and you should punish Mike.",
          "id": 3,
          "comments": [
            {
              "score": 24,
              "content": "Having sex young isnt odd. Whats odd is your teenage son being comfortable bringing a girl, or multiple, home just to purposely have sex knowing his little brother will hear.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -6,
              "content": "this just blew me off. why are ANY 15 y/o having sex?!? they’re SO YOUNG. ok maybe it’s just the place i grew up in, I personally think that for sexual relationships you should atleast be 18, and thus an adult. I could never grasp the idea of two minors having sex.\nBesides, even if they’re comfortable with his son having sex, they should practise boundaries about what happens in the house. and Mike definitely needs help.",
              "id": 5,
              "comments": [
                {
                  "score": 10,
                  "content": "[deleted]",
                  "id": 6,
                  "comments": [
                    {
                      "score": -7,
                      "content": "No, It’s just, minors can’t legally consent to sex, so it is just icky to me. Personally that’s it. I’m not really planning on ever having kids so this dies with me. \n\nI’m very sex positive and I believe everyone should explore themselves and their sex lives. But the minors, Idk. because often you’d see 20 y/o dating 17 y/o and having sex as well, but the 17 y/o can’t legally consent yk? but since they’ve been doing it since they were 15, nobody sees any wrong in it. Maybe it is just me being very weird and something I should work on.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "[deleted]",
                  "id": 8,
                  "comments": [
                    {
                      "score": -2,
                      "content": "personally, i think only for the reason that minors can’t legally consent. you’d expect a 19 y/o to know better than to have sex with a 15 y/o because the 15 y/o can’t consent. I think similar boundaries between two 15 y/o are also important but that’s just me.\n\nand I’m probably never having kids to that also dies with me.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I just grew up in a place where we were always taught to be responsible. I was like 9 when I was told about consent and was properly educated on it. So, It just baffles me when i come across something so odd (according to where i’m from, might not be so odd to where you’re from.) \nBoundaries are important and should be established.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Those are some pretty extreme views the vast majority of people are gonna have sexual experiences before they're 18",
                  "id": 12,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Man in the majority of the world the AOC is 16.  15 year olds aren’t babies.  In fact in many countries in the world by the time you’re 16 you can finish mainstream education, enter the workforce, join the military, drive and even start thinking about marriage. \n\nWhat magic switch gets flipped at the age of 18 that’s so unrealistic to grasp at 16? Culture is what teaches you maturity, not your actual age.  \n\nHaving sex at 15 isn’t for everyone but so long as it’s with their peers and not some creepo, and they’ve had the proper sex education it’s not the end of the world.  \n\nBeing under the age of 18 doesn’t mean they lack all autonomy.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "... because it's fun and hormones?",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": ">WHAT 15y/o has sex?\n\nA lot of them, even if it's below the legal age of consent.\n\nOP's son is a brat. Trying to traumatize his brother by having loud sex? What a cruel little shit.",
          "id": 15,
          "comments": [
            {
              "score": 2,
              "content": "It’s just very icky to me since it’s below the age of consent and kinda disgusting tbh.\n\nYes. agreed on the last point. Older son needs to do better. MUCH better.",
              "id": 16,
              "comments": [
                {
                  "score": 2,
                  "content": "It's legal in North Carolina.  Does that magically make it not \"icky\"?  Or maybe that doesn't actually have anything to do with the law?",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Lots of 15 year olds have sex thats not even weird? Second most common age people become sexually active.",
          "id": 18,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "> WHAT 15y/o has sex?!\n\nPlenty of them. They're 15, not 12.\n\nIOW, what everyone else said.",
          "id": 19,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Would like to note I was sexually active at 15, as were a lot of people in my age group. Definitely not as rare as you think. (Age of consent here is 16 btw).",
          "id": 20,
          "comments": [
            {
              "score": 1,
              "content": "Ok honestly my bad. It is heavily more common than I thought it was. Still icky to me cause of legal issues but I’m no one to dictate someone’s sex life",
              "id": 21,
              "comments": [
                {
                  "score": 1,
                  "content": "I honestly get the ick factor, but for me it would depend on the ages. Like, 15 year old having sex with a 15 year old isn't the same as l, say, a 20 year old having sex with a 15 year old.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 1,
                      "content": "To each their own, I guess?! I wouldn’t have been comfortable doing that at 15, but if someone else is, I guess as long as It’s not affecting me personally, why bother",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "There is a WORLD of difference between 'not letting him ever be responsible' and 'forcing him to look after a child he doesn't want to for a week by guilt tripping him about how much it costs to raise him'.\n\nGood on Mike. I bet they don't do it again.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Almost everyone I know had sex by 15",
          "id": 25,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 46,
      "content": "ESH except the 8 year old. No one in their right mind leaves a 15 year old to watch an 8 year old for a WEEK that is absolutely ludicrous and you should consider yourself lucky that the authorities werent called on you.\n\nYou wife is the biggest AH for insisting on this and not paying the 15 year old thus  guaranteeing that he will resent being stuck with his little brother.\n\nYou are an AH for not standing up to your wife's insanity and finding a different alternative\n\n15 year is an AH but the smallest one of all, he acted like any typical teenager would when left unsupervised and forced to watch his brother. What he did was minor compared to what he could have done, one big party and your house would have been completely trashed",
      "id": 26,
      "comments": [
        {
          "score": 12,
          "content": ">No one in their right mind leaves a 15 year old to watch an 8 year old for a WEEK\n\nI don't see anything wrong with that. A normal, well-adjusted 15 year old should be able to handle the responsibility. OP, however, raised a demon child.",
          "id": 27,
          "comments": [
            {
              "score": 24,
              "content": "For an evening, possibly overnight, but not for a week...!",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "A 15 year old isnt even trusted enough to have a driver's license ! \n\nThere are some 15 year olds that could handle it I am sure but unless your child is on the very mature side of 15 you are taking a HUGE risk that this kid can handle things. CPR certified? Well versed in first aid? A 15 year old cant even drive his brother anywhere if he needs to, the only option is ambulance in the case of an emergency. \n\nWhat are the laws where OP lives? Where I live there is no specific age at which a child can be left alone or left to care for another child so it is up to interpretation as to whether or not it was reasonable for the parents to think the child could handle it...if something would have happened to either one of them during this week you can bet that the parents would be looking at some serious intervention and potentially charges so even if you have a \"mature\" 15 year old would the courts see your 15 year old to be mature enough to be left in charge of an 8 year old for an entire week if something happened to one of them? HUGE risk to take",
              "id": 29,
              "comments": [
                {
                  "score": 6,
                  "content": "Most adults aren't CPR certified, so that's not a good metric.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 0,
                      "content": "But it will get used against the parent in court. Do you have children?",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "> A normal, well-adjusted 15 year old should be able to handle the responsibility. \n\nWell, for starters, \"normal\" 15 year olds aren't \"well-adjusted\". Hormones are still doing all kinds of shit to their brains.\n\nI would love to see the reaction you get talking about \"normal, well-adjusted 15 year olds\" with a high school teacher. My guess would be that they burst out laughing uncontrollably.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "That’s fair, honestly.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 32,
      "content": "ESH here - next time, get a baby sitter for BOTH kids because the 15 year old failed to prove he's responsible enough to be home alone. At the age of 12 my parents would leave me and my younger sibling to fend for ourselves for days at a time, and we were fine, we fought a bit but nothing like what your 15 year old did!",
      "id": 34,
      "comments": [
        {
          "score": 18,
          "content": "Yeah, I would be highly disturbed by the son if I were OP. And likely be seeking out for professional help.",
          "id": 35,
          "comments": [
            {
              "score": 6,
              "content": "The kid has no empathy.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "That’s probably best, honestly. Lesson learned.",
          "id": 37,
          "comments": [
            {
              "score": 8,
              "content": "No worries, definitely get your older son a baby sitter at some point. Maybe embarrass him a little, wait until his friends or his girlfriend or over and just mention that you and your wife are going out on Friday night and you'll be getting a baby sitter because sadly he's not mature enough to watch himself. Even better, take the 8 year old out with you and your wife so 15 year old is stuck at home with a baby sitter all night, and he can't torture the little one over it. I'm not a parent though, but like...man somehow that kid needs to realize what he did was just awful...and it makes him look ugly and sad.",
              "id": 38,
              "comments": [
                {
                  "score": -5,
                  "content": "Let’s hope that someone’s willing to babysit him. He’s...not exactly polite.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 23,
                      "content": "And it's your mistake to fix before he's too old. You only have a few years left.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 32,
      "content": "YTA\n\n>My son’s to blame as well, but he’s 15 and was justifiably annoyed, so I don’t blame him too much.\n\n*You* are the one to blame because you didn't raise your son to have better manners and respect for his family. You shouldn't have to bribe the 15 year old with money in order for him to contribute time to his family.",
      "id": 41,
      "comments": [
        {
          "score": 5,
          "content": "I deserve that, tbh. Lesson learned. We should probably have a talk.",
          "id": 42,
          "comments": [
            {
              "score": 9,
              "content": "I gotta ask, what did your wife mean by 'he costs enough money'? Is she one of those people who thinks she deserves a gold medal and back pay for raising her own kid?",
              "id": 43,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "But he didn't trust his son to do this responsibly. His wife insisted and she is a parent too so how is she absolved of guilt?",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19,
      "content": "ESH \n\nYour oldest son is an asshole. What he did is disgusting and disturbing. And he behaved like a complete jackass and seems to be a horrible older brother. \n\nYour wife is an asshole - your oldest son should have been paid to babysit. \n\nYou are an asshole - you seem to be more focused on winning this argument than to correct your oldest son’s behavior. Why would you ever tolerate his revenge? He should be grounded for a good long time. You also suck for blaming your wife more than your son. You’re supposed to be a team. \n\nYour son sucks the most, you suck the second most, and your wife sucks the least.",
      "id": 45,
      "comments": [
        {
          "score": 9,
          "content": "Yeah this isn't justifiable behaviour. You need to go do some parenting.",
          "id": 46,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Fair enough. We all suck. He should at the very least be grounded for two weeks, probably.",
          "id": 47,
          "comments": [
            {
              "score": 14,
              "content": "You need to start actively parenting him, not passively. Sending him to his room and not talking to him will not fix his psychopathic tendencies.",
              "id": 48,
              "comments": [
                {
                  "score": 0,
                  "content": "So talk and ground him?",
                  "id": 49,
                  "comments": [
                    {
                      "score": 9,
                      "content": "In 3 of your replies I've just read:\n\n\"That's probably best\"\n\"We should probably talk\"\n\"Probably ground for 2 weeks\" \n\nThat's so non-committal. What you're \"probably\" gonna do is close this thread and forget about it because \"lesson learned, we all suck, discipline too hard, just won't go away again.\" \n\nWhat you need to do is ground your oldest, talk to your youngest about how what his brother did was wrong, and get the lot of you to a family therapist.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "probably?? Man you need discipline and fast.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "\"You also suck for blaming your wife more then your son. You're supposed to be a team\". If the wife was more in the wrong then you blame the wife more.",
          "id": 52,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -1,
          "content": ">your oldest son should have been paid to babysit\n\nThat's bullshit. Kids should be expected to contribute to the household.",
          "id": 53,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "ESH- spend the money to hire a proper sitter. She’s wrong but you’re wrong too because you allowed it. Your son should be punished for using the N word and other slurs. What parents allow their 15 year old son to have sex loudly in their house while their on a vacation. Everyone sucks except the poor 8 year old. Poor kid.",
      "id": 54,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "ESH.\n\nYour wife sucks for thinking your 15 year old *wouldn't* act out after having to babysit *for a whole week*.\nYou suck for going on the vacation anyways knowing this was happening.",
      "id": 55,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "NTA a 15 year old shouldn’t be left to look after an 8 year old. Anything could’ve happened, you’re both lucky you came home to x2 live kids.",
      "id": 56,
      "comments": [
        {
          "score": 2,
          "content": "Not this particular 15 year old.",
          "id": 57,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "YTA for blaming your wife and the 15 year old is also TA for his behavior. You should be able to leave an 8 yo with a 15 yo without all this trouble.",
      "id": 58,
      "comments": [
        {
          "score": 8,
          "content": ">  You should be able to leave an 8 yo with a 15 yo without all this trouble.\n\nNot for a week.",
          "id": 59,
          "comments": [
            {
              "score": 3,
              "content": "Maybe for 30 minutes to run a quick errand but a week? Damn I'm surprised they didn't burn the kitchen.",
              "id": 60,
              "comments": [
                {
                  "score": 1,
                  "content": "I agree a week is insane but I was babysitting neighborhood kids at 13.  A 15 year old should easily be able to handle a day or even an overnight.  30 minutes is silly",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Granted a week is a long time, but the 15 yo did a lot of horrible stuff, a lot more than the average 15 yo- speaking as someone with a sibling 7 years younger than myself, I wouldn't have treated my sibling like that",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "You must not have kids and especially not a 15 year old boy lol",
          "id": 63,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "So basically “ESH-Except for your wife...”. Fair enough",
          "id": 64,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "ESH You are a parent, you can put your foot down and veto your wife's decision. Let's be real here, most people wouldn't leave there 15 year old and there 8 old home alone for a whole week together. I kind of think that's neglectful parenting and both your parts. I don't really blame the 15 year old but goddamn he could done better. Your wife went behind your back? Go behind her back, or even better just say \"I am going to do this\"  and get someone to come check in on your kids while you are gone, even a neighbor would have been better than this. Some 15 year olds are mature than others, sure, but a 15 year old who really doesn't want to babysit is worse than one that isn't completely ready for it.",
      "id": 65,
      "comments": [],
      "relation": "Attack"
    }
  ]
}