{
  "post content": "\n\nThis is an ongoing conflict.\n\nYesterday at 11am I was alone at home, DH went to work early and I was just starting my daily cleaning routine when the bell rang, I (f30) peeked through the hole and saw my sister (f36) and her 3 kids (5,3,2) I did not open the door and talked to her behind it and I'll explain why in a minute!.\n\nShe said she had an argument with her chronically ill husband (m34) and wanted to once again punish him by keeping the kids away from him until he apologize to her for what he said which was regular argument stuff.\n\n\n**Explanation || she started doing this when he got sick. Every time she gets in an argument with my BIL she'd take the kids and refuses to bring them back til he apologize to her. He has a medical condition that prevents him from getting outside the house and she is been using that and instead of taking the kids to our aunts house this time she brought them to me since aunt is out of town**.\n\n\nShe asked that I take the kids for 2 days but I refused and pointed out how unacceptable and wrong of her to punish her husband who's already sick and using the fact that he can't drive to go pick HIS KIDS up or at least see them against him (She'd keep them away for days!.)\nShe started talking about how her husband doesn't care about her hurt feelings and how much she does for him. Also how this method has proven to be affective since it got him to recognize his wrong doings and apologize but I replied that he probably was only apologizing just to see the kids. I said it wasn't fair for the kids either but she said they agreed to stay with me and told me to open the door cause they missed me so much.\n\nI refused and said I won't be responsible when BIL finally decides to do something about this and get the cops involved. She yelled she's their mother so the cops won't do a damn thing about it and assured me my BIL would never do that knowing how much she's cared for him but I stood my ground and said I won't be opening the door. Period. She yelled saying I was unsupportive and selfish to keep my nieces and nephew out and refuse to open the door for them.\n\nI suggested she go work her issues out like a rational adult and stop pulling cruel stunts that affects her husband and the kids emotional/mental health. she took offense to that and said I was clearly on my BIL's side. She shamed me infront of the kids for 10+ mins then left. Hours later my dad who lives in another town called shaming & berating me for not opening the door for his grandchildren then insulting my sister and siding against her. I explained my reasons but he said the kids are with my cousin and insisted I go pick them up.\nMy husband said I should've opened the door for the kids and that he could see how dad would be upset with me for not taking the kids in til my sister's conflict with her husband is resolved. He wants me to go pick the kids up but I keep refusing but I feel like unsupportive of my sister.\n\n**more details about my BIL || He has a chronic illness that's gotten worse lately and limited his ability to do most things. To my knowledge he's catheterized, wears a cannula, an a medical device so he can't drive or walk outside the house. My parents never liked him because he was already sick when my sister married him and said she was wasting her life with him but she always say she loves him but I'm not even sure judging by her recent actions**",
  "id": 1,
  "comments": [
    {
      "score": 12113,
      "content": "NTA.\n\nDo not go and pick up the kids. \n\nGet in touch with CPS to explain the situation.",
      "id": 2,
      "comments": [
        {
          "score": 10094,
          "content": "CPS for the kids and adult protective services for the husband.  Both need to be called now.   \n   \nNTA for the OP",
          "id": 3,
          "comments": [
            {
              "score": 4151,
              "content": "Just adding another vote for adult protective services.",
              "id": 4,
              "comments": [
                {
                  "score": 938,
                  "content": "Tacking my vote on for both adult protective services and CPS/DCF. Something tells me that the sister is unraveling and God forbid it get any worse. \"Normal argument stuff\" should never be solved by depriving a parent of their kids. That shit is reserved for child abuse or neglect in my book, otherwise you're hurting the kid in an attempt to punish their parent. If the husband is as reliant on help as he sounds then that help should not be coming from his wife. I mean who is at home looking after the husband while his wife throws a hissy fit and leaves with the kids? And exactly how much resentment gets taken out on the husband when the kids aren't there to see it? I'm concerned that she's getting the kids out of the house so they don't witness how she treats their sick dad, and that she goes full tilt when she's alone with him.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Like how do we know she hasn't left him with a full cath bag and no food/water/ability to get out of bed. NTA, make those calls OP!!!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "And when you contact APS, give them the contact details for his family.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Seriously. What happens when your sister starts holding parts of BIL’s medical treatment for ransom?",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2227,
              "content": "Yes both. The husband is being abused and the sister is an abusive ass hole",
              "id": 9,
              "comments": [
                {
                  "score": 960,
                  "content": "He's being held in a physical and mental prison by a psychotic warden",
                  "id": 10,
                  "comments": [
                    {
                      "score": 579,
                      "content": "And she’s manipulating those childrens minds and opinions of their father and using them as pawns",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 111,
                  "content": ">She yelled saying I was unsupportive and selfish\n\nAnd she has the nerve to say this about op when she is being the same way to her very sick husband.  NTA",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Agreed, she doesn't love him and just there for...IDK, but definitely not love. Poor guy.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Some people like to put themselves in what can be called a victim position. Alleviate their social status, where people would either applaud her or feel sorry for her.. \"Look at her, taking care of this person, putting her life on hold, taking care of the sick husband and kids\"\nThat gives people happiness.. I've personally seen some people like this..\n(There are many truly amazing people who take care of people genuinely and love them, not at all referring to them)\n\nDunno if she is in for same, or she is in love, but what she is doing is mental abuse and manipulation.\nGod knows what she's doing to him after sending the kids away.. am scared for that poor man.. \nNTA, but OP, please alert the authorities",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1457,
              "content": "Honestly I think the call to adult protective services is WAY more important than CPS at the moment. Her husband is the clear target of abuse and neglect. \n\nThe kids are getting shuffled around and she's being an asshole about, but I honestly don't think CPS would make much of a stink about it since they're staying with family members who agreed to take them in, they're being fed and taken care of, and often a situation that is \"just\" emotional abuse isn't enough for CPS to get involved. They need a lot more evidence of wrongdoing besides \"well, their mom is an asshole.\"",
              "id": 15,
              "comments": [
                {
                  "score": 570,
                  "content": "> Honestly I think the call to adult protective services is WAY more important than CPS at the moment. Her husband is the clear target of abuse and neglect.\n\nI would agree with that, I think that both agencies need to be called, and hopefully can protect the husband, the kids, and get the sister the help they need to keep them from getting more abusive.  \n   \n>  I honestly don't think CPS would make much of a stink about it   \n   \nI think that is why both agencies need to be contacted, there is known abuse, and it may be marginal if just CPS was involved, but with the APS also, there may be enough to not take the kids, but get a plan in place to make sure they are safe, and remain safe.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 284,
                      "content": "Having an investigation by CPS could also help APS and show that the children are being used as a method of control.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Agree based on OP's posted version of things.  If she really knows that sister is verbally and emotionally abusing a dependent, sick husband, the call to APS is a must. Mention to APS that the kids are being dragged around and also probably seeing their father being berated and neglected, and see what APS thinks about CPS being involved (APS may make that call themselves once they start investigating....these kids are really too young to get  much out of a verbal interview though).  \n\nNTA.  OP has no obligation to open the door to anyone, especially to be the dumping off point to 3 very young kids who evidently are expected to stay for a few days.  No phone call before to ask?  Just entitled belief by sister that OP will take the kids so she can either berate sick husband some more or maybe just go off, leave him alone, and have fun.  This whole family situation is terribly dysfunctional.  And parents aren't helping by \"shaming' OP for not facilitating the situation to continue just because they never liked their SIL.  These are truly rotten parents from the sounds of it. And I think OP knows that her relationship with sister and parents is pretty much gone (and who would want one with these people) so calling in authorities can't make things much worse for her, but it might help her BIL (who by the way, was apparently healthy and acceptable enough for the sister to give her 3 young children before his healthy went bad....so much for \"in sickness and health.\")",
                  "id": 18,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Given the way OP talks about her sister being their dad's favorite...it makes a lot of sense that she's this entitled to think everyone and everything should be exactly as she wants it and flips her shit whenever it doesn't.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 351,
              "content": "Seconding this. The poor man is being abused by his own wife",
              "id": 20,
              "comments": [
                {
                  "score": 245,
                  "content": "While the kids are being used as pawns. I can't imagine how confused they are. At that age stability is important. To have their lives uprooted for days at a time because \"Mommy got mad at Daddy again\" is awful :(",
                  "id": 21,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Omg this brought up memories of when my mom would take us in the middle of the night. we'd have to sit in a car in a empty dark parking lot until the fight she was in with her (at the time) boyfriend was through. Poor man wasn't our bio father and she used us as pawns multiple times. It sucked bc we didn't know what was happening. Once she went as far as to show me crying saying the kids love you and need you...at his home (lived with another woman at the time if I recall) and he had to take me and put me in his car. Bless him for staying with us but he didn't deserve that!",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 76,
                      "content": "NTA. Also what are these poor kids learning about how to navigate conflict, draw healthy boundaries, and ask for/ provide support during difficult and vulnerable times? Will mom make you feel like a selfish burden if you get hurt playing soccer? Will being unable to take care of yourself make you feel unloved or unlovable? Are disabled people not worthy of love and attention, or deserve to live a life without dignity? \n\nThis lady is screwing up her marriage and her kids, and needs a major “come to Jesus”. The grandparents are enabling this horrible behavior.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Also, God forbid something happens to Dad and he passes.  How screwed up would the kids be then?  I just watched something slightly similar unfold with a family member and he passed and it was awful for the kids.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 136,
              "content": "Yes.  Adult Productive Services ASAP!! and any of his family you can contact.  He's definitely being abused! I'm horrified.  I joke about taking my husband's prosthetic and wheelchair (He's an amputee), but I would NEVER do it!  \n\nFYI: He jokes about taking his prosthetic he doesn't use and kicking me in the rear with it.  We are just joking around.  I've created a corner in the living room where hubs has everything he needs within reach. (Except for going poop, and I offered him a potty chair but he declined.) He's got shelves on one side of a hospital bed and an end table on the other side with everything I can think of he might need.  Food, drinks, wet wipes, meds, spare clothes, salt, pepper, hot sauce, etc.  Everything I can put with in arms reach that he needs that I've come across in the last several years.  Nobody get mad that we joke please.  Comic relief.",
              "id": 25,
              "comments": [
                {
                  "score": 78,
                  "content": "I’m a woman with a disability and dark humor between me and my husband is LIFE. Rock on.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 56,
                      "content": "Agreed. Hubs makes most of the jokes about his disability.  But I'm careful about joking in front of people who aren't familiar with us.  Every Dr appt they ask him about being abused.  The every time he has a new nurse she looks at me like I'm a horrible person.  Til the Dr comes in and asks how many times did I have to beat him this month.  Or something equally horrifying.  :)",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Caregiver here. My husband and I make this kind of sick jokes all the time. Keeps us both sane.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That’s me and my partner! My dog recently went blind and had to get blood work done. The vet tech praised her lack of flinching and I deadpanned “well, she never saw it coming” and chuckled. The tech looked at me eyes wide then started to laugh.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 128,
              "content": "Agreed on APS, it sounds like the sister is at least probably suffering from caretaker burnout and is taking it out on her husband.",
              "id": 30,
              "comments": [
                {
                  "score": 26,
                  "content": "I think you're right.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 3,
                      "content": ">I think you're right.\n\nI agree. The only thing that stops me from feeling like Sis is a monster is that she is seeing to all the needs of four human beings: her husband and her VERY small children. Right now, her husband is most likely not robust enough to help much with child care, and the children are way too small to help take care of their dad. Sister needs a break. I would see if there are any respite care options available that she can pursue. If not, can family members arrange to lend a hand? Sending them food, helping with shopping, or heading over to watch the kids and chat with BIL while Sis takes a day off with some Me Time would all help reduce the pressure she is under. It sounds like you have enough family members to divide up these tasks so no one is overwhelmed while trying to help the situation.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "I second this.  Your sister is so far out of line.  Get CPS and APS involved.\n\nHard NTA",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Jumping in because I was going to say the same thing. A lot of people forget adult services isn't just for the elderly. Your sister is abusing her disable husband and using their children to do it. Op please get in contact with them and if you can any family he might have. Your sister is an abuser and people around her are enabling it just because they don't like your BIL.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Your poor brother in law. Maybe you could help him research legal aid options or contacting some disability advocates in your area.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I was going to say she should pick up the kids and take them back to BIL. But this definitely gets my vote instead or in addition to my suggestion.",
              "id": 36,
              "comments": [
                {
                  "score": 13,
                  "content": "Yes I’m definitely on team ‘take the kids back to daddy’. As well as calling APS and CPS and every and any agency you think could help ie a support charity for his condition or a carers support group.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 792,
          "content": "Unfortunately, they are calling me the crazy one for siding with my BIL but truth be told. He isn't even capable of caring for himself on his own let alone argue or start fights so I'm 100% sure my sister is just being cruel to him for no reason. I tried to get involved but was told off. I saw my BIL during my last visit and he couldn't even get up to greet me because of how sick he is. It's good that my sister takes care of him but she's being unfair to him with what she's doing lately.",
          "id": 38,
          "comments": [
            {
              "score": 693,
              "content": "Op, I am disabled. While disabilities vary greatly, I have been unable to leave the house on my own for close to two years, and when I do get out, it's for medical appointments. I can't help maintain the household right now, and self-care is a struggle. Every day I have to fight to keep my breathing \"okay\", while I try my best to push past the pain and fatigue. \n\nI don't really tell others about this part of my life, and writing it out was harder than I expected. However, I felt I needed to tell you this so you can understand and weigh my response accordingly, knowing I can empathize with your BILs' disability.\n\nOp, you are the only one who is seeing things clearly. Your parents judgment is tainted by their hate for your BIL, and their love for their \"golden child\". They are not reliable witnesses. Between them and your sister, they will make sure to keep any and all family members in line. They will make sure you remain isolated, so that you will give in to doubt as they try to break you down to fall in line, too. You are going to have to decide what kind of person you are, Op, and I won't pretend it will be easy.\n\nYour BIL needs your strength and voice, Op. He is trapped, isolated, and abused; mentally, emotionally, and probably physically (neglect at least). He can't fight, because what would happen to him? Where would he go? I'm sure he already feels like a burden. Deep down, I'd bet he also feels like a failure as a spouse, but moreso as a father. Men often feel like they aren't allowed to ask for help in abusive situations, and being disabled is only going to amplify that. His chronic illness likely saps most of his strength and energy, which creates a type of fatigue a healthy person can't relate to.\n\nThis is why disability advocates are so important.\n\nYour sister has all the power in that house, though she probably feels powerless. She probably started out as a good and loving spouse, but living in a pressure cooker changes people. She carries a ton on her shoulders even when life is good, but add the current state of the world on top of it, and people start to break. When that happens, caring for a disabled person can turn from frustration to hatred, and it gets ugly. It's along the same lines as elder abuse if that helps explain it.\n\nAs problematic as all that is, we then throw three innocent children into the mix. At their ages, they are at the critical formative stages that will have a massive impact on who they will become. A safe, stable, and loving environment are crucial towards a proper foundation. Instead, they are pawns being used to inflict pain and despair on their father. They are constantly removed from their parents home to be left at numerous different places. Your sister is setting up her children to have attachment disorders. \n\nCan you imagine learning that you were a source of pain to your dad? That he would have hurt less if you didn't exist? He hurts, and it's their fault! I'm sure that seems ridiculous, but children always find a way to feel responsible, and they will genuinely think whatever is wrong is their fault.\n\nI know I've written a ton, but we've reached that moment where you need to decide what your role in this will be. Are you willing to stand against your family for the sake of your BIL and nieces/nephews? Someone needs to be their voice. Adult protective services MUST be contacted. You then need to ask them if they will bring in cps, or if you need to make that call separately. Please, don't let this continue and escalate. Somethings gonna give, and it'll be ugly.\n\nI'm sorry this got so long, and I really hope you read it, Op. It took me over two hours to write this while working on my own medical bs. I don't say that for sympathy, I only want to express how important I think your situation is. It's obvious you have a good heart, and I wanted to help explain just how right your perspective is. Does you BIL have family you can talk with? Maybe bring them in as reinforcements? Also, it's going to be hard when your family comes after you, so be ready to block them everywhere. \n\nYou can do this ❤",
              "id": 39,
              "comments": [
                {
                  "score": 133,
                  "content": "I wish I could give you an award. I'm disabled, too, and completely agree with all you wrote and was about to write something similar. u/throwra377657 if you only read one more comment read the one by u/DragonCelica!",
                  "id": 40,
                  "comments": [
                    {
                      "score": 69,
                      "content": "🦄🦄🦄🦄🦄🦄🦄🦄🦄🦄🦄🦄🦄🦄🏁🏁🏁🏁🏁🏁🏁🏁🏁🏁🏁🏁🏁🏁📢📢📢📢📢📢📢📢📢📢📢📢📢📢🟪🟨🟪🟨🟪🟨🟪🟨🟪🟨🟪🟨🟪🟨 \nI’m posting something bright (sorry it’s hideous) in the hope u/throwra377657 sees this and reads u/dragoncelica comment!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "Thank you, this means a lot to me ❤ \n\nWhen I started writing my reply, I didn't see any comments from someone in our shoes, and I felt that kind of perspective might help. I'm not claiming to be the voice of all disabled people obviously, but having your voice backing my own, to the point you kindly tagged op, really made me smile.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Thank you for spending the time to write that out even though it was undoubtedly hard for you.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Maybe it would help for her to take the kids occasionally to give her sister and BIL some time to work on their issues, not as punishment for BIL. And BIL needs to be involved in the discussion.  A disability specialist would probably help both of them",
                  "id": 44,
                  "comments": [
                    {
                      "score": 11,
                      "content": "As someone else has pointed out, sister may be sending the kids away not just to hurt her husband, but because that gives her room to treat him even worse without witnesses. So this strategy would be risky.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 394,
              "content": "Is your sister getting any help? She's definitely in the wrong in this situation, but if she's being for 3 kids under 6 plus caring for her chronically ill husband who, based on your description, needs a fair amount of care, all alone, she's very likely suffering from caregiver burnout.",
              "id": 46,
              "comments": [
                {
                  "score": 189,
                  "content": "That's still no reason to deny her husband access to his kids",
                  "id": 47,
                  "comments": [
                    {
                      "score": 190,
                      "content": "I didn't say it was. In fact, I said she's definitely in the wrong. However, she's obviously struggling, and for the sake of her whole family, it would be good if she had access to services that can help relieve the burden.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 58,
                      "content": "It isn’t a good reason, obviously. It doesn’t absolve the sister of her actions. \n\nIt could, however, help with the underlying struggles which could help prevent these escalations.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 222,
              "content": "Consider your source honey. Your parents are so ableist they consider marrying a disabled person to be “throwing her life away.” This is like taking dog-advice from a cat. On some level your sister learned that disabled people deserve to be treated this way from your parents. Be glad you didn’t inherit the family bigotry and don’t let them make you think it makes you the crazy one.",
              "id": 50,
              "comments": [
                {
                  "score": 23,
                  "content": "Dog advice from a cat, omg. If I had an award I'd give you one for that alone.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 10,
                      "content": "gave my free award to them, so they had one. Because of that comment.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 215,
              "content": "Call adult protective services too then",
              "id": 53,
              "comments": [
                {
                  "score": 122,
                  "content": "[deleted]",
                  "id": 54,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Exactly - what is she’s abusing him in more ways than torment over the children !?? Giving him the wrong meds, poisoning him even. (Not being crazy here : I know someone who was kept sick by their thankfully now ex. And she was grateful for his care for such a long time …)",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I didn’t like that my mind went there but it’s where my thoughts went.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 155,
              "content": "Your sister is abusive. At least there's one decent person in your family.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "Adult protective services.\n\nHe is being abused",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "This is why adult protective services is here.  You don’t have to be the judge and jury.  They may be able to offer other services that would help the family during this stressful time.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Just get a ring and record her when she pulls this again cause I’m sure this won’t be the last time. Then share the video in a family chat and see how it goes. Please include BIL,Parents, YSO, and anyone else who believes you should be responsible in said group chat. If your sister escalates it feel free to post it in Reddit (with children’s faces blurred) so we can all see the shit show. (Don’t do this if you plan on making amends which I’m sure you will cause you sound rational and nice)\n\nAlso you should point out that her kids are going to grow into adults who believe this is how you handle a disagreement, discussion, and any relationships romantic or friendship wise in this manner.\n\nAlso NTA",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Your sister is a psycho. NTA. Using kids as bargaining chips is wrong and they're not even divorced.      \n\n&#x200B;\n\nYet.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "https://www.napsa-now.org/get-help/help-in-your-area/\n\nPlease get him some form of help",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Adult protective services by the sounds of it",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Do it. Go pick up the kids. Then take them right over to their dad.",
          "id": 64,
          "comments": [
            {
              "score": 22,
              "content": "Their dad is so ill he can't get out of bed. This is also a terrible idea.\n\nThe kids need to be somewhere else but not as a punishment for their father.\n\nI mean, ideally, they need to be at home with a mother who doesn't hold them hostage as pawns in emotional abuse but that doesn't seem to be on the table.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "I'm guessing that the sister will be at her house and won't let the kids back inside. That's the issue here. If OP does that, she would have to leave the kids outside. She'd be no better than her sister then. An the sister would just find another dumbass to take her kids in while she abuses her sick husband.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "He can't care for them. What is IP supposed to do?",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Take the kids, take them straight round to their dad.",
          "id": 68,
          "comments": [
            {
              "score": 3,
              "content": "This is exactly what I was going to say",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "CPS is for children who are danger/neglected/being abused. It's not for kids who parents are just using them as a bargaining tool. \n\nOP, please do not waste CPS's time unless you know for sure that your sister is putting these children in immediate danger.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "[deleted]",
          "id": 71,
          "comments": [
            {
              "score": 0,
              "content": "The kids are being abused. It's called emotional abuse. They're taken from their dad days on end for no reason. Now, CPS being unreliable may not do anything about it but don't go around saying what she is doing isn't abusive. It would also help APS in their own reports to support the fact she is physically endangering and emotionally abusing her husband.",
              "id": 72,
              "comments": [
                {
                  "score": 0,
                  "content": "[deleted]",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "And call APS",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I would even call APS also.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Does he have money? Is that why she “loved” him so much to marry a sick man like your parents insinuated? Was she hoping he would pass away sooner rather than later to get his money?",
          "id": 76,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2899,
      "content": "NTA. You have nailed it on the head. Your sister is weaponizing her kids against a guy who CANT FIGHT BACK. The guy is chronically ill and can’t even leave the house to get them. She is abusive, there, I said it. She shouldn’t worry about the cops getting involved, it’s civil at this point, but boy if husband gets a lawyer involved, will he have ammunition against her. Her husband ( if he doesn’t divorce her ) will resent her ( probably already does ), and her kids ( when they’re old enough to figure out what she’s doing ) will resent her.",
      "id": 77,
      "comments": [
        {
          "score": 383,
          "content": "He can't physically take care of himself let alone 3 kids. Don't think he can get custody",
          "id": 78,
          "comments": [
            {
              "score": 501,
              "content": "He can get partial custody. Which means she can’t keep the kids away. He can arrange for the kids transportation to him, and he’ll probably qualify for home care services. Her taking the kids physically away in an attempt to “punish” him because she’s mad, is abusive, and he can probably find a judge to agree.",
              "id": 79,
              "comments": [
                {
                  "score": 205,
                  "content": "If he's so severely ill/disabled that he can't care for himself his chance of getting any custody is less than zero. He will be lucky to get anything but severely restricted visitation.\n\nPeople are incredibly ignorant of the reality that disabled and chronically ill people live with.\n\nHeck, if he's that ill escaping sister and the abusive relationship without ever seeing his kids again will actually be a small miracle and if he does he's likely to live the rest of his life in severe poverty.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 128,
                      "content": "I was wondering if I was the only person going ‘uh…’ in here. People are saying to just drop the kids off. He’s too disabled to care for himself and the oldest child is five.\nAs tragic as it is, unless he had good in home care for himself and them (which unless he has way more money than the average disabled person, he won’t, that shit is expensive) he wouldn’t get any custody. If he did he might have a shot, but without it, no way. Maybe in another reality.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Calling adult protective services wouldn't be about him getting custody. It would be about ending the emotional abuse of the bil and those children.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "He might be able to get alimony/child support to cover at-home care and or help with childcare to get more custody. If he is on a government disability program, he should qualify for a paid at-home caregiver regardless of custody. Even a family member can qualify to be a paid caregiver if they meet requirements. This person could drive him/his kids. A chronic illness or disability shouldn't affect his chance for at least partial custody. As long as he doesn't neglect the kids, can provide for them, and gives them enough support (even if it requires accommodations for his disabilities). \n\nI can't tell if the wife is experiencing caregiver/compassion fatigue, and at the end of her rope because she is overloaded...or if she is genuinely trying to be maliciously cruel. It can be really exhausting to have a chronically ill partner, even without kids! But if she is overloaded, there are solutions for that by getting at-home care help for her husband. There is no excuse for her weaponizing the kids, she is undoubtedly TA. I feel so bad for the husband here. He is isolated, does he have support through this awful situation? Does he feel trapped in this marriage? I hope OP will reach out to him more directly. I have multiple disabilities, I still work and do most things, but do require more support from my partner than a typical person. So I really feel awful for this guy, and hope he gets more time with his kids, and the accommodations he deserves.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "sister shouldn’t be weaponizing the kids against the BIL regardless if he could fight back or not*",
          "id": 84,
          "comments": [
            {
              "score": 2,
              "content": "Right now, the kids are too young to realize how their Mom is acting. When they’re older, they might find out and hold a lot of resentment for not being able to see him, especially if he’s chronically ill.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1371,
      "content": "NTA, there’s something deeply wrong with your families dynamics here, that your Dad is encouraging this is bizarre. It sounds like you need to lay down some firm boundaries with them.",
      "id": 86,
      "comments": [
        {
          "score": 986,
          "content": "Oh yeah, of course my dad is on her side. She's his favorite daughter. There I said it bluntly. What can I possibly do with them? Its helpless and they have been putting more pressure on me and side eyeing me for allegedly siding with my BIL. The man has enough to deal with and doesn't need these pathetic games my sister keeps playing.",
          "id": 87,
          "comments": [
            {
              "score": 227,
              "content": "Show them the results of this reddit post?   This many strangers all agreeing you are the one in the right should mean something",
              "id": 88,
              "comments": [
                {
                  "score": 261,
                  "content": "to a rational person who cares about fairness. Do dad or sister sound like rational, fair people?",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 197,
              "content": "you can help by calling the appropriate authorities (adult protective services and cps) and not turning a blind eye to how abusive your sister is.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 132,
              "content": "Adult protective services is what you can do. And cps for those poor kids who are being dragged into their mother’s abusive tendencies. Your husband needs to see the comments on this post because he NEEDS to recognize that you can’t and shouldn’t have to “fix” this",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "You should have compared the situation to your mom withholding your sister from your dad, and he can't do anything about it until he's groveling at her feet. Since he seems to forget that he is a FATHER. \n\nHow would that make him feel? He'd probably just yell at you, tell you it isn't the same, hang up, but at least you are putting the thought in his head. Call him a hypocrite.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Argh! That’s brutal :(. The stance you have taken is the right one, it sounds like all you will get is hassle for it, that doesn’t mean it’s wrong though.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Pick the kids up and bring them back to your BIL.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I'm sorry your family is so horrid",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Regardless of your sister and dad being awful, abusive people, you need to call Adult Protective Services to report your sister’s neglect/abuse of your BIL",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Call CPS and Adult Protective Services. This is abuse.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "NTA. Listen. Next time you find out she is doing this, skip CPS. Call the police and issue an amber alert for parental kidnapping.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 822,
      "content": "**NTA. What kind of monster is your sister? And apparently the rest of your family for thinking this is ok?? Keeping the children of a chronically ill man away from him so he'll apologize? He probably didn't do anything to apologize for because your sister seems like a easily offended, selfish, cruel monster. She is abusing her husband \\*and\\* her kids. She is teaching them this is how marriage works- use your kids to get what you want.**",
      "id": 99,
      "comments": [
        {
          "score": 120,
          "content": "If he is confined to the bed, what the hell could he have done?",
          "id": 100,
          "comments": [
            {
              "score": 89,
              "content": "I'm not blaming him. The wife should be ashamed of herself. \n\nSince this is apparently normal behavior, I think someone needs to step up and help him get away from his monster wife. Maybe he can call social services or a lawyer or an advocacy group. It won't be long before she's physically abusing him .",
              "id": 101,
              "comments": [
                {
                  "score": 16,
                  "content": "And social services won't care, he most likely can't afford a lawyer and an advocacy group can do nothing. Even if he gets away he'll be living in poverty unless he has some independent wealth already that his wife can't touch in a divorce.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Just when I thought it couldn't get worse, it hit me.  If he is confined to a bed, then he would likely be helpless during an emergency.  Of course we don't know if he is, and he could have a carer.  But she takes his kids away from him because she's mad about something, then deserts him in his bed all alone?  It's like an onion of terribleness, it never stops with the layers upon layers of twatwaffleness",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": ">What kind of monster is your sister? \n\nA garden variety ableist. I'm sorry but abusive behaviour from a partner is pretty standard for a chronically ill person because ableism is the norm in society.",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Yo I want to add something after 2nd edit of post, that BIL is chronically ill and is maybe bound to die, is OP's sister playing a dirty game of mooching on his life insurance/ inheritance which will go to her after his death? That's fucked up on whole another level",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 423,
      "content": "NTA. What the hell is wrong with your sister? Good for you for standing up to this abusive behavior.",
      "id": 106,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 296,
      "content": "Call CPS and APS. This is abuse of all parties, and your sister needs to be reported to the authorities",
      "id": 107,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 250,
      "content": "NTA \n\nYour sister is manipulative against her SICK husband using the kids like that isint good you stood your ground I was thinking you could take in the kids once she leaves drop them back to husbands house and he could spend time with them before she does her shit again.",
      "id": 108,
      "comments": [
        {
          "score": 305,
          "content": "Honestly, I'm not even sure because she said he was sleeping when she took the kids. She already called her friend but she refused to take therm by making excuses.\n\nI'm on perfect terms with my BIL. In fact I'd go as far as to say he's being treated unfairly. Its true that my sister does so much for him as his primary caregiver but she seems to be using this against him which is not okay in any capacity.",
          "id": 109,
          "comments": [
            {
              "score": 166,
              "content": "your sister sounds like a monster, honestly. I don't care how much she does for him, it will never justify what she is doing",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": "Your sister is abusive, no way to sugar coat it. Being a primary care giver does not give her the right to treat him like she does.\n\nPlease contact authorities.. Your family can say whatever they want, but those kids and that man deserve better than this!!",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Honey... If she's taking away the kids to punish her very ill husband into submission, I'm terrified for him with her as his primary caregiver.\n\nAbusers are typically VERY careful to hide their abusive behavior from the outside world to make themselves look good.  If they ARE witnessed showing any abusive behaviors, it's usually the least disturbing and most mild of their abusive behavior. For example, you might witness an abuser berating their victim in public, but they refrain from physical violence until they are alone with their victim at home. \n\nThink of this behavior of as seeing the tip of a iceberg. \n\nAlso, disabled and/or chronically ill adults are significantly vulnerable and are at much higher risk to be victims of abuse or neglect (best estimates are 4-10x more likely).\n\nIf BIL is as sick as you've said, he is essentially trapped with no way out, with no advocate to help him; he is 100% at your sister's mercy because he is dependent on her to care for even his most basic needs. He is probably terrified of speaking up against your sister because he literally depends on her to keep him alive. What happens if he reaches out for help and your sister finds out?\n\nI guarantee, if you are seeing her punish him in this incredibly abusive way (withholding his children), she is doing much more horrifying things to him behind closed doors.\n\nYou need to call adult protective services, yesterday.  Your sister is abusing your BIL, and he needs someone to care.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "You honestly don't know what your sister is doing for hime, whether she's caring for him properly (which is highly doubtful as she's clearly abusive), or whether she's making him sicker than he should be. Frankly I think she is making him sicker, as even IF she isn't neglecting him or doing deliberate acts to make him worse, she is inflicting serious psychological abuse on him at least. Stress, anxiety, and mental trauma has devastating impacts on physical health. \n\nYour sister is a f'kin monster, and if you don't do more to protect your BIL, who is defenceless and unable to help himself, then you will be an AH.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I almost wonder if his health is part of why she married him - seems like she has a real boner for wielding power over other people",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "So I'm confused...where is she when the kids are elsewhere and he's at home? Does she go home and still care for him just w/o the kids? Or is she staying with her kids wherever someone will take them all in..or is she off somewhere away from hubby and the kids??? She expects free childcare from family/friends so she can punish her husband..I wonder if that's really the issue?? Having an affair sounds more in line IMO. What a great wife and mother.🤦🏽‍♀️  /s",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 189,
      "content": "NTA- what she is doing is emotional abuse to both her husband AND her kids.  DONT take the kids anywhere but to their home.  Not your circus not your monkeys.",
      "id": 116,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 179,
      "content": "What the literal fuck did I just read??? \nIs everyone in your family taking crazy pills? Who in their right mind would ever think this was an acceptable way for her to treat her spouse? \n\nShe’s saying you’re unsupportive because you are unsupportive *of her being an abusive ah* \nAnd putting her kids in the middle of this is just the cherry on top of the shit sundae. Honestly I’m baffled that anybody would actually be able to agree with your sister’s bullshit. Truly all I can say is just wtf \n\nNTA and good on you for calling her out. Someone had too",
      "id": 117,
      "comments": [
        {
          "score": 206,
          "content": "The thing is that this has been going on for a while and yes my family, I wouldn't say encourage her but they do support her in doing what she's doing right now. Personally I think she's being unreasonable and unnecessarily cruel and also a user since she's been using the fact the my BIL is sick and can't do much about her actions. It's awful especially when my BIL tells me I'm the only one who understands his situation. Not to mention his declining health and lack of support.",
          "id": 118,
          "comments": [
            {
              "score": 88,
              "content": "Please call adult protective services. She’s abusing her husband!",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 63,
              "content": "Honestly, you are WAY, WAY UNDER REACTING right now!!! This is cruel and abusive! Does she even take care of him when she’s mad? Your parents are absolutely crazy for siding with her and wtf is wrong with you husband?? The only excuse I can think of, that would be sort of valid, is that sister is such a shit show that she should have taken the kids to protect them. Beyond that, I can’t imagine why your own husband wouldn’t understand. NTA!",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I feel for your BIL. I'm chronically sick myself and I wouldn't be able to cope with that kind of crap.\n\nI hope you can find a way to help him. You're NTA at all.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This is so sad. He’s supposed to be able to count on his wife above all others, but instead she’s the worst offender.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I truly hope you do call the services for them all, his just as helpless as the kids. This is horrible.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Plus who tf knocks on a door and ABANDONS their children at people's houses? Because that shit stays with kids. That's what my mom did to me when I was young. Galloped me around town to go fight with her boyfriends and left me to fend off of people's couches for weekends on end. I had years trying to figure out my attachment issues even up to when I got married. You are no orphanage. If she wants to abandon her kids then be prepared for permanent consequences of losing them forever.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 131,
      "content": "NTA\n\n&#x200B;\n\nWell handled.\n\n&#x200B;\n\nIgnore your dad, he is an AH, too.",
      "id": 125,
      "comments": [
        {
          "score": 66,
          "content": "sounds like her own husband isn't much better.",
          "id": 126,
          "comments": [
            {
              "score": 33,
              "content": "Was just about to say this. The fact that the spouse is in support of this wackadoo thinking shared by OP's family is earning some serious side eye from me.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Agreed. NTA. What she's doing is disgusting behaviour, and you've stood your ground and refused to enable her. She's tried to guilt trip you in to caving, and is mad you stood firm. Good on you, if everyone she knows did this, her abusive little game wouldn't last long.\n\nGod knows why your Dad is backing her up, but it's a bad call on his part, and on the friends/relatives who have previously taken the kids in.\n\nIs your sister utterly oblivious that this has absolutely never \"worked\" in the past? She may have gotten an apology, but there's absolutely no way it was sincere, and will just have been lip service to get her to return the kids. 'Punishing' people in this callous, manipulative way does not get them round to your way of thinking, it sets them more firmly than ever against you.\n\nI'm worried about the husband. If this has escalated publicly where she's OPENLY \"punishing\" him by using his actual own children, what are the smaller steps behind closed doors that no-one else can see? Does she punish him by withdrawing food, water, support too? Are the kids just an escalation of this? The fact they're being taken away for days makes me think this is a 'big' argument, and I'm concerned about how she handles smaller arguments.\n\nAll this is besides the fact that CHILDREN ARE NOT A PAWN and should never be used as weapons. They'll be aware of what's going on, are also powerless to stop it, and this will be really, really damaging for them.\n\nNTA OP, but the issues here are much bigger than you not opening the door.",
          "id": 128,
          "comments": [
            {
              "score": 2,
              "content": "Yeah, I would lay bets that withdrawing access to his kids is not the first punishment that she is implementing nor will it be the last. \n\nShe is likely to be withholding adequte care. \n\nPlease get in contact with adult protective services, or if you can a doctor of his or something, just ask them to investigate anything that might not seem quite right, that there is some suspecion that she may be withholding care or experiencing burnout and you are a bit concerned, but you would like to remain anonomous so that you don't experience any blow back if she finds out about it.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "\" the issues here are much bigger than you not opening the door.\"\n\n&#x200B;\n\nWhich made it a very good idea to stay out of it.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}