{
  "post content": "  \n\nMy SO (32M) and I (27F) are expecting our first child by the end of 2020. We’re beyond excited and can’t wait to meet our baby.\n\nWe’re friends with a couple (27F, Amber) (33M, John) who we’ve known for many years by now. They are childfree and have made it clear that they do not want children now or in the future. That is completely fine, and we’re both respectful of each other’s choices. \n\nNow, since we announced the pregnancy John has been teasing us pretty much at every possible moment, saying things like “Such a shame you’ll never go on a vacation again now that you’re having a child”, “hope you’ll think of me sleeping in when you’re up before 6 every day for the next 10 years” and “It sucks that you have to spend so much money on all this child stuff, huh? You might as well wave goodbye to every single paycheck for the rest of your lives.” He also loves to remind us that he will never ever look after our child, because he wouldn’t trust it to behave around their dogs. I was starting to get a bit annoyed with these comments, because they always come out of nowhere and I have never asked them to babysit in the future. However, my understanding was that we were joking around so I let it slide.\n\nLast weekend when we visited Amber and John, he started with the comments again, saying that he would never look after our child and that he was not a childcare service, so if we ever “dumped” our child on him, he would probably just keep it in the garden until we came back. Maybe it was pregnancy hormones, maybe I just had enough, but I ended up snapping at him, saying that he wouldn’t have to worry about looking after our child, because they were at the very bottom of the list of people I would ever trust to babysit. He shut up instantly, giggled a bit and then went back to whatever we were talking about before his comments. It wasn’t mentioned for the rest of the night, so I assumed that everything was fine.\n\nThen yesterday Amber wrote me and said that John had been acting grumpy the entire week, and he had finally opened up about what was bothering him. Apparently, my comment had been out of line, and he was deeply hurt that I wouldn’t trust my child with him. He had only been joking, but my comment was hurtful and unnecessary, he felt.\n\nTo be fair I only said what I said because I was annoyed. We would never hesitate to let them look after our child if they wanted to. And I should probably have brought it up with him in a calm manner before I ended up snapping at him. But on the other hand, I don’t feel like I did anything wrong in standing up for myself.\n\nAITA for telling our friend I don’t want him to look after our child?",
  "id": 1,
  "comments": [
    {
      "score": 38,
      "content": "NTA. I’m childfree too and I would never ever say any of that crap to an expecting friend. My very best friend just had her first baby yesterday and I felt nothing but joy and happiness and was supportive to her through her pregnancy because I love her and respect her life choices. John isn’t a very supportive friend, he poked and poked and poked at you, and I think your reaction was justified. He needed to learn that his jokes weren’t funny.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "Allllll of this",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "NTA he stated before he wouldn't look after your child, and now is mad that you would not let him do it, like what the fuck",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 14,
      "content": "ESH. You shouldn’t wait until you’re angry to tell someone that what they’re saying hurts your feelings. Even if you think they’re joking you should let them know because he’ll think it’s okay to continue making these jokes. He definitely shouldn’t of made those comments about your child.",
      "id": 5,
      "comments": [
        {
          "score": 5,
          "content": "This comment is exactly what i think too. Even if its joking, maybe if you told him sooner that it really bothers you, he might have stopped, or maybe not. But we will never know now. I think you guys should just talk it out.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "NTA\n\n>he will never ever look after our child, because he wouldn’t trust it to behave around their dogs.\n\nSomeone who says that isn't someone who gets to babysit.",
      "id": 7,
      "comments": [
        {
          "score": 2,
          "content": "For real, someone who watches a child should also know to watch and teach a child how to act with a dog. It’s not something they just know.",
          "id": 8,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "NTA - it's fine to joke about the cost of children and lack of vacations and the like.  I would know, I'm child-free by choice myself.\n\nGoing on and on about it every time you meet is just as much an AH move, like the people going on and on to child-free people about how they are missing out and not furthering their genes etc. \n\nNo, you're fine.  He can dish out the lame \"jokes\" all the time, but he can't take one snap back?  Good. When he grows up a little, then maybe he'll understand what happened.",
      "id": 9,
      "comments": [
        {
          "score": 5,
          "content": "Um no, it’s not an ok joke, it’s really annoying. Nobody likes it",
          "id": 10,
          "comments": [
            {
              "score": 1,
              "content": "Oh, it works once or twice.  When your buddy says \"we're having a baby\" you can hoist one and after the congrats you can say \"there went 18 years of vacations\" or \"forget about your fine cigars, it'll be diapers instead\".\n\nYeah, it's expected. It's old and done, but you rib your friend. Once or twice. \n\nHarping on that all the time is the AH move.",
              "id": 11,
              "comments": [
                {
                  "score": -2,
                  "content": "No that’s still not ok.  It’s annoying and honestly just rude.  Let them enjoy their pregnancy and leave the snarky comments to yourself.  Having a kid is huge adjustment in every aspect of life, having friends make jokes like that is not helpful",
                  "id": 12,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I think they meant to say it depends on the friendship. Some people are OK with a little light teasing. If OP and the friend already had that kind of relationship than it shouldn't have been a big deal to joke a few times. If there was no history of teasing then they shouldn't of joked at all. The constant teasing was a dick move regardless. Although I understand her anger, OP should of spoke up sooner and said how it upsetting it was.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA. People that view children so negatively shouldn’t be in charge of babysitting them anyway. He made his feelings very clear and you agreed with him.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA. There is a line between harmless teasing and being a dick. He found it, looked at it, and jumped over it.",
      "id": 15,
      "comments": [
        {
          "score": 4,
          "content": "My dad always told us as kids “once is funny, twice is a pain” when we would tease each other. Know your audience.",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA I'm childfree and his constant comments were out of line. I'm so over people saying they're 'joking' as an excuse for being a jerk",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA you have every right to respond like that. He was hurt? How about how you felt when he said all that crap? It goes both ways. Don't want to be treated like an ass, don't act likr an ass. Pretty simple logic.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA. A real friend would know when to stop making jokes.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    }
  ]
}