{
  "post content": "I ride the bus because I can't afford a car, insurance, gas, etc. I'm 19F and live in the US. For context. \n\nA couple days ago I was on a bus that wasn't that busy. Not empty, but there were multiple unused seats and no one had to stand. I had just gone shopping and had heavy bags that were hard to carry and hardly fit in front of my legs. \n\nSo I sat in one seat and placed my bags on the seat next to me, essentially taking up 2 seats on my own. Since it wasn't crowded when I got on I didn't see an issue and like I said the bags were super heavy and hurt to carry so I wanted to set them down. \n\nThe bus ride was kind of long and as it went on more and more people got on the bus. It eventually got pretty crowded to the point where some people had to stand up. \n\nI didn't ever move my bag or offer the seat to someone. In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know. Also no one said anything to me. \n\nAt the last stop (ended at the bus station where pretty much everyone was getting off) someone passive aggressively told me \"you could have moved your bag and not been inconsiderate and rude. Everyone wants to sit not just you.\" Or something along those lines. I didn't really respond because I didn't know what to say. \n\nThe person who said that never asked me to move my stuff, and if they did I probably would have. So I don't understand how I was being rude? They could have asked during the ride instead of insulting me after it was already done. Busses are also generally first come first serve so I think my behavior was normal. \n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 40348,
      "content": "YTA if there is no seat more yr fucking bag lol. how can u write it and think u arent?.........",
      "id": 2,
      "comments": [
        {
          "score": 13196,
          "content": "Wow - I really thought it would be another one where some creep made her move her bags when there were empty seats because he wanted to sit next to the young girl.  Nope - as soon as the bus fills up you move your stuff.  YOU might rather stand but many people would way rather sit.",
          "id": 3,
          "comments": [
            {
              "score": 2710,
              "content": "If you'd rather stand, leave your bags on the seat and stand beside them.  Two birds one stone.  Otherwise you're just a dick.",
              "id": 4,
              "comments": [
                {
                  "score": 3564,
                  "content": "Don't do that either!!! Seats are for your ASS! as a full time bus rider is you aren't sitting in the seat GTFO and let someone else sit there. That is just as rude a taking two seats to yourself.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1693,
                      "content": "Right? I ride the bus all the time. If your bag didn't pay for fare, it doesn't get a seat. Move. Your. Shit.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "Not really. Heavy bags are much easier to lift from a seat than from the floor, or than a hold in your hands during a bus ride. It would be fine to take up a seat with bags. Just don't take two",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "I feel your rage... and agree while being grateful that I'm no longer a regular bus rider. \n\nI do think there are some exceptions about putting a bag on the seat when the bus is empty, but you have to be situationally aware and proactively move that bag. \n\nI used to get on the bus at the beginning of the line, and it would go from just me and the driver to completely full seats and standing people by the time we were downtown. We'd all spread out a bit and put our bags on the seat. As it got more crowded, we early people compacted down to one seat each and sometimes even stood a few stops early... with our bags. \n\nProper protocol is that the empty seat beside you can be used for an item until the point there are limited seats available. \n\nWhen the bus is more than 50% full, you don't wait to be asked, you put that item on your lap and be grateful that you got to use the seat for half the journey for your bags. \n\nYou know it's time to compact into one seat if you don't see any empty window seats.  That's the time to clear the aisle seat of your possessions in preparation for boarding passengers.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 228,
                  "content": "That’s still kind of a dick move if the bus is crowded. Seats are for people first not bags",
                  "id": 9,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 118,
                  "content": "Or put the bags on the floor like a normal person. She had 2 bags, not 17.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "You’re still taking up two spots. Don’t do this. Move your bags.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "That’s what I would do.  Stand in front of my bags so that I don’t have to carry the weight on my shoulders.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "No, if there aren’t enough seats for everyone to sit, then bags don’t belong on any seats.",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 472,
              "content": "Yeah this post was a wild ride for me, at first I thought it was gonna be OP experiencing fatphobia from someone, then saw the bags thing, thought some creep might get involved, then a wild turnaround when OP admits the bus got full and she still didn’t move her bags (decrepit behaviour). Like a good ol’ Reddit whiplash",
              "id": 14,
              "comments": [
                {
                  "score": 100,
                  "content": "Same! I rode that same wild ride! Fatphobia, to a creep and then, just a YTA. Lol",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 77,
                  "content": "Total wild ride! I 100% thought it was going to be some grody old man wanting to sit next to a pretty young woman and asking her to move her stuff when other seats are clearly available. Crazy how fast I switched from totally on her side to ‘omg how do you not know how to live in a society you ketchup sandwich’.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 9,
                      "content": ">you ketchup sandwich’.\n\nAs a person who doesn't like ketchup, this is an awesome insult! I'll add it to my favorites!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 208,
              "content": "I had to take public transport for 4 years during high school. Schoolbus isn't a thing here.\n\nIt's simple, you have a big bag in a full bus?\n\nYou either put it on your lap or rest your feet on it.\n\nIt isn't difficult",
              "id": 18,
              "comments": [
                {
                  "score": 75,
                  "content": "Exactly! I rode a bus also for about 4 years through uni, yes having bags on the bus sucks, no you don’t get to make it everyone else’s problem. It goes under your feet, between your legs or on your lap in a seat, end of.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Idk how the busses are where you are from.\n\nBut in the middle next to the door we have a small open space for Strollers or people who are wheelchair bound. They are often emty.\n\nAnd have 2 foldout chairs or a small bench.\n\nIf you have a big bag or a suitcase people usually sit there.\n\nIt's like she's never been on a bus",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 93,
              "content": "[removed]",
              "id": 21,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah, I wouldn’t ask someone to move their bag so I could sit down in that seat. People are fucking nuts. OP might be okay with giving up her seat if someone asks but, I’ve been fooled enough times that I’ll just stand, thanks. \n\nOP, what you should have done, at the very, very least is when you noticed there were just a few seats left, you should have made every effort to get your crap off the seat. Put it under the seat, on your lap or stand in front of the bag freeing up your original seat. People aren’t going to ask. YTA for taking too many seats.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 83,
              "content": "Same lol, I can’t fathom not knowing basic bus etiquette and basic human decency of a human taking precedence over your damn shopping. Wth, OP??? YTA, obviously.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Yup. YTA. Sounds like you should get a little folding cart for your shopping trips.",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 49,
              "content": "If you would rather stand, why aren't you standing?    That part made no sense other than as an ad hoc rationalization of her being TA.",
              "id": 25,
              "comments": [
                {
                  "score": 4,
                  "content": "She meant she'd rather stand than sit NEXT TO someone, like when she is the one sitting in the aisle seat.",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "That’s what I thought! Turns out OP is a knob!",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "100% thought this as well and then as it progressed I thought obviously this must be a joke cause anyone in their right mind would realise this was an asshole move. People shouldn't have to ask you... you should have the common sense to do this anyway.\n\nAlso loling at the point where OP says:\n\n>The person who said that never asked me to move my stuff, and if they did I probably would have\n\nProbably would have... this says it all about you OP... YTA.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": ">YOU might rather stand \n\nshe's taking two fucking seats.  she ain't the standing type.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 761,
          "content": "And judging by this post, she seems like she'd be the type to roll her eyes and huff if someone did end up asking  for the seat.",
          "id": 30,
          "comments": [
            {
              "score": 477,
              "content": "No no, if someone had asked her to move her stuff she PROBABLY would have! You’re a real peach, OP.",
              "id": 31,
              "comments": [
                {
                  "score": 94,
                  "content": "The probably had me laughing out loud.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "That part got me",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Well, there was 'barely room' for the bags in front of her legs. She would have been mildly uncomfortable whilst sat down as everyone else bounced and swung around her...🙄 OP has main character syndrome. YTA, OP. You shouldn't need to be asked to move your bags so another person could sit down. You shouldn't need to be told to do the obviously right thing and you shouldn't need to ask people if you're in the wrong for something like this.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Oh I missed that little ditty. It gets even better.",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Yep, it's the \"probably\" that makes her extra special YTA",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 201,
              "content": ">The person who said that never asked me to move my stuff, and if they did I probably would have.\n\n*Probably* would have. If that did happen she would be on Reddit posting, \"AITA for rolling my eyes when someone asked to move my bag?\"\n\nYes OP, YTA in every scenario.",
              "id": 37,
              "comments": [
                {
                  "score": 6,
                  "content": "Right?  I can imagine few people do want to sit next to her if she's openly hostile or derisive to the people around her.  Plenty of strangers sit next to each other on the bus, if they don't want to sit next to \\*her\\* I think that's an admission of sorts.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 337,
          "content": "I take the train to work and will put my bag next to me until it starts filling up. Always give people the option to sit without having to ask you to move your items. \n\nAlso, off topic but huge pet peeve: no matter how empty the bus or train is, keep your feet off the seats. No one wants to sit on a seat your nasty shoes were on.",
          "id": 39,
          "comments": [
            {
              "score": 55,
              "content": "UK here. I take the train to work and am the person who, on the commute home, will say \"please move down the train so other people can get on\" and \"Please move your bag so someone else can sit down\". Don't try to argue with me, it's 6.30pm, I'm tired, I'm a middle-aged woman and I have no Fs to give. I am also the person who, when faced with someone who won't move down the train because they can't see anything to hold on to, tells them to take my seat and *holds on to the handle on the seat they've just taken*. Bonus points if this is a young man.",
              "id": 40,
              "comments": [
                {
                  "score": 15,
                  "content": "My train has backs that flip so you can have a quad. It drives me bananas how many people will flip them to sit with two people on crowded commuter trains instead of just sitting next to each other. There’s a young couple on my regular train who does this and I’ve just sat down in their quad with them a few times at this point since I’m normally getting on as the doors are closing and it’s full. I’m not standing the whole way home after a long day of work.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I love doing this is public spaces\nTo people who are obviously trying to take up more room than they need. Glare at me all you want. I wanna sit and annoying your ass is just the cherry on my ice cream sunday",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 260,
          "content": "YTA- once people have to stand it’s just polite to move your bags so people can choose to sit. Put your bags in your lap if you don’t have room in front of your feet. Do you really not understand that that’s the proper way to do things? It’s just being polite and considerate of other people.",
          "id": 43,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 235,
          "content": "> In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know.\n\nWHAT THE ACTUAL F?\n\n> Busses are also generally first come first serve so I think my behavior was normal.\n\nYeah, for your ass, not for your bags.\n\nYTA",
          "id": 44,
          "comments": [
            {
              "score": 3,
              "content": "But the bags got their first?!     Ah behaviour",
              "id": 45,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 220,
          "content": "YTA - They shouldn't have to ask you. Common courtesy is amazing when applied in everyday life.",
          "id": 46,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 158,
          "content": "I am so happy that this is the top comment. With my mild-ish social anxiety I will never ask someone to move their bag. And it is very common for me to walk the train corridor looking for a seat and seen 5-10 people with bags next to them to block neighbours",
          "id": 47,
          "comments": [
            {
              "score": 10,
              "content": "They should get fined for that , they used to do it in some major cities , but now they let it fly",
              "id": 48,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 152,
          "content": "The phrase 'brought up in a barn' seems to apply here.",
          "id": 49,
          "comments": [
            {
              "score": 57,
              "content": "barnyard animals have better social skills than OP.",
              "id": 50,
              "comments": [
                {
                  "score": 7,
                  "content": "And they're probably smarter too.",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 98,
          "content": "Whenever I take the bus or train and there's either the option for an open seat immediately next to someone or asking someone else to move their bag, I always ask them to move their bag.\n\nThey know what their doing and putting their bag there to deter other people from having a seat. It's just rude.\n\nSo now you can move your bag.\n\nOP YTA",
          "id": 52,
          "comments": [
            {
              "score": 3,
              "content": "I do the same. I hate when people are trying to guarantee that they're one of the last ones on the train without someone sitting next to them. You're not special, move your bag.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "[According to SEPTA (Philadelphia-area mass transit)](https://iseptaphilly.com/blog/Etiquette)\n\n>Still on the topic of seats. You have one human body, you get one seat! Your backpack or purse or groceries has no human body, therefore, does not get a seat. Please use your lap. Or the floor. Allowing all seats to be occupied by humans also helps the aisle and doorway congestion.",
          "id": 54,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21829,
      "content": "YTA.  You don't wait for someone to \"ASK\" you to do the right thing.",
      "id": 55,
      "comments": [
        {
          "score": 11539,
          "content": "I have a feeling this post is the first time OP has ever been held accountable for anything in her life",
          "id": 56,
          "comments": [
            {
              "score": 4097,
              "content": "I wish I had an award, please take this poor man’s award 🥇 Edit: omg thank you for the awardS!!",
              "id": 57,
              "comments": [
                {
                  "score": 807,
                  "content": "Ha, I keep seeing people saying “I wish I had an award, please take this” and someone takes them quite literally, and gives the wisher an award 😂",
                  "id": 58,
                  "comments": [
                    {
                      "score": 309,
                      "content": "The award they were given grants them coins with which they can buy awards :)",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 622,
              "content": "$10 says if the situation were reversed and OP was one of the standing people, they would have been pissed that the other person didn't move their bags",
              "id": 60,
              "comments": [
                {
                  "score": 207,
                  "content": "But but but, they're special....",
                  "id": 61,
                  "comments": [
                    {
                      "score": 64,
                      "content": "Didn’t you read it, they were heavy! I agree with you. I guarantee that if she was looking for a seat she’d be upset.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "I’ll raise you to $11",
                  "id": 63,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "And I’m guessing OP probably also would have fumed in silence about it rather than asking someone to move their stuff like OP expected others to do. Idk about y’all but if I were the person left without a seat on the bus, I would be wary of asking someone to move their stuff. In my mind, if they’re not courteous enough to automatically move their shit on a full bus, I assume they probably won’t be courteous about me asking them to move it.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Bro this is one situation and you guys are sayin this shit? OP is def TA but like, calm down.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "It’s hilarious how people on Reddit genuinely believe they are the moral saviours and punishers of the entitled. She forgot to move her bags on the bus once. Is it that deep? Is it reallyy that deep? \n\nShe’s a teenager who didn’t think, and was a bit rude once. Get a fucking Ouija board and tell the queen. She could be a really nice person idk why people are acting as if she deserves the guillotine. Get a fucking grip\n\nThere’s people, probably even on that bus, who have done a lot worse. She was a bit rude but all of these reddit chronically online moral justice warriors are ripping her to shreds. Stop assuming people character and learn how to be a bit more understanding",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I'm not really a fan of this beat the person who fucked up into the ground approach. Clearly she was wanting to be held accountable because she came here. She was in the wrong, but it's not something that can't be learned from",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "OP is TA in this situation, but this is a stretch and you don't deserve the praise you're getting for it. You've figured out her whole life? You should have a talk show!",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "that is reaching",
              "id": 69,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 474,
          "content": "Especially here in the South (US). We get offended if someone puts us in the position of \\*having\\* to ask. \n\nI will stand for several minutes in the grocery store, waiting for someone to move out of my way, rather than say, \"excuse me\".  If it goes on long enough and I have to say \"excuse me\", then I am mad because they \"made\" me be \"rude\". No, it is not logical, but this is how we were trained, growing up.\n\nI am trying to unlearn this, but that childhood conditioning goes deep!\n\nOP knows she was wrong or she wouldn't have justified using 2 seats by describing how many seats were available at the beginning.\n\nYou messed up, forgive yourself, plan to do better next time, and move on. Everyone makes mistakes. It's only a big deal if you refuse to learn and change.",
          "id": 70,
          "comments": [
            {
              "score": 132,
              "content": "Oh man, I'm glad to hear that I'm not the only one who was raised to just stand kinda close to the person and \"patiently\" wait for them to move. It took me until my late 20's to get out of it and now people get an \"excuse me\" and I continue to where I'm going.",
              "id": 71,
              "comments": [
                {
                  "score": 56,
                  "content": "i have no problem doing this with people but unfortunately when it comes to my cats i am a perennial hostage. \n\nunless i am literally on the verge of peeing myself, i'm completely incapable of getting a cat off my lap. i have stood in doorways holding grocery bags waiting for one of my cats to move. ^i ^need ^help",
                  "id": 72,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I'm am guilty of getting trapped with the cat on the lap and have stood still and waited for her to casually move as well 😅",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Cats are different, their lives are worth that of 10 humans. I'd let my bladder explode before even thinking about inconveniencing my cat for 1 second",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Help? What? You don't need help, you are merely following The Law",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "That’s called cat paralysis.  There is no known cure other than the cat deciding in its benevolence to move and bless you with freedom of movement again.",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "In the Midwest it would be “Ope, I’m just gonna slide right by you, here.”",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Right. I’ve had to learn to voice what I need or want before I’m upset about someone else not figuring it out. OP is still AH for not moving her bags",
                  "id": 78,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Oh I 100% agree that OP is the AH but someone brought up a good point that I hadn't considered as far as her possibly honestly not knowing better. She's only 19 so depending on how long she's been using public transportation, she may have began using it during covid restrictions and took that to be normal bus etiquette only because she's never known of anything else. Just a theory.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Not a “mistake”. A choice",
              "id": 80,
              "comments": [
                {
                  "score": 94,
                  "content": "I’m from NYC, Manhattan specifically. You have 3 seconds before I say excuse me and 4 seconds before I push thru. Anything longer than that you’ve drawn the irate of other New Yorkers and it’s best to keep moving. :)",
                  "id": 81,
                  "comments": [
                    {
                      "score": 5,
                      "content": "What? 7 seconds? Seems about 5 seconds too long. :)",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "Mistake:  an action or judgment that is misguided or wrong. \n\nA choice can be a mistake.",
                  "id": 83,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I haaatee when people do this lol. I don’t have eyes in the back of my head and you have a mouth so use it and tell me to move!!",
              "id": 84,
              "comments": [
                {
                  "score": 11,
                  "content": "Good lord, yes. I also hate when I can feel someone looming by me in my peripherals, but they aren't saying anything, just looking at me like I'm in a zoo. How is saying excuse me rude? Like at all?",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I'd rather someone notify me if I'm in their way.  If I'm concentrating on something, I don't always know if someone quiet has moved close trying to get past.  I don't want to inconvenience you, and will happily get everything out of your way so you can get where you're going and I'll even apologize.  Please let me know.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "As someone that was also raised in the South, I was taught to say excuse me if I needed to get past someone blocking the way.  I can't possibly read the person's mind, and they can't read mine, and they may not be aware of someone behind them.\n\nSaying 'excuse me' is the exact opposite of being rude.  Being rude would just be pushing on by without saying anything.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": ">I will stand for several minutes in the grocery store, waiting for someone to move out of my way, rather than say, \"excuse me\".\n\nThis is the dumbest thing I've read today. Why would anyone accept wasting their own time instead of just telling the other person to move their ass.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Sometimes, people are just in their own worlds and not paying attention, so they don’t mean to be rude. Maybe it’s a Midwest thing, but I also wait but I don’t think it’s rude to say “excuse me” and I don’t get mad because I think it’s rude.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I haaatee when people do this lol. I don’t have eyes in the back of my head and you have a mouth so use it and tell me to move!!",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "lol come to the North East. The closer to Boston you get the shorter the time between patiently waiting for someone to do something they should have done already to someone shouting \"Fucking Move!\" gets.",
              "id": 91,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Thanks for putting my childhood etiquette in writing lol",
              "id": 92,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 412,
          "content": "he didn't ASK me to stop hitting him, so I just carried on.",
          "id": 93,
          "comments": [
            {
              "score": 126,
              "content": "\"If he had just *asked* me to stop firing my pistol at him, I would have stopped immediately!\"",
              "id": 94,
              "comments": [
                {
                  "score": 149,
                  "content": "I *probably* would have",
                  "id": 95,
                  "comments": [
                    {
                      "score": 3,
                      "content": "🤣🤣🤣",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Most people prefer to be hit anyway",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 161,
          "content": "they also don’t actually need to ask for permission to sit down on PUBLIC transportation",
          "id": 98,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 117,
          "content": "Agreed. When she did it initially it was fine since it wasn’t crowded but when it started to fill up it should’ve been her first instinct to move the bags rather than just wait around for someone to ask",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": ">You don't wait for someone to \"ASK\" you to do the right thing.\n\nPerfectly stated.  I'd be interested to see how she'd respond if the roles were reversed and she boarded a packed bus, tired with her heavy bags, and a rider didn't move their belongings so that she could sit...\n\nYTA",
          "id": 100,
          "comments": [
            {
              "score": 3,
              "content": ">Perfectly stated. I'd be interested to see how she'd respond if the roles were reversed\n\n\"I sat on a stranger's bags in a crowded bus. AITA?\"",
              "id": 101,
              "comments": [
                {
                  "score": 3,
                  "content": "Ha!",
                  "id": 102,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "This right here. OP is so selfish it’s just gross.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 42,
          "content": "Hey if someone asked, she PROBABLY would have moved it.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "It really is part of the social contract of living in a society. I'd bet OP doesn't return shopping carts to the corral either. \n\nEver since I started reading on reddit I learn that I'm some type of outlier who thinks about putting myself in the other person's place. It's like the golden rule, two definitions. Treat others the way you want to be treated, or he who has the gold rules. I certainly don't lie awake in bed wondering if doing something nice for general people around me makes me a jerk. I think about how I tried to do the right thing, and it backfired on me, so now I have an awkward situation going on.\n\nEntitled people like this suck. YTA OP.",
          "id": 105,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "As a New Yorker we are labelled rude sometimes but we definitely know the etiquette is move your bags no one needs to ask you to do this.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11903,
      "content": "YTA. Once the bus started getting more crowded to the point where people were standing, you should have moved your bags. You shouldn't need to be asked to do so; it's just common courtesy.",
      "id": 107,
      "comments": [
        {
          "score": 2695,
          "content": "Exactly, N T A for putting bags on the seat when it's not crowded, but YTA for not moving your stuff when there are no more empty seats.\n\nFrom OP's little preamble about why she's taking the bus (you don't need a reason to take the bus, it's a very normal thing to do) and her age, it seems like a new thing to her and she's coming on here to ask about bus etiquette, so there's hope for her yet. But I've definitely had to try manoeuvre bags in the bus or subway to disturb others as little as possible, it sucks, but it's part of living in a society.",
          "id": 108,
          "comments": [
            {
              "score": 612,
              "content": "I don’t even look at it as “bus etiquette”. I look at it as “human being etiquette”. No one should have to ask someone to move their stuff so they can sit down. OP could obviously see other people needed that seat but didn’t care. Also, if someone is inconsiderate enough to leave their stuff occupying a seat when people were standing, why would someone think that asking them to move it would make a difference? If they wanted to be courteous, they would’ve done it already. This post flys all over me. You’re not the center of the universe - it’s not all about you. YTA 100%",
              "id": 109,
              "comments": [
                {
                  "score": 214,
                  "content": "I really don't like people who think like \"I'm going to be inconvenient and the onus is on everyone else for not asking me to stop being inconvenient\"",
                  "id": 110,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah, it's the fact that she was apparently perfectly aware of her surroundings and \"Should I move my bag?\" actually did cross her mind. But then she didn't. That goes beyond a little inconsiderate and into outright selfishness.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Exactly this! If you have to actually ~ask~ someone not to be an obvious dick, you're probably wasting your time and are likely to get a load of abuse for your trouble.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yes! I would be afraid of retaliation at that point. If you’re enough of a dick to leave me standing while your bags have a seat, I don’t expect you to be kind and accommodating when I ask you to move them.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 93,
              "content": "One of the things I’m a little irrationally proud of is how quickly I can get my daughters stroller folded and stowed while entering the bus. When you know you’re taking public transit, you need to plan what you’re going to bring and how it’s going to fit ahead of time.",
              "id": 114,
              "comments": [
                {
                  "score": 11,
                  "content": "Nothing irrational about that. That is a damn high pressure situation that is embarrassing and nerve wracking. I'm a chef and pressure is my way of life, and finnaglin that shit on a bus will stress me out to the point of fumbling and sweating. Respect.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "You should be quite proud of your stroller-speed-folding skills!",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I appreciate someone who pays attention to how they affect others in public. Public transportation and farmer’s markets are always flooded with young new moms with strollers and way too much stuff pushing through the crowds with no regard for the people around them.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 218,
          "content": "Yeah, like, I rode the bus from when I was 18 until I was 35, including buying groceries for two people, so yeah, I'd use an empty seat next to me for my bags, but once the bus is really filling up, you put your shit on your lap.",
          "id": 118,
          "comments": [
            {
              "score": 97,
              "content": "People acting like OP made my transit authority put a cap on how many grocery bags you could carry on the bus. It sucked and it really felt like it was punishing poor people, but you can't take up three or four seats with your shopping!",
              "id": 119,
              "comments": [
                {
                  "score": 43,
                  "content": "Ours does not but they will just pass you by if the bus is busy and you have a lot of bags. I was on a busy bus yesterday with groceries and an elderly woman offered me her seat so I didn't have to stand with them (it shamed a man sitting next to her into moving) meanwhile OP is taking up 2 seats",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Oh wow! In my university town people regularly went home from IKEA trips on the bus. Yes, with furniture packages.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah I've been in this exact scenario many times. Bus fills up, bags go on my lap. I've survived every time.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Or if your stuff is really awkward to carry, leave it on the seat and stand yourself. Just don't take up two seats on a busy bus.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I used to ride a public bus to school (I'm from Europe). When school ended that bus was filled. I'm talking 100+ people crammed on a bus that could legally carry 55 (40 sitting, 15 standing) sometimes. People were sitting in stranger's laps, bags were held above the heads, people were shoulder to shoulder on the stairs next to the driver. If anyone was dumb enough to even consider putting a bag on a seat next to them they'd probably get thrown through the window by a mob of pissed off 15 year olds.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "Sadly, courtesy isn't so common anymore",
          "id": 125,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 52,
          "content": "Agree. Also she says that if they had asked she “probably” would have moved her bags - selfish!",
          "id": 126,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "But also consider - does this happen a lot OP? Because you definitely were being communicated with non verbally. Do you struggle to notice these cues?",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "This. OP knows they should have moved the bag, because she's aware the bus filled up to the point where people needed to stand. Does she also need to be told to move out of doorways and walkways when people are trying to pass?",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Agreed, and it's not even courtesy. One ticket, ONE SEAT. You are not entitled to two. \n\nYTA.",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5590,
      "content": "YTA. You saw the bus was full and didn't move your bags. That's exactly what rude assholes do.",
      "id": 130,
      "comments": [
        {
          "score": 1141,
          "content": "Yep and OP actually gives away that she knows this by clearly stating that when she first put the bags on the seat, there were extra seats. \n\nShe switched from “there’s extra seats so this is ok” (which is reasonable) to “people don’t want to sit by a stranger” (which is unreasonable and a rationalization for selfish behavior).",
          "id": 131,
          "comments": [
            {
              "score": 528,
              "content": "“People don’t want to sit by a stranger” really meant “I don’t want a stranger to sit by me”",
              "id": 132,
              "comments": [
                {
                  "score": 85,
                  "content": "This is it. This is what OP doesn’t want admit to herself so she makes excuses instead.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Ikr? If she wants to talk about how poor she is for having to take the bus, she's gotta get used to strangers. Being poor in America is a very community-oriented thing.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Yep. And no one wants to sit next to strangers, but we still do it anyway since standing isn’t all that great in a moving vehicle.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "[deleted]",
              "id": 136,
              "comments": [
                {
                  "score": 3,
                  "content": "Her point about this was mute because she admitted in the end she would have moved them if someone asked, which means she could have moved them the whole time",
                  "id": 137,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 72,
              "content": ">\"people don’t want to sit by a stranger”\n\nYeah this part was hilarious. If the bus filled up, she just witnessed hard evidence that like 20+ people chose to sit next to a stranger. \n\nIn her head **obviously** the next 10 people suddenly love standing.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": ">“people don’t want to sit by a stranger”\n\n_How do you think public transport works?!_\n\nEDIT: By 'you' I mean the OP",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "Yeah, the other passenger was spot on. Once the free seats fill up, you move your stuff. It’s not rocket science.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "I used to bus to and from work, and the bus was often busy in the evening when I finished. I vividly remember one time nearing Xmas, I'd been working outside all day for 12 hours, freezing cold. Got on the bus and at the very front was a guy with bags full of Xmas presents in the seat next to him. I asked him if I could sit and he deliberately turned his face to look out the window and ignored me.\n\nI hate confrontation and honestly I was too exhausted to put up a fight, so I just stood for the 40 minutes it took to get home.",
          "id": 141,
          "comments": [
            {
              "score": 30,
              "content": "I would've sat on the bag of gifts. :P",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I had an injury and was using a cane.  No seats on the bus available, except one lady had a few bags of groceries on the seat next to her.  The bus was almost full, including standing spots with a hand brace.  I had to stand in front of this lady facing her the whole time while I grimaced at every stop and turn.  She jut grabbed a box of food from her bag and started reading the label.  People can be ridiculous.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I hope you stood as uncomfortably close to him as humanly possible for those 40 minutes and took every opportunity to be thrown off balance and crush all the shit in his bags when you landed on top of them.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I wish I'd been there with you.  The silly thing is that if it had been just me, I might've let him get away with it but for someone else's sake, I'd rip the selfish arsehole a new one.  Yes, I'm a weirdo.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I used to see this one lady who would sit in the reserved spot and would not move when a person or persons needing the space would board. Even if they were in a wheelchair. She would also stick her feet out in the aisle every time the bus stopped and would make people boarding maneuver around her feet. As soon as the bus started moving, she would pull her feet back. She was a real piece of work.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Props to the person who pointed this out on the bus! Honestly seems like she didn't know. Though it seems like very common knowledge that butts go in seats, not bags.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "And most of the people don't want to interact with asssholes hence why nobody asked",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2682,
      "content": "YTA. I would have asked you to move the bag- but not everyone is comfortable with that situation with a stranger. What if they asked you and you said no? It would create an awkward situation for them. Not everyone wants to risk an awkward situation with a stranger in a confined space like a bus. You shouldn't expect someone to have to ask you. If the bus is crowded, you don't take up more than one seat. Period. You weren't TA when the bus had multiple empty seats. But once more people get on you be mindful and put the bags on your lap or the floor. Or at the very least offer the seat to people standing next to you, then maybe keep your bag there if they say no.",
      "id": 149,
      "comments": [
        {
          "score": 393,
          "content": ">but not everyone is comfortable with that situation with a stranger. What if they asked you and you said no? It would create an awkward situation for them.\n\nThis. As someone with an anxiety disorder (clinically diagnosed), this is pretty much textbook me. OP, the people in the bus have absolutely no idea what your response would have been if they asked you. Also, you keep saying you wouldn't have said no. We don't know if you would have moved your bags graciously, or begrudgingly. As someone who is non-confrontational, and an overthinker, if I were a standing passenger on the bus you were on, just laying out all your possible responses would have taken up more energy than just standing on the bus. Now I wouldn't have told you off like that person, but you never know if someone with the same level or worse anxiety than me needed the seat a lot more than you think. And also, you're not entitled to two seats anyway. You paid for one seat, so the extra seat you took should have been open. Your bags in it would have told the standing passengers otherwise.\n\nYTA.",
          "id": 150,
          "comments": [
            {
              "score": 52,
              "content": "Also she only said “probably” would have! Eeesh.",
              "id": 151,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah, I didn't notice the \"probably\" until just now. Yikes.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yes. If I see someone taking up 2 seats on a crowded bus, I automatically think that they just don’t care and they feel superior to others. That is not a person I want to communicate with because I’m sure if I asked, I’d get an annoyed dirty look from them… if not worse",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Didn't even pay for one seat.  Seats are a privilege, not a right (unless you are elderly, pregnant or disabled), and seats are for butts, not bags. YTA.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 379,
          "content": "Yes, the problem with this interaction is that if you see someone like OP who is taking double space despite noticing the bus is full, you already know that you're going to be interacting with an AH, so the chance of an unpleasant experience goes way up.",
          "id": 155,
          "comments": [
            {
              "score": 97,
              "content": "Yup, this. I'd glare at OP, but wouldn't likely say anything. I have asked in an innocent-sounding voice \"is that seat taken?\" , though if im right next to the seat. Forcing the person to answer no or truly be an AH.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yup! Sometimes people are just really oblivious and will be perfectly willing to move their things if asked. Some people are selfishly *hoping* nobody will ask them to move, but they will if requested (I think most seat-hoggers fall into this category). And then there are those who get nasty or aggressive and lash out when asked to move. You really don’t want to be sitting next to this type of person. And you can’t always tell what type of person you’re dealing with ahead of time.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yes! Exactly that!",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I would have moved her bags to the floor without asking.",
          "id": 159,
          "comments": [
            {
              "score": 6,
              "content": "I have seen that happen. It was wonderful to watch.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I once got on a bus and I shit you not, there was a guy taking up four seats. Sitting in one, backpack on another, another very large bag, like garbage bag-sized, on the third, and he was \\*eating his lunch\\* off the fourth. \n\nOh yeah - and he was sitting in the priority area, like directly under the sign saying \"please vacate these seats if they are needed\".\n\nSomeone went to move the huge bag and he *tried to stop them*. Like they were the asshole in this situation. The bus driver finally got up and told him to move his shit.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Absolutely! The entitlement that's ingrained in this girl in WILD. Move your shit, or I'll move it for ya!",
              "id": 162,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Pick up, move to aisle way, sit down. “Not my problem”",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I don't even ask. I just point at the seat and start going to sit. They always move their bag before my ass hits it.",
          "id": 164,
          "comments": [
            {
              "score": 6,
              "content": "In my experience, this works 100% of the time!",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Right. I asked a woman on a bus to move her bags once and I thought she'd kick my ass. I don't ask things of strangers anymore on public transportation. People are garbage.",
          "id": 166,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "So this happened to me once. The train was crowded and I asked “do you mind if you move your bags”? It was some duffels and he said he did mind. I told him seats are for people and not bags in a huff. Afterwards I wish I said “I was being polite. Move your fucking bags or I’ll move them for you”, but it probably wasn’t worth it to get in an altercation.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1753,
      "content": "YTA.  Once it gets crowded you move the bags of your own volition.  It's a courtesy and used to be normal bus riding etiquette.",
      "id": 168,
      "comments": [
        {
          "score": 389,
          "content": "It's also a safety issue.  Seated passengers are safer than standing ones in the event of a sudden stop or crash.",
          "id": 169,
          "comments": [
            {
              "score": 182,
              "content": "Not to mention, someone standing in the aisle may have had a disability and could have been in pain or felt unsteady.",
              "id": 170,
              "comments": [
                {
                  "score": 135,
                  "content": "this. i’m disabled and i don’t look it and as much as i would have needed to sit down, i probably wouldn’t have had the courage to ask op to move their bag. YTA.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Yep. Sometimes people have prosthetic limbs that are not obvious too. It’s good to be mindful.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I was raised that if I'm sitting in a crowded bus and see someone disabled, elderly or pregnant I get up.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Or just been tired after a long day of work.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Yep, I've got fibromyalgia & there have been occasions where I'd just have sat on top of someone's shopping.\n\nLuckily here thete's quite a strong etiquette on buses & passengers would \"get them telt\"! 🤣",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Exactly.\n\nNo one wants to ask because strangers are crazy and they aren't trying to deal with it for the entire ride if you're an angry, or violent person.\n\nThat's why the person waited for you to leave before saying anything.\n\nIf you're on a full bus or train and you've gone out of the way to keep a seat blocked, you're are more likely to fall into the \"this person isn't worth dealing with right now\" category. Not the \"I just feel like standing today anyway.\" category.\n\nYTA",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": ">It used to be normal\n\nbut now OP's bags of new clothes and munchies are more important than other people.",
          "id": 177,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1222,
      "content": "YTA. As soon as you saw people standing, you had to move your bags. You don't need anyone to say that to you.\n\n> In my experience most people don't want to sit next to strangers anyway\n\nThey take public transportation, it is bound to happen. You had to make the seat available not assume what people would want.",
      "id": 178,
      "comments": [
        {
          "score": 336,
          "content": "Yeah, that remark about strangers not wanting to sit beside other strangers is the farthest reach for trying to justify her selfish, entitled behaviour that I've ever seen. Half the seats on every bus, train and subway would remain empty if that was true. Absolute BS. YTA!\n\nEdited to clarify-- strangers always sit beside you when the bus, etc , is full.",
          "id": 179,
          "comments": [
            {
              "score": 118,
              "content": "It's weird to sit next to a stranger *if there are other empty seats*, which is why it's creepy when the bus is empty and someone plops down next to you anyway. But when the bus is full, it's just life.",
              "id": 180,
              "comments": [
                {
                  "score": 26,
                  "content": "yeah, simple as.\n\none person to a “row” until all rows are full unless you’re with a mate, then sit together.\n\nif all rows are full, move your stuff so someone has the option to sit or stand",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 48,
              "content": "Yeah.  I've ridden enough city busses to know it's a lottery to who your riding partner for the day is.  Weird Al even wrote a song about it.",
              "id": 182,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "Yeah, i agree, fine if there are other open seats, do whatever you want with your bags. But saying “there were no other open seats, but people prefer  not to sit with strangers anyway” is olympic level mental gymnastics",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "[deleted]",
              "id": 184,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "yeaaaaah that line rubbed me the wrong way too\n\nif you're a snot about sitting next to strangers you prob aren't on the bus",
          "id": 185,
          "comments": [
            {
              "score": 5,
              "content": "I mean, I don't LIKE to sit beside strangers on the bus, but if there are no other seats, I prefer to sit and sometimes that means beside a stranger.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "What a ridiculous rationalization to attempt to justify her behavior. Like literally everyone else on the bus is sitting next to a stranger except for her because she reserved it for her bags.",
          "id": 187,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "100%! \nI grew up in Brooklyn and was entirely dependent on public transit until I moved. You get used to being VERY up close and personal with strangers multiple times a day. And I’m surprised that OP didn’t have more people up close to them telling them off for being so selfish! Your bags are not more important than humans. \n\nOP, YTA. Please be more considerate of fellow humans.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah, this is so weird to me. Like, I am from a city that has trash public transit so I only ride it when I’m traveling in more functional places where there are decent trains and busses. Even with this limited experience I can observe that people maneuver themselves into and out of seats next to strangers on a continual basis when the transit is crowded. Often it doesn’t even need to involve a real conversation.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah I’m gonna go ahead & admit that I’ve been OP a few times & deliberately blocked the seat next to me on public transit- I remember a time when I was injured & felt that I needed that space to prop up my leg… & I remember another time when I was on the verge of a panic attack, just needed to get home from work, & couldn’t stand the idea of anybody being *that* close to me. \n\nBut I was fully aware in those times that I was being an asshole & that my actions were kind of shitty. \n\nExtenuating circumstances & all that, but our individual problems are just excuses to everybody else. Impact > intent. Being clueless & not noticing the crowd would be one thing, but being aware & still getting defensive when someone brings it to your attention? \n\nTrying to justify (& denying that their actions could be seen as rude) are what makes them the asshole here. It sounds like OP might be bad at handling any criticism, even when it’s truthful or necessary.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 989,
      "content": "YTA and you know it.\n\nIt's fine to have your stuff on the seat when the bus is empty, but you can use basic courtesy when people are standing without a seat available. You're even worse for your comment that if they asked you \"probably would have\" moved your things. Probably? Get over yourself.",
      "id": 191,
      "comments": [
        {
          "score": 186,
          "content": "That really got me 🤣 PROBABLY",
          "id": 192,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 710,
      "content": "YTA. You should’ve moved your bags. Entitled folks like you make the world worse for the rest of us. Seats are for asses not your groceries. They could’ve easily gone ln the floor in front of you",
      "id": 193,
      "comments": [
        {
          "score": 30,
          "content": "I almost down voted you for the assumption that they could have fit. Then I remembered the time I was able to fit an entire trash bag almost bursting with expired-that-day or would-expire-over-break Starbucks food in my one allotted bus seat space with myself.",
          "id": 194,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 575,
      "content": "YTA. It's considerate to move your bags to your lap to give someone the option to sit down. I'm sure that if you were one of those people standing up on a crowded bus, you'd want to sit down and relax.",
      "id": 195,
      "comments": [
        {
          "score": 132,
          "content": "Or on the floor. Wtf. The thing that drove that so far into the asshole territory for me is “most people prefer not to sit with strangers anyway”, ma’am are you out of your mind? Clearly the bus was full and everyone else was sitting next to a stranger just fine",
          "id": 196,
          "comments": [
            {
              "score": 22,
              "content": "Yeah, you're on a damn bus!",
              "id": 197,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": ">most people prefer not to sit with strangers anyway\n\nBy \"most people\" OP means herself.",
              "id": 198,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": ">move your bags to your lap\n\nBut you don't understand, they were HEAVY!",
          "id": 199,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}