{
  "post content": "This is a throwaway and I'm using fake names.\n\nI am 26F and my \"adopted sister\" Ally is 14F. The way we're \"related\" is that my younger brother Michael (24M) has been with his wife Maya (24F) since their freshman year of high school. Maya and Ally had a really bad home life and my mom is very much a \"my home is open to everyone\" type of person, so over that year Maya began spending more and more time at our house, eventually bringing Ally over as well since she was always babysitting. By the time Michael and Maya were 16 years old, Maya basically lived in the guest room and Ally spent after school, most weekends, holidays, and summer vacation at our house.\n\nMy mom and dad say that they love both Maya and Ally like their own children. My other siblings (18M and 16F) also treat her like she's a part of the family. Even after Maya and Michael moved out, Ally is still at their house the same amount, if not more than she was before. Now to preface, I have nothing against Ally. She's a good kid and I make an effort to be nice to her. However, I've never really liked how she was foisted into our lives. She's not actually adopted and she \\*still has parents and her own family\\*. Yet my parents spend so much time and resources on her, it's ridiculous. Everyone else has started unironically calling her their daughter or sister and I've refused. I just don't consider her to be family.\n\nAnyways, I got married recently, which is where the issues start. I invited Ally to the wedding, of course, and she came with all of my other family. When we were doing pictures of the wedding parties, I decided that I wanted one with all of my immediate family (so my parents, my siblings, and Maya, and Maya and Michael's daughter). My mom brought Ally up to come take the picture with us and I was forced to tell her no. My mom started to get upset but then Ally said it was okay and sat down by herself. My mom isn't a very confrontational person so she didn't make a big deal of it but then everyone else realized that Ally wasn't there and they got mad as well.\n\nUltimately, we took the photo how I wanted it because they \"didn't want to do this at my wedding\" but my entire family is pissed at me now. My mom said that Ally cried when she got home because I don't love her, which I don't. I feel like they forced into a position where I had to do an asshole thing by forcing this kid onto me. I don't think I should have to consider her family if I don't want to. AITA?\n\nEdit: After the ceremony but before the reception, the wedding party and both of our close family's took photos. I did not include Ally in this photo session and she sat with the rest of the regular guests waiting for dinner. I did not intentionally exclude her from any of the photos taken. I'm sure she's in some of them from throughout the night especially because she was there with my family. I hope that clears some things up.\n\nEdit 2: Maya and Ally are sisters. Sorry, forgot to explicitly say that in my post.\n\nFinal edit: \n\nThe people who are agreeing with me are starting to convince me that I'm wrong. To the people calling my parents nasty things in my pms or just saying that they aren't good people: you're dead wrong. My mom is the most caring and kind-hearted woman in the world and I should have made that more clear in my post. \n\nTo be clear, I am also not a monster. I don't mistreat Ally. I get her birthday and Christmas gifts every year. However I am starting to understand that I did do a shitty thing by publicly excluding her at my wedding because I wanted it to be how exactly how I imagined, especially because my mom was apparently blindsided by my feelings.\n\nI was 16-18 when Ally started coming around a lot and I didn't form the same bond everyone else did. I never super liked being around kids, including my sister who by all accounts behaved way worse than Ally ever did. But I recognize that she's become a part of our family. And I think I'm going to make more of an effort to get to know her properly, because I do know she is very mature and intelligent for her age.\n\nAlso, I don't mean to minimize what Maya and Ally have gone through. By saying she wasn't physically abused, I moroso meant to explain why she hadn't been legally removed from her mother's house. She does have extended family that actually cares about her but they live at minimum an hour away so she stays with my parents the majority of the time.\n\nThank you for all of your input.",
  "id": 1,
  "comments": [
    {
      "score": 16804,
      "content": "I'm so sorry but YTA.\n\nUnless my math is failing me, this child entered your life when you were 16 and she was about 4 and you already had 3 other biological siblings younger than you but older than her. Your words sound resentful as if you started being neglected at that time.\n\nBut you're taking it out on Ally like her sister/babysitter removing her from her really bad home life as a preschooler was her fault. Like she had designs on worming her way into your family.\n\nThat's not what happened. I hope you understand that. Perhaps therapy could help.\n\nEDIT FOR CLARITY. YTA Because you were a dick to Ally at your wedding. You could have gotten your immediate family photos in a much nicer fashion.\n\nEDIT 2 (because people keep trying to give me information that I already have):I *know* Ally is not adopted. I *know* she is not OP's family. I *know* that Maya is really Ally's sister. I *know* that OP has every \"right\" to exclude whoever she feels like on her wedding day. I *know* she owes Ally nothing. I *still* think she's an AH for the way she behaved. I'm not sure why everybody wants to change my mind about it.\n\nEDIT 3: Michael and Maya's relationship did not start when they were 16. I question my \"math\" because I'm not sure how old people are when they're freshmen. I was 14/15 so I went with 14.",
      "id": 2,
      "comments": [
        {
          "score": 5148,
          "content": "OP seems to be a bit jealous of Ally",
          "id": 3,
          "comments": [
            {
              "score": 3819,
              "content": "No, this is NTA. \n\n\nOP was pretty much grown when this girl started coming around the family. If I was 16-18 and my brother’s girlfriend’s kid sister started coming around I would have pretty much nothing to do with her too. You’re busy with friends and school, then college. \n\n\nThis girl might be “””family””” to the parents/brother, but not to OP and OP is 1000% reasonable for wanting a family photo with the people SHE grew up with.",
              "id": 4,
              "comments": [
                {
                  "score": 2412,
                  "content": "Max she would have been indifferent. Yet she is very much part of the family. While from OP actions seems she really resent this girl. Like Jesus take a picture with the girl and few with out her. I mean wedding pictures are a continues you in/you out so everybody is happy.\nEdit: Omg she already had family photo taken so this was totally uncalled for…  pure free pettiness",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2146,
                      "content": "Nothing adds to past family trauma like being told you don't belong with the family that has embraced you to help you overcome it.\n\nYTA.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1142,
                      "content": "Agreed. My take as well.  She doesn't have to be friends with the girl but that doesn't mean she had a right to be a dick about everything.   \n\nShe used the one moment she had a choice to be a AH.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 716,
                      "content": ">Like Jesus take a picture with the girl and few with out her\n\nExactly, this is what everyone with a brain does.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 448,
                      "content": ">take a picture with the girl and few with out her.\n\nThis is the correct answer.  Some pictures with her for the Parents of the Bride professional album since they feel that way about her, and some without for OP and her husband's album.\n\nThe problem is that I have a feeling the parents would have pushed for her to be in all the pictures her siblings were in, so OP couldn't win.\n\nI do feel bad for the girl.  It sounds like she's stuck in limbo.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 406,
                      "content": "Especially since she's including Ally's sister as \"immediate\" family. It seems intentionally cruel to accept the \"adopted\" child who eventually married into the family but reject the one who has been more or less living with them since pre-school.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 245,
                      "content": "\"Part of the family\" \n\nis different than\n\n\"Part of my family\"",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 113,
                      "content": "Correct. I have shot weddings in the past where there were about 6 different “family groups” could I’ve been done easily but opie made her point.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I don’t think that’s a fair assessment. If she doesn’t consider the person family esp due to the large age gap that’s fine you can’t force a relationship with someone. OP told her she didn’t want her in the picture, which is fine as she isn’t technically immediate family and OP doesn’t have that relationship with her. OP’s mom is the AH for putting Ally in that situation esp knowing the relationship they share and trying to foist one onto them. She was invited to the wedding which shows that OP recognizes the relationship ally shares with the rest of the family. \nSaying he should suck it up and not have his boundary respected because it would make other people more comfortable isn’t healthy behavior. \nThe mom then goes and tries to guilt OP by telling them of Ally’s reaction rather than trying to de-escalate the situation and rather explain why OP responded that way and it isn’t a reflection of the relationship the rest of the family shares with Ally.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Indifferent is having her around - not having her in the photos.\n\nI totally understand wanting a few family photos of just the family. NTA but OP it would have been completely reasonable to do a photo with the family and then ask Ally to be in one afterwards. You don't have to purchase or print the photo with her in it.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It would be so easy to have one with everyone, then say “just the parents now!” and then later get the sibling, then wife and kids. Easy to get a photo without making someone feel like an outcast.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 269,
                  "content": "Wouldn’t that be the same as if, say, the parents had birthed a baby when the other is 16? You’d be busy with school and friends and then college, maybe not have a tight relationship — but most would say it’s an AH move to exclude that baby from your wedding photos, no?",
                  "id": 16,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Isn't it more like a step sibling arrived.? They don't share parents.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 163,
                  "content": "Ally is not an adoptive sister— but the sister of the husband’s wife..you see here in Reddit,  how some people want someone photoshopped out of a picture..",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 60,
                  "content": "She could have done both pictures",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "I said NAH because her family is allowed to be upset at her for her attitude, and they didn't start a fight at the wedding over it.\n\nBut agreed that OP has the right to request the photos she wants at her wedding, and she shouldn't be forced to love and accept someone else as family.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This ⬆️ is why I feel NTA.  \n\nAlly doesn't feel like OP'S family.   That shouldn't be forced on her.  The timing was not great, but honestly when would that conversation go over well?",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "AITA loves virtue signaling, especially preaching about it.",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 533,
              "content": "Oh, but she “has nothing against her!” 🙄",
              "id": 23,
              "comments": [
                {
                  "score": 567,
                  "content": "She doesn't really. She has something against her parents and the rest of her family who so willingly ~~adopted her~~ have been treating her like family for the last eight years.\n\nEdited because apparently nobody knows that the word \"adopted\" doesn't always mean \"legally adopted.\"",
                  "id": 24,
                  "comments": [
                    {
                      "score": 311,
                      "content": "Because *how dare they*",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 492,
              "content": "a very big bit jealous.",
              "id": 26,
              "comments": [
                {
                  "score": 13,
                  "content": "> a very big bit jealous.\n\nDoesn't have to be jealousy at all.\nCould just be irritation that a relationship is being forced upon you. \n\nThis is exactly how it often pans out between step-siblings. Just because one child doesn't like a step-sibling doesn't mean they're feeling jealous.",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 290,
              "content": "I came here to say “imagine being that close to 30 and being jealous of a 14 year old” lol",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 277,
              "content": "I didn't get jealousy I got annoyance.  I got the feeling that op has never liked the girl but has the whole family constantly trying to push girl down ops throat.",
              "id": 29,
              "comments": [
                {
                  "score": 114,
                  "content": "Nothing in the post indicates they tried to push them together. The parents and the rest of the siblings consider the girl family, and she has been part of their lives for years, so the mother naturally thought she would be included in family photos, but when OP said no, everyone went along with what she wanted. And she is very clearly jealous.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I don't see it. We will just have to agree to disagree.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "But she's not actually family so assuming she would be treated as that is pushing her down the Ops throat.  Also the fact that the Op says that she is getting texts and is being nagged about what photos she chose to take on her wedding day indicates that the family are pressuring her and forcing this girl on her.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "This is what I feel.\n\nAnd I think it sucks because people always interpret things like this as jealousy or insecurity.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It honestly reminds me of my mum and her sister's relationship. My mum was 18 and her sister 12 when their mother died. My mum skipped town the second she got the chance, leaving her sister with my grandad who was just in a really bad place and not really able to be the best dad after his wife died. My aunt needed someone to be there for her and neither of the people left in her immediate family could be that.\n\nNow many many years later my mum has very little empathy for her sister. For what she went through. Mostly because she is also caught up in her own stuff about the whole thing.\n\nBut deep down I feel like the 12 year old had the harder time in my family's scenario and that no one cared.\n\nMy mum says very similarly toned things about her sister to how OP speaks of Ally.\n\nIt's painfully familiar.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1201,
          "content": "Ally is technically her SIL’s *sister* and her parents haven’t adopted Ally. OP wanted an immediate family picture with her family. She’s not wrong. \n\nEdit: your math shows she was a teenager and by the time they settled into her house, she was 18, an adult and out for college. Naturally she wouldn’t have bonded with her SIL or her SIL’s sister, like the rest of her family.",
          "id": 35,
          "comments": [
            {
              "score": 432,
              "content": "> she was 18, an adult and out for college.\n\nThat's an assumption on your part. OP doesn't say she moved out at 18 or went to college. \n\n\\>OP wanted an immediate family picture with her family. \n\nThat would be understandable. But it's not what she did. Ally was in none of the pictures. And while I completely understand *why,* it's a cruel thing to do to a 14 year old to her face, in front of others at your own wedding.\n\nI would have judged this differently if OP had said, \"Hey Ally, can you sit out for a few 'formal' pictures?\" instead of this.",
              "id": 36,
              "comments": [
                {
                  "score": 198,
                  "content": "It would make sense to me more if Maya wasn't allowed in the same pictures Ally wasn't allowed to be in but it sounds like ally was really singled out",
                  "id": 37,
                  "comments": [
                    {
                      "score": 302,
                      "content": "But Maya and Michael are married with a shared child? It's a different relationship.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 157,
                      "content": "Maya is her brother's wife. So technically Maya is family.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 76,
                      "content": "Maya is the mother of OPs nephew of course she’s considered family. Maya is her sister in law.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 164,
                  "content": ">And while I completely understand why, it's a cruel thing to do to a 14 year old to her face, in front of others at your own wedding.\n\nAnd plus, it's a *photograph*.  It's not like she's asking OP for a kidney.",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "The real question is how the hell didnt OP see this coming?  Why didnt she talk to her mom about it before the wedding day?",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 186,
              "content": "See, I can agree to this part, but just the way OP words everything. OP is an asshole.\n\nOP clearly holds some degree of malice towards Ally, be it spite or jealousy, who knows.",
              "id": 43,
              "comments": [
                {
                  "score": 19,
                  "content": "The part that really made me mad was OP talking about how Ally already has “her own family”\n\nLike… bitch, what? She literally said her home life was really bad and then insinuated that the people who abused or neglected her were her “actual” family???? Legitimately messed up. Clearly lacking empathy for Ally’s situation in favour of being insanely petty.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 8,
                      "content": "This and the comment before it are everything I wanted to say but didn't. 👏",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "She literally said Ally's family = 1 parent in jail/prison and 1 bipolar mother.\n\nAnd of course Ally's sister... ie OP's SIL. No wonder OP's SIL brings Ally with her.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 65,
              "content": "Except she included SIL and nibling, they aren’t immediate family either.",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Formal adoptions are just paperwork, bureaucracy.\n\nShe's been essentially living as a member of the family for over ten years at this point and certainly OPs mom considers her like a daughter if nothing else. \n\nThis would be like wanting a picture of all the married couples and excluding uncle frank and his girlfriend of 23 years.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 845,
          "content": "OP is asking if she is an asshole for wanting a family-only wedding photo, not for full  psyche evaluation on the situation. In any AITA posts regarding stepfamily, everybody seems incredibly clear that nobody should be forced to be family with someone. That's the question here.",
          "id": 49,
          "comments": [
            {
              "score": 218,
              "content": "Sure, but she’s an adult woman. Does she have to go all the way and humiliate/exclude a 14 yo? Just to prove her point?",
              "id": 50,
              "comments": [
                {
                  "score": 369,
                  "content": "I guess I don't see in the post that she did it to prove a point. She did it to have a family photo. My wedding photos have my aunt's ex-boyfriend, because I didn't want to rock the boat. And I regret it, because I really wish I had a photo with me and my family. It was a really special, missed opportunity",
                  "id": 51,
                  "comments": [
                    {
                      "score": 256,
                      "content": "My wedding photos have my brothers (at the time long time gf) in them. She left him high and dry and now I’m pissed everytime I look at the photos. Same thing I didn’t want to rock the boat.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 187,
                  "content": "This is entirely the mother of the bride’s fault. Photographers and the bride and groom have predetermined sets to photograph based on what the bride and groom want. MOB made it awkward and overstepped by interfering with that plan when it wasn’t her place to do so.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 78,
                      "content": "This! Everyone is saying that OP publicly excluded Ally. But that really only happened because mom decided she had say over the photos. Otherwise photographer would have been calling out specific people etc and it wouldn't have been so \"public\" that Ally wasn't in this or that photo.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yeeessss!",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This! Thank you. The only reason any of this happened is because the mob went against the wedding couple's vision.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 145,
                  "content": "But OP didn't invite her... her mum did. So OPs mum actually caused the humiliation because it wasn't her business to invite her to someone else's wedding pictures... how does no one blame the mum? She could have at least ask OP if it's ok first...",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "You're projecting and assuming. Nothing in the post indicates that any of this was \"to humiliate a 14 year old\". \n\nThat's the thing. It's OPs wedding. This isnt about ally. Ally should feel included enough by being invited. If ally wants a relationship with OP it's up to her to build one. If her parents wanted that it was up to them to facilitate and encourage that. Clearly none of that happened. \n\nOP was pretty clear she doesn't hate Ally. She just doesn't see her as family. And that's fine. Thats OP's choice.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I think you got it backward - by default, the girl was not part of it.  Other relatives tried to add her to it, and OP said \"No\".  Those relatives created a problem when there needn't be any.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 585,
          "content": "But…Ally wasn’t removed from her home, she still has parents and a family, she just chooses to spend a lot of time with OPs family.  She’s not adopted or fostered.  OPs family treats her like family, but that doesn’t obligate OP to do so.",
          "id": 60,
          "comments": [
            {
              "score": 400,
              "content": "No one is obligated to be nice to anyone. We do it because it's the right thing to do and makes the world better for everyone.",
              "id": 61,
              "comments": [
                {
                  "score": 267,
                  "content": "We should always be nice and polite to others however treating them like your own family is not an obligation.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 31,
                      "content": "No one says it's an obligation\n\nNo one says she's even wrong to do that\n\n[But you can be not wrong, and still be an asshole](https://i.imgflip.com/3obhgc.jpg)",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "I'm sorry, but I wouldn't start inviting random people into a family photp just cuz it's a nice thing to do.... fucking ridiculous",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Ally’s father is in prison and OPs own admission, her mother is batshit insane.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "OP said in a comment that Ally's dad is in prison and her mom is Bipolar. OP considers the mom extremely unpleasant to be around \"but at least she isn't being beaten\". So sure, Ally still has a \"parent\" but if the best you can say is at least she doesn't beat her daughter, that's not saying a whole lot.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Ahh yes because you should only be kind if you’re obligated to do so.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Just because she wasn’t removed from her home “officially” doesn’t mean that her parents may not have been terrible or neglectful. Clearly OP’s parents have been more like parent’s to Ally than her own parents ever were.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "No one is obligated to be nice, it’s within your rights to be an asshole. Just accept that you’re an asshole if you act like an asshole and people will view you as an asshole",
              "id": 69,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I think y'all are sheltered if you think only government-controlled fostering is valid.  These situations are exceedingly common and CPS is not universally effective at all.",
              "id": 70,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "It sounds like Ally's home life sucks. Whether it rises to the level that Ally should be removed is another story.\n\nI'm not sure how I feel about this whole story, TBH, and I was in the Ally role when I was high school and even in college. I remember all the times classmates' parents were kind to me. It meant a lot and it still does at my age (late 30s) even though I'm no longer in touch with any of these people. It was never to the extreme of the OP described, but I spent a lot of time at other people's homes. I was given gifts and included.\n\nThat said, I've also seen people in the know talk about how parents who want to foster kids need to consider their non-foster kids. In some ways, Ally is in like a foster kid situation. I think the photo situation could've been theoretically resolved with multiple combinations of people, but the issue isn't the photo.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP literally said in the post that Maya and Ally had a bad home life and that's why they started spending more time at OPs house. \"Bad home\" could mean a lot of things, but I'm guessing if they essentially moved in with OPs family it was pretty darn bad. But a lot of bad parents still have legal custody of their children. A child being removed from the home should not be the barometer for whether they are in a safe and loving environment.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 391,
          "content": "OP doesn't at all need therapy. At all. \n\n This kid is not her family in any way, shape or form. Ally has her own family and shouldn't be in OP's family wedding photos just because she's always hanging out at OP's parents' house.",
          "id": 73,
          "comments": [
            {
              "score": 192,
              "content": "Her family, the people who have taken Ally in and treated her like family, they disagree with your assessment that she isn't family.  Perhaps their opinion on the matter carries more weight than yours?",
              "id": 74,
              "comments": [
                {
                  "score": 338,
                  "content": "They can decide that Ally is their family...however, they can't dictate whether or not op sees Ally as her family.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 172,
                  "content": "So your parents can force who is in YOUR wedding photos?",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 142,
                  "content": "OP is telling us Ally is NOT her family. And she certainly isn't legally. OP disagrees with your assessment that she is family.  Perhaps OP's opinion on the matter carries more weight than yours?",
                  "id": 77,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Perhaps the brides opinion matters more than yours? The bride doesn’t see her as family, that’s what matters here. Yes, the kids feelings got hurt. Yes, It could have been handled better. But just because the mom thinks of the kid as family doesn’t mean OP has to. Mom overstepped by bringing the kid into the photo session in the first place. And if mom didn’t realize that the bride has these feelings in the first place that’s a big part of the issue right there.",
                  "id": 78,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "If that were true then OP would never have posted on the internet explicitly to get the opinions of strangers on the matter.",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "They can make that choice for themselves, not for OP.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "And perhaps the one whose opinion carries the most weight is the one whose wedding it is.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Unfortunately, they can’t make op acknowledge her as family. Op’s family considers Ally as their adopted daughter/sister but op doesn’t. Ally isn’t her family, she doesn’t consider Ally family.",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Correct.  Ally is a close family friend, not a family member.\n\nI feel bad for her, but she does need to realize that.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 343,
          "content": "How is she the ah though. She doesn't owe someone a picture and not wanting some random chick (op clearly thinks of her as such, which is fair) in family wedding photos she'll never be able to re-take, is not some huge ah move. She literally just wanted pictures of the people she considers *her* family. These are her feelings and again doesn't owe ally a damn picture. \n\nI usually use this phrase for dating but let me change it a bit: no one is owed access to your life, and you are not required to consider someone family who isn't.",
          "id": 84,
          "comments": [
            {
              "score": 145,
              "content": "You can take more than one photo. This is not rocket science.   \nTake one with, one without. \n\nHave you ever done wedding photos?",
              "id": 85,
              "comments": [
                {
                  "score": 16,
                  "content": "But how would taking more than one photo help matters? She would still be forcing Ally to leave during a photo. Which would likely have the same result. Her parents would ask why ally isn’t in the next one, and we have the exact same situation with just an extra photo for the photographer to edit and likely for OP to hate when her parents hang it up.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Has the world forgotten how to be polite?\n\nShe could have taken some with Ally and then *asked her* to sit out for some. There are even tactful ways to say it. Ally's 14. She's probably not a moron.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Exactly! Everyone saying “just take multiple photos” doesn’t seem to grasp that it would just be postponing the issue for literally one minute. The minute she asked Ally to step away her mom would’ve gotten upset and she would be in the same situation.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "Finally! Someone who gets it!! I can't believe all the comments calling her an AH. How ridiculous! It's her wedding photos and this is not her sister regardless of how the rest of her family feels. And just like you said, it's once and done with wedding pictures.\n\nI would want family only pictures too. Some with and without in laws even bc we all know a lot of marriages don't last and it's awkward to have wedding pictures up with sister's husband who left her for the nanny 10 years later. Her feelings matter too. \n\n#The way the family reacted tells us a lot about why she feels thrust upon by this girl.",
              "id": 89,
              "comments": [
                {
                  "score": 34,
                  "content": "I don't know why these comments always surprise me but my god you people are immature. I hope the average age in these subs is like 16 because otherwise this shit blows my mind.\n\nShe was a part of their family since she was around *4 years old*. She was taken out of a bad home as a preschooler and has been part of their family since. Paperwork doesn't change that.\n\nThe way you people think Ally should be treated because of what her sister and OP's family did to improve her life is actually insane.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I'm sure everyone advocating here would hate to have someone they didn't want forced into their wedding photos and no amount of insults or bullying your viewpoint is gonna make you right here. \n\nIt's not her sister. It's great what her parents did. But it's not her family for a family picture. She's the bride, she decides who she wants in her family picture.\n\nJust because her life is sad and the parents let her stay does not mean she belongs in family photos of someone who doesn't consider her family. They weren't even raised together ffs. She's a girl that stays part time at her parents' house. She owes her kindness in daily life but not a place in her family wedding photos.",
                      "id": 91,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Exactly. This moment alone, OP's own mother doing this whole bit and making a huge deal out of it makes me feel bad for OP. \n\nWhen OP asked Ally not be included because she only wanted family, that would have been the end of it. But OP's mom decided to be an AH to her own daughter and feels Ally's more important than what her own daughter feels.\n\nOP, try looking for a therapist to help you process how you feel about Ally and your parents taking her in. I felt this way growing up too, and I still feel it today. It's such a complicated feeling, not being angry at anyone but the circumstances, and then your own parents being mad because you don't feel the same way they do about people... sigh. It's the feeling of having your own parents always choosing everyone else but you.   \n\nNTA OP. I only felt peace in my heart when I let go of the expectations I have of my parents ever caring about how I feel. When I realized this and accepted this, their selfish actions could no longer hurt me and life is better.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Totally. She isn't even obligated to include in their special photos a family she doesn't like, less someone that she doesn't feel is part of her family.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Finally one persom who agrees.OP wanted a picture with her family.Ally wasnt really adopted,she spent a lot of time at their home.She kinda came in as a package with Maya.OP was always nice to her,but that doesnt mean she considered her as close family. Also the OP's mother brought in Ally in to the picture,it wasnt the OP's choice.Making a whole wedding about some girl who the parents half adopted is more the AH move.Also there were probably more pictures where Ally was in.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "Op's parents should be given a medal for being such caring people. Op has no clue as to how bad a \"bad\" home life can be. No telling from this story what those two girls were going through.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "She was 6 OP was already 18.",
          "id": 96,
          "comments": [
            {
              "score": 14,
              "content": "By the time Ally was there all the time. She came into their life when Michael and Maya started dating freshman year. That makes them about 14, OP about 16 and Ally 4.",
              "id": 97,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "I agree. I was Ally at one point in my life - I had an extremely dysfunctional family situation due to addict parents and I found myself at 13 suddenly being fostered by my older cousin and her boyfriend. The boyfriend's family initially welcomed me with open arms and I considered them the family I had never known, I loved them so much. And then I got rejected due to my cousin's boyfriend's little sister (who was the same age as me) resenting me for being treated like an adopted family member. They practically ghosted me overnight when I was 16 and it fucked.me.up. 10 years later I am SO glad to be over that but it left me with some serious trust issues. \n\nAlly is a child. She is hurting because of her dysfunctional family situation. She already is feeling probably confused, rejected and unlovable and kids from those backgrounds deserve even MORE love and care, if that's possible.\n\nPlease stop resenting her, she did not ask to be put into this situation and what's so wrong with her being in one photo? Put yourself in her shoes and ask yourself if you'd be hurting, if your chosen family suddenly didn't want you in their photos anymore.",
          "id": 98,
          "comments": [
            {
              "score": 6,
              "content": "Thank you for sharing this. I am glad you are feeling ok now. The lack of empathy in this thread is appalling.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "You’re right. I have an older brother who was actually just my older sisters friend. He was sleeping in his car to avoid going home. He started to live with us off an on for a few months and after awhile he started to bring his younger brother too. While we’re all adults now and don’t talk daily anymore, we still consider each other family. Especially the original “big brother.” I’ve been calling him my brother since I was 12. Families grow and change. OP has a weird issue with a girl who was basically a toddler when she joined their family. Also the comment about how she “has a family.” Is so wildly inappropriate. Everyone hears about children that are neglected and wonders why no one stepped up to be there for them. OP would rather this child be neglected than let her be part of the family. She got what she wanted, this kid was not in her pictures. But then she doesn’t get to turn around and be shocked when people are mad at her. YTA",
          "id": 100,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6905,
      "content": "YTA: you said this girl has be living with you and your family for 8 of her 14 years (since your 24yo brother was 16). more than half of her life, and basically a 3rd of yours. that is a LONG time. On top of that you let her sister in the picture. \n\nyou say you wanted a picture with your \"immediate family\" but included Maya (the girls sister) and Maya's Daughter (the girls niece) who, despite being the spouse and child of your brother, are would not be considered \"immediate family\". you basically included every important person in this girls life in the picture, but not her. \n\nIm normally very much on the side of \"its your wedding, its your call\" but this seems like you are being unnecessarily cruel to a child that clear is in an already horrible situation.",
      "id": 101,
      "comments": [
        {
          "score": 2396,
          "content": "That makes no sense - the spouse and niece are considered immediate family. Not the sister-in-laws sister though. And that’s what Ally is officially and also for her. How come this sub is always on “you can’t make step siblings like each other” but is so harsh on this one now.",
          "id": 102,
          "comments": [
            {
              "score": 1548,
              "content": "Definitions of immediate family can vary but I believe it’s generally regarded as parents, siblings, and children. In-laws, nieces, nephews, and cousins fall outside of immediate but likely still regarded as close family.",
              "id": 103,
              "comments": [
                {
                  "score": 381,
                  "content": "I don't consider my sister's husband to be immediate family much less his parents or brothers (who I've met only 2-3 times, it's rare they see both sides of the family at once)",
                  "id": 104,
                  "comments": [
                    {
                      "score": 11,
                      "content": "You might not see yours, this girl has been living in the OP’s family’s house since she was 4.",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 302,
                  "content": "Op's parents took on the role of parenting and supplying a home for these two girls. In my book that makes them the parents and her the child. Legal adoption is not the point here, op's parents adopted these girls regardless. She would be in my wedding pictures for sure. Some would call it compassion for two children than left a bad home into the hands of a \"mostly\" caring family.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 124,
                      "content": "thats how i feel about it, if the only thing that stops her from being adopted at this point is paper work, then shes already adopted. \n\nthe parents may have wanted ot formally adopt her and the real parent didnt let them. there are a lot of shitty parents out there that will let someone else raise their child for them with out actually giving them p for adoption. this seems like one of those case. \n\nthe people arguing that shes not family are arguing semantics. if it walks like a duck and quacks like a duck, its a duck.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Yet when all was \"taken in as part of the family\" op was almost an adult. She has every right not to see ally as a sister or family member",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "So at *your* wedding, have that person there",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 155,
                  "content": "Yes but she's NOT regarding her like that.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 27,
                      "content": "But she’s the in-law’s sister, not an in-law. And unless I missed something, she was not “living with them for 8 years”. She was just hanging out there.",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "It seems like the problem in the family was that op didn’t consider her a sibling and didn’t love her, not just because of the picture.",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 590,
              "content": "I am surprised at the reaction on this one. First off, huge assumptions are being made about OP resenting/being jealous of Ally, they never shared that and it doesn't sound that way to me, very simply as OP shared, OP doesn't see her as a sister/daughter, while her other family does. Second, it was OPs wedding. This sub loves backing up brides who make decisions for their wedding because it is their day and their decision. OP, the bride, wanted a picture with select people. Her family may view Ally as a sister/daughter but OP doesn't. Maya was in the picture because that is her brothers wife and the mother of OPs niece.\n\nI feel like if worded the right way this posts top comment could easily have been NTA, just so happens the YTA comment got momentum first.\n\nEdit: OP does mention her disagreement on her parents spending time/resources on Ally, I don't view that as resentment, I saw it as disagreeing with their choices.",
              "id": 113,
              "comments": [
                {
                  "score": 105,
                  "content": "She could have definitely taken picture with her immediate family (excluding Ally) and another with Ally. Making her sit the whole session out was unnecessarily petty. Even more so when it would have made the whole family happy. This is such an easy compromise too. She can just have the picture taken for the sake of it and NEVER look at it or use it. I don't believe wedding photographer bill by the picture yet lol\n\nAs someone pointed out, the thing with weddings is that you can do whatever the heck you want but you have to live with the consequences. And OP chose to piss everyone off and make a young girl feel bad to avoid one consensual picture. \n\nThen again I'm leaning towards soft YTA because she doesn't seem to have done anything to make that rejection any smoother - and a 14yo girl's emotions can get big over sometimes like this. It's not really gracious or graceful from how she told.us the story.\n\nChoose your battles I guess?",
                  "id": 114,
                  "comments": [
                    {
                      "score": 234,
                      "content": "From the story it seems OP got the people she wanted together and her mother invited Ally, causing all this. Totally agree with living with the consequences but in this case OP is getting my vote, it is THEIR wedding, if she has a reasonable wish within her power/rights as a bride, it is others job to accept those wishes. \n\nThe situation sucks for Ally, I agree it would have been pretty easy to get a few with her afterwards, but I also can see that being overlooked after the surprise/stress of her being invited up by someone else. I can also see OP just flat out not wanting to do that and I think that is her right given this is her wedding, not Ally's. \n\nOP shared she wasn't excluded from any other photos, seems just these ones and as someone who used to work at weddings, it is very common to have 1 or more photo sessions within the wedding with select people.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "If she had decided to take two pictures the reaction would likely have been the same. OP wouldn't be able to win in the situation.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 101,
                  "content": "Actually, they did share that. They resent that their parents spent time and money on Ally. They resent that they had another sister who they “didn’t” need added to the family. \n\nThey were crystal clear about their resentment of that child.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 85,
                      "content": "I didn't read it as resentment, more as not agreeing with the situation but to each their own!",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "The word “foisted” made it pretty clear to me. If you think someone was foisted upon you when your parents were just taking in a suffering child, you’ve got resentment. And complaining about resources spent on her. Very immature grasp of the situation, imo. I’d be proud of my parents, while OP is angry at them and the child.\n\n&#x200B;\n\nYour wedding day is special but you’re not the absolute queen of it. People make too much of weddings and wedding pictures. I wonder who was paying.\n\n&#x200B;\n\nAlso, a better photographer would’ve known how to take different combinations to get Ally in one or two. The parents can buy those prints; the bride isn’t obligated to pay by the photo taken. Photog sends all the digital pics with a watermark, then it depends on the package you’ve chosen.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "this is literally the definition of extended family.",
              "id": 120,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I am sure the definition could vary, but it typically does not include niblings.",
              "id": 121,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Of course not. They are extended family.",
              "id": 122,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 337,
          "content": ">you are being unnecessarily cruel to a child\n\nThat's what gets me - it would be so easy to include Ally and it would probably mean everything to her. The poor kid has had a rough time and being considered family by OP's parents is probably the best thing that ever happened to her.  OP wants to shit on that for no great benefit to anyone except her own bruised feelings.  Why be small and mean when it would be so easy to be generous and gracious?",
          "id": 123,
          "comments": [
            {
              "score": 125,
              "content": "Yeah this is the core point for me. Especially because this girl has been and will be around the family for a long time. It's not like your brother's new girlfriend of six months who everyone is insisting be in the family photo or something. \n\nOP doesn't have to feel she's another sister but she seems to be unusually unfair, dismissive and a little cruel towards her to the point I feel there's missing information.",
              "id": 124,
              "comments": [
                {
                  "score": 11,
                  "content": "This. Take the damn picture with the kid and later request for a picture however you want. OP sounded nothing less than jelly of the kid, which is absurd imo and I hope it’s just a misunderstood tone in Reddit once again.\n\nAnyway OP, YTA, kid did nothing for you to treat her like this",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "According to this sub, because doing anything you're not legally required to do is just pandering to people who want to make everyone else's events all about them. People really treat this sub like it's \"am I legally required to\" rather than AITA.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": ">Why be small and mean when it would be so easy to be generous and gracious?\n\nexactly this!",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 285,
          "content": "Ally’s been living with the parents’ guest house not with OP. She was 18 when Ally settled in fully. OP’s immediate family is different than her younger siblings’ lol",
          "id": 128,
          "comments": [
            {
              "score": 16,
              "content": "And further, she hasn't been living at OP's house at all, OP stated she was there during the holidays and school break and such, not just permanently staying at OP's house like the other commentor suggests. She literally still has her family that she spends *most* of her time with.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "A lot of people take various pictures without every extended relative in them.  There’s nothing inherently wrong with that as long as it was said gracefully.",
          "id": 130,
          "comments": [
            {
              "score": 204,
              "content": "> as long as it was said gracefully.\n\nbased on ops rhetoric, i doubt it was.",
              "id": 131,
              "comments": [
                {
                  "score": 5,
                  "content": "the way these always go is the photographer will have a list and will shout out groups \"okay bride's family, just sisters, groomsmen, mom and dad, moms, dads...\" so this was probably specifically cited as \"the family photo\" and it excludes 1 single person. That sucks.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 114,
              "content": "OP didn't even include Ally in *some* family pictures and not all; she was in none of the staged photos. At a minimum they could have taken some with her and some without.",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Except she took no formal ones with Ally at all and did include the niece they share",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Freshman year of high school is 13/14, so it's been even longer.",
          "id": 135,
          "comments": [
            {
              "score": 19,
              "content": "Brother's freshman year, OP is 2 years older than the brother and Ally didn't start coming over immediately, it was a few years, the math of OP being around 18 is correct",
              "id": 136,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "[deleted]",
              "id": 137,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Ally doesn't live with them.  She spends all her free time with them.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "She is not living there, she has her own parents and her own home.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Spouses of siblings and nieces/nephews have absolutely been included in every immediate family wedding photo that I have ever seen. Siblings of in-laws have never been.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5746,
      "content": "Against the grain a bit but NAH\n\nJudging by the ages, you were practically out the house when Ally became a factor into your family's lives. It does seem like you didn't have a chance to develop the same relationship with her as the rest of your family.\n\nShe is family to them. She is not family to you. That is not really anyone's fault, but kinda how the circumstances came out.\n\nYou have no official relationship and no personal relationship. While you could have taken the extra photograph to keep the peace the day of, the fact is, you would have felt weird including someone neither you nor your fiance consider family in a photograph, and likely preferred the photograph without her as is. If that's the one you chose to display at any point, it's just tabling the same fight for another time. She was essentially invited to keep tge peace, as is, not because you wanted to celebrate your wedding with her. You just didn't mind her coming along. It's your wedding day and supposed to be celebrating with family and the people supportive of the couple- which Ally technically is not because you guys have no real relationship. \n\nThere might actually be a slight A H to the parents- if they want you to accept Ally as a sister, what have they actually done to build a relationship between you guys? It kinda seems like they expected you to just have one, and it doesn't work like that with older children. We actually see a lot of that in this sub with step and half siblings- this is really the same scenario. OP just has no personal relationship to Ally, so it makes sense OP would feel weird about a stranger to her being in the wedding photos",
      "id": 141,
      "comments": [
        {
          "score": 1489,
          "content": "Finally a reasonable response",
          "id": 142,
          "comments": [
            {
              "score": 1395,
              "content": "Yeah this thread really is highlighting how hypocritical this sub can be. Any child under 18 isn't expected to be forced into a \"step sibling\" relationship, or the parents are assholes, but if you're an adult youre immature and an asshole for the same thing they would excuse if you were just a tad bit younger. \n\nAdults are also allowed to not be forced into \"step/adopted\" relationships just like children are. You cannot force a familial bond that just isn't there and its gross that all these commenters think that you should.",
              "id": 143,
              "comments": [
                {
                  "score": 634,
                  "content": "Agreed! My mother remarried when I was in my 30s. That man is not my step-father. His kids are not my siblings, and their kids are not my nieces and nephews. Sorry not sorry. They can be her surrogate family, but they don’t have to be mine. Obviously she is quite involved in their lives, and she’s grandma to those kids. It’s OK for members of a family to have differing versions of their immediate family.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 123,
                      "content": "I feel this so much. I went NC with my mom because I didn't want her husband (who she married when I was 22 and while we lived in separate states for years, who was also an alcoholic and had physically abused my mom) at my wedding. She said I was disrespecting my step father and so she disinvited herself from the wedding as well. I'd never consider him a step father even if he was a good guy. I was raised by my bio dad and I do not need another father figure in my life thank you.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Agreed. My husband's mom abandoned him and his family when he was very young. She's resurfaced and is trying to rebuild their relationship, three decades later. Her new fiance is not going to be my husband's stepdad and will be no relation to me and my kids. Definitely not their grandpa. Sorry, random dude being introduced into our lives does not equate family member.",
                      "id": 146,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I'm in the same scenario and honestly his kids forget I exist and I them.  When we see each other we are kind but it's rare we ever do.  Theyre just strangers to me.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Posts like this really make this subreddit look like a joke. Which it kind of is.",
                  "id": 148,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 284,
              "content": "Seriously I had to scroll much too far to see this. People saying Y T A are on some kind of trip. Just because someone spends the majority of their time at your house doesn’t mean you have to call them family. Ally is also old enough to understand that she’s not immediate family.",
              "id": 149,
              "comments": [
                {
                  "score": 17,
                  "content": "I had friends that basically lived at my place growing up because they hated being home. Does that mean they are my siblings now? \n\nThis is 100% on the parents for not communicating clearly and helping their kids understand the situation and helping build the relationship",
                  "id": 150,
                  "comments": [
                    {
                      "score": 19,
                      "content": "All the people YTA’ing OP are just conveniently ignoring that her mom was the one who caused the scene in the first place… like obviously, her mom didn’t pay attention to her kids enough to know OP wasn’t down with Ally… OP said her parents were not neglectful but they sure weren’t observant either.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "Yes exactly.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Agreed. But that is just how AITA works.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Agreed",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 652,
          "content": "Yeah, I gotta agree with your assessment, although I’m going with NTA because I feel her parents were being A-Hs. \n\nI don’t think all the Y-T-As are taking into account that OP would have been 16 when Ally first came around and 18 when she started being there more often. A 16 year old isn’t going to want to hang out with a 4 year old. For one, she was probably busy with her friends, school, part-time job, after school activities, etc. Plus a 16 yo just wouldn’t want to hang out with a toddler unless she was being paid to babysit. Then at 18 she would have left for college. \n\nOP’s family bonded with Ally, but she didn’t. They can’t blame her for not feeling the same level of attachment. OP wanted family photos and *to her,* Ally isn’t family. OP’s parents should have understood her perspective instead of assuming there was a bond when there clearly wasn’t.",
          "id": 155,
          "comments": [
            {
              "score": 450,
              "content": "I find it so sad that OP's family really know so little about her/think so infrequently about her that they didn't even consider she might feel differently than they do on this subject. OP is right to feel a level of contempt for Ally because it's obvious she replaced OP in the family when OP left home. They literally cared more about Ally's wishes than OP's at OP's own wedding. Grotesque!",
              "id": 156,
              "comments": [
                {
                  "score": 191,
                  "content": "I'm surprised how many people are ignoring this side.  I also wouldn't be surprised if they went on about it and made Ally cry.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 259,
              "content": "Agreed, not only that, but op's mom was the one who invited Ally to the photo, to me she was the ah\n\nI don't know is OP mothers is blind or oblivious, because I don't believe that this is the first instance in which OP let the family know that OP and ally aren't close \n\n\nAre the family really paying attention to OP",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "Plus the talk of all the resources spent on Ally suggests to me that either OP is jealous or OPs family has done things for Ally that they refused to do for OP (or flat out turned down OPs needs/requests for help due to Ally’s needs). None of this is Ally’s fault of course. \n\nIn the best case the parents failed to manage the relationship and should have known Ally was like a strange and in the worst OP has had to struggle financially because of her parents taking Ally in (or the way in which they’ve chosen to care for Ally), which makes me think of another post where some parents took in like 6 foster kids and in the process made their own child unwelcome at home.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Not to mention pushing the issue. They sound completely oblivious to OPs feelings which makes me wonder if a bit of jealousy may actually be warranted.  It's not Ally's fault that OPs parents alienated their own daughter, and it sucks she's stuck in the middle.   Yes it's great that the parents helped the kids, but it must suck for OP that they have so little idea of OPs feelings and are so in live with Ally that they helped create this situation. I wonder if they made an issue of it on the way home and that's why Ally cried.\n\nI'd go with ESH except Ally because the situation was preventable in multiple ways.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "The family really should have had the entire discussion about the matter well before the wedding.  The fact that it came out at the wedding because no one even asked makes it kinda rude, imo.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 434,
          "content": "Agreed. I feel like the parents not having any boundaries is the actual issue here. Unofficially adopting a girl who has a bad home life seems kind on paper but in real life doesn’t help the girl. And then OP doesn’t have an obligation to have a relationship with them, just like how no one has an obligation to love anyone else. She’s not even an adopted child, just technically a really close family friend who she doesn’t know well.",
          "id": 162,
          "comments": [
            {
              "score": 242,
              "content": "How does it not help the kid? Having a safe space to escape to probably meant a lot to her and changed her life.",
              "id": 163,
              "comments": [
                {
                  "score": 25,
                  "content": "Clearly she would have been better off in the hands of CPS, or so that person seems to think",
                  "id": 164,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I think this person is referring that since she is still underage she still needs the legal approval of her parents for certain things. like tomorrow their parents could decide to move to another country and even if they don't care about her they could still take her and there's nothing OP parents could do because they (I'm assuming) didn't do the work to really keep her safe",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Very few children are actually better off in the system.",
                      "id": 166,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "That's a hell of a dice roll when you have a caring family that loves you, minus op lol. The system is notoriously bad for kids and they sometimes have to rehome several times. Or get severely abused, repeatedly. So while it might not be perfect for the family, your statement is just false. It's essentially a 75-80% if not more guarantee of a good, \"normal\" life with OP's family. Probably like 20-30% chance within the system.\n\nAlso: \"Up to 80 percent of children in foster care have significant mental health issues, compared with approximately 18 to 22 percent of the general population.\"\n\nSource (Reddit wouldn't let me hyperlink it)\n\n[https://www.childwelfare.gov/fostercaremonth/awareness/facts/#:\\~:text=There%20are%20over%20391%2C000%20children,percent%20of%20the%20general%20population](https://www.childwelfare.gov/fostercaremonth/awareness/facts/#:~:text=There%20are%20over%20391%2C000%20children,percent%20of%20the%20general%20population).",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "As someone who’s best friends deals with delinquent children every day she would not be better off in CPS.",
                      "id": 168,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 185,
              "content": "parents' boundaries on what, a preschooler having a safe space away from a bad home? OP's NTA for not feeling connected to her, but lets not talk like her parents are bad people for making space for a kid who needed support",
              "id": 169,
              "comments": [
                {
                  "score": 85,
                  "content": "Yeah OP doesn't say what was so bad about Ally and Maya's home, but it says a lot that the parents didn't care about their preschooler not being home",
                  "id": 170,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Yeah, the fact that a 4 year old girl could spend all of her time at OP's family's home indicates that Ally's home life is pretty fucking bad.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": ">but in real life doesn’t help the girl\n\nare you serious???? WHAT ARE YOU ON ABOUT???? How are the parents not helping the girl by unofficially adopting her and treating her as their own since she doesn't get that from her birth parents. What boundaries do they need to set exactly??Are we just using buzzwords without having a clue what they mean?  \nI feel sorry for people like you who think that 'pulling oneself by the bootstraps' is the only way for someone to get out of a difficult situation, even if they are a kid. Yeah, by helping her they are not helping her. How does that make ANY sense in your head is beyond me.",
              "id": 172,
              "comments": [
                {
                  "score": 18,
                  "content": "This is literally the most helpful thing you can do in this situation. I depended heavily on my friend's parents for emotional stability and normalcy as a kid, and my home life wasn't even that bad compared to a lot of people's. It certainly wasn't bad enough to make an actual legal battle over me viable or even healthy, if that's what Special's comment was implying.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Seriously. My friends’ parents loving me changed my life in so many ways.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "It does help her tho. Was friend was able to stop falling class and get a scholarship for college because we took her in. Being able to sleep before cleaning a 2 story house with 4 young kids making mess daily without any rules, being able to actually study without being screamed at for not cooking 3 meals that day and for being a \"fucking nerd\". And even more allowed her to focus on school and get a better mental health. Without that she would still be basically forced to be a friend maid and babysitter.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 349,
          "content": "This is my thought too. NAH\n\nOP could have handled the photos better, but it’s not their responsibility to add a “family friend” (which is sort of the relation they have) to the weddings photos. Maybe they could have taken a few photos with Ally in them as well, or letting the photographer take a photo of Ally, Maya and the niece.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 249,
          "content": "I’m surprised I had to scroll so far to see a NAH. It’s very strange to me that this thread is trending Y T A since this ‘adopted’ sister isn’t even adopted at all, and doesn’t really have a relationship with OP. Plus, it’s so normal for people getting married to have photos taken with different sets of family members.",
          "id": 177,
          "comments": [
            {
              "score": 21,
              "content": "Yeah we had all sorts of picture configurations at my sister’s wedding…which was actually a good thing because she wound up getting divorced.",
              "id": 178,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 149,
          "content": "Thank you for the voice of reason. \n\nAlly is OP's sister-in-law's sister. That doesn't qualify as immediate family. \nOP's parents accepted Ally into their home, but OP should not be forced to accept her as \"sister.\"\n\nNTA",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "100% agree, I’m actually more “Y-T-A” towards mom tbh.  These pictures have discretion, and it’s like 15 minutes, there’s ones with the bridal party, each set of parents etc. Child would have been happy as can be not even knowing she was excluded, along with all the other guests just chilling had mom not wanted her in the pic. Why would anyone but the bride or groom invite anyone to the posed pics. And you can’t tell me mom hasn’t picked up that op doesn’t really give a shit about this kid, which is ok, NAH unless it’s maybe mom",
          "id": 180,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "This all day long!\n\nAlso, you're entitled to your feelings, OP. NTA.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "god, THANK YOU. I thought I was tripping, looking at all the top responses.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I agrée with this. NAH.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2977,
      "content": "Wow, massively weird energy on this comment thread.\n\nNTA.\n\nI think a bottom-line principle is that nobody should ever be forced to be family with anyone, PERIOD. All these AITA commenters seem to grasp that just fine when a stepsibling or stepparent is forced onto someone. That framework applies here. \n\nIf you truly are kind to Ally, that's all that you owe her. My god, you are allowed to take a family photo at your wedding.",
      "id": 184,
      "comments": [
        {
          "score": 1079,
          "content": "This thread is wild. At your wedding you get to take the photos you want. OP wanted photos of the people she considers family.",
          "id": 185,
          "comments": [
            {
              "score": 628,
              "content": "I’m also shocked at the amount of Y T A. It sucks for Ally who probably thought she was considered family but it’s OPs wedding day and she’s probably paying a lot for the photographer.. she should be able to get the photos she wants? It doesn’t sound like she was mean about it. Plus ally is not adopted or a foster. She splits her time between OPs parents house and her own. \n\nIt’s unfortunate but ehhh I think people are being harsh to OP",
              "id": 186,
              "comments": [
                {
                  "score": 175,
                  "content": "I think so too. She’s allowed to have the photos she wants without having grief",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "See, that's the thing. Ally was sitting at a table when OP was taking the wedding photo of immediate family... until OP's mom dragged her over. Seems to me that Ally and OP understand each other just fine, it was the mom who didn't. Who knows how Ally really felt, extreme sadness or total apathy, but we know she went to the car and cried AFTER the mom pushed the issue and OP had to clarify she did not want this girl in this particular photo. It probably would have been kinder to Ally to not bring it up at all instead of forcing the issue.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 21,
                      "content": "And the mom bringing Ally in is probably an example of why OP doesn’t really like her. I’m sure this has happened countless times",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I don't think anyone is saying she had to be in all the photos but OP should have had her in at least a couple. I loathe my mom's boyfriend, but if I were to get married he would be in some of the photos. I don't consider him family but my mom does. I don't need to display the photo but I know it would make them both happy if he was included. There's no need to be an insensitive person just because it's your wedding. What harm comes from taking a couple of pictures with the kid?",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "If OP's parents officially adopted Ally, would OP include her in the photo? Or would she tell her legally adopted sister that she doesn't belong and isn't a \"real\" member of the family?\n\nIf OP would include her, then why does what the government says matter more to her than what her family says?",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 476,
          "content": "I am so weirded out by this thread. People can’t have their own feelings I guess and everyone needs to feel what other people feel or else be called heartless. \n \nHard NTA",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 249,
          "content": "I’m with you. Completely baffled by all the “you’re the a-hole” answers. OP has no attachment or relationship with Ally, therefore no obligation to include her in wedding photos. Not to mention, 14 is old enough for Ally to understand that she isn’t really part of this family just because she spends a lot of time at their house.",
          "id": 193,
          "comments": [
            {
              "score": 34,
              "content": ">14 is old enough for Ally to understand that she isn’t really part of this family just because she spends a lot of time at their house.\n\nAccording to OP their siblings call Ally their sister, so what you say makes no sense. Everyone considers her a part of the family except OP",
              "id": 194,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "You seem like you're probably old enough to understand that if she's lived with this family for much of her life and all of them call her family (save for one) that she might consider herself family.",
              "id": 195,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Oh, I'm sure she got that loud and clear when she was told, \"no, you're not family, out of the pictures,\" by OP. At least everyone else was confused by this vastly selfish person, so the teen knows not everyone wants her gone.\n\nIt was a moment that she showed exactly what she thought of her sister-in-law's immediate family, who has lived with her own family for at least a decade. She may not be \"wrong\" by the definition of \"MY immediate family ONLY\", but she definitely shouldn't be surprised when none of them consider her that anymore either.\n\nIt shouldn't be that hard to smile for an extra picture, but I guess it is when you're so self-centered.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "Right? I wouldn’t want to be forced to have someone in my wedding photos that I don’t like. Someone that was forced into my family etc etc. \n\nIt’s the Reddit circle jerk calling everyone an AH until it happens to them. “Ohhhhh, now I get it….”",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "Agree NTA, you cannot force someone to accept other people as family no matter their age. Op was still a child when they met and may have been emotional about losing attention from his sibling who started dating. As a double down they brought a younger child into the mix who also would take attention and time from family previously dedicated to the child op.",
          "id": 198,
          "comments": [
            {
              "score": 17,
              "content": "This happened to me. When I complained to my mother I was told they didn’t have good parents and needed her more. My response was so you take away my parents and give them to them and now they go places and do things with you, they got my bedroom and I moved into the trailer in the back yard, where I still can’t get any privacy because they Keep coming out unsupervised. The only time you even check on me is when you want me to come in and babysit them.   \n\n\nNeedless to say this has a huge impact in the few months they were with us as I’m over 60 and still remember that time with no fondness. I can totally feel the OP’s not wanting to have the girl pushed into the pictures of such a special day. And to have mom make the teen a priority only leads me to believe that it’s a pattern of long standing.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I think it's just kind of weird to do something that you know will hurt your family for no real reason other than relatively pointless symbolism about who technically belongs in the photo and who doesn't.\n\nThe OP gets almost zero benefit from her decision, but willfully hurts people. That's sort of callous.\n\nNo one's saying she doesn't have the right to choose. They're just questioning the purpose of the choice and why some mild preference about a photo was worth hurting other people.\n\nWhat if OP's family did adopt Ally? Is a piece of paper all that really matters here?\n\nTelling a kid who was basically abused by her biological family and has mostly lived with your family since she was 4 years old that she doesn't belong because she doesn't have a piece of paper saying she's officially adopted is sort of unpleasant. Especially since Ally literally is part of the extended family at least. So this petty splitting of hairs seems needlessly hurtful.",
          "id": 200,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Huh? Literally NO ONE ever \"chose\" to be family with anyone. Everyone who is family is \"forced\" to be a family wether they like it or not. You can't just decide not to be related towards your mother, father or siblings, what are you talking about? You are literally FORCED to be a family. It's genetical fact.\nLike saying no one should be forced to be a certain race or even born. We are all forced.",
          "id": 201,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Family is literally a process of being forced to have relationships with people. thats the entire thing. Friends are the ones you choose. wth?",
          "id": 202,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "> I think a bottom-line principle is that nobody should ever be forced to be family with anyone, PERIOD.\n\nThat's not how families work. You get to choose your friends. You don't get to choose your family.",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1869,
      "content": "NTA, she's a good family friend, she is not a SIL, she is the sister in laws sister.  She has parents, a family and a bedroom that she goes home to at night.  Although your parents are invested in her, she is not your sister, adopted or otherwise.",
      "id": 204,
      "comments": [
        {
          "score": 698,
          "content": "Love this comment. \n\nYou can have a whole crew of people that “live” at your home because they are friends with your brother and have a shit home life. That doesn’t make them family. They are FRIENDS of the family, not family. \n\nI don’t get all the YTAs. Ally isn’t a sister to OP, Ally is a “daughter” to OPs parents which developed over time. OP was an adult and probably out of the house 2 years after Ally came into her life. Not a lot of time to develop a sisterly relationship when they didn’t live together 24/7. It doesn’t sound like OP has a relationship with Ally at all. Maya is in the pictures cause she is SIL by “marriage” even if they aren’t married yet they have a kid together so she is family and will be linked with your family through your niece.\n\nOP you get to choose your relationships. No one else. NTA.",
          "id": 205,
          "comments": [
            {
              "score": 3,
              "content": "You don't usually get to choose your family, tbf",
              "id": 206,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 232,
          "content": "Yeah I would go with NTA— OP could have included her in another photo just for the sake of smoothing this over but is she really obligated to? She’s her SIL’s sister and her and OP don’t really have a close relationship even if the rest of the family does.\n\nOP I feel for you, my parents did something similar once but I and my siblings were older. My family had a lot of our own issues going on and in the midst of that my parents decided to take their dirtbag friends’ kids under their wing. It didn’t last nearly as long as this situation but I understand how OP feels with having this child foisted upon them and their family. I mean it sounds shitty but 🤷‍♀️ sometimes you really don’t need to make room in your life for absolutely anybody and everybody.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "She has a home that is so bad that OP acknowledges how terrible it is and Ally spends more time living with OP's parents. Sounds like the bio parents provide a bed during week days and that's about it.\n\nIf Ally was legally adopted, would OP still exclude her, telling her that she doesn't belong and isn't a \"real\" family member?\n\nIf she would include her in the photo, and all that matters here is the paperwork, then why does OP care more about what the government says than what her family says?",
          "id": 208,
          "comments": [
            {
              "score": 6,
              "content": "Seriously. OP can do what they want and have whoever she wants in her wedding pictures, but some of the NTA comments acting like Ally is some stranger are so willfully missing the point that it's insane. This girl is already family *anyway*, by virtue of being the SIL's sister, but she also pretty much lives with OP's parents and attends all their family events and had a shitty home life. She's adopted in all but legal paperwork. Some people in this thread are so heartless.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Why does it matter so much whether she’s a blood relative or not? That’s what I find most weird about this thread.",
          "id": 210,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1030,
      "content": "I'm gonna go against the grain and say NTA- is was your wedding and you and your husband should be who is in charge of who's in the pictures. It's entirely your choice to take her on as a sister regardless of how your family feels about her and treats her",
      "id": 211,
      "comments": [
        {
          "score": 206,
          "content": "This! Everyday there is a question on here about someone completely disregarding a step-sibling or even half-sibling because they don’t consider them family, and invariably they are supported. I don’t remotely get why this person is being berated for not considering someone she has no remote reason to consider family as family.",
          "id": 212,
          "comments": [
            {
              "score": 39,
              "content": "This sub is just super hypocritical and has double standards for \"kids\" versus \"adults.\" Somehow because OP is an adult she has to shut up about her feelings in order to protect the kids.",
              "id": 213,
              "comments": [
                {
                  "score": 19,
                  "content": "They go nuts over “adoption” too",
                  "id": 214,
                  "comments": [
                    {
                      "score": 12,
                      "content": "It's just crazy. Even if Ally was adopted and OP just didn't like her, it'd be her right to exclude her (though in that case it would be a little ruder, I suppose). I really don't get why these comments are so nuts today.",
                      "id": 215,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "But there have been loads of cases where an adult with younger step siblings or half siblings is reprimanded by parents for rejecting them, and this sub is all up in arms defending them. I really do think that there are too many people who are damaged by their parents divorce and they are completely incapable of seeing things sensibly.",
                  "id": 216,
                  "comments": [
                    {
                      "score": 16,
                      "content": "True, I don't really get why this particular post is getting grief. Agreed that there are probably a lot of people just incapable of seeing things sensibly.\n\nI think the bit about Ally having a rough background has got way too many people feeling sympathy for her. That's sad and all but she isn't owed anything by OP.",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Seems like it honestly comes down to OP is an adult and the other party is a child. If they were both kids or both adults OP would be ok, but a lot of redditors just see an adult being mean to a child in this scenario.",
              "id": 218,
              "comments": [
                {
                  "score": 13,
                  "content": "I guess that must be it. Such inconsistent energy though.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Agreed and I don't know why it should matter, but it's the only thing I can see that's different about the story.",
                      "id": 220,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I don’t think she’s being berated for not considering Ally family to her. It’s more that there is very little harm to Ally being in the picture, and great harm from her being excluded from the picture. \n\nIt is her wedding day and she can do what she wants, but can still be judged for those decisions. It’s like freedom of speech. She made thousands of decisions to make her day perfect. Most of them don’t crush people’s hearts in the process. This one did. It was an easy battle to relinquish for the sake of her family.\n\nIt seems she ultimately has been stewing on Ally’s invasion of her family and needed to make a statement on a subconsciousish level, and used the power afforded to her as a bride to carry this out.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "I agree and will get downvoted. OP wanted a picture of the people she considers family at her own wedding. I’m surprised because usually this sub is all about people being able to choose who their family is.",
          "id": 222,
          "comments": [
            {
              "score": 80,
              "content": "If your parent has a child with someone other than your other parent, or marries someone with a child, you are completely ok to ignore, disregard and, based on some posts here, even abuse that child. If your parents let a random kid come over all the time, you must accept that child as a sibling. This is the law according to Reddit.",
              "id": 223,
              "comments": [
                {
                  "score": 12,
                  "content": "Nailed it",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Ah, the alluring stench of *authority*. \n\nYou know, there's so much more to life.",
          "id": 225,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 908,
      "content": "It’s crazy that this sub will defend someone’s right to not accept step family but then bash OP for not accepting her brother’s wife’s sister as a member of her family. \n\nNAH",
      "id": 226,
      "comments": [
        {
          "score": 227,
          "content": "Thank you! I thought I was in the twilight zone. Are people not realizing this isn't an actual adopted sibling or something? OP didn't even have to invite her to the wedding, frankly. \n\nNot shocking at all that she wouldn't think of her sister-in-law's sibling as family, especially with the age difference. And sorry, picture time at weddings typically has a small window. I doubt the 14 year old would've felt any better to have pics with her in them just to see them also do ones without her anyway. It's really OP's mom's fault for assuming.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Well Reddit doesn’t stop being Reddit. No matter what you’re wrong. \n\nYea if op was 18 when she “moved in” op barely knows this girl",
          "id": 228,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "\"This sub\" isn't one guy. Solved the mystery for you.",
          "id": 229,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "You may want to consider that this sub sucks.  99% knee jerk NTA across the board, no matter how obviously posters untruthfully spin narrative in their favor.",
          "id": 230,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 808,
      "content": "This is a hard one. OP was already 18 when Ally moved in “most” time. The other siblings and parents spent vastly more time at home with Ally being around almost all the time than OP. If OP wasn’t around to establish a sibling relationship with a child that wasn’t actually adopted full time by her own family, how can you call her an A H for not considering her family?  She’s not OPs sister, never was. Not biologically, not legally, not by choice either. \n\nShe should’ve been included in a bigger family photo, but I can see how OP would not want her in her immediate family- Ally is her SIL’s sister- not immediate family. \n\nThis seems more like a NAH. It’s not Ally’s fault her biological family let her be nearly 100% cared for by another family. There’s no info indicating abuse- could’ve just been dirt poor and couldn’t care for their kids. Still not anyone’s fault. It’s not OP fault for already being grown up and not having a sisterly relationship with a child. It’s also not anyone’s fault OPs parents are super caring and would take in children not belonging to them to give them a better life.",
      "id": 231,
      "comments": [
        {
          "score": 130,
          "content": "Father in prison, mother bipolar.\nNot the healthiest environment for a 4 yo...",
          "id": 232,
          "comments": [
            {
              "score": 209,
              "content": "Still not OP's responsibility. The parents could have called CPS at any time but decided not to. Now they have these gray family dynamics that have nothing to do w OP",
              "id": 233,
              "comments": [
                {
                  "score": 22,
                  "content": "file sip squeal piquant amusing salt wise pie zealous price\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 234,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "I have 2 cousins, one I've met 2 or 3 times in like 37 years and one I've never met in 26 years. I often forget about them, especially the youngest one but if we were ever in the same place they are my cousins and I'll treat them like family. To have a kid who has lived with your parents for 8 years that everyone views as their daughter in a photo won't ruin a wedding but as a guest seeing that would ruin my opinion of this woman.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "she is his sister in law",
          "id": 236,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 734,
      "content": "INFO: Did you do another photo with everyone included?",
      "id": 237,
      "comments": [
        {
          "score": 190,
          "content": "Apparently the answer is no.",
          "id": 238,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "The most diplomatic way to do this would have been to include the SIL and any other non blood family, and then done a second picture that was only blood related family. These things aren't difficult to figure out. I would question if this option wasn't presented, which would kind of indicate that OP went out of their way to exclude her.",
          "id": 239,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 549,
      "content": "NTA\n\nI don't really get all of these comments. You don't see her as family. And she isn't in your wedding party. You shouldn't be obligated to take a picture with her.",
      "id": 240,
      "comments": [
        {
          "score": 208,
          "content": "Apparently, anybody our extended family considers family is also our family by default. We are expected to treat random kids we meet at 16 and have no real connection to as a sibling. Yet another completely logical position on Reddit.",
          "id": 241,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}