{
  "post content": "Throwaway bc my husband knows my acc\n\nMy (25M) husband “Harry” (26M) has been in bed with the flu for about a week now. He’s quite miserable (headache, nausea, fairly high fever) so I’ve been working from home to be able to keep an eye on his throughout the day.\n\nIt was my younger siblings’ (twins, 9) birthday on Saturday and my husband and I were invited over to my parent’s house to celebrate.\n\nOn Friday, Harry told me he wasn’t feeling up to a children’s birthday party, which is understandable. I wouldn’t necessarily want to be around rowdy children if I was sick either.\n\nSo I decided I’d go there on my own, bring over the presents, stay for an hour or two and be back home before dinner. To be honest, after spending days holed up in our flat taking care of my husband, I was quite grateful for the opportunity to get outside for a few hours.\n\nWhen I told Harry as much, he didn’t comment on it but he did seem a bit grumpy afterwards.\n\nSaturday came and I drove over to my parent’s house in the afternoon (they live about 20 minutes away). I left Harry with some painkillers, tea and tissues on the nightstand so he wouldn’t need to get up while I was gone. I told him he could call me in case something happened, though. \n\nThe party went great and I got back home after about 2 hours without any calls from Harry so I assumed everything had gone well.\n\nHowever, he was frowning all evening and when I asked whether he was alright, he called me selfish for leaving him alone and accused me of not caring about his well-being. He told my I should’ve stayed home with him instead of having fun on my own while he was miserable.\nHe has since been giving me the silent treatment whenever I tried to talk to him about it. \n\n\nIt’s been a few days and I thought he’d have calmed down by now but he’s still sulking and I’m starting to wonder whether his reaction is reasonable and I’m the AH here.",
  "id": 1,
  "comments": [
    {
      "score": 9537,
      "content": "NTA. The flu sucks, but your husband is an adult and he can spend a few hours taking care of himself. Perhaps it would be a shock to your husband to learn this, but there are plenty of people out there who will spend an entire week taking care of themselves! Even if they are sick! Sometimes, longer than a week!\n\nYour husband sounds immature. And I hope this is just an isolated incident.",
      "id": 2,
      "comments": [
        {
          "score": 3494,
          "content": "If they are planning to have kids, he’s gonna have a rough awakening to find out that when you’re a parent, sometimes you have to spend an entire week taking care of *someone else* even if you are sick!",
          "id": 3,
          "comments": [
            {
              "score": 1209,
              "content": "As a single parent that catches every single cold during winter with every single one turning into a chest infection so much this. Yes being ill sucks yes its nice to be looked after whilst you are ill but when ur a adult sometimes u jst need to suck it up and actually b a adult.",
              "id": 4,
              "comments": [
                {
                  "score": 464,
                  "content": "It's not even about being an adult, it's about understanding there are other priorities people need to focus on and to be fair they can't do much about u being sick. Growing up my parents had to work they didn't have bosses they could just call up and say \"hey my kid is sick I gotta stay home\" no! Mom would set u up with tissues, some cans of soup, and some medicine. After the age of 11 your old enough to stay home, take some cough meds, and boil a can of soup by yourself. Being sick is inconvenient, but u aren't helpless.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 97,
                      "content": "That is something most kids would have a hard time being okay with. Sure there are some kids who would understand but I wouldn't blame a kid for being upset if their mother/father can't look after them whilst sick. But I would fully expect a adult to be able to understand obligations and having to look after oneself.\n\nEdit: ill change statement from most kids to i understand when kids have a hard time with this.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Hell my mom was a stay at home mom and she still lived her life when I was sick.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "And this was before cell phones or email. \"If you need anything, call me at work. If I can't come home, call Grandma\".",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yep, I think the last time someone ever stayed at home specifically to look after me when I was sick as a child I would’ve been about eight. If I was lucky, I would get a phone call at lunchtime, otherwise eat your sandwich, here’s the toilet roll / bucket  now sleep, or watch television (not that there was much to watch during the day back then)",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I think at 11 I was still being told 'nothing hot, nothing sharp' when I was left home alone, but my parents definitely figured that since I could survive going to school and back every day I probably wouldn't die left in our house",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 181,
                  "content": "Oh is there anything more pathetic than the man flu? Like these guys think that NO ONE HAS EVER FELT SO BAD and everyone MUST CATER TO ME. NTA and tell your hubby to grow up, get some NYQUIL and go to bed.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 65,
                      "content": "This!  I'm married to a Jewish man - that doubles the Center of the Universe Syndrome. Dearest, sainted mommy would never have left her baby boy alone to suffer. Me - here's the nyquil, tissues and cup a soup.   \n\n\nNTA",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "WTF did he do when he was single -- have his mommy come over?",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I was looking for this comment 😂 OP, NTA!!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "Imagine being a chronically ill person who feels like crap ALL of the time and doesn't get the luxury of being taken care of for the duration of their possibly  permanent and life-altering illness.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 21,
                      "content": "[deleted]",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "…God.  I WISH that was something I was imagining.  :-/",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "The husband needs to get over himself, but I’d be pretty mad at OP for showing up at that party.  ~~She~~ He could be contagious and not showing symptoms yet. \n\nOf someone in your house is sick like this, please don’t go to parties.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Correction: HE could be contagious. 🙂 Though I don’t think I’d worry about it too much if he hadn’t caught anything up till then.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "And only for TWO HOURS!",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "But he won't. Why would he when he can just guilt trip his husband into being all around caretaker? That's all he's good for right?! /S\n\nEdit for correct pronouns.",
              "id": 21,
              "comments": [
                {
                  "score": 71,
                  "content": "op and the husband are both males",
                  "id": 22,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Thank you! I missed that. I have corrected my comment",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "He’s still just dealing with what straight women do",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "100% this",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 212,
              "content": "I was going to say this. My wife doesn't have sick time or paid vacation time, so I usually stay home when the kids are sick.  Then I usually catch whatever they have. Even before kids, though, we never stayed home to take care of each other unless it was for a surgery recovery. Spouse has the flu? Employers don't care.\n\nThe only time I did much caretaking for my wife was when she had COVID, but two kids also soon became sick, so I wasn't waiting on her hand and foot. \n\nOP, your spouse needs to grow up.  What would happen if you couldn't work from home? What happens if you have a baby? Or even a dog? If your husband is so sick that he needs constant care, he should be at a hospital. \n\nNTA",
              "id": 26,
              "comments": [
                {
                  "score": 17,
                  "content": "And even in hospital, patients are expected to do what they can do for themselves. Staff is busy enough with people who are more sick than you just to cater to your every whim.\n\nThis man needs to grow up.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 12,
                      "content": "As a nurse, I guarantee he would get significantly less attention at the hospital than he would from his wife, including the time she spent at the party, and he would be a lot less comfortable. This reminds me of male patients who ask me to hold the urinal for them when they have two perfectly good arms. It’s a weird control thing and she needs to put a stop to it.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I was gonna say when I was recovering from my hyster at the hospital, my then bf left at the end of visiting hours. I spent the whole night alone in the hospital (gasp). I mean I was still groggy from everything so why shouldn't he go home and get some rest himself?",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I'm married and same.  If there was an operation and they need watching and shouldn't be alone, of course we take off for each other.  But the flu?  Nope.  Hell, we don't even take each other to the doctor.  I MIGHT call to see when they can see him and tell him what time to be there - from work.  Then I'll call to see what the doctor said and ask if he needs me to pick up any medicine after work.  Probably ask him what he feels up to eating and pick that up too.  \n\nWe don't stay home for each other though.  Like, we have to work.  We prefer to save our PTO for trips.  He's never asked me to stay home when he was ill.  Nor would I ask that of him.  \n\n(Want to point out that while this is how we function internally, Spousal privilege still applies.  If he wants a free day off work, he's totally allowed to blame it on me needing him.  That's just a benefit of marriage)\n\nETA:  If he wants his mommy, offer to call his mommy to come take care of him every time you leave the house.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "yup. both me and my husband had covid, husband was much worse than me and we have 2 teenagers and 3 toddlers who were 2 babies and a toddler back then and we still had to take turns and handle little ones while keeping an eye on teenagers as one of them was sick too. and both me and my husband were a wreck and leaving the bed was like torture, at times i had to ask help from my teenager to help me get up and gole my arm while walking cos i felt like fainting",
              "id": 31,
              "comments": [
                {
                  "score": 0,
                  "content": "[removed]",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "Me, my 16 year old and, at the time, 4 month old caught covid in December. My husband was negative, so was told he had to go to work. I had to look after a baby with colic and covid, a 16 year old autistic child with coivd all whilst also being incredibly I’ll with it myself.\n\nThis man sounds worse than my children when they’re ill, he needs to grow up. His wife is not his mom.",
              "id": 33,
              "comments": [
                {
                  "score": 10,
                  "content": "His husband is not his mom/parent, but your point is spot on",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I spent almost a week seriously sick in November. Husband is a truck driver so wasn’t even home to help. Then 14 year old and 10 year old sons had to suck it up and amused themselves while I spent most of it in a DayQuil/NyQuil induced stupor. They pretty much lived on sandwiches, snacks, toast, cereal and water because I could barely make it to the bathroom let alone do anything else.\n\nThank god it was over Thanksgiving break",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "My daughter and I got a nasty seasonal flu a few weeks ago. We were both sick and filled with phlem FOR A MONTH. Absolutely miserable",
              "id": 36,
              "comments": [
                {
                  "score": 2,
                  "content": "[removed]",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Sometimes? You're really underselling it there. Lol\n\nKids are germ factories. There needs to be a quarantine facility for them",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Shocking to me that you believe this guy will take care of his kids when he’s sick, if at all.",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": "Man flu 🙄",
          "id": 40,
          "comments": [
            {
              "score": 2,
              "content": "Ma'am, this is a child",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -79,
              "content": "Yep just like woman dismissal.",
              "id": 42,
              "comments": [
                {
                  "score": 69,
                  "content": "When women are consistently dismissed? Yeah, I hate that too.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 201,
          "content": "And OP had been taking care of him for several days at that point. It’s not like he’d just come down sick that very morning and then he immediately abandoned him.\n\nEdit: Corrected “she” to “he.” I swear I didn’t assume OP’s gender was female, I thought it said (25F) because I was reading while also working a hotel front desk and also I have terrible eyesight. 🤦🏻‍♀️",
          "id": 44,
          "comments": [
            {
              "score": 26,
              "content": "He, op is a man",
              "id": 45,
              "comments": [
                {
                  "score": 22,
                  "content": "Heck, you’re right. This is what I get for reading Reddit while I’m at work. Gonna fix it now.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "It's still the same thing, for OP, isn't it? \n\nSelfish, needy partners are not necessarily gender specific.\n\nThey're all a PITA, regardless.\n\nOP just happens to be saddled with a needy man.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 1,
                      "content": "What does that have to do with my comment? Person I replied to was calling the OP 'she' when OP is a 'he'. OP's husband is the sick one.",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Everyone who works at a front desk gets at least one pass",
              "id": 49,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "You don’t have to over explain yourself, it’s okay to make a mistake lol",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "[removed]",
          "id": 51,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 82,
          "content": "NTA- good grief. Next time you’re unwell demand exactly the same level of sacrifice. You may want to think very carefully before having kids with him.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "And sometimes (often), people are sick and take care of themselves for a week or more *and take care of other people at the same time*!! He can handle it. OP is NTA.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "When I was a teen and I was sick, I’d stay home from school by myself. I sure as hell didn’t need my mother to supervise me eating chicken noodle soup and watching food network marathons.",
          "id": 54,
          "comments": [
            {
              "score": 2,
              "content": "Lolol \n\nSame thing I did as a kid when sick.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Almost 15 year old will pillow fort himself with soap operas and freeze pops lol",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "I had covid and it was awful. Really high fever, headaches, pain all over my body. I spent 7 full days by myself and didn’t die. This man needs to grow up.",
          "id": 57,
          "comments": [
            {
              "score": 29,
              "content": "High five from someone else who delt with COVID alone. It sucked but whatever, I survived. This dude can make it a few freaking HOURS on his own!",
              "id": 58,
              "comments": [
                {
                  "score": 3,
                  "content": "Same only I had to care for my two kids- being a single parent is FUN. They survived on takeaways and cereal for a solid week. At the end of the first week I got sent to hospital for coughing up blood, turns out I wasn’t coping as well as I thought. This after having had the flu end of 2022 and doing all of the above minus coughing blood. \nSometimes you just have to get on with it and manage. Ops hubby is being a total baby over this",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I envy you. My whole household caught Covid at the same time so two very sick adults had to look after two not as sick disabled children. I wish I could have spent a few days by myself just resting.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I had bad covid & my son had it at the same time. He's already total care disabled & using a trach & ventilator. His nurses decided they didn't want to come during quarantine. I had to stumble around trying to suction & change diapers, prepare tube feedings & meds, all while I was sick as a dog & had myself hooked up to his supplemental oxygen(he only needs it for emergencies & his pulse ox was ok without it). It was one of the worst times of my life. Staying at home alone for 2 hours on day 7 of the flu sounds like an absolute cakewalk.",
              "id": 61,
              "comments": [
                {
                  "score": 2,
                  "content": "Fellow trach kid mom here, I admire you and your dedication to your son!",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Nah, OP's a giant asshole for going to a party *while quite possibly contagious*.  He's been spending all week around someone so sick with the flu that he's been in a bed for a week.  That's obviously what you should do before going to a party.\n\nPeople like him are why we can't have nice things.\n\n> You may be able to spread flu to someone else before you know you are sick,\n\nhttps://www.cdc.gov/flu/about/keyfacts.htm\n\nWhen you, or your family members, are extremely sick: stay the fuck home.",
          "id": 63,
          "comments": [
            {
              "score": 27,
              "content": "I had to scroll down way too far to finally find a comment like this. Yes, sick husband is being over dramatic, but OP could end up being Patient Zero at that party and that is far worse than a sick person pouting!",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yes! this is one of those posts where I'm reading through and thinking 'wow everyone is completely missing the point'\nfor most narrowly interpreted interpersonal conflict here, op would be n t a, or if context was different and op's husband had a broken leg or was suffering from anything other than a highly transmissible infectious disease (to which children are especially vulnerable! and op is going to a kids' bday party!)",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yeppers. NTA for leaving the husband home alone, but mega, MEGA YTA for very likely taking the FLU to a party full of people. Like WTAF?",
              "id": 66,
              "comments": [
                {
                  "score": 10,
                  "content": "Not only going himself, but considering bringing his still ick husband with.  Ughhhhh people.  Your infectious disease is not what anyone wants for a birthday present.",
                  "id": 67,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Right? I'm gobsmacked. Have people completely forgotten about covid? \n\nOP says flu, but his husband's symptoms could very well be covid. And covid kills. Just because OP wasn't feeling any symptoms doesn't mean he couldn't carry the virus to a vulnerable person at the party. \n\nFlu, RSV, Covid, all can be deadly for some people.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "As a man who is also rendered completely helpless when he has a cold, his accusation that you're being selfish is completely out of line. You're allowed to take a two hour break on Day 7 of his flu after taking care of him all week. When he's feeling better, take him to task for his whining.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2683,
      "content": "NTA and he needs to stop acting like a baby. You went to a kids party at your families house for god sake. You didn’t come home drunk, you told him he can call for emergencies. He needs to grow up. He had the flu like a lot of people do",
      "id": 70,
      "comments": [
        {
          "score": 1025,
          "content": "[deleted]",
          "id": 71,
          "comments": [
            {
              "score": 486,
              "content": "Oh yes, the dreaded man flu. Worst thing on the planet if you’re male. Can’t function at all, incapable of holding your own ding-a-ling to go to the bathroom kinda sickness. \nI f’ing hate the man flu.",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 411,
              "content": "Studies show that the man flu is actually just as painful as childbirth. \n\n/s",
              "id": 73,
              "comments": [
                {
                  "score": 253,
                  "content": "Oh come on, everyone knows it's even worse! Because women agree to have more kids all the time, a dude never asks for the flu! (Cries in third trimester)",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Was looking for this comment 😅",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 65,
              "content": "I get the man flu as a woman and even I’m not as needy as husband.",
              "id": 76,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "And now he’s throwing a mantrum.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -15,
              "content": "Cool you found a way to be sexist without anyone calling you out. How do you feel about that?",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -22,
              "content": "I believe OP is a man too",
              "id": 79,
              "comments": [
                {
                  "score": 76,
                  "content": "Doesn't mean his husband (OP's husband) isn't being melodramatic and unreasonable about needing constant care (which I understand is the main symptom of man flu).",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": -27,
              "content": "Is that like when females pretend having their period is the worst thing in the world and they need constant care?",
              "id": 81,
              "comments": [
                {
                  "score": 14,
                  "content": "My period is *much* worse than the flu.",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Argument is immediately invalid \n\n\nWe're women.  We are human.  Dont call us females like we're an alien species \n\n\nMoreover, newsflash hun, the majority of women who have their periods push forward with gritted teeth.  And there are some who have cramps so bad they cant even stand.  So how about you shut up.",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -57,
              "content": "sexist",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -70,
              "content": "Nah, she's just hysterical.  Oh, wait!  Maybe generalization about genders is wrong?",
              "id": 85,
              "comments": [
                {
                  "score": 49,
                  "content": "OP is a man too, so not sure what you’re getting at bud.",
                  "id": 86,
                  "comments": [
                    {
                      "score": -42,
                      "content": "I'm coming at the comment of man flu and how it's wrong to throw an entire gender under the bus.",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 22,
                  "content": "OP’s a man",
                  "id": 88,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "I'm single and I surprisingly survive being sick all by myself!\n\nOkay, my Mom will sometimes drop chicken soup off at the door and wave to me from the car as I go to get it. We share too well to have actual human contact.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "I got the feeling the husband's name might be Cameron 🙂",
          "id": 90,
          "comments": [
            {
              "score": 84,
              "content": "“You’re not dying, Cameron, you just can’t think of anything good to do.”",
              "id": 91,
              "comments": [
                {
                  "score": 9,
                  "content": "Why does that sound familiar",
                  "id": 92,
                  "comments": [
                    {
                      "score": 14,
                      "content": "It’s from Ferris Bueller’s Day Off",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -4,
                      "content": "[deleted]",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1713,
      "content": "NTA - He doesnt need 24/7 supervision. If he did, he should be in the hospital. Hes being selfish, since he’s miserable no one else can have fun.",
      "id": 96,
      "comments": [
        {
          "score": 217,
          "content": "He'd complain that the nurses didn't sit by his bedside the whole time.\n\"How dare they look after other people when I'm sick!\"",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 200,
          "content": "I'm a med student who worked CNA/care tech jobs for a while, and even in the hospital it would not be unusual at all for a patient to be left alone for 2+ hours. If they need to be assessed every 1-2 hours, that is ICU level care!",
          "id": 98,
          "comments": [
            {
              "score": 42,
              "content": "Thank you, exactly, what does he need that can't wait a few hours?? Nothing!",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1066,
      "content": "NTA...your husband is a baby.  He probably slept the whole time you were gone.",
      "id": 100,
      "comments": [
        {
          "score": 361,
          "content": "Nah he was too busy sulking and planning how he was going to emotionally punish him for his crimes.\n\nEdit: fixed pronouns",
          "id": 101,
          "comments": [
            {
              "score": 90,
              "content": "Him*",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "him* his*",
              "id": 103,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "OP is a man, as is the partner.",
              "id": 104,
              "comments": [
                {
                  "score": 4,
                  "content": "No the partner is surely a child. Clearly quite young too as he apparently can't stay home alone for even an afternoon.",
                  "id": 105,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I can just imagine him sitting at home holding the same face Patrick held when SpongeBob gave him a handshake on Valentines Day.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "this!!",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 813,
      "content": "Hold it. You went to a kids party knowing your husband was ill. Didn't it occur to you that you might be carrying the virus and pass it to the other guests? You should have stayed home to prevent the spread of whatever he has. Also, are you sure it's the flu?\n\nI might be a bit biased at the moment as I'm recovering from a bout of covid. (I used a home test.)\n\nETA: Thanks for the award!",
      "id": 108,
      "comments": [
        {
          "score": 334,
          "content": "Surprised this is the first comment I've seen mentioning this, we only just got out of a pandemic!\n\nMy partner and I have gotten sick a bunch of times this winter, and every time I only got sick right about when he was getting better, and you are most contagious right before/when you start showing symptoms.\n\nI mean I guess the world is back to normal speed and people don't care about proper illness etiquette anymore, but I wouldn't be visiting family if someone I lived with was sick. (and honestly it doesn't really matter if it's covid or \"just a flu\" anymore, I don't want to get sick at all! They all suck!)",
          "id": 109,
          "comments": [
            {
              "score": 285,
              "content": "We are absolutely not out of a pandemic.\n\nhttps://www.nebraskamed.com/COVID/what-covid-19-variants-are-going-around\n\n People just care far less than ever before because \"they're tired of living like this\" when most never listened in the first place, making immunocompromised people like me with a baby frustrated AF. \n\nBut I digress, I'm also surprised I had to scroll so far down to see a comment about how OP being the AH for going to a children's party (or any party for that matter, while being around someone with a contagious disease. \n\nOP, NTA for your husband being a baby about trying to push misery loves company. However...\n\n100%  YTA for not learning a fucking thing over your adulthood, but ESPECIALLY in the last 3 years.",
              "id": 110,
              "comments": [
                {
                  "score": 63,
                  "content": "I work in healthcare, and COVID is being treated like it’s part of the priority workload, but it is no longer considered *the* priority.\nI believe it’s just considered endemic now.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Where do you live that it's being treated like it's part of the priority? All over the U.S healthcare workers aren't masking and are getting upset or angry when asked to mask by their patients- and it's always those of us who are immunocompromised who are getting especially strong reactions.\n\nAlso, it being *considered* endemic doesn't mean it's *actually* endemic- we are absolutely still in a pandemic here.",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Thank you for the award kind, anonymous redditor!!!",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "Thank you for the award kind, anonymous redditor!!!",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "That was my first thought too. Is it confirmed to be a flu rather than something else?\n\nAnd if you've been around him, you've been exposed, and you could expose others. Children are usually among the most vulnerable populations for illness. You could have spread it to everyone at that party.\n\nESH\n\nYour husband is being a bit selfish, he can take care of himself for a few hours and stay home so as not to get others sick. I managed for hours by myself with *covid* just fine.\n\nYou're selfish for wanting to go while risking the health of everyone there. You should have stayed home.",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "It's not like the husband was quarantined off either.  Sounds like OP had to be at his beck and call for that week.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "We are NOT out of a pandemic.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "Even if it was “just” the flu, the flu can also be deadly! Very much doubt anyone would take the same precautions as they would for COVID unfortunately.",
          "id": 118,
          "comments": [
            {
              "score": 64,
              "content": "Having had both the flu and covid, yeah they both suck a lot! To be honest the flu was worse but covid lingered longer. I wouldn't want to be around anyone who might have either.",
              "id": 119,
              "comments": [
                {
                  "score": 12,
                  "content": "The flu felt worse in the moment for me (I was constantly shivering and my muscles could barely move. It felt like I ran a 100 mile marathon every time I got up to go to the bathroom)\n\nBut COVID stuck around for a lot longer, and it's not like it's symptoms were particularly fun either. I had so much phlegm building up in my throat that it sometimes felt difficult to breathe through it. Thank God for whatever magical pill I was taking that cleared that up.\n\nBeing sick just isn't fun. It doesn't matter if it's the cold, the flu, the stomach flu, or COVID. It sucks.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Last year my husband and I both had Covid and later the flu. The flu was that really nasty one going around November/December. We both agreed that the flu was WAY worse and sucked much more than Covid. And, at least for me, the flu took a lot longer to get well from.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Yeah, that was what was tripping through my brain too. NTA for leaving and needing a break. If husband was not bedridden and incapable, he is being a brat.\n\nBut i would have seriously hesitated to hang out with kids and older people if I was in this situation. Drop off sanitized gifts sure... but stay? Nah.\n\nI am not sick-compatible with my daughter or roommate ... i never catch what they have (and they dont get my bugs) but I know I could still be a carrier. Would never want to spread anything to loved ones.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "This was my first thought as well. Even if it isn't Covid, there's a lot of other illnesses that can be serious. The flu can really knock out the elderly / infants. RSV. etc.",
          "id": 123,
          "comments": [
            {
              "score": 50,
              "content": "Not just the elderly, a nurse friend of mine saw a perfectly healthy young person suffer sudden complications from the flu and die. People should be taking the flu a lot more seriously than most seem to",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Not to mention that we don’t even have to care if it’s deadly, it’s kind of an asshole move to show up anywhere if you know you have the possibility of passing the illness along",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Agreed! ESH because he is being unreasonably clingy and petty and you were traipsing about being an illness easter bunny at a kid's birthday party!",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "I love how no one gets COVID anymore. Just the flu, strep throat, a terrible cold, etc. Also, even if it is the flu, people don’t want that either!",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Yep. That was my first thought too.  Can't believe I had to scroll so far.  He should have stayed home.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Can’t believe I had to scroll this far to see this.",
          "id": 129,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "Even if it was \"just\" a common cold, stay away from other people when you're knowingly carrying a virus. (As someone with severe asthma that can get really bad really quick, a common cold isn't something to brush off.)\n\nIf you absolutely must go somewhere, sanitize, mask up, and leave as quickly as you can. If you need to just get out, find something to do that doesn't involve sharing food with a bunch of kids for a few hours.",
          "id": 130,
          "comments": [
            {
              "score": 18,
              "content": "As someone else whose asthma can go to shit with even a cold, thank you",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Thank God. I only made it part of the way before I wanted to declare OP thr ahole. You dont go to a kids' party when your husband is sick. I would be pissed if I got sick because someone just had to attend. \n\nI was losing my mind when I saw people saying N.TA. Yah, your husband will live if you are not there 24/7.\n\nYTA",
          "id": 132,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 658,
      "content": "NTA.  You're his wife, not his mother and he is 26 not 6.  What a gigantic baby.  He has a cold.  If he was having some sort of life threatening issues you should have stayed home.  Staying home would have meant what, you sit there and watch him cry like the baby he is?   He needs to grow up.  It sucks being sick, but not as much as it sucks being married to an adult first grader.\n\nEdit:  Sorry OP, I missed that you were a male.  Doesn't change my opinion though!",
      "id": 133,
      "comments": [
        {
          "score": 285,
          "content": "OP is male, but I agree. What a big baby. Reacting like that and he’s a 26 year old man. It’s was 2 hours for gods sake. A 13 year old would behave better than him.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "If he was having life threatening issues, neither one of them should be staying home. They should be going to seek medical attention. 😂",
          "id": 135,
          "comments": [
            {
              "score": 18,
              "content": "For sure.  I was thinking mostly if he had asthma and having the flu was really aggravating it or something like that.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 327,
      "content": "NTA \n\nHas he never been left home alone sick?? Cheese and rice he’s a grown man. \n\nYou didn’t even stay that long he needs to stop sulking.",
      "id": 137,
      "comments": [
        {
          "score": 44,
          "content": "English is not my first language and I had to read your comment a couple of times before I got what \"cheese and rice\" could mean in this context. :D",
          "id": 138,
          "comments": [
            {
              "score": 26,
              "content": "Jesus Christ.  If you don't want to \"swear\" if someone didn't get it.",
              "id": 139,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I will totally use \"cheese and rice\" from now on in front of my religious American ILs.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 197,
      "content": "NTA. Your husband is an adult. He's capable of taking care of himself for a few hours. You've already demonstrated you care about him by looking after him for a week.\n\nHe needs to stop acting like a spoiled child.",
      "id": 141,
      "comments": [
        {
          "score": 12,
          "content": "This is so weird. I posted similar sentiments on a now-deleted post five months ago, and I got downvoted. \n\nIn that one it was a woman who wanted to leave to run errands, and her husband had a gastro bug and wanted to cuddle.",
          "id": 142,
          "comments": [
            {
              "score": 17,
              "content": "Ew. Gastro bug = throw some water bottles at him and put a pillow and blanket in the bathroom. Then bu-bye!",
              "id": 143,
              "comments": [
                {
                  "score": 13,
                  "content": "That's what I said! Gastric bug: if he's too sick to shower, I'm not cuddling him. If he's well enough to shower, he's well enough for me to head out for a few hours. And I still don't want to cuddle him.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 176,
      "content": "NTA\n\nWhat is with all these adults acting like babies when they're sick? It's absolutely ridiculous.\n\nI had to manage covid all on my own and had to sleep in a recliner sitting up just so I wouldn't choke on the fluid in my lungs.\n\nBut poor baby over here can't handle the fucking flu.\n\nI had an ex like this. They're an ex for a reason.",
      "id": 145,
      "comments": [
        {
          "score": 45,
          "content": "I’m a giant baby when I’m sick.  But, it’s just me, the dog, and the cat.  Dog is too short to help with anything (freeloader) and cat puts hair in my food so I don’t ask either of them for help.  I sure do whine, though!",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Currently down and locked in house with covid, I live alone, so no one to help or take care of me. I asked a friend living close by if they could get some groceries I really needed, and some extra sweets to treat myself. I'm not angry for my boyfriend or parents to stay away from me now. My best friend and mom have (had) trouble with long covid. I'm not gonna cause that in anyone!\n\nOp's partner is just being petty. The only thing he might be slightly angry about is possibly bringing the virus to a busy birthday party.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 130,
      "content": "ESH. Your husband is being a baby. But you're an AH for taking all his flu germs to a kid's party!",
      "id": 148,
      "comments": [
        {
          "score": 19,
          "content": "Why did I have to scroll this far to find this!",
          "id": 149,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -18,
          "content": "[deleted]",
          "id": 150,
          "comments": [
            {
              "score": 6,
              "content": "Yeah, maybe you should stick with what you know, because basic germ theory — like… very basic germ theory — doesn’t *quite* back that. \n\nCovid made people hyper aware because it’s a highly contagious virus. And it fucking killed millions of people in record time, AND its gonna cause long lasting disabilities in millions more. \n\nYou sound like the *literal* Typhoid Mary, and it would be funny if you weren’t denying basic science. \n\nAs long as you have the symptoms of the flu, you can transmit it. You shed the virus even before you have the symptoms, too. (That’s also a fact you could’ve verified with a quick google search, btw, but you chose to be loud & wrong instead).",
              "id": 151,
              "comments": [
                {
                  "score": 0,
                  "content": "[deleted]",
                  "id": 152,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah, the idea that people weren’t cautious like this before covid is also not true. Immunocompromised people & other people w/ conditions that leave them vulnerable have *always* had to be hyper vigilant, in part bc the rest of the world had your mindset — no symptoms, no problem & “it’s been X days, I’m not contagious anymore!”. I know this is anecdotal, but my own aunt has seen an incredible difference in her own health because of covid safety. She’s got a congenital lung issue (and they’re INVERTED, which is weird & interesting) that makes her highly susceptible to respiratory illnesses. \n\nPre-covid, she had a standing appointment every 3-4wks w the pulm. because she was getting sick so often. She’d have bronchitis and then pneumonia so often that I don’t remember a time when she wasn’t coughing or wheezing. \n\nAnd then people started masking regularly, over-sanitizing literally everything… and it stopped. People weren’t inadvertently sharing the germs that didn’t affect them anymore. She wasn’t constantly exposed to the things that made her sick. \n\nShe went two whole years without a single resp. illness!! \n\nThere are soooo many more people out there like my aunt, who have benefitted from this strictness. \n\nAnd honestly? There are entire countries who have practiced this level of sterility for *years*, so the idea that “nobody was like this” is ignorant. \n\n(Also, you’re right a 9y/o isn’t an infant, but that 9y/o is presumably in school & could expose even more people if they get sick! This is how contact tracing happens lol).",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}