{
  "post content": "My (22F) gf's mom came over with two of my gf's nieces (6 and 3F). We were welcoming and nice and let the two girls nap in my room when they got tired. \n\nThey had found my childhood stuffie, which is  a husky I had named Emma and took her everywhere for 15 years. Emma is also wearing my favorite shirt from when I was two, because I wanted to keep it close. They took a huge liking to her and asked if they could take Emma back home with them, because I clearly didn't need it. \n\nI told them no, and explained how much I loved her and how much she meant to me. I told them that I had a great aunt who I loved, but she'd passed away long ago and she had gotten me Emma when I was a baby, so I didn't want to let go. I (slightly embarrassedly) told them I actually still slept while cuddling her. I told them the story of the shirt, but they wouldn't budge. \n\nThey began screaming because I wasn't letting them have the husky. My gf's mom heard what was going on and immediately sided with the girls, because 'I am too old for a stuffed toy' and 'shouldn't really care'. She called me an a-hole and told me that I'm pathetic for 'loving to make innocent children cry' and that 'I just love the feeling of power I have over them', before leaving, with the promise of coming back to get the husky when I couldn't do anything about it. \n\nMy gf and her dad are siding with me, but my gf's siblings, mom and aunts are all with the two girls. So, AITA? \n\nUpdate: I have reached out through my gf and offered to buy the girls similar ones from Amazon or IKEA, but I've been told it's got to be Emma because the girls want the shirt too\n\nUpdate 2: this got deleted earlier but Emma has been taken to safety, a ring camera and mini security cameras have been ordered, and my gf's family except her dad have secured a nice telling off/talking to (read: yelling at for upsetting me)\n\nUpdate 3: I didn't think I'd be back so soon but here I am. The 6 year old's elder sister (13F) has just shown up at our doorstep saying she was kicked out by her grandma because she heard what happened and agreed with me supporting 'people who love making children miserable'.",
  "id": 1,
  "comments": [
    {
      "score": 2224,
      "content": "NTA\nUgh, the entitlement. I'd get a ring camera and/or a camera fixed on that stuffy's location in your place, just to have evidence if indeed they take it. Perhaps even get an Airtag inside it, somehow!\n\nNothing builds character like being told you can't have everything in life, but your gf's mom getting slapped with evidence of theft would surely run a close second.",
      "id": 2,
      "comments": [
        {
          "score": 536,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 357,
              "content": "Right? And what a horrible example that girlfriend's mom is setting for the gf's nieces. Blech. \n\nI have an ancient stuffed animal who plays music when wound up. These days he's a bit frayed, and his music is out of tune, but if someone were to try and take Bow-Wow I would crank up the last movement of Beethoven's 9th and unleash hell.",
              "id": 4,
              "comments": [
                {
                  "score": 75,
                  "content": "1812 Overture would be a good second choice",
                  "id": 5,
                  "comments": [
                    {
                      "score": 50,
                      "content": "May I suggest the [Dies Irae](https://m.youtube.com/watch?v=X6cogix3cwQ) from Verdi’s Requiem?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I wish I could up vote you more! My dad would blast that at neighbors that pissed him off! Yes. I was frequently embarrassed by this behavior!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yessssss!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "If your stuffy takes a battery in his voice box, try replacing it. In older toys they didnt just die like they do today. The battery controlled a motor and that motor would slow down if batteries had low power. \n\nIf not a battery, try opening the box and cleaning it out. Sometimes gunk gets in there that makes it slow or sound awful.\n\nI have an old musical teddy that I do surgery on if he gets messed up. 32 years old now and I have decided to patch him with nonmatching threads because I like the idea of seeing all the love and repairs he has needed. They are memories.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I am replying to this late - but I wanted to say: thank you so much for your suggestion! He is from the '80s, so he doesn't take a battery. But I will do my best to see if someone can open the box and clean out the gunk, as I am pretty sure that's what's making the music slow down and be really out of tune.\n\n(It's important to me because it's possibly the earliest music memory I have!)",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Not too many people seem to be familiar with the soundtrack of Clockwork Orange and what the poster implies here....",
                  "id": 11,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Shhhhhhh!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I always liked the idea of doing violence to Ode to Joy. ",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Toccata and Fugue in D Minor",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "It's a basic lesson in DayCare.",
              "id": 15,
              "comments": [
                {
                  "score": 3,
                  "content": "It’s like a case study in how to develop intolerable people.",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": "Never let them in your place again without hiding it away. It would be extremely unwise to do so.\n\nThese people sound horrible.",
          "id": 17,
          "comments": [
            {
              "score": 223,
              "content": "Or just never let them in your place again period.",
              "id": 18,
              "comments": [
                {
                  "score": 128,
                  "content": "As soon as they threatened to come back and just take it, I would've ended the conversation and friendships right there. Anyone who threatens to steal something I said \"You can't have this\" even if it wasn't sentimental, nah, you can gtfo and delete my number.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "I would  change the locks , since you there is a good chance as her mother she has set of keys.\n\nAlso alert management that she should not be given access to the home.",
              "id": 20,
              "comments": [
                {
                  "score": 42,
                  "content": "> there is a good chance as her mother she has set of keys\n\nIs this a common thing? Because it is *absolutely unhinged*, not to mention directly in violation of most rental agreements",
                  "id": 21,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Yeah, I gave my mother a copy when I got my first apartment, in case I got locked out. \n\nBut I also lived in a second story apartment and knew my mom would never tackle the stairs to snoop.\n\nThere is also the chance she’s just overbearing and made her own copy on the low, I’ve seen quite a few a few parents do that to their kids.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah, my mom also has a copy of my keys, so I can go pick that one up if I forget mine. She also would never, ever, in a million years enter my apartment without me asking her to do so. Conversely, I also have a key to my parents' house, so I can let myself in if I'm visiting them and running errands, going out etc. Both are pretty normal where I live.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Just don’t ever let them into your place at all. Gf can see her mother outside your house.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "The kids are 6 and 3.  If the adults quit talking about this, they will forget all about the stuffy and move onto the next shiny thing.  Some adult has talked this up, the kids couldn’t care less about a t shirt.",
          "id": 25,
          "comments": [
            {
              "score": 53,
              "content": "Right? I always have to bite my tongue, because I Am Not A Parent - but whenever a relative of mine is driving themself into a tizzy trying to persuade their kid not to be sad that the kid Cannot Have a Thing, I'm just like ... keep it chill! and point out the construction crane across the street or something, gahhhhh!",
              "id": 26,
              "comments": [
                {
                  "score": 40,
                  "content": "Whenever someone tells you \"You are not a parent\" in the future just tell them \"Nope. YOU don't know how to parent.\". Coming from a parent. Shotty parents will always use this to get out of an argument. My mom used to tell me \"wait till you have kids\". Now she tells me \"wait till they grow up\" or stuff like that. Some people can't take the blame",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I am a parent - and I'm clapping for you because you've got it right.\n\nIf a child can't be distracted (might take a little effort), then that child needs extra parenting.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "The fact that they're making a huge deal out of this shows they're shitty parents raising brats. \n\n\nIt's normal for kids to want stuff and cry when being told no. Parents who are afraid of upsetting their children create people who are afraid of big feelings and can't handle the real world. ",
              "id": 29,
              "comments": [
                {
                  "score": 1,
                  "content": "The kids just wanted Emma because they can't have her, I'm sure if they could get her they'll lose interest in less than a week and then lost her.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Or they could have made a fun activity out of it. \"Let's invite OP and GF and we can all get stuffed animals and T shirts, and spend some time decorating them!\" a Plain white baby shirt and some fabric markers, and you've got a great afternoon activity planned, while OP's stuffie remains safe",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "I am 36 next week and have a few toys from my childhood that are special to me and I would have to be dead before someone else gets to own them not even my own children get to claim them special is special no matter what the item is",
          "id": 32,
          "comments": [
            {
              "score": 18,
              "content": "I'm 38, and Bear the Second has pride of place in the corner of my room ... although as an autistic eternal bachelor I may not be the best example to hold up.",
              "id": 33,
              "comments": [
                {
                  "score": 16,
                  "content": "46 (m). Got a stuffed monkey sitting on top of my book shelf. (It's not a like a taxidermy monkey. I'm not that weird). My mom brought it home from a business trip to prove that she was always thinking of me when I was like three.  \n\nIt's at the top of the list of things that I'm rescuing in case of a fire.  Everything else can burn, meh I got insurance and the computer's  backed up.\n\nBut you don't. Fuck. With. My. Monkey.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 5,
                      "content": "42F For me it's a stuffed bear that my mum got and has since been passed on to my eldest.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "On my first christmas I was gifted a doll that came with a tiny blue donkey plushy. The doll now sits in a dedicated box of childhood memories in the attic 25 years later, but that donkey (I called her Lisa) still sleeps in my bed every night and I would go into unholy rage if anybody took her without my permission",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "Sewing a little square inside the shirt to place the airtag in might be a great solution !",
          "id": 37,
          "comments": [
            {
              "score": 25,
              "content": "Inside Emma. Reverse airpendectomy. Less chance of being detected.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Nice idea!",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "They might discard the shirt. Inside the stuffed animal would be better.",
              "id": 40,
              "comments": [
                {
                  "score": 3,
                  "content": "Also works, if it can be removed discreetly (for washing / changing battery purposes)!",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "And the mother is the worst part!\n\nTeach your kids no, means no.  Not your stuff,  not your right.    Much easier at 6 than 16, or 26.  \n\nNTA",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "OP should be careful with the 13 year old, she may be genuine but she may be acting as a double agent, get the info from where Emma is and steal it.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "imagine being threatened with a break in over a stuffed animal? the girls are sure learning how to be unhinged from that mom.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She would probably just destroy it because she can’t get her way.",
          "id": 45,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "NTA. No one is entitled to your stuff. That’s about a hard stop already. \n\nI just love how they’re teaching / enabling innocent children entitlement and what it means when they grow older. Yes that last sentence was sarcasm in case anyone misses it.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 674,
      "content": "Hide the stuffy in a safe place, and tell the adults to pound sand. They aren’t allowed to take your property. If they come back, take the stuffy and leave for the time they are there… or don’t let them in. \n\nI’m 40. I have a 33 year old stuffy that I still cuddle with. It was and is my security item. It’s mine. Your husky has sentimental meaning to you. My stuffy is the same. \n\nNTA.",
      "id": 47,
      "comments": [
        {
          "score": 134,
          "content": "My sister’s thirty and she has a well-loved teddy bear (it’s falling apart, she’s gotta keep it up on a shelf) she had since she was a baby. If anyone tried touching that, hoo boy. I really don’t know where the uptick in entitled people came from, or if they’ve always been there and we’re just not calling them out enough.",
          "id": 48,
          "comments": [
            {
              "score": 52,
              "content": "I think we became too politically correct and have stopped calling poor behaviour out, in kids and in adults. And some parents/relatives seem to think everyone’s world should revolve around their ‘little darlings.’ \n\nI’d be very firm with your gf’s mother that the husky is off limits, and this topic will not be discussed again. Any attempts to take the husky will not be tolerated, and you will be prepared to remove them from your home, if they try for it. If this doesn’t work, tell them the police can quickly be called, and that you are willing to go to that, if their behaviour doesn’t improve. Being in your home is a privilege. They misbehave, they all get removed.\n\nThe most helpful advice I ever got from Reddit…. No is a full sentence. You don’t have to justify it.\n\nThese toys have meaning. More than just being a toy.",
              "id": 49,
              "comments": [
                {
                  "score": 88,
                  "content": "This has sod all to do with 'political correctness'. This is training children that other people's feelings don't matter, the very opposite of what political correctness was all about. Children don't learn this level of entitlement without help. And, from the story, it's quite obvious where they got it from. \n\nGood luck OP! Keep your stuffie safe and do NOT buy new ones for those kids. They need some good examples in their life. NTA",
                  "id": 50,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Entitled people are raised to be not told no.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "That is NOT what Political Correctness means.",
                  "id": 52,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I guess nobody's reading/watching The Velveteen Rabbit anymore? The \"drawn in pastel with narration\" film on PBS friggin' WRECKED me as a kid!\n\nFOUND IT! [https://www.youtube.com/watch?v=cKJLrgJ8B-U&ab\\_channel=W%C3%98EPD-RabbitEarsTV](https://www.youtube.com/watch?v=cKJLrgJ8B-U&ab_channel=W%C3%98EPD-RabbitEarsTV)",
                  "id": 53,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Watership Down.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This has ZERO to do with political correctness. It's a shitty woman being a shitty grandparent by overindulging her spoiled grandkids. And the kids' shitty, lazy mom also overindulging the spoiled kids. Where's the politics?",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "I'm 58 and still have my Tigger stuffie. There's nothing wrong with keeping a momento from your childhood.",
          "id": 56,
          "comments": [
            {
              "score": 24,
              "content": "I'm 60 and have my teddy and my toy horse from when I was a child.  No chance that I'm giving them away",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Exactly this! My stuffy is as old as I am - 49 - and she still hangs out on my night stand. When I’m sad my daughter always brings her to me. She - 13 - also has a stuffy, still has a spot in her bed. \nMy husband had my stuffy lovingly repaired since she was beyond repair. \nCherish your stuffy and secure it. It’s yours and yours alone.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "45 here and a 37 year old stuffy. She’s my parents’ favourite family member.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Yup. I'm 30 and I was given a stuffed dog when I was about 7. It's super important to me, because I was adopted right before I turned 4 and that was the very first thing my new mom already owned and gave to me. (The bought lots of toys for me. But being given something my mom had for years made me feel like real family.)\n\nI'd never give her to anyone. I have a 5yo now. I have given him every stuffed animal I have ever owned, except for Rosie. He's allowed to play with her, but knows she stays in mommies room.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "It's time for  locked box so it stays safe as well as air tag it. No one is entitled to your property.  If they don't understand then go to their house put on their jewelry and prized possessions and say it's the same thing. See if their tune changes.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 325,
      "content": "NTA \nSend your gf's mom a pacifier in the mail as she is clearly a baby and yet to grow up...then turn off your cell phone and have cuddle with your toys and gf.",
      "id": 62,
      "comments": [
        {
          "score": 45,
          "content": "This.  Omg to be a fly on the wall.   Unfortunately this will escalate the situation.",
          "id": 63,
          "comments": [
            {
              "score": 18,
              "content": "Worth it 😎",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Some situations need to be escalated at escape velocity.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": " I think if OP has a young family member who can ask gfs mom for her watch/ring/iphone/etc. Since she would clearly give anything to a young child who asks else she is a complete hypocrite.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "…and make to Ms Veruca Salt from OP.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 322,
      "content": "NTA. This is pure entitlement.\n\n>the promise of coming back to get the husky when I couldn't do anything about it\n\n\"I am planning to steal from you and I am stupid enough to tell you about it.\"",
      "id": 68,
      "comments": [
        {
          "score": 25,
          "content": "It’s also theft.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "But really, the nerve to plan a heist just to make sure you won't have to explain to the kids they will not get everything they want and that's just life is just shocking",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "She should text her in no uncertain terms that she is not welcome at her house anymore and that if she is found on the premises OP and her girlfriend will call the cops and have her arrested for burglary since she is threatening to steal your property.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 244,
      "content": "NTA. These girls are being raised very poorly. I can’t think of a time any of my kids have ever asked to bring something home from someone’s house, let alone thrown a screaming tantrum about it.",
      "id": 72,
      "comments": [
        {
          "score": 25,
          "content": "I've had a couple instances where they asked me later for X. just like So-and-so has.. but damn, just like you said. Never did they even ask, much less  pitch a fit when they couldn't bring something home.",
          "id": 73,
          "comments": [
            {
              "score": 10,
              "content": "This, I've had to purchase items that were replicas or similar for my son but he always knew that whatever someone else had was just his to *borrow* while we were where ever we were.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 154,
      "content": "NTA.  I have a teddy bear named Bessie that was gifted to me when I was 3 days old.  Bessie and I are now considered antiques.  I'd knife anyone who tried to take her away from me.",
      "id": 75,
      "comments": [
        {
          "score": 18,
          "content": "heck my sister still has the bear i picked for her when she was newborn in the hospital. its sitting on her bed shelf",
          "id": 76,
          "comments": [
            {
              "score": 3,
              "content": "Aww.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 121,
      "content": "I’m so perplexed. When did it become normal to demand someone else’s property and then harass them when they say no? The entitlement is insane to me. \n\nI have a cat beanie baby that I’ve had since I was a small child. My mother gave it to me and I took it everywhere. It’s currently still with me, sitting on top of my vanity mirror next to my side of the bed. I would -never- give her away to *anyone*. And if someone tried to call me names and degrade me for it, I can’t say I would handle it anywhere as nice as you have. \n\nThose girls are going to grow up just as awful as their aunt. Don’t buy them shit, OP.",
      "id": 78,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 121,
      "content": "Sounds like Emma is getting a dog bed in a box that can be locked for crating her when you are not home\n\nEdit: don’t forget to put food and water bowls in the crate!",
      "id": 79,
      "comments": [
        {
          "score": 17,
          "content": "And lock the crate!",
          "id": 80,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 92,
      "content": "Honestly, with the threat of her coming back to steal it, I would open up a seam and put a tile tracker in there and sew it back up. NTA ",
      "id": 81,
      "comments": [
        {
          "score": 28,
          "content": "yes op chip your dog lol",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 64,
      "content": "Nta\n\nNow when ever your girlfriend 's niece's visit you'll have to hide the stuffed animal. But next time you go to the girlfriend's parents house find something really nice and expensive Nancy, oh my God I love it. I want it and ask her if you didn't take it home. Say but you don't need it. Why do you have that? I want it. I deserve it. Please give it to me. And see what they say.",
      "id": 83,
      "comments": [
        {
          "score": 53,
          "content": "Nice thought experiment, but don't try to actually do it. Suppose they surprise you and say yes, then ask again for the stuffie.\n\nNeither the nieces nor their parents should ever be allowed inside your house again after making that credible threat.",
          "id": 84,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Do the nieces have favourite stuffies or toys? Ask if you can have it, since they don’t need it anymore after they fell in love with Emma.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}