{
  "post content": "So super weird situation and need a judgement. I (32M) have been engaged to Amanda (34F) for about a year, we dated for 3. She has a 12 year old daughter named Alexis. Me and Alexis have a good relationship. Me, Amanda and her ex all have a good relationship for the most part. I’m totally comfortable with my role. So Amanda, her ex and Alexis have this weird thing they do. They all get together on Sundays and hangout the three of them. I guess it started as a family tradition and then once they divorced they kept it going. They make breakfast, watch movies and just hang around all day together. I find it really weird tbh. Like I’m not insecure about it, but why you would want to spend a day a week with your ex is beyond me. I said how weird I found this when we started dating but Amanda said that Alexis looks forward to it weekly so she never stopped it. So at first I would just hang in our room or the basement all Sunday. But I got tired of being trapped in my own house so I started leaving the whole day. Amanda would never ask where I was going or anything. Wouldn’t even notice I was gone. \n\nSo at first I was golfing or getting errands done. Or would find a bar. But then I reconnected with my old friend Bella. Bella and me dated 5 years ago and have remained good friends since. She just broke up with her husband and moved into a new apartment. I told her one Sunday that I was just planning on going to the movies and she instead invited me over. We smoked some weed, watched some movies, cooked and just hung out. It was nice and ever since it’s become my weekly tradition. Whenever Sunday would come I’d head over to Bella’s and we’d just hangout all day. \n\nI didn’t see the need to bring up to Amanda where I was going. She never asked or even wondered where I was every Sunday. So yesterday Bella stopped by our house to drop off my phone charger because I left it at her place. Amanda asked why Bella had my phone charger. And I told her that it’s where I was on Sunday. She asked why I was there and I told her that was my Sunday hangout spot. She flipped out. Saying how rude it was to not let her know I was hanging out with an ex. I laughed and said “do you really not see the irony with that statement”. She said it’s different because she was forthcoming about her/ex’s relationship and that if I had an issue with it then I should have said so. I said I did already bring it up and that she said it was important to her daughter. Was I supposed to interfere with the highlight of her daughters week in order to make myself feel better? No I’ll just sneak out the back door and head to my friends house. And that I didn’t see why this was even an issue at all. We trust each other and are adults. Amanda doesn’t want me over there anymore and said she wants me to find another way to spend my Sundays. I said then I don’t want your ex over here on Sundays anymore if that’s how we’re playing this. AITA?\n\nUpdate: some shit has already hit the fan with the whole situation. I’ve put my foot down and said I’m not being forced out of my house anymore. That they can do Sunday funday at her ex’s place moving forward. I’ll post a complete update when I can. I did want to clarify that the reason I don’t hang out with them is that I was asked not to at first. Then I always felt awkward about the whole thing. So at first I stayed away because I was asked, then I felt like the fourth wheel so I decided to quit trying. Bella has really helped because she went through something similar with her SO.",
  "id": 1,
  "comments": [
    {
      "score": 30442,
      "content": "You had us in the first half. \n\nBut man. So many red flags in the second half. 100% YTA. \n\nHanging with an ex and keeping it a secret? That alone makes you an AH.",
      "id": 2,
      "comments": [
        {
          "score": 12352,
          "content": "While i totally agree with your judgment that OP is TA and obviously does have insecurity issues, even if he specifically says he has not... I cant help but ask myself why the girlfriend did never even bother to ask if he had a good day, too, or what he was doing all day. If I spend a day without my significant other, I always ask how their day was etc, just because I care and I am interested in my partner. \n\n(And as their relationship seems to be good, why was he never asked to join them every now and them if they consider him part of the family, too? I know its a tradition, but this way, he will always be an outsider.)",
          "id": 3,
          "comments": [
            {
              "score": 4369,
              "content": "I think OP mentions that she never “directly” asked him what he was doing, which is kind of a weird way to put it… and that she complained about her ex afterwards a few times, so at least it seems like she was talking about *her* day.",
              "id": 4,
              "comments": [
                {
                  "score": 3227,
                  "content": "OP wrote:\n\n>Amanda would never ask where I was going or anything. Wouldn’t even notice I was gone.\r  \n\r\n\nI dont think it is weird, but after reading the whole text it does sound like he is really frustrated and thinks she doesnt care about him just because she doesnt ask directly. \n\nDo you mind quoting the area where she complained about the ex/talked about her day? Because I cant really find anything about that.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 752,
                      "content": "I’m not very Reddit literate (sorry!!) but here’s a link. It’s OP commenting in a different thread in this post. \n\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/sexfa3/comment/huma0f6/",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 554,
                      "content": "I don’t think OP noticed that she noticed he was gone.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "But.. if she doesn't notice he left how would she know to ask? Like if she had always got a snarky response when he stayed in and she asked then she could have stopped asking because of his pissy attitude. None of us really know but op is a sourpus over trying to give a kid a nice Sunday with both parents. Lucky kid, unlucky mom.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I don’t know, don’t most men complain if you want to know every moment of their day? Last time I live with a guy I didn’t grill him every time he left the house.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Maybe she is giving him his “space” since she knows OP doesn’t like hanging with her ex. But she needs to do it for her daughter.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I've read over all of OP's comments and it looks deadass like this man was jealous/felt left out/whatever over the Sunday thing and ignored any guilty feelings about hanging out with his ex bc he figured he was justified in it. He is mad b/c he's been mad, and he is too immature to talk about it.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "OP is definitely the asshole but I find it weird that the ex comes over to their house and he is not included.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1673,
                  "content": "If he originally was running errands or just hanging out with male buddies, I can see why the fiancé wouldnt question it. The difference is that the fiancé is hanging out with her ex in the company of their daughter. OP hanging out with his ex solo.\n\nEdit: and OP knew about his fiancé situation from the beginning. The tradition predates their entire relationship. There was an understanding from\nThe beginning. OP’s behavior is not only a secret but it’s new. There was no discussion or agreement.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 3015,
                      "content": "The difference is also that the fiance wants to marry the man, allegedly, while excluding him from what she calls a family tradition.....sorry, that family doesn't exist in that form anymore.  What, should OP be excluded from all the major holidays, or am I being too much and really one full day every single week is clealry the appropriate amount of time to exercise a family tradition without your fiance?\n\nHow people think that's normal is wild to me.\n\nThe daughter should of course have quality time with her dad, but is there a legit reason why if mom is present her fiance should be excluded?\n\nThey pretending once a week that he doesn't exist, and mommy and daddy are back together? That healthy for the child?\n\nCause I tell you this....not healthy for the new family, and I don't even know if it's healthy for the kid who may simply see OP as the place holder while mommy and daddy figure it out.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 993,
                      "content": "The other thing is the fiancé is doing all that in the home she shares with the OP.  So the OP has always had the opportunity to be involved, or at least keep an eye on what's going on.  The OP going to an ex's place, getting high (no judgment overall, I smoke myself) and then thinking its not worth telling the fiancé?  Hell no.  I get that there is a level of comfort and trust in the relationship, but as soon as the ex came back around, OP should have spoke up.  Had he done it from the beginning this may have been no big deal.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 290,
                      "content": "Yeah, I am curious about timelines. When did he start leaving the house instead of entertaining himself at home, when did he *start* hanging out with Bella, when did his wife stop asking about anything that happened on Sunday? Because considering how OP worded an earlier comment he made, I do think she’s asked about his day before. Maybe not often enough anymore and maybe he thinks she doesn’t care. But I don’t think I buy her being 100% disconnected from him every Sunday.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "This. Not only is he hanging out with his ex, but he’s doing so solo, in her apartment, right after she and her husband split and getting intoxicated on top of it. \n\nHis partner on the other hand, has fully informed him on what she’s doing, is doing it at the house they live at together, he is welcome to stay there while it’s going on, she’s hanging out with her ex for the sake of her daughter, and is co parenting immaculately it seems. \n\nThe fact that he is trying to say they are doing the same thing is crazy, he is being sneaky and trying to “even the score” while she is being mature and forthcoming.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "He never mentioned how he \"reconnected\" with his ex either.\nThat would seriously bother me if my husband \"reconnected\" with an ex and spent the day smoking weed etc all day without telling me.\n\nI always ask husband how is day was. I don't believe she didn't. Especially if he was coming home high.\n\nHis partner and her ex have their daughter there as *chaperone*\n\nHe's off with his newly divorced ex.\n\nHe's TA",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Also, OP says he finds it weird to hang out with an ex and why anyone would do it is \"beyond him,\" and he is doing the exact same thing. Personally, I think the only reason people are finding it weird these 3 do this thing on a Sunday is because people are used to toxic ex family units. We have 2 mature adults here, comfortable in their situation and putting any negative feelings they may have aside, to do this one traditional thing for the sake of their daughter whom they love, gives her a sense of stability. I think it's awesome to do, and we should normalize co-parenting and healthy relationships between exes that involve children.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Maybe it's projecting, but OP's version seems also biased. It dues seem weird that after 3 years they've never involved OP (although it's possible they just assumed he was not interested). But regardless there's a very clear difference between what the fiancé is doing and OP's sneaking around with his ex. \n\nAt best this is a ESH situation, with op coming across as worse because he was actively being deceitful instead of just talking to his fiancé.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Honestly why the fuck does he think her hanging out with her ex is weird then goes and does it himself? Hypocrite",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I could see it being a weird loophole. Like, \"she only said 'how was your day' not 'what did you do today,' so it's okay that I've been lying by omission.\"",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I caught that phrasing also. I'm thinking lying by omission. Gf never directly asked were he went but maby how his day was. \n\nLike \"how was your day\" vs \"what did you do today\" \n\nIt's implied with the first but I could defiantly just say I had a great day and or say what I did but not were I was or who I was with.... man it sucks to be cheated on for years but you learn all the b******* that people pull.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 588,
              "content": "And when is he included?? After they get married, it's going to be incredibly hurtful for him to not being included with his stepdaughter. And what happens when they have kids together? Does she leave him home with their children while she hangs with the ex? \nI understand trying to make a divorce as calm as possible but when does she expect her daughter to accept the new part of her family??\nShe's got no right to judge his plans when he's a part of the family bit excluded from Sundays.",
              "id": 24,
              "comments": [
                {
                  "score": 478,
                  "content": "I'm not sold the wedding is happening.\n\nI mean you spend a full day every single week pretending he doesn't exist so you can relive your past relationship.\n\nAs you say, what if new kids? Whose family tradition worthy and who isn't?\n\nYikes.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 134,
                      "content": "Yes, this. The whole thing wouldn't be half as weird if OP was a part of this weekly brunch thing. Children complicate things, but maybe OP could have a talk with Amanda to precede another talk including Alexis about being a part of the get-together every week. If they do have kids and Alexis still wants it to be just her and her bio parents, how would OP's kids feel? \n\nEssentially, the family is already divided due to the wishes of Alexis. So either they can reach a compromise or the divide will widen if OP and Amanda get married.\n\nI didn't really think OP was the AH until he said he didn't see why it was a problem. Like, if he has just ran it by Amanda before running to an ex's house to smoke weed and chill, it wouldn't be bad. But he kept it a secret from her so I'd say, OP YTA.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Exactly, I wouldn't marry OP's girlfriend. \n\nIf she really had to have the ex over every Sunday all day to hang out, have meals, watch movies for their daughter, then when OP moved in and it was at OP's home OP needed to be invited. \n\nShe expected OP to live in exile and hide in their room or garage a full day every week to not get in the way of the ex's visit. That's shocking.\n\nESH. OP was shady but his fiancée sucks as a fiancée. She was super inconsiderate to him in exiling him once a week from his own home to make sure he is properly excluded from her ex's visits. Note that her response isn't that OP should join them, no, no, no.\n\nOP should go somewhere else. She still wants him out of the house once a week to not intrude on family time with  her ex, but he just needs to leave to a place she approves of. Come on. This is awful.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "OP just needs to cut his loses. He will forever be an outsider to this family. He would be better off getting back with his ex it sounds like.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "But yall seem to be okay with her reliving HER past relationship.... Kid or not. Kids can go to their rooms, play on phones, they can get outta sight quite fast. ESPECIALLY pre teens... So what are the PARENTS doing while the kid is occupied? I find it so wild, yall give her CARTE BLANCHE to hang wit hwr ex but yall make him out to be the bad guy....",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Good thing the wedding is going to happen on a Sunday...",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 375,
                  "content": "Was he barred from spending time with them on Sunday’s? Or did he never try because he found it weird? I don’t understand why they all couldn’t spend time together.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 318,
                      "content": "He says in one comment that Alexis (daughter) didn’t want him to. In another he says he wouldn’t want to intrude on family time anyway.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 251,
                  "content": "100% I don’t understand the Y T A. He is legit doing the same thing just without a child in between.\n\nEdit: for those who think playing house with your ex is not a road to cheating highly mistaken. Moreover, it create a false narrative for the child (yes children do believe mommy and daddy can get back together if they try hard enough).",
                  "id": 33,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Secretly hanging out with an ex and no kid =/= dad of your kid coming over to have breakfast and continue to have family time",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Yes and if they get married and the kids time with her mom and dad ends she’s going to resent her stepdad.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 368,
              "content": "Gotta love it when posts in here start with “we have a really good relationship”. Then proceeds to give half a dozen reasons why their relationship is in fact not good without a shred of awareness.",
              "id": 36,
              "comments": [
                {
                  "score": 31,
                  "content": "Also \"We trust each other\" ... Do you?? Because you think it's weird for her to hang out with her ex for her daughter's sake, and she doesn't think you can be friends with an ex, so... (ETA: It's possible that OP, in fact, cannot just be friends with an ex, but still.)",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Thats called trust. \"How was your day?\" is answerable with \"fine\". \"What did you do today\" is a different question.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I have a feeling she did and he probably was vague with the answers, not outright lying but intentionally withholding the info because he thought he wasn’t doing the right thing.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "To add\n\nHe leaves his own house so his fiance and kid can hang out with kids dad in ops house.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1229,
          "content": "Lol this is totally revenge on his part too. Like, he can’t understand why his gf is trying to be a good coparent with someone they have a CHILD with… but finds it completely normal and healthy to go spend time with his ex he has absolutely no connection to aside from the fact they used to date… and ever friggen Sunday? YTA op, mega time.\n\nEdit: I don’t think you can really call yourself an adult when you’re taking petty revenge shots like this towards someone who’s supposed to be your partner. Just break up already. Holy fuck.",
          "id": 41,
          "comments": [
            {
              "score": 397,
              "content": "There’s definitely a petty revenge feel to this: “Oh yeah? If you’re spending a whole day with an ex, then I will too!” That’s a childish reaction, as is not telling his fiancée and then pretending that his actions are equivalent to hers. Both of these things definitely make OP TA. \n\nThat said, I’m also a stepparent. I have a good relationship with my stepchild, and my husband and his ex co-parent amicably, which is good for all of us. But if they had a tradition, from which I was excluded, of spending an entire day each week, every week, all together at our house, during which time I had to make myself scarce, that would be … odd. I could see how this tradition started, as a way to help the daughter through the breakup, but continuing it, as a weekly thing, for years, while not recognizing the presence of current partners, isn’t really healthy. Of course, the way to handle that would’ve been through better communication, not passive aggressive pettiness. So I don’t fault OP for feeling hurt by an odd situation, but yeah, 0/10 do not recommend for the way he handled it.",
              "id": 42,
              "comments": [
                {
                  "score": 19,
                  "content": "Right, but wouldn’t the solution be to figure out a way to integrate you into the tradition… not pull the move OP opted for?",
                  "id": 43,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Oh, absolutely. Hence my YTA ruling for the way OP handled it. ETA: My point was I don’t think the solution is for everyone to go back to the status quo where OP gets kicked out of his house once a week and just have him not go to Bella’s. They all need to talk about what this tradition should look like going forward, recognizing that OP is now a part of the equation as well (assuming of course his fiancée doesn’t ditch him entirely for being a petty AH).",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 576,
          "content": "And so funny that he asks his fiance if she can't see the irony in thinking he should have told her.. when he himself can't see the irony that he thinks it's weird she hangs out with an ex every week.. and then  proceeds to hang out with his own ex every week.\n\nThe difference between them is that one is being honest and is motivated by whatever is best for her child,, while the other is lyimg and is motivated by pettiness at best,, and infidelity at worst.\n\nYTA",
          "id": 45,
          "comments": [
            {
              "score": 32,
              "content": "Right!  And she was completely up-front about where and how she was spending her time.  WTF.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I have been scrolling for ages to find someone saying this!! \nTHANK YOU!!!!! \nThat’s all I could think about when I was reading it!!",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 464,
          "content": "\"Why would you want to hang out with your all day.\"\n\n>Starts hanging out with his ex all day.\n\nIt doesn't sound like anything is happening with Bella, but why didn't he tell his partner? I also find it very weird that he and his partner have been dating 3 years and no attempt has been made to include him in the Sunday family time even a little.",
          "id": 48,
          "comments": [
            {
              "score": 21,
              "content": "On his part at least it sounds like an emotional affair, he's feeling disconnected from his partner and instead of finding a solution he's maintaining an emotional connection with someone else",
              "id": 49,
              "comments": [
                {
                  "score": 13,
                  "content": "I immediately thought of an emotional affair. I don't even think he has romantic feelings for her, she's just his weekly placeholder partner.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 12,
                      "content": "An emotional affair, but the emotion is passive aggression.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Sounds like he set himself up for a complicated scenario. Shoulda addressed that weird \"family tradition\" right off the bat. I wouldn't marry into that.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "But also, why is OP not allowed to hangout with the three of them on Sundays?",
          "id": 53,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Also, did the ex and Amanda not include the Op on Sunday’s? Why couldn’t it be all of them hanging out?",
          "id": 54,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "This. The best definition I've ever heard for cheating is \"something you wouldn't want to tell your partner\". Leaves a lot of room for different types of relationships, you set your own rules. But if you wouldn't want to tell about it, you shouldn't be doing it.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yep. And why isn't the solution that Amanda and Alexis go to the ex's house on Sundays from now on? It's totally reasonable to not want your partner's ex taking over your house one day a week, but to sneak over to YOUR ex's house *and get intoxicated together?* Really?",
          "id": 56,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "My favorite part of the entire post is how he can say this:  \n\" but why you would want to spend a day a week with your ex is beyond me\"  \nYeah OP, why would you want to spend a day a week with your ex?",
          "id": 57,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16283,
      "content": "*but why you would want to spend a day a week with your ex is beyond me.*\n\nYTA lol",
      "id": 58,
      "comments": [
        {
          "score": 4467,
          "content": "[removed]",
          "id": 59,
          "comments": [
            {
              "score": 4643,
              "content": "[removed]",
              "id": 60,
              "comments": [
                {
                  "score": 1713,
                  "content": "[removed]",
                  "id": 61,
                  "comments": [
                    {
                      "score": 28,
                      "content": "[removed]",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "[removed]",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 488,
                  "content": "[removed]",
                  "id": 64,
                  "comments": [
                    {
                      "score": 410,
                      "content": "[removed]",
                      "id": 65,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 126,
                      "content": "[removed]",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 840,
              "content": "[removed]",
              "id": 67,
              "comments": [
                {
                  "score": 322,
                  "content": "[removed]",
                  "id": 68,
                  "comments": [
                    {
                      "score": 187,
                      "content": "[removed]",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "[removed]",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 966,
          "content": "Why aren't there more comments pointing this out?! Dude, you aren't just TA, you're petty. Don't ruin Alexis' family day.",
          "id": 71,
          "comments": [
            {
              "score": 747,
              "content": "Why aren't more pointing out OP is a fiance whose partner is literally pretending once a week he doesn't exist in order to have her old relationship/family.  One full day every single week.\n\n\nThat's wildly toxic to a relationship, and unless mommy and daddy are practicing to get back together again....not sure this is good bejavioir to model for a child. \"Ya the person you marry, totally normal if they excluded you for a whole day 52 times a year while they do a \"family tradition\"\".",
              "id": 72,
              "comments": [
                {
                  "score": 707,
                  "content": "I don't see anything wrong with co-parenting and keeping a tradition strong for the kiddo. But actively excluding OP, the fiance and future stepdad, is totally toxic and weird.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 340,
                      "content": "If it was just dinner or lunch or something, I don't think it would be that weird to exclude the finance. But the full day? Ya that's super strange and he should be included. That said he's still the asshole in this scenario.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 156,
                  "content": "I agree that it’s wrong he’s expected to do that.\n\nSo why didn’t he just tell her that he was unhappy with the current arrangement, and at least attempt to find a compromise? \n\nThere is *a lot* of wiggle room between: having to hide and getting high at an ex’s (and being dishonest). It doesn’t sound like OP even tried, or told his fiancé he was unhappy.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 65,
                      "content": "Was he expected to do that? He says he hid in his room or the basement before. It’s not like he was ever kicked out of the house, so was he actually banned from joining them? Or did he just not want to?",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 29,
                  "content": "Add in the fact that this almost certainly turns Saturdays into a chore/errand day in which very little quality family/couple/relaxation time occurs and the fact that both OP and the fiancee are likely working full time and thus probably don't get much quality time together on weekdays, and OP's fiancee is probably getting more quality time per week with her ex than with OP. If the Sunday with the ex/baby daddy were once per month rather than every week, I'd have a harder time finding sympathy for OP, but every single week is patently ridiculous when you consider the time involved. Also, why isn't fiancee trying to create some new family traditions that do involve OP given that she allegedly plans on marrying him? For someone who's planning to add OP as a stepfather to her child, fiancee really doesn't seem to be making much effort to help build a relationship between OP and the future stepdaughter...\n\nQuestion: Did OP clarify whether he purposely went with his ex to spite fiancee or whether it just kinda happened and he found some irony in it after the fact?\n\nFrankly, I'm gonna go with ESH as far as OP and fiancee go, because OP should absolutely understand why she was upset, and she should also understand why OP is upset.\n\nEdit: added a space that was missing",
                  "id": 77,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Ya OP ain't off the hook.\n\nIt's funny cause despite being in a situation where we struggle to find that quality nonchore time in a 2 day weekend setup, I didn't even think of that point you are 1,000% correct on about the quality of time spent.\n\nThey might not see it yet, but their relationship is on very unstable ground imo.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yes exactly! You do not hang out with an ex once a week, that’s just absurd!",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "At what point does Alexis have to accept her parents aren't together, don't live together, and you don't have 'family day' with your ex while having your actual partner sit in his room or hang out in the basement?  At what point does she have to accept her mom has a new partner? Is she going to expect they reserve 'family day' for the ex after the wedding? When they have more kids? Or are we going to have \"Sorry, honey, but we can't have your party on your birthday, it's on Sunday and your big sister and your mom have Family Day with her dad so we can't be in the house and your mom will be busy.\"",
              "id": 80,
              "comments": [
                {
                  "score": 6,
                  "content": "Great points. I agree their dynamic is odd and not sustainable. I think there is a better compromise out there then saying \"no more family days at our house if I don't get to go spend the day getting high with my ex\"",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 303,
          "content": "When I read “I reconnected with *my* ex” I was like, uh oh.\n\nDude is trying a subtle (or not so subtle) “how does it feel that I spend all day with my ex!” move.",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 219,
          "content": "i was gonna say n t a until i saw the hypocrisy lmfao. it’s also not about OP’s fiancé spending time with an ex, it’s about doing something to make her daughter happy.",
          "id": 83,
          "comments": [
            {
              "score": 182,
              "content": "So the daughter requested the fiance, her soon to be step dad, gets excluded for a full day every single week for...get this....family tradition?\n\nSo uh, as another poster mentioned.....what if OP and his fiance have another kid?\n\nDoes kid get excluded, or just its father.....every single week for a full day, for a family tradition?\n\nMy advice to OP would be not to marry women who already have a family with a partner.\n\nThe daughter spending time with the dad is about the daughter.  The daughter spending time with mom snd dad occasionally can even be about the daughter.  Heck, the daughter dad, mom, and mom's soon to be husband can be about the daughter.\n\nRole playing your old relationship for a full day every single week is far more than just about the daughter, bit I don't doubt thats how it was originally intended.",
              "id": 84,
              "comments": [
                {
                  "score": 15,
                  "content": "This is what I was thinking too. Like how long are they going to keep this up for? \nDivorce is hard for kids (I would know) but from my experience it’s best if you don’t keep playing house once a week after the divorce. I think I would have been really confused as a little kid if my parents had done this. If they are 100% doing it “for the kid”, I think their good intentions are misguided. \n\nAs for OP, yeah what he did was shady but I don’t think his fiancé is completely innocent here either. Sounds like a giant mess overall that should probably be sorted out in couples/family counselling",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Nice call XD",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I smell a hypocrite",
          "id": 87,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "The hypocrisy in that statement is staggering. Just a couple of paragraphs later and he's spending all day with an ex like it's totally fine. Then he has the cheek to call his partner a hypocrite!",
          "id": 88,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9726,
      "content": "ESH\n\nWhy did you feel the need to hide in your own house rather than hanging out with them, doing projects around the house, etc?\n\nPersonally I’d be livid about be kicked out of my space every single weekend, but you also clearly are using Bella to get a dig in at Amanda.",
      "id": 89,
      "comments": [
        {
          "score": 2858,
          "content": "Because I was asked to. Because Alexis viewed it as her family time. And also I didn’t really have all that much interest in spending that time with the three of them. Trust me I’m not happy about having to leave my house for half the weekend. But Amanda is amazing and I understood the dynamic when I committed to her.",
          "id": 90,
          "comments": [
            {
              "score": 3071,
              "content": "Why can't they do this at his house? I think I would get a little tired of this arrangement. \n\nNTA.",
              "id": 91,
              "comments": [
                {
                  "score": 1153,
                  "content": "I think that’s a good question. Maybe Alexis lives with mom full-time, but it’s not nice to completely exclude someone from an activity that happens weekly at their own place. Even though it sounds like OP doesn’t actually want to hang out with the three of them at this point.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 567,
                      "content": "I mean if the three of them are too wrapped up in each other for OP to be all that involved, I can see why he'd feel awkward...",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "If I'm OP, it's not that I feel excluded from the family gathering, but that it's happening at all. Unless the ex can only legally visit the child while the mom is present, the child should be with *the ex only* for ex's visit. And it definitely shouldn't be happening in my house! \n\nI'm a huge proponent of even the most strained exes remaining cordial for the sake of their children, but acting like you're a happy family isn't healthy either. There's a *reason* for the divorce.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 294,
                  "content": "Maybe they intended it to be for OP's peace of mind? Like, the three get together somewhere OP has access to so he doesn't have to be suspicious of anything shady going on.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 16,
                      "content": "But he knew about this dynamic going into it and was fine with it. It’s having to share his space with this man who just *has* to come over every week that’s the issue. Whether they are doing it for his peace of mind or not- he’s already expressed his discomfort with the situation. Right then would have been a great time to compromise and find out what they can do differently. Instead they just said it was for the kid and that’s that end of story. I mean, it’s hard not to get that jealous feeling when your lover is spending time with someone they used to love but I’d much rather know about it and not have to see it take place. Or at least only see it take place every other week instead of every week. That’s a sure way to get someone to hate Sundays lol. Anyways, ESH",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "If they were so considerate of OP's feelings then they would include him in their trio. Its more likely the ex has a partner at his house that doesn't want them over.",
                      "id": 97,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 147,
                  "content": "I agree with you.  It's weird that the ex is in their home, every Sunday and OP can't move around freely cause the kid does not want him there.  NTA.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Why don’t they go to the dads house? Instead of kicking you out?",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Honestly it's doing far more damage to the kid than anyone. Role playing and pretending everything is alright once a week only prolongs the hurt. \n\nThey need to rip the band aide off",
                  "id": 100,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I agree. But my main thought was these two never get a lazy Sunday morning, never get a whole weekend together & he has to leave the house. I understand why but I still think they should be going to the ex's house if they insist on doing this.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1356,
              "content": "Sorry but this dynamic is really unhealthy. Even her daughter needs to understand that it is not a reasonable request to exclude a current partner for ex-family time. If this was happening for a yearly vacation, its one thing, but every week their family reconvening like they are still married is really not acceptable.",
              "id": 102,
              "comments": [
                {
                  "score": 645,
                  "content": "I had to double check the ages. The daughter is 12, not 2. Toddlers need routines, a sense of belonging, and a lot of consistency. Pre-teens benefit from those things, too, but they’re a lot more capable of understanding life changes. A full day once a week, more than 3 years after the divorce, is a lot of time to exclude all the new people in their lives. Once a month would be more reasonable. \n\nI get the feeling that OP has somewhat reluctantly accepted the status quo, maybe thinking it would evolve over time as the daughter grew older.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 488,
                      "content": "I have a feeling this is so important to the daughter because she is still hoping her parents will get back together. Especially as it sounds like the daughter is the one who asked OP be excluded.\n\nPlaying house every weekend at the request of the daughter is just playing into her fantasy that they can still be a family. I have a feeling that if OP marries Amanda, the daughter is going to suddenly start acting out.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Exactly she’s almost a teenage not a toddler. Rip the bandaid off",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "I agree in a sense that yeah it would be ideal if he was included and they all spent time together as a family and I’m sure there’s a way to get Alexis to go along with this but it honestly seems like he doesn’t want to hang out with them so what’s the point?",
                  "id": 106,
                  "comments": [
                    {
                      "score": 5,
                      "content": "She doesn’t want to hang out with him during “family time,” and he’s totally fine with not being considered “family.”\n\n…Why are they getting married again?",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I agree. Coming together as a family again for special things like a yearly vacation, holidays, and birthdays are totally normal and good for the kid to have. But playing house with the ex every week without even trying to include OP? Weird and unhealthy imo.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "The 12 year old is obviously hoping her parents will get back together and it’s up to the mother to explain why that won’t happen and that excluding the current partner *every week* is very rude.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Daughter wants her family back and mom and dad are encouraging it.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 483,
              "content": "If you’re to be married though and be Alexis’s stepfather, surely you should be involved in their Sundays? At least for a little bit. My parents divorced when I was 7, I lived with my dad. my mum would come over once a week and spend the whole day, even if I was at school. My stepdad would come and pick her up in the evening, we’d always have dinner waiting for him that day and he’d spend a couple of hours with us. My stepdad found it weird but ultimately understood that it was for me. We also understood that he was part of the parenting dynamic and should be included",
              "id": 111,
              "comments": [
                {
                  "score": 285,
                  "content": "He was asked not to. He spends the other 6.2 days with wife/step kid and was told to make himself scarce, which he does. He did exactly what he was asked to do: leave his wife alone with her ex and the step kid.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 133,
                      "content": "He was asked not to by the kid. And that's where he needed to adult and tell his fiancé that he should be included since he is part of the family rather than sulking in the basement and then going to get high with his recently divorced ex.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 155,
                  "content": "Right, like I get Alexis sees this as her family time, but surely there's a non-intrusive way to start slowly including OP in some activities? He is going to be part of her family, has anyone even asked Alexis if she'd be ok with him there every once in a while? OP's comment is a little vague. Maybe he should talk to Alexis about this himself.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 83,
                      "content": "Or even make it a half day? Breakfast and hanging out for a bit is way more reasonable given the living situation. Everyone adapts to new living situations. So after they moved in together why didn’t Amanda say they needed to finish up a little earlier because OP lives there too? Or why don’t they go to the park for a while so OP can move around freely? Or he gives them some time to themselves, but then later when they’re chilling on the couch watching a movie he hangs out with them?\n\nThere were so many solutions that could have made this more fair for everyone involved, but it seems like nobody had any real conversations or tried to come up with any solutions. Instead he’s getting back at his fiancé by hanging out with his ex in a not remotely similar situation. If he’s not cheating already, he’s on the verge of it.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Your divorced parents would spend the whole day together alone while you were at school once a week and your step dad didn't care? That's super weird...",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 392,
              "content": "See, as much as I think your behavior is super childish, I'm not a fan of Amanda's setup either. She's basically playing pretend one day a week for her daughter. Let her close her eyes and imagine that mommy and daddy never split up. It goes beyond a \"good coparenting relationship\"",
              "id": 117,
              "comments": [
                {
                  "score": 112,
                  "content": "Absolutely. You can have a cordial relationship with the parent of your child without playing \"happy family\" once a week.  \nHow is this child going to accept OP as the partner of her mom if the mom still seems perfectly happy with dad? Why did they even divorce if everything's fine?\n\nSo confusing for a kid.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 249,
              "content": "Doesn't the ex have a home???",
              "id": 119,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 223,
              "content": "I think if you had not sneaked around and just said, \"I'm going to be spending Sundays with my ex\" that would have been fair.  She wants to spend them with her ex; you get to spend them with your ex.  If they wanted \"happy family\" for the kid they should have stayed together and worked on their marriage.  What she's doing is not committing fully to your relationship and clinging to this fake \"happy family\" scenario.  It's disingenuous and she needs to move on.",
              "id": 120,
              "comments": [
                {
                  "score": 94,
                  "content": "I agree. And I'm baffled with the responses on here. Many people saying \"just join them\" as if that's going to solve the whole problem.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Redditors skew very young and inexperienced these days.  There is often an idealized vision of how things \\*should\\* be.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I saw that OP also commented that Amanda asked him to stay out of it too.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "A 12yo is old enough to understand that this isn't normal.  I'm sure she has friends that are in blended families, and they don't do this.  She's also old enough to understand what kind of negative emotional load this puts on you.  This whole thing should have been done years ago.  I could get if they did it a few times a year, or even once a month, but every week, all year long is really bizarre.\n\nEdit:  You and your wife are her family, and her and her father are family.  Your wife, the daughter and the father are no longer a combined family.  Continuing to imply otherwise isn't healthy for anyone.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "Break with fiance She doesn't respect you and her daughter wants her dad. Maybe try counseling but this is toxic",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 49,
              "content": "Sounds exhausting.",
              "id": 126,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "Have you revisited this discussion at all since you first started dating Amanda? It entirely makes sense that mom’s boyfriend would be excluded from special parent time with an 8-9 year old, and it was the right move on your part to respect that. At this point, though, you’re engaged and a regular part of Alexis’ life, and Alexis is older. Why not sit down with Amanda and talk about whether Alexis might be comfortable adding you to the mix or cutting down the length of the hangout?",
              "id": 127,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah, I mean, they're engaged and living together at this point. It having to be the three of them every time is weird. Why can't dad take Alexis out to dinner or something for quality time? It really does sound like Alexis doesn't want to let go of the old family or something, which isn't fair to OP.\n\nESH, but I understand why OP did what he did.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 134,
          "content": "This sums it up. ESH is the only right answer here.",
          "id": 129,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 101,
          "content": "Kinda wondering that myself - I don't see why he couldn't remain at home and just give them space.  I've been a step parent and my step daughters mom would sometimes come over to spend time with her, I didn't leave my house, I just went about my day like normal.",
          "id": 130,
          "comments": [
            {
              "score": 148,
              "content": "He did though - he said he just got tired of staying home a lot so that's why he would go to stuff. Also Amanda asked him not to interfere so :/",
              "id": 131,
              "comments": [
                {
                  "score": 221,
                  "content": "Yeah, I see from his replies and comments why he doesn't.\n\n&#x200B;\n\nnot gonna lie, I do think it's pretty mean of them to ask this of him EVERY sunday for most of the day.  He's put up with it longer than most people would have.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 98,
                      "content": "Yeah. Tbh first glance, i was gonna say NTA but now I think its a soft ESH bc she literally has asked him to not interfere with their \"family time\" (like he's not family?) and in response has stayed out of their way for a while & got fed up with just not doing stuff. He went out, reconnected with an old friend who he didn't state was an ex until the very last part of the story (which I thought was also weird?). Then proceeded to turn it against his fiance when she questioned him, almost like that was a hidden agenda all along. \n\nBUT I think the fiance is a bigger ass than he is because what if the positions were flipped? Idk I feel like there might not be enough context or info\n\nEdit: i reread it and he does mention that it was his ex. Either way my ESH still stands",
                      "id": 133,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "This is the correct answer and honestly I'm rolling my eyes at the top comments. His wife steamrolled over his discomfort with the situation and now she wants to cry about it when he's doing the same thing. Their daughter is twelve, that's old enough for them to ease towards something else, and it's garbage that she's now trying to forbid OP from doing this. \n\nObviously he shouldn't have concealed it but people are cutting her a hell of a lot of slack on this.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "The weekend is the only time I get to spend any quality time at my home on projects. I'd loose my mind if I had to work all week for oy a single day at home.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "He didn't do it to get a jab. Bro he didn't even tell her until it came up he wasn't rubbing it in her face.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6549,
      "content": "YTA. Amanda and her ex have a child together. You and Bella do not. Do you really not see the difference? They're spending time with their kid who still needs them, meanwhile you're off having what sounds like an emotional affair.",
      "id": 137,
      "comments": [
        {
          "score": 1831,
          "content": "This was my thought too. OP, if you can’t see the difference in your situations then I’m not sure you should stay in your relationship. Your fiancé feels obligated to do this Sunday routine for her kid. You on the other hand do it for fun? I think it is a bad idea and some sort of petty power play or the beginnings of an affair. YTA.",
          "id": 138,
          "comments": [
            {
              "score": 614,
              "content": "I don't in fact see anything different in these situations.  \n\n\nI have an ex. I have a child. We don't hang out as a unit. TBH I feel like that's actually a really unhealthy dynamic.   \n\n\nA good coparenting relationship should be business like, and with clear boundaries.",
              "id": 139,
              "comments": [
                {
                  "score": 650,
                  "content": "Kids need both their parents and it’s obvious the kid likes hanging out with both her parents at the same time. They’re doing it for her",
                  "id": 140,
                  "comments": [
                    {
                      "score": 375,
                      "content": "I honestly think OP should be included in this though",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "She needs to learn to have a relationship with each parent separately. The difference between spending time with each parents vs as a family is that mom and dad have to act all buddy buddy for the day. It's either a false relationship put on for show at that point, or the fiance is showing it's okay to have a platonic relationship with your ex. Which makes what OP is doing okay of they're just hanging out like friends",
                      "id": 142,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "But that's also not how life works lol. 12yrs old is about that age where that dynamic should begin to be understood.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 432,
                  "content": "When my parents divorced (and they got along too) playing \"happy family\" one day a week would have confused the crap out of me. I don't care if mom is engaged to another man. There is still that hope that mom and dad are getting back together because they act like it every Sunday.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 15,
                      "content": "THIS.\n\nI've been a step-dad for 10 years, and the whole time I swear one of my step kids has wished their parents would get back together.  Even though it was their dad who cheated, had more kids and married the homewrecker, it was some how MY fault for coming into their mom's life 2 years later.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Thank you for emotional affair comment, I haven't seen anyone else talking about that aspect",
              "id": 146,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "The fact that the ex comes EVERY SUNDAY to hang out though is WEIRD AF and kind of offensive tbh for OP.  OP if I were you I would be extremely uncomfortable.  Reverse the genders in the situation.  I would NEVER want to be excluded every Sunday in my OWN place from my fiance.  This is very fucked up I don't know why people on this sub think it's such a good idea.   OP if you are very bothered by it please break off the engagement.  There are a lot of other childless women out there that won't put you in this situation.  You are wasting time.  Instead of hanging out with your own ex, you should have been trying to tell you fiance how you really feel.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "An emotional affair?\n\nBy smoking weed and cooking together?  Damn, I guess I got some news for my friends.",
          "id": 148,
          "comments": [
            {
              "score": 4,
              "content": "There's a difference between having friends and secretly hanging out with an ex every week.",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": ">  meanwhile you're off having what sounds like an emotional affair.\n\nthat's a very weird word for \"friendship\".\n\nPeople can be friends with exes. People can be with friends with people of different genders. Not everyone is having affairs all the time.\n\nI'm not gonna comment on the general situation because there's clearly a big problem with communication there and it's a mess, but why do people on here instantly jump to \"cheating\" all the time?",
          "id": 150,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "So you are saying that OP and Bella should have a kid together and it will all be ok   /s",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Who wants to spend every fu….ing sunday with your ex?? Why did they Even divorce if they «coparent» so well? And why cant he spend sundays with his ex , you think he should stay in the basement in HIS house, when his fiance «plays happy family with kid and ex»?",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "And that shouldn’t bother him?",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5150,
      "content": "I know I'm going to be downvoted, but I dont care. People can coparent just fine without devoting an entire day to pretending they aren't split up.This whole arrangement screams of still being a happy little family minus the fiance. Should have he told his fiance he was hanging out with another chick? Yeah. I personally dont think she gets a vote in what he does though. I think it's a situation of pot meeting kettle. I personally wouldnt have put up with their little Sunday Sham for even a minute.",
      "id": 154,
      "comments": [
        {
          "score": 1090,
          "content": "I agree and what happens when they kids? How is that Sunday arrangement going to work?",
          "id": 155,
          "comments": [
            {
              "score": 576,
              "content": "I think that OP should have started being included on Sunday family time (at least starting when they got engaged), but it seems like none of them want that. I think there's more to this than family traditions. OPs comments talk about how great his fiancée is, but don't say much about his future step daughter. I'm wondering if this is a situation where he wants the marriage without actually being a step-parent.",
              "id": 156,
              "comments": [
                {
                  "score": 549,
                  "content": "Or the whole Sunday thing is causing the daughter to keep believing her parents will get back together any day now, thus making it impossible for OP to build a healthy relationship with her. Also, regarding OP not wanting to join them, nobody is happy to be somewhere they are not wanted, if him joining would be against the express will of daughter (and likely ex) it would not be a fun or relaxing day anymore. Don't get me wrong, I think he should have been up front with his fiancé and I think he handled this badly but he is far from the only AH in this group.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 225,
                      "content": "Also the daughter herself asked OP not to be there, because it's *her* family time. The kid doesn't see OP as family.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 126,
                      "content": "Yeah there’s this weird dynamic going on and I bet the daughter is hoping they’ll be back as a happy family.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "If Sunday is family day, it seems like OP needs to read the not-so-subtle message his fiancée is sending here: *he’s not part of the family.*\n\nIf you were serious about wanting to build a life with a new partner, how would you not find a way to include him?\n\nIf you were serious about becoming a part of a woman’s family, how would you not insist on being included?\n\nThey should both be jazzed about building new traditions and finding things that all four of them can do together.\n\nHer family day doesn’t include him, and it seems like he’s totally fine with that. Doesn’t sound like they much want to be each other’s family. So…why are they getting married again?",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 206,
              "content": "Gosh. If they have kids and the Sunday thing can’t happen anymore, Alexis is going to blame her half siblings and OP. Instead of gradually transitioning to a new family arrangement, it’ll be sudden and acute.",
              "id": 161,
              "comments": [
                {
                  "score": 7,
                  "content": "Yeah but he says he doesn't want kids of his own so I think they're at least okay on that front.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "I agree with you NTA but maybe a little for not mentioning the ex because you kinda knew it was gonna come up at some point.  The whole still having a little family thing on sundays is just a time bomb. Alexis should definitely have time with father, not sure of the legal custody breakout, but that should be the baseline, if there isn’t one, then that’s the first misstep. Again another timebomb.  Alexis should also be spending time with the father at the fathers house/residence or at a neutral location (details about the status of the father we’re not provided so just going on what we have here).  \n\nIf Amanda’s intentions are to have a long term relationship with OP then that needs to be the priority and parenting time of the other parent needs to be without Amanda being there. People on here are saying it’s about Alexis spending time with mommy and daddy, if that’s really the priority why is OP involved? I thought Amanda had moved onto another relationship with the OP. \n\nContinuing on as if Alexis’s parents are still in a relationship even if it’s just one day a week is just delaying the inevitable and messing with Alexis’s mental health.\n\n(Edit: added spaces between paragraphs)",
          "id": 163,
          "comments": [
            {
              "score": 37,
              "content": "Yeah I am surprised about the Y T As here this is a weird set up and depending on how OPs ex is they might just be platonic friends. I don't think OP intends on cheating but more is being passive aggressive. How can you get mad at OP for finding something to do? Personally I would have probably put my foot down after a few months.\n\nPersonally I feel this falls on NTA bordering on E SH",
              "id": 164,
              "comments": [
                {
                  "score": 22,
                  "content": "I agree, it's pretty hypocritical to give him a YTA and not an ESH. They're be ding over backwards to put all the blame on him.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 203,
          "content": "Same here! I co-parent with my ex and we don’t have to spend an entire day huddled up together. It’s weird and awkward. Even despite our split being amicable, it would be hella uncomfortable to hang out for a full day. Plus my significant other would feel awful and rejected. This whole situation is weird and OP’s fiancé is still attached to her ex. No doubt about it.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "I'm with you on this one. That whole Sunday ritual is weird and even worse is that he had to be kicked out of his own place. \n\nBut honestly rather than just hang out with an ex, I wouldn't have dated her.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "[deleted]",
          "id": 168,
          "comments": [
            {
              "score": 335,
              "content": "And what happens if OP and fiancé have a child.  Are these fake family days going to exclude the new child or just keep excluding OP.",
              "id": 169,
              "comments": [
                {
                  "score": 144,
                  "content": "Then kick the husband and the kid out for Alexis and Ex, Duh. It's the family dynamic after all.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Hahahahahah",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 163,
              "content": "I think it would be different if the parents were actively doing things with their daughter, or if the events were shorter, like a movie morning on Sundays. But what they're doing now just sounds like movie cuddle time all day. Board games, a trip to the park, making cookies or something like that? I think that's normal. Spending a full day a week glued to the tv screen sitting on a couch? That's a bit strange.",
              "id": 172,
              "comments": [
                {
                  "score": 31,
                  "content": "It's very strange, and it's hilarious people think that just because a young child is around you can't be romantic even physically.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 136,
              "content": "I would think that it would be very confusing to the child and that it sends mixed messages.  Especially with her step father being excluded. \n\nIt's a weird thing.  \nOn that note ESH.",
              "id": 174,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I would have loved my parents to have done this. And if they had, they would have been miserable. They divorced. Life changed. Pretending one day a week may not be as good for the daughter as they think. When a kid is allowed to think I want mommy and daddy together and everyone else goes away...not good for anyone.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 56,
          "content": "I agree with this view.  The whole dynamic is very one-sided towards the fiance.  Honestly I think it's disrespectful like OP how did you put up with this for so long?   It almost seems like a Sunday fantasy to the fiance, a fantasy that OP is clearly not invited to.  This is why I would never want to date someone with children.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Agreed.. very right, and not a healthy situation to pretend everything is normal for the daughter. They should spend Sundays in family councelling to try to help Alexis adjust to the divorce.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Agree. I have a lot of friends who are divorced with kids and I have never heard of anything like this. Occasional outings, sure. Once a week - every week!! - all day!! - is weird and excessive. Not saying hanging out with Bella is a great idea (obv) but this feels very much like ESH. \n\nCan you call a reset on this whole Sunday thing and figure something out that actually makes sense?",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Agreed. The occasional afternoon and  for all three is fine but every Sunday? No",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I agree. I think OP is a little bit of an AH for keeping his hangouts from Amanda, but OP let’s her do things with her ex, why can’t he? Seems hypocritical to me. I also don’t like the idea of partners telling partners who they can and cannot spend time with. Perhaps the three of them can spend some time together and Amanda can see they’re just friends.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2464,
      "content": "YTA\n\nIt almost seems like you did this on purpose to get back at her. Like you thought this was a gotcha, you dont like me hanging out with an ex? Well so are you so now you're a hypocrit if you dont like me doing it, so if I have to stop so do you!\n\nWhat you forget is context. They do this because its important to their daughter, its something she looks forward to. They never hid or just so happened to not inform you, you knew all along that this was going on and if it was a deal breaker for you you had that choise. \n\nYou are hanging out with an ex getting high all sunday for you and yourself, without informing your fiance so she could make an informed desition if this is a deal breaker for her or not.",
      "id": 181,
      "comments": [
        {
          "score": 637,
          "content": "Yes, OP seems extremely passive aggressive in this situation.",
          "id": 182,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "It’s extremely weird for OP’s fiancée to play happy family every single week for an entire day. Not only that, but to do it in OP’s own house and tell him he isn’t wanted there. Being good co-parents doesn’t mean you pretend to be together, especially not every single week.\n\nI wouldn’t put up with that and would’ve left, personally. And OP is TA for hanging out with a friend?",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "[deleted]",
          "id": 184,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2411,
      "content": "ESH.  You should have been forthcoming about hanging with your ex.  I mean I'm friends with a couple of people I've dated so I know it can be plutonic but for the sake of trust you should have let Amanda know.  \n\nNow the other side is hella weird for sure.  Not the 3 of them hanging out but the fact they don't include you.  That's disrespectful.   Like you're just supposed to leave your house or hang in your bedroom all day?  WTF is that?",
      "id": 185,
      "comments": [
        {
          "score": 784,
          "content": "I'm still stuck on the fact she didn't ask him what he gets up to while she's playing fake happy families with her ex and their kid. Does she not care?",
          "id": 186,
          "comments": [
            {
              "score": 306,
              "content": "OP said that she asked but she never “directly asked”. So OP was definitely trying to keep it a secret.",
              "id": 187,
              "comments": [
                {
                  "score": 73,
                  "content": "Yeah I am curious about this. Was it \"What did you do today?\" \"Nothing, stop questioning me\".  I mean, if someone answers like that, you do eventually stop asking.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 10,
                      "content": "It was probably more like \"What did you do today?\" and OP responds \"Hung out with a friend\"",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "I mean an indirect question can also be did you have a good day? that’s really generic and non committal to a conversation.",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 200,
              "content": "He actually says at one point that he lied & said he was going to the movies, then went & saw her so the part about him not being directly asked just isn’t true. He’s definitely trying to paint it to be like he she just acted like he didn’t exist on Sunday’s & with some of the inconsistencies I feel like he’s exaggerating to make people go easier on him. If his position is that there’s no normal way to hang out with an ex then he can’t also say he’s hanging out with his for normal reasons. He actively hid seeing his ex which doesn’t sound like how you’d confront this even from a spiteful angle. He big sus.",
              "id": 191,
              "comments": [
                {
                  "score": 122,
                  "content": "I read that as he was planning to go to movies, then ex called and he says instead went to her place (new plans). Then Sundays have continued since",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "[She did, he admitted so in another post.](https://old.reddit.com/r/AmItheAsshole/comments/sexfa3/aita_for_not_telling_my_fianc%C3%A9_where_i_go_on/huma0f6/) The original post was as misleading as he's been with his partner.\n\nOP is full of shit and hiding information even from internet strangers. He knows damn well he's in the wrong.",
              "id": 193,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 212,
          "content": "Plutonic, as derived from the former planet Pluto",
          "id": 194,
          "comments": [
            {
              "score": 47,
              "content": "Nah, he means that his friendships with his exes are like igneous rock that was formed by solidification at considerable depth beneath the earth's surface. IMO, it's not gneiss to treat your fiance like schist. He's clearly taking her for granite.",
              "id": 195,
              "comments": [
                {
                  "score": 6,
                  "content": "Subscribed to geology joshing",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "Every time I see that I imagine aliens being friendly with each other, just hanging out.",
              "id": 197,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I thought Pluto was a cartoon dog?",
              "id": 198,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "From one of his comments it sounds like he’s welcome to join but he doesn’t relish hanging out with them. [OP’s comment](https://www.reddit.com/r/AmItheAsshole/comments/sexfa3/aita_for_not_telling_my_fianc%C3%A9_where_i_go_on/hum8seg/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) Understandable, but doesn’t change much to me. As someone else said, sounds like he started this as a gotcha: you do it, so I do too. [comment](https://www.reddit.com/r/AmItheAsshole/comments/sexfa3/aita_for_not_telling_my_fianc%C3%A9_where_i_go_on/humcsdq/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nI’m going, YTA. One is weird but open, OP’s is selfish and secret.",
          "id": 199,
          "comments": [
            {
              "score": 6,
              "content": "In one comment, OP says he was asked not to join because the stepdaughter didn't want him to.  But that he ALSO didn't want to join. I think the first part is more important than the latter part.",
              "id": 200,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1146,
      "content": "ESH. \n\nYour fiance shouldn't be so markedly excluding you every Sunday. \n\nYou shouldn't be hanging out with an ex without telling her.",
      "id": 201,
      "comments": [
        {
          "score": 115,
          "content": "I understand doing things for the daughter but the vibe here is very much “oh it’s her favorite day of the week,” “oh I’m excluded because she wants me not to be there.” She’s 12. This reads like the get your parents back together part of the Parent Trap with one kid. They can do things to support her without letting her dictate their behavior toward OP. (Yes OP shouldn’t have used his ex to get back at Amanda, passive aggressiveness didn’t seem to help anything here, but there is something very much ESH about the way they just caved to the point of excluding OP in his own home like that.)",
          "id": 202,
          "comments": [
            {
              "score": 10,
              "content": "I agree. Couldn't have said it better myself. It did remind me of the Parent Trap",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 850,
      "content": "YTA\n\nI think that you handled this incredibly poorly. I mean you knew how she would react, of course she wouldn’t be comfortable with you sneaking around with your ex, because that was what you were doing.\n\nYour girlfriend has been forthcoming with you about this tradition between her ex, her daughter, and herself. Like you knew that was happening, and it was happening under your roof while you were there so you also knew it was all fine.\n\nI’ll be honest while I was typing this out I was originally putting E S H, because she was having her ex over. However as I thought about it, she was honest with you, while you were shady with her.\n\nYou need to apologize and find another way to spend your Sunday.\n\nI will throw you a bone here, I do think your girlfriend and her ex need to find a better way to practice this tradition so you don’t feel uncomfortable in your own home, that’s not really fair to you.\n\nEdit per advice from a below reply",
      "id": 204,
      "comments": [
        {
          "score": 101,
          "content": "Totally agree, this was not the way to handle things. He is marrying into the family, it would be reasonable to have a discussion about him joining Sunday hangout once in a while, or taking 1 Sunday a month to spend with his fiance and stepdaughter. But none of what his fiance is doing justifies hanging out with your ex and not telling your fiance, that's just inappropriate and makes it YTA.\n\nOP honestly has no business getting married if this is how he handles conflict.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Yes. A good way to do that is let the kid spend time with her dad alone. Them being all together is gonna make the kid think they're all still together. They're not.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "He was an idiot for accepting this tradition in the first place. Getting told to disappear in his own home? For half of each weekend? That would have and probably should have been a show stop for anyone. Apparently this was the kid's request. But his fiancé should not be playing happy family with another guy in OP's home. \n\nProbably ESH. Fiancé is biggest AH, followed by OP being immature and not just talking this out. Ex should not be enabling this scenario either.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "You can be honest and still be an asshole. ESH",
          "id": 208,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 738,
      "content": "NTA. It’s weird how literally one half of every weekend is spent with the ex pretending they’re still a happy family. It’s obvious this is what they’re doing because he’s not even allowed in the house. It’s not normal and your relationship is going to suffer for it. You can be great coparents without that. Honestly doesn’t sound like wife or step-daughter were ready to start a new relationship. Is this something you want to put up with for the rest of your life? Like even if y’all have your own kid?",
      "id": 209,
      "comments": [
        {
          "score": 151,
          "content": "That's also what I through. I get the fact that they want to keep the habit but..  Why like that.\nLeave Alexis see the ex BF or bring the new parent to the meeting. \nBut that. That look weird to me.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Yeah, I know someone that was engaged, did similar things with her ex-husband and the kids.  The fiance had issues with them hanging out 1-2 times a week (not full day things like OP though).  Guess what?  They broke up and she just remarried her ex-husband a few months ago.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Literally this? I don't know why people don't understand the double standard that is going on. NTA all way but just a shit situation overall",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Normal people coparent at the kid's events like softball, dance, karate, soccer or whatever. \n\nIf they're so happy to spend time together that the fiance is willing to let her daughter kick her future husband out, she should just be with the ex.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}