{
  "post content": "I adopted my cat when she was four from the shelter. It had taken a while to talk my husband into letting us get a cat but, with the agreement that she's my responsibility, he finally relented. I remember how scared she was there and, as one of the declawed cats, she had to spend most of her time in a small cage for her safety. We bonded immediately and she's always at my side ever since.\n\nI don't know if I was so excited that I missed them saying anything or the shelter never mentioned it, but I had no idea she had any issues. She began to have asthma attacks, licking herself raw and peeing outside of her box. She's on expensive medicine now that controls the wheezing and licking, but I've never been able to resolve the peeing. Multiple boxes, buying special litter, etc. It could help to get litter boxes on multiple floors, but my husband won't allow that for the smell.\n\nFor years, I had been trying to deal with the stressful situation. My husband has never been happy with the result (heightened sense of smell) and makes passive aggressive remarks about it. I can't smell it. He also said her fur bothered him at night so she was kicked out of our bedroom and then he's upset that she'd cry at the door. I always feel like I'm blamed for the problems.\n\nRecently to help make things tolerable, we tried an extreme solution. Our cat now spends the day while we're gone and all night in the basement to control the peeing and odor. When she's out of the basement, she's always with one of us, so we have to close her in rooms we're in. She's not happy with this and wants free reign of the house.  He's not happy because, even though she's not able to pee in the living spaces, she meows and constantly tries to escape rooms we're in and he doesn't like the heat (house cooler with doors open) and smell being trapped in the room we're in. And he says he can still smell her anyways \"wafting up through vents in the basement\".\n\nRecently, I was informed that she has gingivitis, which will be another costly medical issue on top of her already expensive medicines. Right now, it's a stretch to afford the care. We were in a better financial situation when we got the cat.\n\nWe've had her four years now and empathize with my husband that it sucks to have these issues in your home where you can't escape them. I know he didn't want a cat in the first place and only relented because I wanted one really bad. But last night, I got the \"me or the cat\" ultimatum.\n\nAt her age (atleast 8) and with these medical issues and her attachment to me, I can't imagine it will be easy to find a good home for her. I can take her back to the non kill shelter I got her from but she was miserable there too and I just cry thinking of her sitting in one of those cages again or just being anxious wondering where I am. But I also love my husband and empathize with his unhappiness as well. I just don't know what to do there's no happy ending.",
  "id": 1,
  "comments": [
    {
      "score": 28,
      "content": "Have to say ESH here but i do think your husband is the biggest AH. Well you have a problem cat for sure but her problems will not ever go away if your home isnt a 100% open to her. Since she is declawed she'll need the absolute softest and finest sand you can find, and there should be litter boxes in all the areas she tends to pee. She needs trees and shelves so she can move around rooms without touching the floor. She needs to be played with daily, all her energy needs to be drained otherwise she will bother you during the night. You absolutely cannot confine her to the basement that is abuse and thats why you suck because you allow this. I also read in the comments that you dont have a tree? Why not? Give the show My cat from hell a watch if you want to make things work otherwise yes she needs another home.",
      "id": 2,
      "comments": [
        {
          "score": 0,
          "content": "My husband doesn't like the way trees look. My husband doesn't want litter boxes on the main floor. Basement seems less cruel than shelter, especially because we let her out when we're home. I'll look into sand to see if it helps but my husband is pretty done at this point.",
          "id": 3,
          "comments": [
            {
              "score": 23,
              "content": "But all those things are part of owning a cat! Having litter boxes available, having cat trees. That’s like having fish, but saying you don’t like the way the aquarium looks.",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Yeah of course he doesn't like how they look. Your husband is part of the problems your cat has and his nonsense is bs.",
              "id": 5,
              "comments": [
                {
                  "score": 7,
                  "content": "Agree",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17,
      "content": "[deleted]",
      "id": 7,
      "comments": [
        {
          "score": 5,
          "content": "I ran out of characters so I guess I didn't properly explain. I do not plan to put her back in the shelter because of how awful it was for her before. I'm going to try to rehome her.",
          "id": 8,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "Honestly I still think YWBTA if you return her to the shelter vs finding a different home that can take care of her. Your pets are for life and you get them understanding that medical issues arise.\n\nAlso try fine sand or pine or something very soft for litter— she could have injuries from being declawed and that’s why she may be peeing outside of the box. Cat litter has been known to be really hard on declawed cat paws and she may be in near constant pain because of this. Literally look specifically for litter solutions for declawed cats.\n\nBut as someone with a cat with gingivitis that’s the hand you’re dealt. Fee free to look for a comforting home that can take care of her— but if you don’t find one YWBTA for taking her back to a shelter.",
      "id": 9,
      "comments": [
        {
          "score": 2,
          "content": "My preference would be to find a new home, I was going to see if the shelter can help me find one and hopefully I can keep her until then. Just not sure how long that would take as she not very adoptable with her age and issues.",
          "id": 10,
          "comments": [
            {
              "score": 12,
              "content": "Try the litter thing first. Scented pine pee pads or really soft litter might help. It’s really common for declawed cats to have peeing outside the box. Like imagine your fingers have been cut off from the first knuckle and you have to walk on sand. She is probably finding the softest places in the house to pee",
              "id": 11,
              "comments": [
                {
                  "score": 3,
                  "content": "I'll look into sand to see if it helps but my husband is pretty done at this point. I didn't declaw her fyi.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 8,
                      "content": "No I get that. My dad got a declawed cat who had the same issues. Pee pads with potted plants *around he area* and this really fine sand stuff (sorry I don’t remember the name) ended up working most of the time. Cats tend to seek places where they can hide/cover up their scent as much as possible so if she has an option that is comfortable to her that might work. Also if you have something particularly destroyed by her pee in the house that you’re willing to sacrifice putting it by the new stuff (along with her poops) and then placing her there a couple times might help.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "Your husbands a dick. There's no issue around that. You might want to reconsider a relationship just from some of the things you stated here. I'd post over in just no so. But now in to the main issue, if your making your cat miserable by keeping her get rid of her. Find her a nice home don't take her to the shelter. Or look for a cat sanctuary near you. I have 2 cats. I had 3. I found a great no kill shelter with what she needed to find a happy home (had to lie a lot to get them to take her idc she would be way better off there than with me) and I never lost any sleep over it because I cared more about her happiness.\n(we were told she had issues. We did not knkw those issues would be her miserable inside with nothing to hunt. She was very attached to me, would follow me and sleep on me. But she was also always in windows crying and got aggressive over mouse toys. She belonged in a barn mousing and with me she was indoor only)",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "INFO Going by Jackson galaxy, is your cat peeing in certain spots? Like maybe underneath a specific location or something? Is another cat peeing there but outside?\n\nDo you have cat trees/cat toys/signs a cat lives in your house?",
      "id": 15,
      "comments": [
        {
          "score": 3,
          "content": "She does prefer to pee in particular spots, which I use a special enzyme car urine formula to clean, as it's supposed to both better to reduce the smell and deter her. Didn't really work. She doesn't have access to those spots anymore and has new ones in the basement, even with the litter boxes.\n\nWe have cat toys and a bed but in her areas not all over the house. No tree.",
          "id": 16,
          "comments": [
            {
              "score": 11,
              "content": "Maybe watch “my cat from hell” - your issue comes up multiple times in the series. \n\nCat toys and bed (maybe less so the bed) should be all over the house. Keeps their scent around and lets them feel safe in “their” territory. From what I remember (it’s been a couple years since I last watched it), it’s also primarily why your cat is peeing all over the place (basically trying to mark her territory).\n\nIf she prefers to pee in those spots, can you at least start by putting a litter box there and slowly move it to where you ideally want it?\n\nAre the spots in the same location as where she’d have been peeing upstairs?",
              "id": 17,
              "comments": [
                {
                  "score": 1,
                  "content": "No not in the same spot. Husband won't allow cat things in main areas, especially litter boxes. And even with the compromises I've made, he's done",
                  "id": 18,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Why doesn’t he want cat things in the main area though? If you get an animal they are part of the family and deserve to be able to feel comfortable in the main parts of the house, just like you do. I’m sorry but that’s part of owning a pet. \n\nDo you plan on having children with this man one day? What’s he gonna say about baby things/toys lying around? Is he gonna ban those from the main area of the house too just because they don’t “look nice”?  You’re not TA but your husband sure sounds like one.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "I want to reiterate: your husband sounds awful.  You’re in a pickle.  What’s he going to do if you have kids?! 😢",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA. Neither you nor the cat are happy in this situation.\n\nIt's a tough call, but she has to go somewhere she can be looked after.\n\nIt's okay that it can't be you.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH.\n\nJust make sure to be involved in the rehoming process. Do not give the cat away to a stranger for free. Pet extremists are going to brigade this post. Please ignore them.\n\nYou are doing the responsibile thing and admitting you can't provide the home this animal deserves. You want to give the cat a better life, and that's a good thing.",
      "id": 22,
      "comments": [
        {
          "score": 4,
          "content": "Just don’t put the cat in a shelter.  You rescued the cat from the “small cages”, remember?",
          "id": 23,
          "comments": [
            {
              "score": 3,
              "content": "I ran out of characters so I guess I didn't properly explain. I do not plan to put her back in the shelter because of how awful it was for her before. I'm going to try to rehome her.",
              "id": 24,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "ESH - \ndon’t adopt and animal you can’t take care of for life. Don’t give up, the  cat  seems to be very attached to you. If it gets much worse for the cat look for new owners-don’t put it back in a shelter.\n\nHe agreed to the cat but why does that mean he has to throw it in your face? Or threaten your relationship? It’s a little over dramatic. \n\nUpdate us? :)",
      "id": 25,
      "comments": [
        {
          "score": 3,
          "content": "I ran out of characters so I guess I didn't properly explain. I do not plan to put her back in the shelter because of how awful it was for her before. I'm going to try to rehome her.\n\nI have been trying for years to make this livable and would still keep trying but what can you do against that ultimatum? I agree that my husband is being shitty here, but he's been unhappy since she started showing her issues and it's affecting it relationship.",
          "id": 26,
          "comments": [
            {
              "score": 1,
              "content": "I have had the same cat for 19 years and he’s still kicking. In my case his medical care only gets worse. \nEven still +8 more years of a life long relationship?\nHe’s willing to throw away a life long relationship for a temporary problem? \nPermanent solution for a temporary problem.  I would just consider that when dealing with the husband. \n\nRehoming can be difficult, I haven’t been able to rehome a single animal I’ve had.  It’s better just to figure out a more sustainable system and make sure your husband can be on board with it. \nIt’s a little irrational to get a divorce over a cat you both agreed to, in my opinion.  That doesn’t mean you can’t validate his feelings, a little acknowledgment to his situation might help. Telling him that you’re doing your best and if he could provide helpful solutions aside from a shelter, until you are able to rehome. \nRelationships are a two way street. \nBest of luck.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "ESH. You're are not properly caring for your cat, you are not giving them an engaging enough life  nor are you respecting their health (gingivitis doesn't happen overnight or by accident). Your husband is an unreasonable shit.",
      "id": 28,
      "comments": [
        {
          "score": 2,
          "content": "She gets vet checks regularly, last visit was first time gingivitis was mentioned, and more that she's early into it and needs very expensive cleaning (minimum $500) to prevent it being an issue",
          "id": 29,
          "comments": [
            {
              "score": 1,
              "content": "What else were you doing for her oral hygiene?  And what were you feeding her?",
              "id": 30,
              "comments": [
                {
                  "score": 1,
                  "content": "She gets healthy teeth treats occasionally, but is very finicky and doesn't really eat them.  I feed her special vet recommended wet and dry food because of her allergies.\n\nVet actually said it was unusual for her to be so old and just starting to show signs, apparently it is very common ailment and cats usually get it younger.",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "YTA for sure.  It sounds like you’ve made up your mind (back to the “no kill” shelter for her).  Returning a cat to a shelter four years after adoption is not called “rehoming” - it’s called “dumping” or “abandoning”.  You’re looking for people to sympathize with the bad kitty habits and the expense of treatments for these (common as dirt) ailments.  Had you never had a pet before?  \n\nThe cat has bonded with you.  Animals aren’t disposable.  People with your mindset are WHY shelters are full.  I’m so sad for your kitty. \n \nYour husband is an asshole to the max, too.  \n\nEdit: Although I find that YTA, I do think it’s kind of you to ask for opinions - it looks like you’re really considering peoples input.  With your husband, however, you seem to be in a predicament.",
      "id": 32,
      "comments": [
        {
          "score": 2,
          "content": "I ran out of characters so I guess I didn't properly explain. I do not plan to put her back in the shelter because of how awful it was for her before. I'm going to try to rehome her.",
          "id": 33,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}